{
  "https://www.cnbc.com/2024/07/02/revolut-boss-confident-on-uk-bank-license-approval-after-record-profit.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/revolut-boss-confident-on-uk-bank-license-approval-after-record-profit.html",
    "date": "2024-07-01",
    "time": "23:01:38 UTC",
    "title": "Revolut CEO confident on UK bank license approval as fintech firm hits record $545 million profit",
    "body": "LONDON — The boss of British financial technology giant Revolut told CNBC he is optimistic about the company's chances of being granted a U.K. banking license, as a jump in users saw the firm report record full-year pre-tax profits.\n\nIn an exclusive interview with CNBC, Nikolay Storonsky, Revolut's CEO and co-founder, said that the company is feeling confident about securing its British bank license, after overcoming some key hurdles in its more than three-year-long journey toward gaining approval from regulators.\n\n\"Hopefully, sooner or later, we'll get it,\" Storonsky told CNBC via video call. Regulators are \"still working on it,\" he added, but so far haven't raised any outstanding concerns with the fintech.\n\nStoronsky noted that Revolut's huge size has meant that it's taken longer for the company to get its banking license approved than would have been the case for smaller companies. Several small financial institutions have been able to win approval for a banking license with few customers, he added.\n\n\"U.K. banking licenses are being approved for smaller companies,\" Storonsky said. \"They usually approve someone twice every year,\" and they typically tend to be smaller institutions. \"Of course, we are very large, so it takes extra time.\"\n\nRevolut is a licensed electronic money institution, or EMI, in the U.K. But it can't yet offer lending products such as credit cards, personal loans, or mortgages. A bank license would enable it to offer loans in the U.K. The firm has faced lengthy delays to its application, which it filed in 2021.\n\nOne key issue the company faced was with its share structure being inconsistent with the rulebook of the Prudential Regulation Authority, which is the regulatory body for the financial services industry that sits under the Bank of England.\n\nRevolut has multiple classes of shares and some of those share classes previously had preferential rights attached. One conditions set by the Bank of England for granting Revolut its U.K. banking license, was to collapse its six classes of shares into ordinary shares.\n\nRevolut has since resolved this, with the company striking a deal with Japanese tech investor SoftBank to transfer its shares in the firm to a unified class, relinquishing preferential rights, according to a person familiar with the matter. News of the resolution with SoftBank was first reported by the Financial Times.",
    "summary": "LONDON — The boss of British financial technology giant Revolut told CNBC he is optimistic about the company's chances of being granted a U.K. banking license, as a jump in users saw the firm report record full-year pre-tax profits.\nSeveral small financial institutions have been able to win approval for a banking license with few customers, he added.\n\"U.K. banking licenses are being approved for smaller companies,\" Storonsky said.\nA bank license would enable it to offer loans in the U.K.\nOne conditions set by the Bank of England for granting Revolut its U.K. banking license, was to collapse its six classes of shares into ordinary shares.",
    "keywords": [
      "uk",
      "profit",
      "financial",
      "revolut",
      "shares",
      "firm",
      "fintech",
      "license",
      "smaller",
      "bank",
      "hits",
      "confident",
      "company",
      "banking",
      "record",
      "storonsky",
      "million"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/106911221-1626337239518-gettyimages-1180635150-1835438.jpeg?v=1719844415&w=1920&h=1080",
    "clean_body": "london -- bos british financial technology giant revolut told cnbc optimistic company chance granted uk banking license jump user saw firm report record fullyear pretax profit exclusive interview cnbc nikolay storonsky revoluts ceo cofounder said company feeling confident securing british bank license overcoming key hurdle threeyearlong journey toward gaining approval regulator hopefully sooner later well get storonsky told cnbc via video call regulator still working added far havent raised outstanding concern fintech storonsky noted revoluts huge size meant taken longer company get banking license approved would case smaller company several small financial institution able win approval banking license customer added uk banking license approved smaller company storonsky said usually approve someone twice every year typically tend smaller institution course large take extra time revolut licensed electronic money institution emi uk cant yet offer lending product credit card personal loan mortgage bank license would enable offer loan uk firm faced lengthy delay application filed one key issue company faced share structure inconsistent rulebook prudential regulation authority regulatory body financial service industry sits bank england revolut multiple class share share class previously preferential right attached one condition set bank england granting revolut uk banking license collapse six class share ordinary share revolut since resolved company striking deal japanese tech investor softbank transfer share firm unified class relinquishing preferential right according person familiar matter news resolution softbank first reported financial time",
    "sentiment": 0.07231379731379729,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.cnbc.com/2024/07/01/ken-griffin-says-hes-not-convinced-ai-will-replace-human-jobs-in-near-future.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/01/ken-griffin-says-hes-not-convinced-ai-will-replace-human-jobs-in-near-future.html",
    "date": "2024-07-01",
    "time": "19:43:08 UTC",
    "title": "Citadel’s Ken Griffin says he's not convinced that AI will replace human jobs in the near future",
    "body": "Ken Griffin, founder and CEO of Citadel, said he remains skeptical that artificial intelligence could soon make human jobs obsolete as he sees flaws in machine learning models applied in certain scenarios.\n\n\"We are at what is widely viewed as a real inflection point in the evolution of technology, with the rise of large language models. Some are convinced that within three years almost everything we do as humans will be done in one form or another by LLMs and other AI tools,\" Griffin said Friday during an event for Citadel's new class of interns in New York. \"For a number of reasons, I am not convinced that these models will achieve that type of breakthrough in the near future.\"\n\nThe rapid rise of AI has had the world pondering its far-reaching impact on society, including technology-induced job cuts. Elon Musk, CEO of Tesla, is among many who have repeatedly warned of the threats that AI poses to humanity. He has called AI \"more dangerous\" than nuclear weapons, saying there will come a point where \"no job is needed.\"\n\nGriffin, whose hedge fund and electronic market maker have been at the forefront of automation, said machine-learning tools do have their limits when it comes to adapting to changes.\n\n\"Machine learning models do not do well in a world where regimes shift. Self-driving cars don't work very well in the North due to snow. When the terrain changes, they have no idea what to do,\" Griffin said. \"Machine learning models do much better when there's consistency.\"\n\nStill, the billionaire investor thinks the power of advanced technology can't be dismissed in the long term, and he even sees cancer being eradicated one day because of it.\n\n\"The rise of computing power is allowing us to solve all kinds of problems that were just simply not solvable five, 10, 15 years ago,\" Griffin said. \"This is going to radically transform healthcare. We will end cancer as you know it in your lifetime.\"\n\nCitadel has long placed a great emphasis on hiring, not hesitant about putting responsibility into the hands of young employees and even interns, the CEO said.\n\nThe firm's internship program has become one of the most competitive in the country. More than 85,000 students applied for about 300 positions this year, reflecting an acceptance rate of less than 0.5%, which is lower than that of Harvard University and the Massachusetts Institute of Technology.\n\n\"The people we hire today are going to be the leaders of Citadel not in 30 or 40 years, but in just a few years,\" Griffin said.",
    "summary": "Ken Griffin, founder and CEO of Citadel, said he remains skeptical that artificial intelligence could soon make human jobs obsolete as he sees flaws in machine learning models applied in certain scenarios.\nSome are convinced that within three years almost everything we do as humans will be done in one form or another by LLMs and other AI tools,\" Griffin said Friday during an event for Citadel's new class of interns in New York.\n\"For a number of reasons, I am not convinced that these models will achieve that type of breakthrough in the near future.\"\nThe rapid rise of AI has had the world pondering its far-reaching impact on society, including technology-induced job cuts.\n\"Machine learning models do much better when there's consistency.\"",
    "keywords": [
      "learning",
      "tools",
      "rise",
      "convinced",
      "near",
      "replace",
      "jobs",
      "ai",
      "human",
      "technology",
      "hes",
      "griffin",
      "ceo",
      "citadels",
      "world",
      "models",
      "sees",
      "future",
      "ken"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/108000509-1719860325647-Ken_Griffins_Conversation_with_the_Interns.jpg?v=1719860423&w=1920&h=1080",
    "clean_body": "ken griffin founder ceo citadel said remains skeptical artificial intelligence could soon make human job obsolete see flaw machine learning model applied certain scenario widely viewed real inflection point evolution technology rise large language model convinced within three year almost everything human done one form another llm ai tool griffin said friday event citadel new class intern new york number reason convinced model achieve type breakthrough near future rapid rise ai world pondering farreaching impact society including technologyinduced job cut elon musk ceo tesla among many repeatedly warned threat ai pose humanity called ai dangerous nuclear weapon saying come point job needed griffin whose hedge fund electronic market maker forefront automation said machinelearning tool limit come adapting change machine learning model well world regime shift selfdriving car dont work well north due snow terrain change idea griffin said machine learning model much better there consistency still billionaire investor think power advanced technology cant dismissed long term even see cancer eradicated one day rise computing power allowing u solve kind problem simply solvable five year ago griffin said going radically transform healthcare end cancer know lifetime citadel long placed great emphasis hiring hesitant putting responsibility hand young employee even intern ceo said firm internship program become one competitive country student applied position year reflecting acceptance rate le lower harvard university massachusetts institute technology people hire today going leader citadel year year griffin said",
    "sentiment": 0.07878041498731155,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.cnbc.com/2024/07/01/how-magnificent-7-affects-sp-500-stock-market-concentration.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/01/how-magnificent-7-affects-sp-500-stock-market-concentration.html",
    "date": "2024-07-01",
    "time": "14:35:31 UTC",
    "title": "Is the U.S. stock market too ‘concentrated’? Here’s what to know",
    "body": "In this article META\n\nAMZN\n\nMSFT\n\nTSLA\n\nGOOGL\n\nAAPL\n\nNVDA Follow your favorite stocks CREATE FREE ACCOUNT\n\nJensen Huang, co-founder and chief executive officer of Nvidia Corp., displays the new Blackwell GPU chip during the Nvidia GPU Technology Conference on March 18, 2024. David Paul Morris/Bloomberg via Getty Images\n\nThe U.S. stock market has become dominated by about a handful of companies in recent years. Some experts question whether that \"concentrated\" market puts investors at risk, though others think such fears are likely overblown. Let's look at the S&P 500 , the most popular benchmark for U.S. stocks, as an illustration of the dynamics at play. The top 10 stocks in the S&P 500, the largest by market capitalization, accounted for 27% of the index at the end of 2023, nearly double the 14% share a decade earlier, according to a recent Morgan Stanley analysis.\n\nwatch now\n\nIn other words, for every $100 invested in the index, about $27 was funneled to the stocks of just 10 companies, up from $14 a decade ago. That rate of increase in concentration is the most rapid since 1950, according to Morgan Stanley. It has increased more in 2024: The top 10 stocks accounted for 37% of the index as of June 24, according to FactSet data. The so-called \"Magnificent Seven\" — Apple , Amazon , Alphabet , Meta , Microsoft , Nvidia and Tesla — make up about 31% of the index, it said.\n\n'A bit riskier than people realize'\n\nSome experts fear the largest U.S. companies are having an outsized influence on investors' portfolios. For example, the Magnificent Seven stocks accounted for more than half the S&P 500's gain in 2023, according to Morgan Stanley. Just as those stocks helped push up overall returns, a downturn in one or many of them could put a lot of investor money in jeopardy, some said. For example, Nvidia shed more than $500 billion in market value after a recent three-day sell-off in June, dragging down the S&P 500 into a multiday losing streak. (The stock has since recovered a bit.) The S&P 500's concentration \"is a bit riskier than people realize,\" said Charlie Fitzgerald III, a certified financial planner based in Orlando, Florida. \"Nearly a third of [the S&P 500] is sitting in seven stocks,\" he said. \"You're not diversifying when you're concentrating like this.\"\n\nWhy stock concentration may not be a concern\n\nThe S&P 500 tracks stock prices of the 500 largest publicly traded companies. It does so by market capitalization: The larger a firm's stock valuation, the larger its weighting in the index. Tech-stock euphoria has helped drive higher concentration at the top, particularly among the Magnificent Seven. Collectively, Magnificent Seven stocks are up about 57% in the past year, as of market close on June 27 — more than double the 25% return of the whole S&P 500. Chip maker Nvidia's stock alone has tripled in that time. More from Personal Finance:\n\nAmericans struggle to shake off a 'vibecession'\n\nRetirement 'super savers' have the biggest 401(k) balances\n\nHouseholds have seen their buying power grow Despite the sharp increase in stock concentration, some market experts believe the concern may be overblown. For one, many investors are diversified beyond the U.S. stock market. It's \"rare\" for 401(k) investors to own just a U.S. stock fund, for example, according to a recent analysis by John Rekenthaler, vice president of research at Morningstar. Many invest in target-date funds. A Vanguard TDF for near-retirees has a roughly 8% weighting to the Magnificent Seven, while one for younger investors who aim to retire in about three decades has a 13.5% weighting, Rekenthaler wrote in May.\n\nThere's precedent for this market concentration\n\nAdditionally, the current concentration isn't unprecedented by historical or global standards, according to the Morgan Stanley analysis. Research by finance professors Elroy Dimson, Paul Marsh and Mike Staunton shows that the top 10 stocks made up about 30% of the U.S. stock market in the 1930s and early 1960s, and about 38% in 1900.\n\nThe stock market was as concentrated (or more) around the late 1950s and early '60s, for example, a period when \"stocks did just fine,\" said Rekenthaler, whose research examines markets since 1958. \"We've been here before,\" he said. \"And when we were here before, it wasn't particularly bad news.\" When there were big market crashes, they generally don't appear to have been associated with stock concentration, he added. When compared with the world's dozen largest stock markets, the U.S. market was the fourth-most-diversified at the end of 2023 — better than that of Switzerland, France, Australia, Germany, South Korea, the United Kingdom, Taiwan and Canada, Morgan Stanley said.\n\n'Sometimes you can be surprised'\n\nBig U.S. companies also generally seem to have the profits to back up their current lofty valuations, unlike during the peak of the dot-com bubble of the late 1990s and early 2000s, experts said. Present-day market leaders \"generally have higher profit margins and returns on equity\" than those in 2000, according to a recent Goldman Sachs Research report. The Magnificent Seven \"are not pie-in-the-sky\" companies: They're generating \"tremendous\" revenue for investors, said Fitzgerald, principal and founding member of Moisand Fitzgerald Tamayo. \"How much more gain can be made is the question,\" he added.\n\nYou're not diversifying when you're concentrating like this. Charlie Fitzgerald III certified financial planner based in Orlando, Florida",
    "summary": "David Paul Morris/Bloomberg via Getty ImagesThe U.S. stock market has become dominated by about a handful of companies in recent years.\nSome experts question whether that \"concentrated\" market puts investors at risk, though others think such fears are likely overblown.\nThe so-called \"Magnificent Seven\" — Apple , Amazon , Alphabet , Meta , Microsoft , Nvidia and Tesla — make up about 31% of the index, it said.\nWhy stock concentration may not be a concernThe S&P 500 tracks stock prices of the 500 largest publicly traded companies.\nWhen there were big market crashes, they generally don't appear to have been associated with stock concentration, he added.",
    "keywords": [
      "sp",
      "heres",
      "according",
      "investors",
      "seven",
      "stock",
      "magnificent",
      "know",
      "market",
      "500",
      "concentrated",
      "concentration",
      "stocks"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107435171-1719606882336-gettyimages-2087335238-NVIDIA_GTC_CONFERENCE.jpeg?v=1719607004&w=1920&h=1080",
    "clean_body": "article meta amzn msft tsla googl aapl nvda follow favorite stock create free account jensen huang cofounder chief executive officer nvidia corp display new blackwell gpu chip nvidia gpu technology conference march david paul morrisbloomberg via getty image u stock market become dominated handful company recent year expert question whether concentrated market put investor risk though others think fear likely overblown let look sp popular benchmark u stock illustration dynamic play top stock sp largest market capitalization accounted index end nearly double share decade earlier according recent morgan stanley analysis watch word every invested index funneled stock company decade ago rate increase concentration rapid since according morgan stanley increased top stock accounted index june according factset data socalled magnificent seven -- apple amazon alphabet meta microsoft nvidia tesla -- make index said bit riskier people realize expert fear largest u company outsized influence investor portfolio example magnificent seven stock accounted half sp gain according morgan stanley stock helped push overall return downturn one many could put lot investor money jeopardy said example nvidia shed billion market value recent threeday selloff june dragging sp multiday losing streak stock since recovered bit sp concentration bit riskier people realize said charlie fitzgerald iii certified financial planner based orlando florida nearly third sp sitting seven stock said youre diversifying youre concentrating like stock concentration may concern sp track stock price largest publicly traded company market capitalization larger firm stock valuation larger weighting index techstock euphoria helped drive higher concentration top particularly among magnificent seven collectively magnificent seven stock past year market close june -- double return whole sp chip maker nvidias stock alone tripled time personal finance american struggle shake vibecession retirement super saver biggest k balance household seen buying power grow despite sharp increase stock concentration market expert believe concern may overblown one many investor diversified beyond u stock market rare k investor u stock fund example according recent analysis john rekenthaler vice president research morningstar many invest targetdate fund vanguard tdf nearretirees roughly weighting magnificent seven one younger investor aim retire three decade weighting rekenthaler wrote may there precedent market concentration additionally current concentration isnt unprecedented historical global standard according morgan stanley analysis research finance professor elroy dimson paul marsh mike staunton show top stock made u stock market early stock market concentrated around late early example period stock fine said rekenthaler whose research examines market since weve said wasnt particularly bad news big market crash generally dont appear associated stock concentration added compared world dozen largest stock market u market fourthmostdiversified end -- better switzerland france australia germany south korea united kingdom taiwan canada morgan stanley said sometimes surprised big u company also generally seem profit back current lofty valuation unlike peak dotcom bubble late early expert said presentday market leader generally higher profit margin return equity according recent goldman sachs research report magnificent seven pieinthesky company theyre generating tremendous revenue investor said fitzgerald principal founding member moisand fitzgerald tamayo much gain made question added youre diversifying youre concentrating like charlie fitzgerald iii certified financial planner based orlando florida",
    "sentiment": 0.22142676767676767,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.cnbc.com/2024/07/01/chewy-shares-rally-20percent-after-sec-filing-reveals-roaring-kitty-keith-gill-has-6point6percent-stake.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/01/chewy-shares-rally-20percent-after-sec-filing-reveals-roaring-kitty-keith-gill-has-6point6percent-stake.html",
    "date": "2024-07-01",
    "time": "20:12:41 UTC",
    "title": "Chewy shares fall nearly 7% as the boost from Roaring Kitty's new stake diminishes",
    "body": "The filing showed Roaring Kitty, whose legal name is Keith Gill, bought just over 9 million shares — amounting to a 6.6% stake in the company. That makes him the third-biggest Chewy shareholder, according to FactSet. Based on Friday's close, that stake is valued at more than $245 million.\n\nThe rally in Chewy shares lost steam Monday as traders reacted to a Securities and Exchange Commission filing that showed meme stock trader \"Roaring Kitty\" took a stake in the pet food e-commerce retailer.\n\nThe SEC filing also included a section that read: \"Check the appropriate box to designate whether you are a cat.\" There was an \"x\" next to a response that read: \"I am not a cat.\" This line was included in Gill's statement in a series of congressional hearings about 2021's GameStop trading mania.\n\nThe stock rallied more than 9% on Monday, but it quickly fell into negative territory in morning trading. Shares ended the day down 6.6%.\n\nChewy shares took a wild ride last week after Gill posted a picture on social media platform X of a cartoon dog that resembled Chewy's logo. The shares were up as much as 34% on Thursday but ended the day down slightly.\n\nCNBC emailed Chewy's public relations team seeking comment on the new shareholder.\n\nGill is known to be a champion of GameStop and has been stirring up trading in the video game company in the last few months. In mid-June, he disclosed a stake of 9.001 million GameStop shares after exiting his massive call options position. It's unclear if he sold his GameStop bet to fund the purchase of Chewy.\n\nGameStop shares fell more than 5% following the news.\n\n\n\nThere's a big connection between GameStop and Chewy. GameStop CEO Ryan Cohen was founder and the first CEO of Chewy, who was instrumental in PetSmart's takeover of Chewy in 2017 and its subsequent initial public offering in 2019.\n\nCohen joined the GameStop board of directors along with two other Chewy executives in January 2021, partly helping fuel the initial GameStop rally. He later took over as GameStop CEO in 2023, leading a turnaround in the brick-and-mortar video game retailer.\n\nIn a recent YouTube livestream, Gill said GameStop is in the second stage of a reinvention, and it has become a bet on Cohen himself, who's also been leading a pivot to e-commerce.\n\nThe investor was hit by a new class-action lawsuit filed Friday, alleging he engaged in securities fraud by manipulating GameStop's stock price through his online influence in May and June. The case was voluntarily dismissed on Monday.\n\nGill is a former marketer for Massachusetts Mutual Life Insurance. He came into the limelight after successfully encouraging retail investors to buy GameStop shares and call options in 2021 to squeeze out short-selling hedge funds.",
    "summary": "This line was included in Gill's statement in a series of congressional hearings about 2021's GameStop trading mania.\nChewy shares took a wild ride last week after Gill posted a picture on social media platform X of a cartoon dog that resembled Chewy's logo.\nIn mid-June, he disclosed a stake of 9.001 million GameStop shares after exiting his massive call options position.\nGameStop shares fell more than 5% following the news.\nHe came into the limelight after successfully encouraging retail investors to buy GameStop shares and call options in 2021 to squeeze out short-selling hedge funds.",
    "keywords": [
      "shares",
      "roaring",
      "ceo",
      "filing",
      "stock",
      "took",
      "stake",
      "trading",
      "chewy",
      "gamestop",
      "nearly",
      "kittys",
      "diminishes",
      "boost",
      "gill",
      "fall"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107425911-1717778213196-Screenshot_2024-06-07_at_123626_PM.png?v=1717778362&w=1920&h=1080",
    "clean_body": "filing showed roaring kitty whose legal name keith gill bought million share -- amounting stake company make thirdbiggest chewy shareholder according factset based friday close stake valued million rally chewy share lost steam monday trader reacted security exchange commission filing showed meme stock trader roaring kitty took stake pet food ecommerce retailer sec filing also included section read check appropriate box designate whether cat x next response read cat line included gill statement series congressional hearing gamestop trading mania stock rallied monday quickly fell negative territory morning trading share ended day chewy share took wild ride last week gill posted picture social medium platform x cartoon dog resembled chewys logo share much thursday ended day slightly cnbc emailed chewys public relation team seeking comment new shareholder gill known champion gamestop stirring trading video game company last month midjune disclosed stake million gamestop share exiting massive call option position unclear sold gamestop bet fund purchase chewy gamestop share fell following news there big connection gamestop chewy gamestop ceo ryan cohen founder first ceo chewy instrumental petsmarts takeover chewy subsequent initial public offering cohen joined gamestop board director along two chewy executive january partly helping fuel initial gamestop rally later took gamestop ceo leading turnaround brickandmortar video game retailer recent youtube livestream gill said gamestop second stage reinvention become bet cohen who also leading pivot ecommerce investor hit new classaction lawsuit filed friday alleging engaged security fraud manipulating gamestops stock price online influence may june case voluntarily dismissed monday gill former marketer massachusetts mutual life insurance came limelight successfully encouraging retail investor buy gamestop share call option squeeze shortselling hedge fund",
    "sentiment": 0.05774638274638274,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.cnbc.com/2024/07/01/paramount-streaming-merger-talks.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/01/paramount-streaming-merger-talks.html",
    "date": "2024-07-01",
    "time": "20:57:17 UTC",
    "title": "Paramount is hunting for a streaming partner, could kick off a wave of deals",
    "body": "Paramount Global is holding talks with other entertainment companies about merging its Paramount+ streaming service with an existing platform. If it reaches a deal, it may kick off a new wave of streaming partnerships that could put the entire media industry on firmer footing.\n\nParamount Global leadership is having active discussions with other media and tech company executives to determine if a structure makes sense for both parties where Paramount+ can be merged with another streaming entity and potentially co-owned, according to people familiar with the matter, who asked not to be named because the discussions are private.\n\nOne of the companies that has expressed a desire to reach a deal is Warner Bros. Discovery , according to people familiar with the matter. Combining Max and Paramount+ could strengthen both services by allowing them to better compete with Netflix and Disney's suite of platforms (Disney+, Hulu and ESPN) for eyeballs and future content.\n\nWarner Bros. Discovery held preliminary merger talks for a deal for all of Paramount Global earlier this year, but talks didn't escalate.\n\nParamount Global is also considering partnering with a technology platform, the company's co-CEO Chris McCarthy said at an employee town hall on June 25.\n\n\"What they don't have is our scale of content, and together we will make for a very powerful combination to drive more minutes and greater profits,\" McCarthy said of a potential tech partner at the town hall, according to a transcript of the event obtained by CNBC.\n\nA merged streaming service would mitigate churn by giving customers more diverse programming and fewer reasons to cancel each month, and it could take Paramount+ losses off Paramount Global's balance sheet by giving it new ownership.\n\nWhile a structure for a hypothetical joint venture with Warner Bros. Discovery hasn't been discussed in detail, ownership likely wouldn't be a 50-50 split given the existing natures of the streaming assets and their finances, according to people familiar with the discussions.\n\nWarner Bros. Discovery's direct-to-consumer business made $103 million in annual adjusted EBITDA in 2023 after losing $2.1 billion the year before. Paramount Global reported a loss of $1.67 billion in direct-to-consumer operating income before depreciation and amortization in 2023, narrower than its $1.8 billion loss a year prior.\n\nMax has about 100 million global subscribers, with 52.7 million based in the U.S. Paramount+ ended its first quarter with 71 million subscribers.\n\nComcast's NBCUniversal has also expressed interest in a joint venture with Paramount+, as The Wall Street Journal first reported earlier this year. The talks didn't progress and never got particularly far, according to people familiar with the matter.\n\n\"The sheer volume of hit content that we could offer together would be tremendous across TV, film and sports, and would attract millions of viewers,\" McCarthy said during the town hall in reference to a potential partnership with an existing subscription streaming service like Max or Peacock. \"Plus, we would share in all other non-content expenses.\"\n\nSpokespeople for Warner Bros. Discovery, NBCUniversal and Paramount Global declined to comment.",
    "summary": "Paramount Global is holding talks with other entertainment companies about merging its Paramount+ streaming service with an existing platform.\nOne of the companies that has expressed a desire to reach a deal is Warner Bros.\nWarner Bros.\nParamount Global is also considering partnering with a technology platform, the company's co-CEO Chris McCarthy said at an employee town hall on June 25.\nWarner Bros.",
    "keywords": [
      "talks",
      "bros",
      "according",
      "discovery",
      "warner",
      "million",
      "deals",
      "partner",
      "paramount",
      "hunting",
      "kick",
      "global",
      "streaming",
      "wave",
      "familiar"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107427460-1718135934060-gettyimages-2150317990-PARAMOUNT_STUDIOS_LA.jpeg?v=1719596317&w=1920&h=1080",
    "clean_body": "paramount global holding talk entertainment company merging paramount streaming service existing platform reach deal may kick new wave streaming partnership could put entire medium industry firmer footing paramount global leadership active discussion medium tech company executive determine structure make sense party paramount merged another streaming entity potentially coowned according people familiar matter asked named discussion private one company expressed desire reach deal warner bros discovery according people familiar matter combining max paramount could strengthen service allowing better compete netflix disney suite platform disney hulu espn eyeball future content warner bros discovery held preliminary merger talk deal paramount global earlier year talk didnt escalate paramount global also considering partnering technology platform company coceo chris mccarthy said employee town hall june dont scale content together make powerful combination drive minute greater profit mccarthy said potential tech partner town hall according transcript event obtained cnbc merged streaming service would mitigate churn giving customer diverse programming fewer reason cancel month could take paramount loss paramount globals balance sheet giving new ownership structure hypothetical joint venture warner bros discovery hasnt discussed detail ownership likely wouldnt split given existing nature streaming asset finance according people familiar discussion warner bros discovery directtoconsumer business made million annual adjusted ebitda losing billion year paramount global reported loss billion directtoconsumer operating income depreciation amortization narrower billion loss year prior max million global subscriber million based u paramount ended first quarter million subscriber comcasts nbcuniversal also expressed interest joint venture paramount wall street journal first reported earlier year talk didnt progress never got particularly far according people familiar matter sheer volume hit content could offer together would tremendous across tv film sport would attract million viewer mccarthy said town hall reference potential partnership existing subscription streaming service like max peacock plus would share noncontent expense spokespeople warner bros discovery nbcuniversal paramount global declined comment",
    "sentiment": 0.12072966507177031,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.cnbc.com/2024/07/01/boston-celtics-for-sale-after-nba-championship.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/01/boston-celtics-for-sale-after-nba-championship.html",
    "date": "2024-07-01",
    "time": "20:31:23 UTC",
    "title": "Boston Celtics' majority owner puts team up for sale weeks after NBA championship",
    "body": "A \"Believe in Boston\" flag flies during the duck boat parade celebrating the Boston Celtics' 18th NBA championship.\n\nThe 2024 National Basketball Association champions are up for sale.\n\nThe Boston Celtics' ownership group announced Monday that it plans to sell the team, according to a statement posted to the Celtics' account on social media site X.\n\nThe controlling family of the ownership group, Boston Basketball Partners LLC, said it intends to sell all of its shares in the team \"for estate and family planning consideration.\"\n\nThe sale of a majority stake is expected to be completed by the end of 2024 or early 2025, with the remainder of the sale closing in 2028, according to the statement.\n\nAs sports franchise valuations soar, the Celtics could fetch a particularly high price. The team is among the most successful and most widely followed in U.S. professional sports, and won its NBA record 18th championship last month.\n\nThis, plus the soaring cost of sports media rights, will likely lead to a valuation close to — if not more than — the record $4 billion price tag the NBA's Phoenix Suns received in 2023, sports consultants said Monday.",
    "summary": "A \"Believe in Boston\" flag flies during the duck boat parade celebrating the Boston Celtics' 18th NBA championship.\nThe Boston Celtics' ownership group announced Monday that it plans to sell the team, according to a statement posted to the Celtics' account on social media site X.\nThe controlling family of the ownership group, Boston Basketball Partners LLC, said it intends to sell all of its shares in the team \"for estate and family planning consideration.\"\nAs sports franchise valuations soar, the Celtics could fetch a particularly high price.\nThe team is among the most successful and most widely followed in U.S. professional sports, and won its NBA record 18th championship last month.",
    "keywords": [
      "ownership",
      "sell",
      "price",
      "puts",
      "celtics",
      "boston",
      "weeks",
      "majority",
      "nba",
      "team",
      "championship",
      "record",
      "owner",
      "sale",
      "media"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/108000446-1719855890968-gettyimages-2158636361-s3___bgmp-arc_arc-feeds_generic-photos_to-arc_c7.jpeg?v=1719861356&w=1920&h=1080",
    "clean_body": "believe boston flag fly duck boat parade celebrating boston celtic th nba championship national basketball association champion sale boston celtic ownership group announced monday plan sell team according statement posted celtic account social medium site x controlling family ownership group boston basketball partner llc said intends sell share team estate family planning consideration sale majority stake expected completed end early remainder sale closing according statement sport franchise valuation soar celtic could fetch particularly high price team among successful widely followed u professional sport nba record th championship last month plus soaring cost sport medium right likely lead valuation close -- -- record billion price tag nbas phoenix sun received sport consultant said monday",
    "sentiment": 0.11102564102564103,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.cnbc.com/2024/07/01/inside-starbucks-plans-to-improve-stores.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/01/inside-starbucks-plans-to-improve-stores.html",
    "date": "2024-07-01",
    "time": "21:19:38 UTC",
    "title": "Inside Starbucks' plans to improve stores for customers and baristas",
    "body": "watch now\n\nStarbucks cafes across the country are starting to change how they make drink orders, among other tweaks designed to reduce bottlenecks and long wait times that have dogged the chain. The overhaul comes as the coffee giant prepares for an anticipated swell of orders through its mobile app. At the heart of the plan is Starbucks' \"Siren Craft System,\" a series of processes that are aimed at making baristas' jobs easier and speeding up service times for customers. Starbucks said more than 10% of its 10,000 stores have already implemented the system, which includes changing the production order for hot and cold drinks. It will be in use across North America by the end of July, according to the company. Executives hope the changes will provide a much-needed jolt to Starbucks. In April, the company reported a disappointing second quarter, as U.S. same-store sales fell 3% and traffic dropped 7%. The coffee chain cut its 2024 outlook. Starbucks reported rates of incomplete mobile app orders in the mid-teens and said occasional customers came in less. CEO Laxman Narasimhan mentioned the need to make improvements to stores. Katie Young, senior vice president of store operations at Starbucks, said the most immediate shift that needed to happen in cafes was better handling the unexpected. \"It's the ability to flexibly respond to things we cannot predict,\" she told CNBC in an interview.\n\nStarbucks Coffee shop in Krakow, Poland on February 29, 2024. Beata Zawrzel | Nurphoto | Getty Images\n\nThe store changes will be key this month, as Starbucks on Monday started opening up its app to non-rewards members, which the company believes will increase traffic and orders. Analyst Peter Saleh, managing director at BTIG, said, \"My sense is that they have a lot of demand in certain stores, and the footprint of the kitchen is so small, you have to find ways to be more efficient.\" Losing customers because of slow orders and other store frustrations could cost Starbucks at a particularly vulnerable time. Americans have become cost conscious in the face of ongoing inflation, and in some cases have pulled back on morning or afternoon beverages and snacks. Narasimhan in April said consumers are spending more cautiously. Starbucks has done something uncharacteristic in recent weeks, joining the stream of value offerings with a $5 food and beverage combo option. Communicating value to customers is also part of the plan to drum up business.\n\nThe Siren system\n\nStarbucks has been diagnosing the bottleneck issue for more than a year, since the company's reinvention plan rollout in 2022, said Young. At the time, Howard Schultz was at the helm, having returned during a burgeoning unionization movement and shifts in consumer preferences. The changes underway in cafes were first previewed that fall, to be rolled out in the years to come. Narasimhan took over for Schultz in March 2023. The Siren system processes were developed with worker feedback on which issues stopped them from creating beverages and connecting with customers. Starbucks said it plans to add a role akin to an expediter in a restaurant production line, a \"play caller\" who steps away from production and helps solve logjams in cafes, handling tasks such as restocking cups or helping when an unexpected crowd arrives. The company plans to train existing workers for the role or potentially add new baristas, if needed. \"One of the pain points we saw was [that] our espresso machine was often running all the time, and that was one of the things that kept our partners from being able to check in. And another thing we saw that you didn't necessarily know was which part of the store would get crowded,\" Young said. \"We needed to actually have a partner that was dedicated when things got busy to pulling out of production and just helping.\" Starbucks said it will also change the order in which beverages are made. Previously, cold drinks were prioritized from start to finish, even if a hot beverage order came in first, as pulling espresso shots was the last step. This could create a traffic jam in the drive-thru, for example, if a person ordered one of each beverage, as the cold item would be ready while the hot drink was still in production. Macoy McLaughlin, manager of Seattle's First and Walker Starbucks location, said producing beverages in the order they were placed allows for a faster, streamlined process. \"We actually have proper sequencing between our hot and cold bars, versus cold bars becoming as popular as ever, to really have a consistent experience for the customers. So we're actually making them in the order they're coming in,\" McLaughlin said, adding that the cafe feels busier, but customers in store and in the drive-thru are getting drinks faster. Baristas also will have more control over the company's digital production manager, an iPad system that controls the sequencing of orders in various channels from cafes, mobile orders and the drive-thru, the company said. Workers will have more flexibility over changing order priority.\n\nStarbucks app expands",
    "summary": "At the heart of the plan is Starbucks' \"Siren Craft System,\" a series of processes that are aimed at making baristas' jobs easier and speeding up service times for customers.\nStarbucks said more than 10% of its 10,000 stores have already implemented the system, which includes changing the production order for hot and cold drinks.\nStarbucks reported rates of incomplete mobile app orders in the mid-teens and said occasional customers came in less.\nLosing customers because of slow orders and other store frustrations could cost Starbucks at a particularly vulnerable time.\nThe company plans to train existing workers for the role or potentially add new baristas, if needed.",
    "keywords": [
      "cafes",
      "inside",
      "starbucks",
      "baristas",
      "system",
      "plans",
      "improve",
      "production",
      "customers",
      "order",
      "company",
      "cold",
      "orders",
      "store",
      "stores"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107408068-1714480095054-gettyimages-2040998551-zawrzel-economya240229_npoRp.jpeg?v=1719522289&w=1920&h=1080",
    "clean_body": "watch starbucks cafe across country starting change make drink order among tweak designed reduce bottleneck long wait time dogged chain overhaul come coffee giant prepares anticipated swell order mobile app heart plan starbucks siren craft system series process aimed making baristas job easier speeding service time customer starbucks said store already implemented system includes changing production order hot cold drink use across north america end july according company executive hope change provide muchneeded jolt starbucks april company reported disappointing second quarter u samestore sale fell traffic dropped coffee chain cut outlook starbucks reported rate incomplete mobile app order midteens said occasional customer came le ceo laxman narasimhan mentioned need make improvement store katie young senior vice president store operation starbucks said immediate shift needed happen cafe better handling unexpected ability flexibly respond thing predict told cnbc interview starbucks coffee shop krakow poland february beata zawrzel nurphoto getty image store change key month starbucks monday started opening app nonrewards member company belief increase traffic order analyst peter saleh managing director btig said sense lot demand certain store footprint kitchen small find way efficient losing customer slow order store frustration could cost starbucks particularly vulnerable time american become cost conscious face ongoing inflation case pulled back morning afternoon beverage snack narasimhan april said consumer spending cautiously starbucks done something uncharacteristic recent week joining stream value offering food beverage combo option communicating value customer also part plan drum business siren system starbucks diagnosing bottleneck issue year since company reinvention plan rollout said young time howard schultz helm returned burgeoning unionization movement shift consumer preference change underway cafe first previewed fall rolled year come narasimhan took schultz march siren system process developed worker feedback issue stopped creating beverage connecting customer starbucks said plan add role akin expediter restaurant production line play caller step away production help solve logjam cafe handling task restocking cup helping unexpected crowd arrives company plan train existing worker role potentially add new baristas needed one pain point saw espresso machine often running time one thing kept partner able check another thing saw didnt necessarily know part store would get crowded young said needed actually partner dedicated thing got busy pulling production helping starbucks said also change order beverage made previously cold drink prioritized start finish even hot beverage order came first pulling espresso shot last step could create traffic jam drivethru example person ordered one beverage cold item would ready hot drink still production macoy mclaughlin manager seattle first walker starbucks location said producing beverage order placed allows faster streamlined process actually proper sequencing hot cold bar versus cold bar becoming popular ever really consistent experience customer actually making order theyre coming mclaughlin said adding cafe feel busier customer store drivethru getting drink faster baristas also control company digital production manager ipad system control sequencing order various channel cafe mobile order drivethru company said worker flexibility changing order priority starbucks app expands",
    "sentiment": 0.06531119154069974,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.cnbc.com/2024/07/01/boeing-to-buy-spirit-aerosystems.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/01/boeing-to-buy-spirit-aerosystems.html",
    "date": "2024-07-01",
    "time": "20:06:11 UTC",
    "title": "Boeing agrees to buy fuselage maker Spirit AeroSystems in $4.7 billion deal",
    "body": "In this article SPR\n\nBA Follow your favorite stocks CREATE FREE ACCOUNT\n\nBoeing Co. 737 fuselage sections sit on the assembly floor at Spirit AeroSystems in Wichita, Kansas. Daniel Acker | Bloomberg | Getty Images\n\nBoeing said Monday that it will buy back its struggling fuselage maker Spirit AeroSystems in an all-stock deal that the plane maker has said will improve safety and quality control. It said it agreed to pay $37.25 a share in Boeing stock for Spirit, giving the plane supplier an equity value of $4.7 billion. Including Spirit's debt the deal has a transaction value of $8.3 billion Boeing said. Spirit's shares closed Friday at $32.87 a share, a market capitalization of about $3.8 billion. Boeing in March disclosed it was in talks to acquire the Wichita, Kansas-based company, weeks after a fuselage panel blew out midair from a nearly new Boeing 737 Max 9 on an Alaska Airlines flight, sparking a fresh crisis for Boeing. Spirit makes the fuselages for the 737 and other parts, including sections of Boeing's 787 Dreamliners. In 2005, Boeing spun off operations in Kansas and Oklahoma that became the present-day Spirit AeroSystems. Boeing accounted for about 70% of Spirit's revenue last year, while roughly a quarter came from making parts for Boeing's main rival, Airbus, according to a securities filing. Boeing CEO Dave Calhoun, who has said he will step down at the end of the year, on Monday said bringing Spirit in-house will \"fully align\" the companies' production systems and workforces.\n\nwatch now\n\n\"Among the many actions we're taking as a company, this is one of the most significant in demonstrating our unwavering commitment to strengthen quality and make certain that Boeing is the company the world needs it to be,\" Calhoun said in a message to employees. He said he expects the deal to close mid-2025, subject to approval by regulators, Spirit shareholders and the sale of Spirit's operations dedicated to Airbus planes. Spirit's CEO, Pat Shanahan, is considered a possible successor for Calhoun. Airbus, meanwhile, said Monday it has reached an agreement with Spirit so that the European aircraft manufacturer is compensated $559 million by Spirit to acquire its manufacturing lines dedicated to Airbus planes. Those include operations in Belfast, Northern Ireland, where the wings and mid-fuselage of the A220 are produced, A220 pylons in Wichita and A350 fuselage sections in North Carolina. Airbus will pay $1 for the assets.\n\nMounting pressure",
    "summary": "In this article SPRBA Follow your favorite stocks CREATE FREE ACCOUNTBoeing Co. 737 fuselage sections sit on the assembly floor at Spirit AeroSystems in Wichita, Kansas.\nDaniel Acker | Bloomberg | Getty ImagesBoeing said Monday that it will buy back its struggling fuselage maker Spirit AeroSystems in an all-stock deal that the plane maker has said will improve safety and quality control.\nIt said it agreed to pay $37.25 a share in Boeing stock for Spirit, giving the plane supplier an equity value of $4.7 billion.\nIncluding Spirit's debt the deal has a transaction value of $8.3 billion Boeing said.\nIn 2005, Boeing spun off operations in Kansas and Oklahoma that became the present-day Spirit AeroSystems.",
    "keywords": [
      "boeing",
      "airbus",
      "spirit",
      "buy",
      "sections",
      "agrees",
      "wichita",
      "aerosystems",
      "47",
      "spirits",
      "billion",
      "company",
      "fuselage",
      "operations",
      "maker",
      "deal"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/106307685-1576861638462gettyimages-98590875.jpeg?v=1593567129&w=1920&h=1080",
    "clean_body": "article spr ba follow favorite stock create free account boeing co fuselage section sit assembly floor spirit aerosystems wichita kansa daniel acker bloomberg getty image boeing said monday buy back struggling fuselage maker spirit aerosystems allstock deal plane maker said improve safety quality control said agreed pay share boeing stock spirit giving plane supplier equity value billion including spirit debt deal transaction value billion boeing said spirit share closed friday share market capitalization billion boeing march disclosed talk acquire wichita kansasbased company week fuselage panel blew midair nearly new boeing max alaska airline flight sparking fresh crisis boeing spirit make fuselage part including section boeings dreamliners boeing spun operation kansa oklahoma became presentday spirit aerosystems boeing accounted spirit revenue last year roughly quarter came making part boeings main rival airbus according security filing boeing ceo dave calhoun said step end year monday said bringing spirit inhouse fully align company production system workforce watch among many action taking company one significant demonstrating unwavering commitment strengthen quality make certain boeing company world need calhoun said message employee said expects deal close mid subject approval regulator spirit shareholder sale spirit operation dedicated airbus plane spirit ceo pat shanahan considered possible successor calhoun airbus meanwhile said monday reached agreement spirit european aircraft manufacturer compensated million spirit acquire manufacturing line dedicated airbus plane include operation belfast northern ireland wing midfuselage produced pylon wichita fuselage section north carolina airbus pay asset mounting pressure",
    "sentiment": 0.13583854417187752,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.cnbc.com/2024/06/30/us-seeks-guilty-plea-from-boeing-over-737-max-crashes.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/06/30/us-seeks-guilty-plea-from-boeing-over-737-max-crashes.html",
    "date": "2024-07-01",
    "time": "00:14:48 UTC",
    "title": "U.S. plans to seek guilty plea from Boeing over fatal 737 Max crashes",
    "body": "The fuselage plug area of Alaska Airlines Flight 1282 Boeing 737-9 MAX, which was forced to make an emergency landing with a gap in the fuselage, is seen during its investigation by the National Transportation Safety Board (NTSB) in Portland, Oregon, U.S. January 7, 2024.\n\nU.S. prosecutors plan to seek a guilty plea from Boeing over a charge tied to two fatal crashes of 737 Max planes, attorneys for the victims' family members said Sunday, blasting a potential agreement as a \"sweetheart deal.\"\n\nJustice Department attorneys and victims' family members and their lawyers spoke for about two hours on Sunday, discussing the plan, lawyers said.\n\nBoeing declined to comment, and it wasn't immediately clear if it would accept a plea deal. A guilty plea could complicate its ability to get government contracts. Boeing is a major defense contractor.\n\nThe Justice Department didn't immediately respond to a request for comment.\n\nThe DOJ said in May that it was reviewing whether Boeing violated a 2021 settlement that protected the company from federal charges tied to the 2018 and 2019 crashes of its best-selling 737 Max planes, which killed all 346 people on the two flights. Under that agreement, Boeing said it would pay $2.5 billion.\n\nThe DOJ revisited the agreement after a door panel blew out of a new 737 Max 9 midair during an Alaska Airlines flight in January, sparking a new safety and quality control crisis for one of the world's two suppliers of large commercial airplanes. The so-called deferred prosecution agreement was set to expire days before the door panel blew out.\n\nBoeing admitted in 2021 that two of its pilots defrauded the Federal Aviation Administration by concealing its addition of a new flight-control system to the planes before they were flown commercially. That system was later implicated in the two crashes.\n\nThe plea deal would require Boeing to pay an additional fine of about $247 million and call for the installation of an outside monitor on Boeing, according to Paul Cassell, one of the lawyers. Cassell called the new deal a \"slap on the wrist.\"",
    "summary": "U.S. prosecutors plan to seek a guilty plea from Boeing over a charge tied to two fatal crashes of 737 Max planes, attorneys for the victims' family members said Sunday, blasting a potential agreement as a \"sweetheart deal.\"\nJustice Department attorneys and victims' family members and their lawyers spoke for about two hours on Sunday, discussing the plan, lawyers said.\nBoeing declined to comment, and it wasn't immediately clear if it would accept a plea deal.\nUnder that agreement, Boeing said it would pay $2.5 billion.\nThe plea deal would require Boeing to pay an additional fine of about $247 million and call for the installation of an outside monitor on Boeing, according to Paul Cassell, one of the lawyers.",
    "keywords": [
      "planes",
      "boeing",
      "fatal",
      "tied",
      "737",
      "lawyers",
      "seek",
      "max",
      "plans",
      "guilty",
      "victims",
      "agreement",
      "plea",
      "deal",
      "crashes"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107355459-17047289222024-01-08t152706z_389571828_rc2rd5a4qd9q_rtrmadp_0_alaska-air-boeing-landing.jpeg?v=1704731605&w=1920&h=1080",
    "clean_body": "fuselage plug area alaska airline flight boeing max forced make emergency landing gap fuselage seen investigation national transportation safety board ntsb portland oregon u january u prosecutor plan seek guilty plea boeing charge tied two fatal crash max plane attorney victim family member said sunday blasting potential agreement sweetheart deal justice department attorney victim family member lawyer spoke two hour sunday discussing plan lawyer said boeing declined comment wasnt immediately clear would accept plea deal guilty plea could complicate ability get government contract boeing major defense contractor justice department didnt immediately respond request comment doj said may reviewing whether boeing violated settlement protected company federal charge tied crash bestselling max plane killed people two flight agreement boeing said would pay billion doj revisited agreement door panel blew new max midair alaska airline flight january sparking new safety quality control crisis one world two supplier large commercial airplane socalled deferred prosecution agreement set expire day door panel blew boeing admitted two pilot defrauded federal aviation administration concealing addition new flightcontrol system plane flown commercially system later implicated two crash plea deal would require boeing pay additional fine million call installation outside monitor boeing according paul cassell one lawyer cassell called new deal slap wrist",
    "sentiment": -0.03117183742183742,
    "sentiment_category": "negative",
    "t": 314
  },
  "https://www.cnbc.com/2024/07/01/a-new-index-is-using-ai-tools-to-measure-us-economic-growth-in-a-broader-way.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/01/a-new-index-is-using-ai-tools-to-measure-us-economic-growth-in-a-broader-way.html",
    "date": "2024-07-01",
    "time": "18:02:03 UTC",
    "title": "A new index is using AI tools to measure U.S. economic growth in a broader way",
    "body": "Measuring the strength of the sprawling U.S. economy is no easy task, so one firm is sending artificial intelligence in to do the job.\n\nThe Zeta Economic Index, launched Monday, uses generative AI to analyze what its developers call \"trillions of behavioral signals,\" largely focused on consumer activity, to score growth on both a broad level of health and a separate measure on stability.\n\nAt its core, the index will gauge online and offline activity across eight categories, aiming to give a comprehensive look that incorporates standard economic data points such as unemployment and retail sales combined with high-frequency information for the AI age.\n\n\"The algorithm is looking at traditional economic indicators that you would normally look at. But then inside of our proprietary algorithm, we're ingesting the behavioral data and transaction data of 240 million Americans, which nobody else has,\" said David Steinberg, co-founder, chairman and CEO of Zeta Global.\n\n\"So instead of looking at the data in the rearview mirror like everybody else, we're trying to put it out in advance to give a 30-day advanced snapshot of where the economy is going,\" he added.",
    "summary": "Measuring the strength of the sprawling U.S. economy is no easy task, so one firm is sending artificial intelligence in to do the job.\nThe Zeta Economic Index, launched Monday, uses generative AI to analyze what its developers call \"trillions of behavioral signals,\" largely focused on consumer activity, to score growth on both a broad level of health and a separate measure on stability.\nAt its core, the index will gauge online and offline activity across eight categories, aiming to give a comprehensive look that incorporates standard economic data points such as unemployment and retail sales combined with high-frequency information for the AI age.\n\"The algorithm is looking at traditional economic indicators that you would normally look at.\nBut then inside of our proprietary algorithm, we're ingesting the behavioral data and transaction data of 240 million Americans, which nobody else has,\" said David Steinberg, co-founder, chairman and CEO of Zeta Global.",
    "keywords": [
      "using",
      "measure",
      "growth",
      "tools",
      "zeta",
      "algorithm",
      "ai",
      "way",
      "look",
      "looking",
      "behavioral",
      "economy",
      "data",
      "broader",
      "economic",
      "index"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/106895258-1623343847356ZETA-OB-Photo-210610-PRESS-5-jpg?v=1719856723&w=1920&h=1080",
    "clean_body": "measuring strength sprawling u economy easy task one firm sending artificial intelligence job zeta economic index launched monday us generative ai analyze developer call trillion behavioral signal largely focused consumer activity score growth broad level health separate measure stability core index gauge online offline activity across eight category aiming give comprehensive look incorporates standard economic data point unemployment retail sale combined highfrequency information ai age algorithm looking traditional economic indicator would normally look inside proprietary algorithm ingesting behavioral data transaction data million american nobody else said david steinberg cofounder chairman ceo zeta global instead looking data rearview mirror like everybody else trying put advance give day advanced snapshot economy going added",
    "sentiment": 0.029294217687074835,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.theguardian.com/money/article/2024/jul/02/next-uk-government-poised-to-benefit-from-fall-in-inflation-and-fuel-prices": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/money/article/2024/jul/02/next-uk-government-poised-to-benefit-from-fall-in-inflation-and-fuel-prices",
    "date": "2024-07-01",
    "time": "23:01:27 UTC",
    "title": "Next UK government poised to benefit from fall in inflation and fuel prices",
    "body": "Britain’s next government is poised to benefit from easing pressure on household finances after a slowdown in inflation in stores and a fall in fuel prices, but costs remain “too expensive” for many families.\n\nFigures from the British Retail Consortium (BRC) show that annual UK shop price inflation cooled last month to 0.2%, down from 0.6% in May – the slowest pace since October 2021 – as retailers cut the prices of many of their key products, including butter and coffee.\n\nComing before Thursday’s general election, separate figures from the RAC show that petrol and diesel prices fell for a second straight month in June to ease pressure on families affected by the cost of living crisis. The organisation said, however, that filling up on the forecourt was still “too expensive” in England, Wales and Scotland.\n\nAccording to the RAC’s monthly fuel watch, the average price of petrol in the UK at the end of June was just under 145p a litre, down from 148p at the start of the month. Diesel dropped from nearly 154p to about 150p.\n\n“Fuel prices are still nowhere near where they should be despite falling for the second consecutive month,” the RAC said. It highlighted the lower cost of filling up in Northern Ireland, where petrol is 4.5p a litre cheaper on average and diesel 8p cheaper than in the rest of the UK.\n\nThe RAC’s head of policy, Simon Williams, said: “While it’s good news prices at the pumps have fallen for the second month in a row, this also leaves a bad taste in the mouth because we know drivers in Great Britain are continuing to get a raw deal as both petrol and diesel are still much more expensive than in Northern Ireland.”\n\nHe said prices at forecourts owned and run by Shell and BP were the most expensive, highlighting Competition and Markets Authority data showing that Shell-owned sites were the most expensive in the UK.\n\n“We remain baffled how the very same fuel can be sold for such vastly different prices by the biggest retailers, whether they’re run by supermarkets or the world’s largest oil companies,” he said.\n\nRishi Sunak has made lower inflation the cornerstone of the Conservatives’ general election campaign after a return in the official headline rate to the Bank of England’s target of 2% in May, down from a peak of 11.1% in October 2022.\n\nThe shadow chancellor, Rachel Reeves, however, has said pressure on household finances remains “acute” as average prices remain significantly higher than before the cost of living crisis took hold.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nAccording to the latest snapshot from the BRC, food inflation slowed to 2.5% in June, down from 3.2% in May, in the 14th consecutive deceleration for annual growth in grocery prices. The figures suggest average prices in UK shops are continuing to rise, albeit at a slower pace than in previous months.\n\nThe chief executive of the BRC, Helen Dickinson, said retailers had, however, cut the prices of some key products including butter and coffee. Non-food prices were also in deflation – meaning average prices are falling compared with a year earlier – as shops tried to boost their sales by discounting products.\n\n“This was particularly true for TVs with great deals to capitalise on the Euros fever,” she said. “Whoever wins Thursday’s election will benefit from the work of retailers to cut their costs and prices, easing the cost of living for millions of households.”",
    "summary": "Britain’s next government is poised to benefit from easing pressure on household finances after a slowdown in inflation in stores and a fall in fuel prices, but costs remain “too expensive” for many families.\n“Fuel prices are still nowhere near where they should be despite falling for the second consecutive month,” the RAC said.\nThe figures suggest average prices in UK shops are continuing to rise, albeit at a slower pace than in previous months.\nNon-food prices were also in deflation – meaning average prices are falling compared with a year earlier – as shops tried to boost their sales by discounting products.\n“Whoever wins Thursday’s election will benefit from the work of retailers to cut their costs and prices, easing the cost of living for millions of households.”",
    "keywords": [
      "uk",
      "benefit",
      "prices",
      "poised",
      "petrol",
      "retailers",
      "average",
      "cost",
      "month",
      "expensive",
      "diesel",
      "fuel",
      "inflation",
      "fall"
    ],
    "image_url": "https://i.guim.co.uk/img/media/13285bd8fe46bf7bfea7b1d61c21412510d0649b/0_135_4789_2872/master/4789.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a1e1280965a96fd6f58363c6c9e63104",
    "clean_body": "britain 's next government poised benefit easing pressure household finance slowdown inflation store fall fuel price cost remain `` expensive '' many family figure british retail consortium brc show annual uk shop price inflation cooled last month may - slowest pace since october - retailer cut price many key product including butter coffee coming thursday 's general election separate figure rac show petrol diesel price fell second straight month june ease pressure family affected cost living crisis organisation said however filling forecourt still `` expensive '' england wale scotland according rac 's monthly fuel watch average price petrol uk end june p litre p start month diesel dropped nearly p p '' fuel price still nowhere near despite falling second consecutive month '' rac said highlighted lower cost filling northern ireland petrol p litre cheaper average diesel p cheaper rest uk rac 's head policy simon williams said `` 's good news price pump fallen second month row also leaf bad taste mouth know driver great britain continuing get raw deal petrol diesel still much expensive northern ireland '' said price forecourt owned run shell bp expensive highlighting competition market authority data showing shellowned site expensive uk '' remain baffled fuel sold vastly different price biggest retailer whether 're run supermarket world 's largest oil company '' said rishi sunak made lower inflation cornerstone conservative ' general election campaign return official headline rate bank england 's target may peak october shadow chancellor rachel reef however said pressure household finance remains `` acute '' average price remain significantly higher cost living crisis took hold skip past newsletter promotion sign business today free daily newsletter get set working day - well point business news analysis need every morning enter email address sign privacy notice newsletter may contain info charity online ad content funded outside party information see newsletter may contain info charity online ad content funded outside party information see privacy policy use google recaptcha protect website google privacy policy term service apply newsletter promotion according latest snapshot brc food inflation slowed june may th consecutive deceleration annual growth grocery price figure suggest average price uk shop continuing rise albeit slower pace previous month chief executive brc helen dickinson said retailer however cut price key product including butter coffee nonfood price also deflation - meaning average price falling compared year earlier - shop tried boost sale discounting product '' particularly true tv great deal capitalise euro fever '' said `` whoever win thursday 's election benefit work retailer cut cost price easing cost living million household ''",
    "sentiment": 0.06445077556188669,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.theguardian.com/world/article/2024/jul/01/greece-introduces-growth-oriented-six-day-working-week": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/article/2024/jul/01/greece-introduces-growth-oriented-six-day-working-week",
    "date": "2024-07-01",
    "time": "16:26:54 UTC",
    "title": "Greece introduces ‘growth-oriented’ six-day working week",
    "body": "Companies in countries worldwide may be toying with the idea of implementing shorter working weeks, but in Greece employees have been told that, henceforth, they can put in a sixth day of labour in an unorthodox step aimed at turbocharging productivity.\n\nAfter outpacing other Europeans in terms of economic growth, the nation once at the heart of the continent’s worst financial crisis has bucked the trend again, introducing a 48-hour working week. The measure, decried as “barbaric” by unions, takes effect from Monday.\n\n“It makes no sense whatsoever,” said Akis Sotiropoulos an executive committee member of the civil servants’ union Adedy. “When almost every other civilised country is enacting a four-day week, Greece decides to go the other way.”\n\nThe pro-business government of the prime minister, Kyriakos Mitsotakis, says the initiative was made necessary by the twin perils of a shrinking population and shortage of skilled workers. Prior to announcing the legislation – part of a broader set of labour laws passed last year – Mitsotakis described the projected demographic shift as a “ticking timebomb”. In an unprecedented exodus, about 500,000 mostly young educated Greeks are estimated to have emigrated since the near decade-long debt crisis erupted in late 2009.\n\nThe six-day scheme, officials say, will only apply to private businesses providing round-the-clock services. Under the extended working week, staff in select industries and manufacturing facilities will have the option of working an additional two hours a day or an extra eight-hour shift, rewarded with a top-up fee of 40% added to the daily wage.\n\nEither choice, the centre right government claims, will redress the issue of employees not being paid for overtime while also tackling the pervasive problem of undeclared work.\n\n“The nucleus of this legislation is worker-friendly, it is deeply growth-oriented,” Mitsotakis said before the Greek parliament endorsed the law. “And it brings Greece in line with the rest of Europe.”\n\nBut the backlash has been fierce. In a country with almost no tradition of inspections in the workplace, critics contend the reform ultimately sounds the death knell of the five-day working week, not least because it enables employers to dictate whether a sixth day of labour is required.\n\nFor opponents, who have already taken to the streets in protest, the reform erodes legal protections and rolls back long-established workers’ rights in the name of flexibility.\n\n“In reality this has been passed by a government ideologically committed to generating ever bigger profits for capital,” said Sotiropoulos. “Better productivity comes with better work conditions, a better quality of life [for employees] and that, we now know, is about less hours not more.”\n\nThe measure, he said, had been made possible partly because trade unions had also seen their power wane as a result of debt-stricken Athens enacting austerity measures in return for rescue funds during the country’s financial crisis. Unions have long argued that overtime enables employers to hold back on hiring more staff.\n\nTrialled four-day week programmes have repeatedly shown increased levels of productivity with researchers attributing the outcome to improved levels of focus. Belgium in 2022 legislated to give employees the legal right to spread their working week over four days instead of five, and pilot schemes have been carried out in countries including the UK, Germany, Japan, South Africa and Canada.\n\nGreeks already work the longest hours in Europe, putting in an average 41 hours a week according to the EU’s statistics agency, Eurostat, although surveys have also proved they get paid much less. The left-wing opposition has frequently decried “Bulgarian salaries in a country of British prices”, claiming the phenomenon has only exacerbated the brain drain.\n\nPeople on pensions, who have also been encouraged to work under the legislation, have weighed into the debate.\n\n“What the government is essentially saying is ‘go and work longer, we’ll turn a blind eye even if you’re a pensioner,’” said Grigoris Kalomoiris who heads the union of retired teachers (Pesek).\n\n“It knows that the majority of Greeks, on an average monthly salary of €900, can only survive until the 20th of the month. This latest barbaric measure is not going to solve the fundamental problem of labour shortages and a lot of us feel it is very unfair to unemployed young Greeks who may never have a job.”",
    "summary": "After outpacing other Europeans in terms of economic growth, the nation once at the heart of the continent’s worst financial crisis has bucked the trend again, introducing a 48-hour working week.\nUnder the extended working week, staff in select industries and manufacturing facilities will have the option of working an additional two hours a day or an extra eight-hour shift, rewarded with a top-up fee of 40% added to the daily wage.\n“The nucleus of this legislation is worker-friendly, it is deeply growth-oriented,” Mitsotakis said before the Greek parliament endorsed the law.\nTrialled four-day week programmes have repeatedly shown increased levels of productivity with researchers attributing the outcome to improved levels of focus.\nBelgium in 2022 legislated to give employees the legal right to spread their working week over four days instead of five, and pilot schemes have been carried out in countries including the UK, Germany, Japan, South Africa and Canada.",
    "keywords": [
      "measure",
      "mitsotakis",
      "sixday",
      "working",
      "work",
      "labour",
      "employees",
      "week",
      "unions",
      "introduces",
      "greece",
      "hours",
      "growthoriented",
      "legislation"
    ],
    "image_url": "https://i.guim.co.uk/img/media/0d1a793aeb66e912d8cd7cf0f984014ad4a304c6/0_136_5568_3341/master/5568.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9c2d181ffc56089ab7deaabf7dc5d7eb",
    "clean_body": "company country worldwide may toying idea implementing shorter working week greece employee told henceforth put sixth day labour unorthodox step aimed turbocharging productivity outpacing european term economic growth nation heart continent 's worst financial crisis bucked trend introducing hour working week measure decried `` barbaric '' union take effect monday '' make sense whatsoever '' said akis sotiropoulos executive committee member civil servant ' union adedy `` almost every civilised country enacting fourday week greece decides go way '' probusiness government prime minister kyriakos mitsotakis say initiative made necessary twin peril shrinking population shortage skilled worker prior announcing legislation - part broader set labour law passed last year - mitsotakis described projected demographic shift `` ticking timebomb '' unprecedented exodus mostly young educated greek estimated emigrated since near decadelong debt crisis erupted late sixday scheme official say apply private business providing roundtheclock service extended working week staff select industry manufacturing facility option working additional two hour day extra eighthour shift rewarded topup fee added daily wage either choice centre right government claim redress issue employee paid overtime also tackling pervasive problem undeclared work '' nucleus legislation workerfriendly deeply growthoriented '' mitsotakis said greek parliament endorsed law `` brings greece line rest europe '' backlash fierce country almost tradition inspection workplace critic contend reform ultimately sound death knell fiveday working week least enables employer dictate whether sixth day labour required opponent already taken street protest reform erodes legal protection roll back longestablished worker ' right name flexibility '' reality passed government ideologically committed generating ever bigger profit capital '' said sotiropoulos `` better productivity come better work condition better quality life employee know le hour '' measure said made possible partly trade union also seen power wane result debtstricken athens enacting austerity measure return rescue fund country 's financial crisis union long argued overtime enables employer hold back hiring staff trialled fourday week programme repeatedly shown increased level productivity researcher attributing outcome improved level focus belgium legislated give employee legal right spread working week four day instead five pilot scheme carried country including uk germany japan south africa canada greek already work longest hour europe putting average hour week according eu 's statistic agency eurostat although survey also proved get paid much le leftwing opposition frequently decried `` bulgarian salary country british price '' claiming phenomenon exacerbated brain drain people pension also encouraged work legislation weighed debate '' government essentially saying 'go work longer 'll turn blind eye even 're pensioner ' '' said grigoris kalomoiris head union retired teacher pesek '' know majority greek average monthly salary EUR survive th month latest barbaric measure going solve fundamental problem labour shortage lot u feel unfair unemployed young greek may never job ''",
    "sentiment": 0.030648926237161537,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.theguardian.com/politics/article/2024/jul/01/nick-hartley-obituary": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/politics/article/2024/jul/01/nick-hartley-obituary",
    "date": "2024-07-01",
    "time": "15:54:44 UTC",
    "title": "Nick Hartley obituary",
    "body": "Nick Hartley, who has died aged 80, was a respected economist and in the 1990s served as head of energy, economics and statistics at the Department of Trade and Industry.\n\nHis reputation was made as chief economist at Oftel (the Office of Telecommunications) for six years from 1984. He was then chief economist at the Department of the Environment (1990-94), before becoming head of energy, economics and statistics at the DTI, a post, he liked to point out, once held by Harold Wilson. In 1996, Nick joined the economic consultancy Oxera, from where he was seconded to the Cabinet Office to head up a report on energy policy.\n\nBorn in London, the only child of Nancy (nee Fulton), a dressmaker, and Edward Hartley, a publican, Nick went to St Clement Danes grammar school, Hammersmith, where he and I met in 1955. Sitting side by side in assembly for the headteacher’s address to the new boys, he introduced himself: “Hello, I’m Hartley, like the jam.”\n\nIn the sixth form we were told by our economics teacher, Jack Harvey, to apply to St Catharine’s College, Cambridge, to study economics. We arrived in 1962 during a winter so cold that the River Granta froze, and Nick and I would walk on it to Grantchester.\n\nAfter graduating, Nick passed the civil service exam and became assistant principal at the Department for Education, where he worked for JAR Pimlott setting up polytechnics (1965-69). From there, he moved to the Treasury as an economic adviser (1969-84). He was seconded from the Treasury twice, in 1970-71 to do an MPhil at York University, and in 1974-77, to the Royal Commission on the Press.\n\nLatterly he was a companion of the Guild of St George, a charity for arts and crafts founded by John Ruskin who, Nick said, “was asking all the right questions about the way work and society should be organised”. Nick travelled throughout Italy with Ruskin’s work in mind, and artistic interests were central to his life.\n\nHe wrote several books, including The Prince of Privateers (2012), a life of one of his forebears who was on the British side in the American war of independence, and Monuments Officer (2012), a novel.\n\nAn enthusiastic theatregoer, as an undergraduate he played Lucky in a production of Waiting for Godot. After hearing Bob Dylan’s second album in 1962 he became a lifelong fan of the musician. He was also a keen reader of the magazine Cahiers du Cinéma, so after watching a film at Cambridge, whether Hammer horror or Truffaut, he would give notes on “auteur theory”.\n\nThe novelist and playwright Nigel Williams described Nick as having a “unique brisk theatricality”. Perfect words with which to preserve my own memories of him, particularly as the briskness often involved the sort of expansive gestures that put any wine glasses on a table at risk.\n\nNick is survived by Jenny (nee Stern), whom he married in 1975, and by their sons, Ned and Gabriel, and granddaughters, Violet, Hazel and Hana.",
    "summary": "Nick Hartley, who has died aged 80, was a respected economist and in the 1990s served as head of energy, economics and statistics at the Department of Trade and Industry.\nIn 1996, Nick joined the economic consultancy Oxera, from where he was seconded to the Cabinet Office to head up a report on energy policy.\nBorn in London, the only child of Nancy (nee Fulton), a dressmaker, and Edward Hartley, a publican, Nick went to St Clement Danes grammar school, Hammersmith, where he and I met in 1955.\nNick travelled throughout Italy with Ruskin’s work in mind, and artistic interests were central to his life.\nNick is survived by Jenny (nee Stern), whom he married in 1975, and by their sons, Ned and Gabriel, and granddaughters, Violet, Hazel and Hana.",
    "keywords": [
      "work",
      "hartley",
      "st",
      "economist",
      "obituary",
      "economics",
      "head",
      "energy",
      "nick",
      "department",
      "treasury"
    ],
    "image_url": "https://i.guim.co.uk/img/media/e22704c0696b1826b4d7d4aaab7399a808290d47/117_242_1103_662/master/1103.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b14914ac579065bb5c8fda68877e52eb",
    "clean_body": "nick hartley died aged respected economist served head energy economics statistic department trade industry reputation made chief economist oftel office telecommunication six year chief economist department environment becoming head energy economics statistic dti post liked point held harold wilson nick joined economic consultancy oxera seconded cabinet office head report energy policy born london child nancy nee fulton dressmaker edward hartley publican nick went st clement dane grammar school hammersmith met sitting side side assembly headteacher 's address new boy introduced `` hello 'm hartley like jam '' sixth form told economics teacher jack harvey apply st catharine 's college cambridge study economics arrived winter cold river granta froze nick would walk grantchester graduating nick passed civil service exam became assistant principal department education worked jar pimlott setting polytechnic moved treasury economic adviser seconded treasury twice mphil york university royal commission press latterly companion guild st george charity art craft founded john ruskin nick said `` asking right question way work society organised '' nick travelled throughout italy ruskin 's work mind artistic interest central life wrote several book including prince privateer life one forebear british side american war independence monument officer novel enthusiastic theatregoer undergraduate played lucky production waiting godot hearing bob dylan 's second album became lifelong fan musician also keen reader magazine cahiers du cinema watching film cambridge whether hammer horror truffaut would give note `` auteur theory '' novelist playwright nigel williams described nick `` unique brisk theatricality '' perfect word preserve memory particularly briskness often involved sort expansive gesture put wine glass table risk nick survived jenny nee stern married son ned gabriel granddaughter violet hazel hana",
    "sentiment": 0.19710046897546896,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.theguardian.com/business/article/2024/jul/01/austerity-was-a-disastrous-political-choice-that-we-are-still-reeling-from": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/article/2024/jul/01/austerity-was-a-disastrous-political-choice-that-we-are-still-reeling-from",
    "date": "2024-07-01",
    "time": "15:41:16 UTC",
    "title": "Austerity was a disastrous political choice that we are still reeling from",
    "body": "Paul Krugman (How the ‘unforced error’ of austerity wrecked Britain, 28 June) hits the nail on the head when he says that there was no economic case for the austerity that the coalition government foisted on us in 2010, the effects of which are still with us. It was a political choice on the part of George Osborne and David Cameron to advance their class interest, cleverly camouflaged by stories of Labour profligacy when the economic crisis to which it was the alleged response was caused by a surfeit of financial deregulation advocated by Osborne and Cameron and supinely accepted by Labour.\n\nThe American political economist Clara E Mattei, in her 2022 book, The Capital Order: How Economists Invented Austerity and Paved the Way to Fascism, showed how similar policies were applied in Britain and Italy after the first world war, essentially to keep workers in their place, and how in Italy they led to the rise of Mussolini and fascism. Let us be warned.\n\nProf Roger Brown\n\nSouthampton\n\nPaul Krugman is right about the impact of austerity on the UK economy – here are a couple of reasons why. First, those who advocate the shrinking of the state fail to appreciate how the economy is interdependent. Most public authorities require tendering for services. Generally, the private or voluntary sectors get the tender. So if the public sector is starved of finance and catches a cold, the private and voluntary sectors start to sneeze too.\n\nSecond, the assumption is that if the public sector is smaller, the private sector will take up the slack. This ignores the fact that the private sector’s bottom line is its profitability and ability to satisfy its shareholders, not the public interest. In practice, this means that the private sector will cherry-pick the easy and profitable tasks, as with the failed privatisation of the probation service, while leaving anything difficult or unprofitable to the public sector.\n\nAlternatively, as with the failed privatisation of the railways, the private sector demands subsidies out of our taxes so that it can pay a dividend to its shareholders, thereby taking money out of the system that could otherwise be used to improve the infrastructure, reduce fares, or both.\n\nAusterity was an ideological choice by the coalition government. While I would have expected little better from the Conservatives, I would have hoped that their Liberal Democrat coalition partners would have drawn enough red lines to prevent the government from following through on its economic illiteracy and choking off the first signs of recovery from the 2007-08 crash. As it is, we’ve suffered from the consequences ever since.\n\nDave Pollard\n\nLeicester\n\nPaul Krugman does an excellent job of exposing the disastrous consequences of 14 years of austerity for both society and the economy. But in solely blaming the Tories, he neglects to acknowledge the role of the Liberal Democrats in both enabling austerity and even co-authoring the genesis of the policy through the key role played by the then chief secretary to the Treasury David Laws.\n\nAlthough in post for only a short time, his role was pivotal in developing the first drastic cuts in public expenditure. We now live with the consequences of 14 years of monetarist dogma ruthlessly, pitilessly and unfairly applied.\n\nAlan Beynon\n\nBarmby Moor, East Yorkshire",
    "summary": "Prof Roger BrownSouthamptonPaul Krugman is right about the impact of austerity on the UK economy – here are a couple of reasons why.\nSo if the public sector is starved of finance and catches a cold, the private and voluntary sectors start to sneeze too.\nSecond, the assumption is that if the public sector is smaller, the private sector will take up the slack.\nThis ignores the fact that the private sector’s bottom line is its profitability and ability to satisfy its shareholders, not the public interest.\nDave PollardLeicesterPaul Krugman does an excellent job of exposing the disastrous consequences of 14 years of austerity for both society and the economy.",
    "keywords": [
      "disastrous",
      "austerity",
      "political",
      "reeling",
      "private",
      "sector",
      "krugman",
      "role",
      "economy",
      "choice",
      "consequences",
      "economic",
      "sectors",
      "public"
    ],
    "image_url": "https://i.guim.co.uk/img/media/dfdc700242647c2cfdbd8b62f0d5c9923dddc68b/0_94_4237_2543/master/4237.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c443bae3224dbaeafb53f96d6629203e",
    "clean_body": "paul krugman 'unforced error ' austerity wrecked britain june hit nail head say economic case austerity coalition government foisted u effect still u political choice part george osborne david cameron advance class interest cleverly camouflaged story labour profligacy economic crisis alleged response caused surfeit financial deregulation advocated osborne cameron supinely accepted labour american political economist clara e mattei book capital order economist invented austerity paved way fascism showed similar policy applied britain italy first world war essentially keep worker place italy led rise mussolini fascism let u warned prof roger brown southampton paul krugman right impact austerity uk economy - couple reason first advocate shrinking state fail appreciate economy interdependent public authority require tendering service generally private voluntary sector get tender public sector starved finance catch cold private voluntary sector start sneeze second assumption public sector smaller private sector take slack ignores fact private sector 's bottom line profitability ability satisfy shareholder public interest practice mean private sector cherrypick easy profitable task failed privatisation probation service leaving anything difficult unprofitable public sector alternatively failed privatisation railway private sector demand subsidy tax pay dividend shareholder thereby taking money system could otherwise used improve infrastructure reduce fare austerity ideological choice coalition government would expected little better conservative would hoped liberal democrat coalition partner would drawn enough red line prevent government following economic illiteracy choking first sign recovery crash 've suffered consequence ever since dave pollard leicester paul krugman excellent job exposing disastrous consequence year austerity society economy solely blaming tory neglect acknowledge role liberal democrat enabling austerity even coauthoring genesis policy key role played chief secretary treasury david law although post short time role pivotal developing first drastic cut public expenditure live consequence year monetarist dogma ruthlessly pitilessly unfairly applied alan beynon barmby moor east yorkshire",
    "sentiment": -0.005951359960793924,
    "sentiment_category": "negative",
    "t": 314
  },
  "https://www.theguardian.com/business/live/2024/jul/01/euro-dollar-sterling-bond-markets-france-election-marine-le-pen-french-hung-parliament-manufacturing-ecb-business-live": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/live/2024/jul/01/euro-dollar-sterling-bond-markets-france-election-marine-le-pen-french-hung-parliament-manufacturing-ecb-business-live",
    "date": "2024-07-01",
    "time": "14:05:04 UTC",
    "title": "Port Talbot steel union suspends strike; French share prices jump after elections – as it happened",
    "body": "6d ago 15.26 CEST Northern Irish politicians have raised concerns over the future of as many as 1,400 workers at the Spirit Aerosystems factory in Belfast, after its takeover by planemaker Airbus. Boeing has announced the takeover of Spirit Aerosystems as it tries to retake control of its supply chain following a series of production issues. As part of that deal Airbus will take over Spirit operations serving it, including in Belfast which makes wings and fuselages for the small A220 jet. However, the Unite union has said that 40% of the 3,600 workforce is employed on parts that are not related to Airbus projects, including work for Bombardier and Rolls-Royce. Airbus did not say whether it plans to continue that work. Local politicians are concerned that job losses may result at an historic factory that traces its history back to Short Brothers, the first company to make production aircraft. First minister Michelle O’Neill and deputy first minister Emma Little-Pengelly released statements in which they said the government was working with the company to preserve the Belfast operations. Economy minister Conor Murphy said: “I have been engaging with the company and union on the acquisition and will work with all key stakeholders to ensure that the future status of the highly skilled workforce is protected.” Reuters reported: The leader of Northern Ireland’s largest unionist party, the Democratic Unionist Party’s (DUP) Gavin Robinson, said the sale represented only “a partial solution”. Steve Aiken, a member of the smaller Ulster Unionist Party, said it was an outcome “neither management, workforce or the unions desired”, calling on Northern Ireland’s economy minister to intervene to ensure the entire business is retained. “The minister also needs to emphasis to Airbus the considerable investment the Northern Irish and UK governments have made in wing and aerostructure manufacturing in Belfast and that we will not be allowing our aircraft industry to be asset stripped and manufacturing moved elsewhere,” Aiken added. Share\n\n6d ago 14.45 CEST German inflation drops as European Central Bank mulls further rate cuts German inflation has dropped slightly more than expected to 2.2% year-on-year in June, as the European Central Bank (ECB) considers whether to cut interest rates again. It dropped from 2.4% in May, and was slightly lower than the 2.3% forecast. The ECB has a 2% inflation target, but it has cut borrowing costs because it believes that inflationary pressure is easing. A further reduction in inflation could support that view. Carsten Brzeski, global head of macro at ING, a Dutch investment bank, said the reading keeps the door open to further ECB rate cuts, but added that inflation “remains sticky above 2%. He wrote: Looking ahead, the stickiness of inflation at slightly too high a level looks set to continue as favourable energy base effects are petering out while, at the same time, wages are increasing. With recent new wage demands, it is hard to see German wage growth coming down in the second half of the year. Claus Vistesen, chief eurozone economist at Pantheon Macroeconomics, a consultancy, a September cut is likely. He said: said: Looking further ahead for Germany, we see scope for a further decline in headline inflation to below 2% by August, helping to get a 25 basis point rate cut over the line in September, before a rebound to just under 2.5% by the end of the year. Share Updated at 14.45 CEST\n\n6d ago 14.21 CEST Facebook owner Meta's 'pay or consent' model breaches EU law View image in fullscreen A photo taken on 3 April 2024 shows the logo of US online social media and social networking service Facebook on a smartphone screen in Frankfurt am Main, western Germany. Photograph: Kirill Kudryavtsev/AFP/Getty Images Mark Zuckerberg’s Meta has breached the EU’s new digital laws with an advertising model that charges users for ad-free versions of Facebook and Instagram, according to the European Commission. Meta launched a “pay or consent” model last year in an effort to comply with the bloc’s data privacy rules, where users pay a monthly fee for an ad-free version of Facebook or Instagram that does not use their personal data for advertising purposes, writes the Guardian’s Dan Milmo. Users who do not pay have, as part of the signing up process for the platforms, consented to their data being used to tailor personalised adverts that appear in their social media feeds. The European Commission, the EU’s executive body, said the model does not comply with the Digital Markets Act, which is designed to rein in big tech companies. The commission issued preliminary findings from an investigation into “pay or consent” on Monday and found the model “forces users to consent” to their data being collected from multiple platforms. It also does not allow users to choose a service that uses less of their data but is broadly similar to the “with adverts” versions of Facebook and Instagram, the commission said. You can read the full story here: Meta breaches digital rules by charging users for ad-free social networks, EU claims Read more Share\n\n6d ago 13.57 CEST Unite the union has said that Tata Steel will enter talks about “future investment for its operations and not just redundancies”, after suspending strikes. Other unions have complained that there has been no progress in the last six weeks, but Unite suggested that Tata had changed stance. Tata has stuck to its position that the two blast furnaces must close this year. However, a plan backed by counterpart unions Community and GMB suggested keeping one furnace open for longer while readying a large investment in greener technology (such as a direct reduced iron plant) to convert iron ore to iron, which could then be fed into an electric arc furnace. That plan would preserve jobs on the blast furnaces for several years, and would then require more workers to run in the longer term – although nowhere near the 2,800 employees who could be out of work by the autumn. View image in fullscreen Unite union general secretary Sharon Graham. Photograph: Jacob King/PA Sharon Graham, Unite’s general secretary, said: This is a significant development in the battle to protect jobs and the long-term future of steel making in South Wales. Investment from Labour secured by Unite will be key to the future of the site. This breakthrough would not have come about without the courage of our members at Port Talbot who were prepared to stand up and fight for their jobs. Workers were simply not prepared to stand idly by while steel making ended and their communities were laid to waste. It is essential that these talks progress swiftly and in good faith with the focus on fresh investment and ensuring the long-term continuation of steel making in South Wales. Share\n\n6d ago 12.59 CEST Tata Steel had written to the three main unions representing steelworkers at Port Talbot offering more talks over its plans to cut 2,800 jobs as it closes the blast furnaces if the strike threat were removed. Owner of Port Talbot steelworks offers fresh talks as last furnace faces closure Read more The unions are hopeful that a Labour government would persuade Tata Steel to delay the closure of at least one blast furnace, preserving thousands of jobs for several years. Unite had threatened strike action from 8 July – after the planned closure of the first blast furnace. The other unions were hanging on for a Labour government after 4 July. Shadow business secretary Jonathan Reynolds has already been in talks with the unions and the company in an effort to avert the closures. Alun Davies, national officer for Community, which represents most of the affected steelworkers, said: With thousands of jobs at stake, we welcome Unite’s decision to withdraw their strike action and get back around the table with their sister steel unions. Tata confirmed that if the strike was called off they are ready to resume discussions on a potential [memorandum of understanding], through the multi-union steel committee which is chaired by Community. The truth is Tata never walked away from those discussions, and at our last meeting on 22 May all unions agreed to conclude the negotiations and put the outcome to our members. Community will welcome resuming those discussions, but we regret that zero progress has been made since 22 May. Share\n\n6d ago 12.49 CEST Port Talbot steelworks union suspends strike threat View image in fullscreen Labour politicians have urged Tata to avoid taking action that cannot be reversed before the election result after the steel giant announced it was bringing forward plans to shut down blast furnaces at its biggest plant because of a strike. Photograph: Ben Birchall/PA A union representing some workers at Tata Steel’s works in Port Talbot, south Wales, has suspended strikes after talks with the company. Unite union is understood to have suspended the strike threat after high-level talks between union officials and the company. Tata plans to close two blast furnaces at the site and shift towards much cleaner electric arc furnaces. However, unions want them to delay the closure – the first of which is due this week – to await a Labour government. Labour has said it will offer significant extra state subsidy to the steel industry, above the £500m deal agreed with Tata Steel by the Conservative government. A full statement from Unite is expected shortly. Share\n\n6d ago 12.16 CEST There has been a rush of manufacturing data today. The UK’s purchasing managers’ index (PMI) from S&P Global suggests it is doing better than Europe. The PMI reading came in at 50.9 in June, still well into expansionary territory, in contrast to the two-year contraction in Europe. The reading was worse than the initial flash estimate of 51.4, and down slightly from May’s 22-month high of 51.2. View image in fullscreen Output from the UK manufacturing sector has picked up in recent months. Photograph: S&P Global Rob Dobson, director at S&P Global Market Intelligence, said: The UK manufacturing sector is enjoying its strongest spell of growth for over two years, with June seeing output and new order growth sustained at robust rates similar to May’s recent highs. The performance of the domestic market remains a real positive, providing a ripe source of new contract wins. In contrast, the ongoing weak export performance is concerning, with manufacturers reporting difficulties in securing new business in several key markets including the US, China and mainland Europe. However, that did not stop companies from making job and spending cuts and trying to run down inventories of unsold products, Dobson said. Inflation may be partly behind that: This is coming from a backdrop of renewed cost inflation pressure, with manufacturers’ input prices now rising at the quickest pace since the start of 2023. This renewed upward lurch in manufacturing prices will likely add to concerns over the potential stubbornness of underlying inflationary pressures among hawkish rate setters at the Bank of England. Share\n\n6d ago 12.00 CEST View image in fullscreen Metal cables in the rig area in front of the Samson crane at the Harland and Wolff shipyard. Photograph: Liam McBurney/PA It’s a big news day for what remains of Northern Irish manufacturing: first, we had the news that Airbus will take over the historic Shorts aerospace operation from Spirit Aerosystems. And now there are renewed questions over the future of the nearby Harland & Wolff site, after its shares were suspended on the London’s junior stock market. It has been forced to temporarily suspend trading in its shares after accounting issues meant it was unable to file audited accounts on time, the Guardian’s Jack Simpson reports. It expects to publish the accounts in the week commencing 8 July, with share trading resuming at that point. The Belfast-based shipbuilder was plunged into uncertainty last month when it was reported that the UK government was witholding the approval of a £200m loan guarantee promised in December to shore up its finances. You can read the full report here: Harland & Wolff temporarily suspends trading as it delays accounts Read more Share\n\n6d ago 11.33 CEST France's Cac 40 up 1.5%; euro gains 0.5% against US dollar France’s Cac 40 index has moderated somewhat: the index is now up by 1.5%. That is still a notable move, but less than the nearly 3% surge earlier. The euro is up by 0.5% today against the US dollar at $1.0766. A hung parliament would make it more difficult for either the far-right National Rally (RN) or the leftwing New Popular Front coalition to win a majority and increase spending. Some economists fear that a spending spree could prompt investors to dump French assets. The chart below is what the pre-election move looked like in the bond markets. The yield on French bonds (which moves inversely to prices) had risen to a seven-month high before the election. #euro 10y Govt bond yields spread #France vs #Germany - chart @bpolitics https://t.co/kc4rEDiZX5 pic.twitter.com/fbACyQgZUH — ACEMAXX ANALYTICS (@acemaxx) July 1, 2024 The gap between the yield on French and German debt had also soared, although it closed after the slightly lower than expected vote share for the RN over the weekend. Via Reuters: The spread between French and German 10-year sovereign bond yields a gauge for the risk premium investors demand to hold French bonds – tightened to 73 basis points (bps), after hitting 85.2 on Friday, its highest level since July 2012. It was less than 50 bps the days before Macron called for snap elections. However, even if the spread narrowed, the yield on French 10-year debt still rose to its highest since November. The yield hit a high of 3.334% on Monday, up from 3.135 before French President Emmanuel Macron called the election on 9 June. View image in fullscreen French 10-year bond yields rose on Monday. Photograph: Refinitiv Share",
    "summary": "However, the Unite union has said that 40% of the 3,600 workforce is employed on parts that are not related to Airbus projects, including work for Bombardier and Rolls-Royce.\nView image in fullscreen Unite union general secretary Sharon Graham.\nUnite union is understood to have suspended the strike threat after high-level talks between union officials and the company.\nLabour has said it will offer significant extra state subsidy to the steel industry, above the £500m deal agreed with Tata Steel by the Conservative government.\nShare6d ago 12.00 CEST View image in fullscreen Metal cables in the rig area in front of the Samson crane at the Harland and Wolff shipyard.",
    "keywords": [
      "french",
      "talbot",
      "prices",
      "tata",
      "suspends",
      "happened",
      "unite",
      "share",
      "strike",
      "port",
      "jump",
      "unions",
      "cest",
      "ago",
      "view",
      "inflation",
      "union",
      "steel"
    ],
    "image_url": "https://i.guim.co.uk/img/media/b742af2684e86c919f2489356838eb797fb96842/0_97_2901_1741/master/2901.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=80a2b94f984be186a389e92af2592565",
    "clean_body": "ago cest northern irish politician raised concern future many worker spirit aerosystems factory belfast takeover planemaker airbus boeing announced takeover spirit aerosystems try retake control supply chain following series production issue part deal airbus take spirit operation serving including belfast make wing fuselage small jet however unite union said workforce employed part related airbus project including work bombardier rollsroyce airbus say whether plan continue work local politician concerned job loss may result historic factory trace history back short brother first company make production aircraft first minister michelle o'neill deputy first minister emma littlepengelly released statement said government working company preserve belfast operation economy minister conor murphy said `` engaging company union acquisition work key stakeholder ensure future status highly skilled workforce protected '' reuters reported leader northern ireland 's largest unionist party democratic unionist party 's dup gavin robinson said sale represented `` partial solution '' steve aiken member smaller ulster unionist party said outcome `` neither management workforce union desired '' calling northern ireland 's economy minister intervene ensure entire business retained `` minister also need emphasis airbus considerable investment northern irish uk government made wing aerostructure manufacturing belfast allowing aircraft industry asset stripped manufacturing moved elsewhere '' aiken added share ago cest german inflation drop european central bank mull rate cut german inflation dropped slightly expected yearonyear june european central bank ecb considers whether cut interest rate dropped may slightly lower forecast ecb inflation target cut borrowing cost belief inflationary pressure easing reduction inflation could support view carsten brzeski global head macro ing dutch investment bank said reading keep door open ecb rate cut added inflation `` remains sticky wrote looking ahead stickiness inflation slightly high level look set continue favourable energy base effect petering time wage increasing recent new wage demand hard see german wage growth coming second half year claus vistesen chief eurozone economist pantheon macroeconomics consultancy september cut likely said said looking ahead germany see scope decline headline inflation august helping get basis point rate cut line september rebound end year share updated cest ago cest facebook owner metas pay consent model breach eu law view image fullscreen photo taken april show logo u online social medium social networking service facebook smartphone screen frankfurt main western germany photograph kirill kudryavtsevafpgetty image mark zuckerberg 's meta breached eu 's new digital law advertising model charge user adfree version facebook instagram according european commission meta launched `` pay consent '' model last year effort comply bloc 's data privacy rule user pay monthly fee adfree version facebook instagram use personal data advertising purpose writes guardian 's dan milmo user pay part signing process platform consented data used tailor personalised advert appear social medium feed european commission eu 's executive body said model comply digital market act designed rein big tech company commission issued preliminary finding investigation `` pay consent '' monday found model `` force user consent '' data collected multiple platform also allow user choose service us le data broadly similar `` advert '' version facebook instagram commission said read full story meta breach digital rule charging user adfree social network eu claim read share ago cest unite union said tata steel enter talk `` future investment operation redundancy '' suspending strike union complained progress last six week unite suggested tata changed stance tata stuck position two blast furnace must close year however plan backed counterpart union community gmb suggested keeping one furnace open longer readying large investment greener technology direct reduced iron plant convert iron ore iron could fed electric arc furnace plan would preserve job blast furnace several year would require worker run longer term - although nowhere near employee could work autumn view image fullscreen unite union general secretary sharon graham photograph jacob kingpa sharon graham unite 's general secretary said significant development battle protect job longterm future steel making south wale investment labour secured unite key future site breakthrough would come without courage member port talbot prepared stand fight job worker simply prepared stand idly steel making ended community laid waste essential talk progress swiftly good faith focus fresh investment ensuring longterm continuation steel making south wale share ago cest tata steel written three main union representing steelworker port talbot offering talk plan cut job close blast furnace strike threat removed owner port talbot steelworks offer fresh talk last furnace face closure read union hopeful labour government would persuade tata steel delay closure least one blast furnace preserving thousand job several year unite threatened strike action july - planned closure first blast furnace union hanging labour government july shadow business secretary jonathan reynolds already talk union company effort avert closure alun davy national officer community represents affected steelworker said thousand job stake welcome unite 's decision withdraw strike action get back around table sister steel union tata confirmed strike called ready resume discussion potential memorandum understanding multiunion steel committee chaired community truth tata never walked away discussion last meeting may union agreed conclude negotiation put outcome member community welcome resuming discussion regret zero progress made since may share ago cest port talbot steelworks union suspends strike threat view image fullscreen labour politician urged tata avoid taking action reversed election result steel giant announced bringing forward plan shut blast furnace biggest plant strike photograph ben birchallpa union representing worker tata steel 's work port talbot south wale suspended strike talk company unite union understood suspended strike threat highlevel talk union official company tata plan close two blast furnace site shift towards much cleaner electric arc furnace however union want delay closure - first due week - await labour government labour said offer significant extra state subsidy steel industry PSm deal agreed tata steel conservative government full statement unite expected shortly share ago cest rush manufacturing data today uk 's purchasing manager ' index pmi sp global suggests better europe pmi reading came june still well expansionary territory contrast twoyear contraction europe reading worse initial flash estimate slightly may 's month high view image fullscreen output uk manufacturing sector picked recent month photograph sp global rob dobson director sp global market intelligence said uk manufacturing sector enjoying strongest spell growth two year june seeing output new order growth sustained robust rate similar may 's recent high performance domestic market remains real positive providing ripe source new contract win contrast ongoing weak export performance concerning manufacturer reporting difficulty securing new business several key market including u china mainland europe however stop company making job spending cut trying run inventory unsold product dobson said inflation may partly behind coming backdrop renewed cost inflation pressure manufacturer ' input price rising quickest pace since start renewed upward lurch manufacturing price likely add concern potential stubbornness underlying inflationary pressure among hawkish rate setter bank england share ago cest view image fullscreen metal cable rig area front samson crane harland wolff shipyard photograph liam mcburneypa 's big news day remains northern irish manufacturing first news airbus take historic short aerospace operation spirit aerosystems renewed question future nearby harland wolff site share suspended london 's junior stock market forced temporarily suspend trading share accounting issue meant unable file audited account time guardian 's jack simpson report expects publish account week commencing july share trading resuming point belfastbased shipbuilder plunged uncertainty last month reported uk government witholding approval PSm loan guarantee promised december shore finance read full report harland wolff temporarily suspends trading delay account read share ago cest france cac euro gain u dollar france 's cac index moderated somewhat index still notable move le nearly surge earlier euro today u dollar hung parliament would make difficult either farright national rally rn leftwing new popular front coalition win majority increase spending economist fear spending spree could prompt investor dump french asset chart preelection move looked like bond market yield french bond move inversely price risen sevenmonth high election euro govt bond yield spread france v germany chart bpolitics httpstcokcredizx pictwittercomfbacyqgzuh -- acemaxx analytics acemaxx july gap yield french german debt also soared although closed slightly lower expected vote share rn weekend via reuters spread french german year sovereign bond yield gauge risk premium investor demand hold french bond - tightened basis point bps hitting friday highest level since july le bps day macron called snap election however even spread narrowed yield french year debt still rose highest since november yield hit high monday french president emmanuel macron called election june view image fullscreen french year bond yield rose monday photograph refinitiv share",
    "sentiment": 0.06648853193590037,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.theguardian.com/business/article/2024/jul/01/roaring-kitty-keith-gill-chewy-stock": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/article/2024/jul/01/roaring-kitty-keith-gill-chewy-stock",
    "date": "2024-07-01",
    "time": "14:10:13 UTC",
    "title": "Chewy shares stage short-lived rally as filing reveals ‘Roaring Kitty’ takes stake",
    "body": "Shares of Chewy rose 15% premarket on Monday, before reversing sharply, after a filing showed Keith Gill, the stock influencer known as “Roaring Kitty”, had picked up a 6.6% stake in the pet products e-retailer.\n\nThe turbulent rally comes days after the investor, known for triggering the meme-stock rally of 2021, posted an uncaptioned picture of a puppy on the social media platform X that briefly sent Chewy shares to a near one-year high on Thursday.\n\nChewy reversed all its gains and entered the red shortly after the New York Stock Exchange opened on Monday. It finished the day down 6.6%.\n\nThe filing with the US Securities and Exchange Commission (SEC), which lists Gill as the reporting person, included a section “Check the appropriate box to designate whether you are a cat” under which the descriptor “I am not a cat” was checked.\n\nThe SEC, Chewy and Gill did not immediately respond to requests for comment.\n\nThe filing showed that Gill owns 9m shares of Chewy, equating to a stake worth about $245m at the stock’s Friday closing price of $27.24. The stake would make Gill Chewy’s third-largest shareholder, according to LSEG data.\n\nMeme stocks – boosted by memes on social media – first e​merged as a force three years ago, when amateur traders mobilized on platforms including Reddit to boost shares in GameStop.\n\nTheir bids triggered an extraordinary, but fleeting, increase in GameStop’s stock market value. It also left hedge funds that had bet against the company nursing heavy losses.\n\nGill, who led an army of retail investors backing GameStop, is known for his posts on Reddit – where he is known as “DeepFuckingValue” – and YouTube. While silent on the platforms for years after 2021’s frenzy, he has re-emerged in recent months.\n\nShares of Chewy, which sells pet food as well as medicine online, have risen 15% so far in 2024 but declined in the three preceding years as spending on pets slowed after a post-pandemic boom.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nIts sales have been stable in the past few quarters despite weaker consumer spending on discretionary items. “Pet humanization” is a key part of Chewy’s strategy, in which owners splurge on pets as they are considered a part of the family.\n\nSome analysts said last week that Gill’s interest in Chewy could also be influenced by the fact that the pet retailer was founded by GameStop CEO Ryan Cohen.",
    "summary": "Shares of Chewy rose 15% premarket on Monday, before reversing sharply, after a filing showed Keith Gill, the stock influencer known as “Roaring Kitty”, had picked up a 6.6% stake in the pet products e-retailer.\nThe turbulent rally comes days after the investor, known for triggering the meme-stock rally of 2021, posted an uncaptioned picture of a puppy on the social media platform X that briefly sent Chewy shares to a near one-year high on Thursday.\nChewy reversed all its gains and entered the red shortly after the New York Stock Exchange opened on Monday.\nThe SEC, Chewy and Gill did not immediately respond to requests for comment.\nThe filing showed that Gill owns 9m shares of Chewy, equating to a stake worth about $245m at the stock’s Friday closing price of $27.24.",
    "keywords": [
      "shortlived",
      "shares",
      "roaring",
      "privacy",
      "newsletter",
      "rally",
      "takes",
      "filing",
      "known",
      "stock",
      "pet",
      "stake",
      "stage",
      "chewy",
      "online",
      "kitty",
      "gill",
      "reveals"
    ],
    "image_url": "https://i.guim.co.uk/img/media/2bf3507b7ed36687bc0899532d8ac7d8eaaa6353/0_126_6197_3720/master/6197.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a2125e0d574a839ac04e997d8c2d6623",
    "clean_body": "share chewy rose premarket monday reversing sharply filing showed keith gill stock influencer known `` roaring kitty '' picked stake pet product eretailer turbulent rally come day investor known triggering memestock rally posted uncaptioned picture puppy social medium platform x briefly sent chewy share near oneyear high thursday chewy reversed gain entered red shortly new york stock exchange opened monday finished day filing u security exchange commission sec list gill reporting person included section `` check appropriate box designate whether cat '' descriptor `` cat '' checked sec chewy gill immediately respond request comment filing showed gill owns share chewy equating stake worth stock 's friday closing price stake would make gill chewy 's thirdlargest shareholder according lseg data meme stock - boosted meme social medium - first e merged force three year ago amateur trader mobilized platform including reddit boost share gamestop bid triggered extraordinary fleeting increase gamestop 's stock market value also left hedge fund bet company nursing heavy loss gill led army retail investor backing gamestop known post reddit - known `` deepfuckingvalue '' - youtube silent platform year 's frenzy reemerged recent month share chewy sell pet food well medicine online risen far declined three preceding year spending pet slowed postpandemic boom skip past newsletter promotion sign business today free daily newsletter get set working day - well point business news analysis need every morning enter email address sign privacy notice newsletter may contain info charity online ad content funded outside party information see newsletter may contain info charity online ad content funded outside party information see privacy policy use google recaptcha protect website google privacy policy term service apply newsletter promotion sale stable past quarter despite weaker consumer spending discretionary item `` pet humanization '' key part chewy 's strategy owner splurge pet considered part family analyst said last week gill 's interest chewy could also influenced fact pet retailer founded gamestop ceo ryan cohen",
    "sentiment": 0.06811200237670825,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.theguardian.com/business/article/2024/jul/01/french-markets-marine-le-pen-euro-dollar": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/article/2024/jul/01/french-markets-marine-le-pen-euro-dollar",
    "date": "2024-07-01",
    "time": "12:21:48 UTC",
    "title": "French market leaps amid hopes Le Pen will fall short of outright victory",
    "body": "Shares on the French stock market have risen after the first round of voting in the country’s parliamentary election eased concerns about an outright victory for the rightwing National Rally (RN) party.\n\nThe euro rose against the dollar, while the risk premium investors demand for holding French government bonds fell as the markets took the view that the result could have been worse.\n\nBut despite a 1.5% jump in France’s benchmark stock market measure – the Cac 40 – on Monday, shares have fallen 5% in the past month amid fears that Marine Le Pen’s RN could still emerge from next Sunday’s second round of voting with an overall majority.\n\nRN secured 33% of the vote, while the leftwing New Popular Front secured 28% and Emmanuel Macron’s centrist bloc won the support of 20% of those who voted.\n\nAlex Everett, an investment manager at the fund management company abrdn, said: “We are not out of the woods yet. The National Rally exceeded expectations and may yet pick up the second-round votes for a relative or even absolute majority.\n\n“Intense horse trading until Tuesday evening will likely see deals cut between the left and centre parties to try to derail this.”\n\nOn Friday, the gap between the interest rate (yield) on French and German bonds had widened to its highest since the eurozone debt crisis in 2012, but the spread narrowed slightly from 0.85 percentage points to 0.75 points after the results came in. The gap was less than 0.5 points before the snap election was called.\n\nKrishna Guha, an analyst at the US investment bank Evercore, said: “The vote is far from definitive but leans in favour of the less bad scenario of a hung parliament, political paralysis in Paris and chronic dysfunction at the EU level rather than the worse scenarios of an outright win for the far right or far left that might directly lead to a new European sovereign crisis.”\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nGuha warned that the fall in the stock market since Macron announced the election and the only partial narrowing of bond spreads underlined “that material risks remain heading into the second round vote Sunday and beyond”.",
    "summary": "Shares on the French stock market have risen after the first round of voting in the country’s parliamentary election eased concerns about an outright victory for the rightwing National Rally (RN) party.\nAlex Everett, an investment manager at the fund management company abrdn, said: “We are not out of the woods yet.\nThe National Rally exceeded expectations and may yet pick up the second-round votes for a relative or even absolute majority.\nWe use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply.\nafter newsletter promotionGuha warned that the fall in the stock market since Macron announced the election and the only partial narrowing of bond spreads underlined “that material risks remain heading into the second round vote Sunday and beyond”.",
    "keywords": [
      "french",
      "privacy",
      "newsletter",
      "parties",
      "short",
      "leaps",
      "le",
      "outright",
      "victory",
      "hopes",
      "stock",
      "points",
      "market",
      "round",
      "pen",
      "far",
      "vote",
      "fall"
    ],
    "image_url": "https://i.guim.co.uk/img/media/85d23cf4fff7f7dd43cbb58603378b08e3c6d19a/578_1141_5564_3339/master/5564.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=82224ed582cdad3ec9c4dd75454177e4",
    "clean_body": "share french stock market risen first round voting country 's parliamentary election eased concern outright victory rightwing national rally rn party euro rose dollar risk premium investor demand holding french government bond fell market took view result could worse despite jump france 's benchmark stock market measure - cac - monday share fallen past month amid fear marine le pen 's rn could still emerge next sunday 's second round voting overall majority rn secured vote leftwing new popular front secured emmanuel macron 's centrist bloc support voted alex everett investment manager fund management company abrdn said `` wood yet national rally exceeded expectation may yet pick secondround vote relative even absolute majority '' intense horse trading tuesday evening likely see deal cut left centre party try derail '' friday gap interest rate yield french german bond widened highest since eurozone debt crisis spread narrowed slightly percentage point point result came gap le point snap election called krishna guha analyst u investment bank evercore said `` vote far definitive lean favour le bad scenario hung parliament political paralysis paris chronic dysfunction eu level rather worse scenario outright win far right far left might directly lead new european sovereign crisis '' skip past newsletter promotion sign business today free daily newsletter get set working day - well point business news analysis need every morning enter email address sign privacy notice newsletter may contain info charity online ad content funded outside party information see newsletter may contain info charity online ad content funded outside party information see privacy policy use google recaptcha protect website google privacy policy term service apply newsletter promotion guha warned fall stock market since macron announced election partial narrowing bond spread underlined `` material risk remain heading second round vote sunday beyond ''",
    "sentiment": 0.03931394692264257,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.nytimes.com/2024/07/01/business/dealbook/barry-diller-paramount.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/01/business/dealbook/barry-diller-paramount.html",
    "date": "2024-07-01",
    "time": "22:31:42 UTC",
    "title": "Barry Diller Explores Bid to Take Control of Paramount",
    "body": "It’s unclear how far along the talks between IAC and National Amusements are. Others have also expressed interest in acquiring National Amusements, including the media and finance executive Edgar Bronfman Jr. and Steven Paul, the Hollywood executive best known for his work on the “Baby Geniuses” franchise.\n\nA bid to take control of Paramount would be a coda of sorts for Mr. Diller, 82, who tried to acquire Paramount Pictures in the early ’90s. He was outbid by Sumner Redstone, the bellicose media mogul whose daughter, Shari, now controls the company.\n\nMr. Diller was named head of Paramount Pictures in 1974 at the age of 32. He was credited with rejuvenating the studio, developing a cadre of talented lieutenants, like the future Disney chief executive Michael Eisner and the studio wunderkind Jeffrey Katzenberg, that became known as the Killer Dillers.\n\nAfter Mr. Redstone outbid him for the company, Mr. Diller set his sights on continuing to build his new media empire, striking a series of audacious deals to expand IAC.\n\n“They won,” Mr. Diller said in a statement after losing out to Mr. Redstone. “We lost. Next.”\n\nNational Amusements began exploring potential deals last year. As part of its talks with Skydance, Shari Redstone, the largest shareholder at National Amusements, would sell the company to Skydance, while Paramount would merge with Skydance through a separate transaction. That deal was scuttled after they could not agree on noneconomic terms after significant shareholder pushback.",
    "summary": "It’s unclear how far along the talks between IAC and National Amusements are.\nA bid to take control of Paramount would be a coda of sorts for Mr. Diller, 82, who tried to acquire Paramount Pictures in the early ’90s.\nMr. Diller was named head of Paramount Pictures in 1974 at the age of 32.\nAfter Mr. Redstone outbid him for the company, Mr. Diller set his sights on continuing to build his new media empire, striking a series of audacious deals to expand IAC.\n“They won,” Mr. Diller said in a statement after losing out to Mr. Redstone.",
    "keywords": [
      "mr",
      "talks",
      "skydance",
      "executive",
      "national",
      "paramount",
      "control",
      "explores",
      "barry",
      "amusements",
      "bid",
      "redstone",
      "diller",
      "media"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/05/multimedia/05diller-kqzh/05diller-kqzh-facebookJumbo.jpg",
    "clean_body": "'s unclear far along talk iac national amusement others also expressed interest acquiring national amusement including medium finance executive edgar bronfman jr steven paul hollywood executive best known work `` baby genius '' franchise bid take control paramount would coda sort mr diller tried acquire paramount picture early 's outbid sumner redstone bellicose medium mogul whose daughter shari control company mr diller named head paramount picture age credited rejuvenating studio developing cadre talented lieutenant like future disney chief executive michael eisner studio wunderkind jeffrey katzenberg became known killer dillers mr redstone outbid company mr diller set sight continuing build new medium empire striking series audacious deal expand iac '' '' mr diller said statement losing mr redstone `` lost next '' national amusement began exploring potential deal last year part talk skydance shari redstone largest shareholder national amusement would sell company skydance paramount would merge skydance separate transaction deal scuttled could agree noneconomic term significant shareholder pushback",
    "sentiment": 0.2646694214876033,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.nytimes.com/2024/07/01/business/save-student-loan-biden.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/01/business/save-student-loan-biden.html",
    "date": "2024-07-01",
    "time": "21:37:56 UTC",
    "title": "A Major Part of Biden’s Student Loan Repayment Plan Is Restored",
    "body": "Major components of President Biden’s student loan repayment plan can continue to operate as lawsuits challenging it wind through the legal system, a federal appellate court ruled on Sunday. That frees the administration to cut certain borrowers’ payments by as much as half, a benefit that had been previously scheduled but blocked.\n\nThe order, from the U.S. Court of Appeals for the 10th Circuit in Denver, is the latest twist in a saga that began to unfold last week after two federal judges temporarily suspended parts of the plan known as SAVE. That program, which has about eight million enrollees, ties borrowers’ monthly payment amounts to their income and household size.\n\nTwo judges, one in Kansas and another in Missouri, last Monday issued separate preliminary injunctions, which are tied to lawsuits that were filed in the spring by two groups of Republican-led states that seek to upend the SAVE program.\n\nThe Kansas order suspended parts of the program that were not yet in place, including a big decrease in monthly payments for people with undergraduate debt — to 5 percent of their discretionary income from 10 percent — which was to take effect on July 1. The judge in Missouri blocked new debt cancellation through the SAVE program, though legal experts initially said it wasn’t clear how widely that ruling should be interpreted.",
    "summary": "Major components of President Biden’s student loan repayment plan can continue to operate as lawsuits challenging it wind through the legal system, a federal appellate court ruled on Sunday.\nThat frees the administration to cut certain borrowers’ payments by as much as half, a benefit that had been previously scheduled but blocked.\nThe order, from the U.S. Court of Appeals for the 10th Circuit in Denver, is the latest twist in a saga that began to unfold last week after two federal judges temporarily suspended parts of the plan known as SAVE.\nThat program, which has about eight million enrollees, ties borrowers’ monthly payment amounts to their income and household size.\nThe judge in Missouri blocked new debt cancellation through the SAVE program, though legal experts initially said it wasn’t clear how widely that ruling should be interpreted.",
    "keywords": [
      "bidens",
      "restored",
      "parts",
      "plan",
      "repayment",
      "program",
      "monthly",
      "payments",
      "legal",
      "major",
      "loan",
      "order",
      "save",
      "student",
      "missouri",
      "suspended"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/01/multimedia/01save-saga-jqmb/01save-saga-jqmb-facebookJumbo.jpg",
    "clean_body": "major component president biden 's student loan repayment plan continue operate lawsuit challenging wind legal system federal appellate court ruled sunday free administration cut certain borrower ' payment much half benefit previously scheduled blocked order u court appeal th circuit denver latest twist saga began unfold last week two federal judge temporarily suspended part plan known save program eight million enrollee tie borrower ' monthly payment amount income household size two judge one kansa another missouri last monday issued separate preliminary injunction tied lawsuit filed spring two group republicanled state seek upend save program kansa order suspended part program yet place including big decrease monthly payment people undergraduate debt -- percent discretionary income percent -- take effect july judge missouri blocked new debt cancellation save program though legal expert initially said n't clear widely ruling interpreted",
    "sentiment": 0.09865440115440115,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.nytimes.com/2024/07/01/business/media/hunter-biden-fox-lawsuit.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/01/business/media/hunter-biden-fox-lawsuit.html",
    "date": "2024-07-01",
    "time": "19:52:45 UTC",
    "title": "Hunter Biden Sues Fox News Over a Series That Included His Nude Photos",
    "body": "President Biden’s son Hunter Biden sued Fox News on Sunday, arguing that a mini-series produced by the company broke the law by sharing explicit photos and videos of him without his permission.\n\nThe program, “The Trial of Hunter Biden,” which first appeared in 2022 on Fox Nation, the network’s streaming service, presented a dramatized version of a criminal trial of Mr. Biden, with fictional charges. The mini-series integrated real-life images of Mr. Biden in the nude and engaged in sex acts, imagery that was discovered on a laptop that Mr. Biden abandoned at a computer repair shop in Delaware.\n\nThe lawsuit, filed in New York Supreme Court in Manhattan, accuses Fox of violating a so-called revenge porn law in New York State that was passed in 2019. The law allows people to sue anyone who shares their sexually explicit photos and videos without permission.\n\n“Fox published and disseminated these intimate images to its vast audience of millions as part of an entertainment program in order to humiliate, harass, annoy and alarm Mr. Biden and to tarnish his reputation,” the lawsuit states.",
    "summary": "President Biden’s son Hunter Biden sued Fox News on Sunday, arguing that a mini-series produced by the company broke the law by sharing explicit photos and videos of him without his permission.\nThe program, “The Trial of Hunter Biden,” which first appeared in 2022 on Fox Nation, the network’s streaming service, presented a dramatized version of a criminal trial of Mr. Biden, with fictional charges.\nThe mini-series integrated real-life images of Mr. Biden in the nude and engaged in sex acts, imagery that was discovered on a laptop that Mr. Biden abandoned at a computer repair shop in Delaware.\nThe law allows people to sue anyone who shares their sexually explicit photos and videos without permission.\n“Fox published and disseminated these intimate images to its vast audience of millions as part of an entertainment program in order to humiliate, harass, annoy and alarm Mr. Biden and to tarnish his reputation,” the lawsuit states.",
    "keywords": [
      "biden",
      "mr",
      "law",
      "york",
      "sues",
      "videos",
      "fox",
      "program",
      "photos",
      "nude",
      "series",
      "miniseries",
      "hunter",
      "included",
      "trial"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/01/multimedia/01hunter-fox-kmcp/01hunter-fox-kmcp-facebookJumbo.jpg",
    "clean_body": "president biden 's son hunter biden sued fox news sunday arguing miniseries produced company broke law sharing explicit photo video without permission program `` trial hunter biden '' first appeared fox nation network 's streaming service presented dramatized version criminal trial mr biden fictional charge miniseries integrated reallife image mr biden nude engaged sex act imagery discovered laptop mr biden abandoned computer repair shop delaware lawsuit filed new york supreme court manhattan accuses fox violating socalled revenge porn law new york state passed law allows people sue anyone share sexually explicit photo video without permission '' fox published disseminated intimate image vast audience million part entertainment program order humiliate harass annoy alarm mr biden tarnish reputation '' lawsuit state",
    "sentiment": 0.1028409090909091,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.nytimes.com/2024/07/01/us/politics/trump-organization-saudi-arabia-tower.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/trump-organization-saudi-arabia-tower.html",
    "date": "2024-07-01",
    "time": "17:45:15 UTC",
    "title": "Trump Organization Signs Up to Put Its Brand on a New Saudi Tower",
    "body": "The Trump Organization has signed a new deal with a Saudi real estate company to build a residential high-rise tower in the city of Jeddah, extending the family’s close ties with the kingdom.\n\nSaudi Arabia has become one of the few reliable sources of growth for the Trump family’s business operations, as new real estate deals in the United States have slowed or stopped since the Jan. 6, 2021, assault on the Capitol and since former President Donald J. Trump left the White House.\n\nThis new deal is like other international projects the Trump family has signed over the past decade. It offers the family’s name and brand to a well-financed developer that will build the project and sell luxury resident units, it hopes at a premium, based on the marketability of the former president’s perceived star power. Other projects include a resort complex in Oman and Saudi-backed golf tournaments at Trump courses in recent years.\n\n“We are delighted to strengthen our ongoing relationship with the Trump Organization and expand our portfolio by delivering premium properties to redefine Saudi Arabia’s high-growth real estate market,” Ziad El Chaar, the chief executive of the real estate firm, Dar Global, said in a statement Monday.",
    "summary": "The Trump Organization has signed a new deal with a Saudi real estate company to build a residential high-rise tower in the city of Jeddah, extending the family’s close ties with the kingdom.\nSaudi Arabia has become one of the few reliable sources of growth for the Trump family’s business operations, as new real estate deals in the United States have slowed or stopped since the Jan. 6, 2021, assault on the Capitol and since former President Donald J. Trump left the White House.\nThis new deal is like other international projects the Trump family has signed over the past decade.\nOther projects include a resort complex in Oman and Saudi-backed golf tournaments at Trump courses in recent years.\n“We are delighted to strengthen our ongoing relationship with the Trump Organization and expand our portfolio by delivering premium properties to redefine Saudi Arabia’s high-growth real estate market,” Ziad El Chaar, the chief executive of the real estate firm, Dar Global, said in a statement Monday.",
    "keywords": [
      "estate",
      "tower",
      "saudi",
      "organization",
      "signed",
      "premium",
      "real",
      "familys",
      "signs",
      "projects",
      "trump",
      "brand",
      "deal"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/01/multimedia/01dc-Trump-Saudi-qlbf/01dc-Trump-Saudi-qlbf-facebookJumbo.jpg",
    "clean_body": "trump organization signed new deal saudi real estate company build residential highrise tower city jeddah extending family 's close tie kingdom saudi arabia become one reliable source growth trump family 's business operation new real estate deal united state slowed stopped since jan assault capitol since former president donald j trump left white house new deal like international project trump family signed past decade offer family 's name brand wellfinanced developer build project sell luxury resident unit hope premium based marketability former president 's perceived star power project include resort complex oman saudibacked golf tournament trump course recent year '' delighted strengthen ongoing relationship trump organization expand portfolio delivering premium property redefine saudi arabia 's highgrowth real estate market '' ziad el chaar chief executive real estate firm dar global said statement monday",
    "sentiment": 0.03677685950413223,
    "sentiment_category": "positive",
    "t": 314
  },
  "https://www.bbc.com/news/articles/clkkllxm4jzo": {
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/clkkllxm4jzo",
    "date": "2024-07-01",
    "time": "23:02:51 UTC",
    "title": "The fastest data in the world",
    "body": "The fastest data in the world\n\n5 days ago By Chris Baraniuk , Technology Reporter Share\n\nsurf Mission accomplished for Edwin Verheul (left) and Joachim Opdenakker\n\nIn February, deep inside a warehouse at Cern, the Swiss home of the Large Hadron Collider (LHC) – the world’s biggest science experiment – two network engineers held their breath. And pressed a button. Suddenly, text on a black background flashed up on a screen in front of them. It had worked. “There was high-fiving involved,” recalls Joachim Opdenakker at SURF, a Dutch IT association that works for educational and research institutions. “It was super-cool to see.” He and his colleague Edwin Verheul had just set up a new data link between the LHC in Switzerland and data storage sites in The Netherlands. A data link that could reach speeds of 800 gigabits per second (Gbps) – or more than 11,000 times the average UK home broadband speed. The idea is to improve scientists’ access to the results of LHC experiments. A subsequent test in March using special equipment on loan from Nokia proved the desired speeds were achievable. “This transponder that Nokia uses, it’s like a celebrity,” says Mr Verheul, explaining how the kit is booked up for use at various locations in advance. “We had limited time to do tests. If you have to postpone a week, then the transponder is gone.” This amount of bandwidth, approaching one terabit per second, is extremely fast but some subsea cables are a few hundred times faster still – they use multiple fibre strands to achieve such speeds.\n\nNokia & Surf After its upgrade the Large Hadron Collider will produce five times as much data\n\nIn labs around the world, networking experts are coming up with fibre optic systems capable of pushing data around even more rapidly than this. They are reaching extraordinary speeds of many petabits per second (Pbps), or 300 million times the average UK home broadband connection. This is so fast that one can barely imagine how people will use such bandwidth in the future. But engineers are wasting no time in proving that it is possible. And they only want to go faster. The duplex cable (with cores that either send or receive) from Cern to data centres in The Netherlands is just shy of 1,650km (I,025 miles) long, snaking from Geneva to Paris, then Brussels, and finally Amsterdam. Part of the challenge in reaching 800 Gbps was in beaming pulses of light such a long way. “Due to the distance, the power levels of that light decrease, so you have to amplify it at different locations,” explains Mr Opdenakker. Every time one tiny subatomic particle smashes into another during experiments at the LHC, the impact generates staggering volumes of data – about one petabyte per second. That’s enough to fill 220,000 DVDs. This is slimmed down for storage and study, but still requires hefty amounts of bandwidth. Plus, with an upgrade due by 2029, the LHC expects to produce even more scientific data than it does today. “The upgrade increases the number of collisions by at least a factor of five,” says James Watt, senior vice president and general manager of optical networks at Nokia.\n\nA time when 800 Gbps seems slow may not be far away, however. In November, a team of researchers in Japan broke the world speed record for data transmission when they reached an astonishing 22.9 Pbps. That’s enough bandwidth to supply every single person on the planet, and then a couple billion more, with a Netflix stream, says Chigo Okonkwo at Eindhoven University of Technology, who was involved in the work. In this case, a meaningless but huge stream of pseudorandom data was beamed over 13km of coiled fibre optic cable in a lab setting. Dr Okonkwo explains that the integrity of the data is analysed post-transfer to confirm it was sent as quickly as reported without accumulating too many errors. He also adds that the system he and colleagues used relied on multiple cores – a total of 19 cores inside one fibre cable. This is a new type of cable unlike the standard ones that connect many people’s home to the internet.\n\nBut older fibre is expensive to dig up and replace. Extending its lifetime is useful, argues Wladek Forysiak at Aston University in the UK. He and colleagues have recently achieved speeds of around 402 terabits per second (Tbps) along a 50km-long optical fibre with just one core. That’s about 5.7 million times faster than the average UK home broadband connection. “I think it’s a world best, we don’t know of any results that are better than that,” says Prof Forysiak. Their technique relies on using more wavelengths of light than usual when flashing data down an optical line. For this they use alternative forms of the electronic equipment that sends and receives signals over fibre optic cables but such a setup could be easier to install than replacing thousands of kilometres of the cable itself. Activities in the so-called metaverse might one day require extreme bandwidth, suggests Martin Creaner, director general of the World Broadband Association. His organisation expects home broadband connections to reach up to 50 Gbps by 2030. But reliability may be even more important than speed for some applications. “For remote robotic surgery across 3,000 miles… you absolutely do not want any scenario where the network goes down,” says Mr Creaner. Dr Okonkwo adds that training AI will increasingly require moving huge datasets around. The faster this can be done, the better, he argues. And Ian Phillips, who works alongside Prof Forysiak, says bandwidth tends to find applications once it is available: “Humanity finds a way of consuming it.”\n\nTeleGeography Demand for bandwidth is growing surprisingly fast says Lane Burdette",
    "summary": "“It was super-cool to see.” He and his colleague Edwin Verheul had just set up a new data link between the LHC in Switzerland and data storage sites in The Netherlands.\nA data link that could reach speeds of 800 gigabits per second (Gbps) – or more than 11,000 times the average UK home broadband speed.\nIn November, a team of researchers in Japan broke the world speed record for data transmission when they reached an astonishing 22.9 Pbps.\nHe also adds that the system he and colleagues used relied on multiple cores – a total of 19 cores inside one fibre cable.\nActivities in the so-called metaverse might one day require extreme bandwidth, suggests Martin Creaner, director general of the World Broadband Association.",
    "keywords": [
      "second",
      "uk",
      "fastest",
      "lhc",
      "bandwidth",
      "data",
      "fibre",
      "broadband",
      "cable",
      "times",
      "world"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/ba57/live/c11a1ac0-233f-11ef-94ce-2524c2e905df.png",
    "clean_body": "fastest data world day ago chris baraniuk technology reporter share surf mission accomplished edwin verheul left joachim opdenakker february deep inside warehouse cern swiss home large hadron collider lhc - world 's biggest science experiment - two network engineer held breath pressed button suddenly text black background flashed screen front worked `` highfiving involved '' recall joachim opdenakker surf dutch association work educational research institution `` supercool see '' colleague edwin verheul set new data link lhc switzerland data storage site netherlands data link could reach speed gigabit per second gbps - time average uk home broadband speed idea improve scientist ' access result lhc experiment subsequent test march using special equipment loan nokia proved desired speed achievable `` transponder nokia us 's like celebrity '' say mr verheul explaining kit booked use various location advance `` limited time test postpone week transponder gone '' amount bandwidth approaching one terabit per second extremely fast subsea cable hundred time faster still - use multiple fibre strand achieve speed nokia surf upgrade large hadron collider produce five time much data lab around world networking expert coming fibre optic system capable pushing data around even rapidly reaching extraordinary speed many petabit per second pbps million time average uk home broadband connection fast one barely imagine people use bandwidth future engineer wasting time proving possible want go faster duplex cable core either send receive cern data centre netherlands shy km mile long snaking geneva paris brussels finally amsterdam part challenge reaching gbps beaming pulse light long way `` due distance power level light decrease amplify different location '' explains mr opdenakker every time one tiny subatomic particle smash another experiment lhc impact generates staggering volume data - one petabyte per second 's enough fill dvd slimmed storage study still requires hefty amount bandwidth plus upgrade due lhc expects produce even scientific data today `` upgrade increase number collision least factor five '' say james watt senior vice president general manager optical network nokia time gbps seems slow may far away however november team researcher japan broke world speed record data transmission reached astonishing pbps 's enough bandwidth supply every single person planet couple billion netflix stream say chigo okonkwo eindhoven university technology involved work case meaningless huge stream pseudorandom data beamed km coiled fibre optic cable lab setting dr okonkwo explains integrity data analysed posttransfer confirm sent quickly reported without accumulating many error also add system colleague used relied multiple core - total core inside one fibre cable new type cable unlike standard one connect many people 's home internet older fibre expensive dig replace extending lifetime useful argues wladek forysiak aston university uk colleague recently achieved speed around terabit per second tbps along kmlong optical fibre one core 's million time faster average uk home broadband connection `` think 's world best n't know result better '' say prof forysiak technique relies using wavelength light usual flashing data optical line use alternative form electronic equipment sends receives signal fibre optic cable setup could easier install replacing thousand kilometre cable activity socalled metaverse might one day require extreme bandwidth suggests martin creaner director general world broadband association organisation expects home broadband connection reach gbps reliability may even important speed application `` remote robotic surgery across mile ... absolutely want scenario network go '' say mr creaner dr okonkwo add training ai increasingly require moving huge datasets around faster done better argues ian phillips work alongside prof forysiak say bandwidth tends find application available `` humanity find way consuming '' telegeography demand bandwidth growing surprisingly fast say lane burdette",
    "sentiment": 0.09935417843026538,
    "sentiment_category": "positive",
    "t": 314
  }
}