{
  "https://www.bbc.com/news/articles/c5y5l7116g1o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c5y5l7116g1o",
    "date": "2024-11-12",
    "time": "00:00:00",
    "title": "Archbishop of Canterbury: Why did Justin Welby resign after abuse scandal?",
    "body": "The abuse scandal that led to the archbishop's resignation\n\n12 November 2024 Share Save Amy Walker BBC News Share Save\n\nGetty Images\n\nJustin Welby has resigned as Archbishop of Canterbury after facing increasing pressure to stand down over his failure to report prolific child abuser John Smyth. Here are the events that led up to Mr Welby's resignation after 11 years in the post.\n\nWhy has Welby resigned?\n\nA damning independent review published last week found Mr Welby - the most senior bishop within the Church of England - and other church officers should have formally reported Smyth in 2013 to police in the UK and authorities in South Africa. Smyth was accused of attacking dozens of boys, including those he met at Christian camps, in the UK in the 1970s and 1980s. The barrister and senior member of a Christian charity then moved to Zimbabwe and later South Africa, where he abused up to 100 boys aged 13 to 17, the Makin review added. By 2013, the Church of England \"knew, at the highest level\" about Smyth's abuse, including Mr Welby who took up the Church's top job that year. If he and other Church officers had reported this to police in the UK and authorities in South Africa at that time, “John Smyth could have [been] brought to justice at a much earlier point”, the independent report said. Mr Welby had previously resisted calls to step aside over his response to the case since 2013. But amid mounting pressure, he said in a statement on Tuesday he must take \"personal and institutional responsibility\". The prime minister's spokeswoman said Keir Starmer \"respects the decision\" to step down and his thoughts \"first and foremost, remain with all the victims”.\n\nWhen did the abuse allegations first surface?\n\nSmyth was under police investigation when he died\n\nSmyth's abuse was first reported to the charity Iwerne Trust, where he had been chairman, in the early 1980s. A report detailing his \"horrific\" beatings of teenaged boys was presented to some Church leaders in 1982. But the recipients of that report \"participated in an active cover-up\" to prevent its findings, including that crimes had been committed, coming to light, the Makin review said. Smyth's abuse in the UK re-emerged in 2012, when a church officer in Cambridgeshire received a letter “out of the blue” from a fellow survivor. The review stated that five police forces were told of the abuse between 2013 and 2016. Church leaders however did not lodge a formal report. It was not until 2017, after a Channel 4 documentary revealed details about Smyth's abuse to the public, that police launched a full investigation. Smyth is believed to have continued his abuse in South Africa until his death in 2018.\n\nHow much did Welby know about Smyth?\n\nMr Welby worked at summer camps in Dorset where Smyth met some of his victims, but the archbishop said he was unaware of the nature of the allegations until 2013. A member of the clergy warned Mr Welby about Smyth in the 1980s, but the archbishop told the review this had been \"vague\" and \"there was no indication given of the abuses which later came to light\". After the Channel 4 documentary was broadcast in 2017, Mr Welby apologised \"unreservedly\" to Smyth's victims but did not resign. Following the Makin review this month, the archbishop said he had considered resigning over its findings and repeated his apology. Mr Welby acknowledged that the review made clear he had \"personally failed to ensure it was energetically investigated\". But on Tuesday, following a petition set up by members of the Church's parliament - the General Synod - and mounting pressure to go, Mr Welby resigned.\n\nWhat did his critics say?\n\nDIOCESE OF NEWCASTLE Bishop Hartley said it was \"hard to find the words\" to respond to last week's report\n\nCritics included Bishop of Newcastle Helen-Ann Hartley, who said Mr Welby's resignation would \"be a very clear indication that a line has been drawn, and that we must move towards independence of safeguarding\". Andrew Morse, a survivor of Smyth's abuse, also called for Mr Welby to go, saying that he felt the archbishop's admission that he had not done enough in response to the reports meant that both he and the Church of England had effectively been involved in a \"cover-up\". The petition calling for his resignation, which accused the archbishop of \"allowing abuse to continue\" and said his position was \"no longer tenable\", was signed by more than 14,000 people. The prime minister had also publicly said victims of Smyth had been \"failed very, very badly,\" but would not comment when asked whether the archbishop should quit.\n\nHow will the new Archbishop of Canterbury be chosen?",
    "clean_body": "the abuse scandal that led to the archbishops resignation 12 november 2024 share save amy walker bbc news share save getty images justin welby has resigned as archbishop of canterbury after facing increasing pressure to stand down over his failure to report prolific child abuser john smyth here are the events that led up to mr welbys resignation after 11 years in the post why has welby resigned a damning independent review published last week found mr welby the most senior bishop within the church of england and other church officers should have formally reported smyth in 2013 to police in the uk and authorities in south africa smyth was accused of attacking dozens of boys including those he met at christian camps in the uk in the 1970s and 1980s the barrister and senior member of a christian charity then moved to zimbabwe and later south africa where he abused up to 100 boys aged 13 to 17 the makin review added by 2013 the church of england knew at the highest level about smyths abuse including mr welby who took up the churchs top job that year if he and other church officers had reported this to police in the uk and authorities in south africa at that time “john smyth could have been brought to justice at a much earlier point” the independent report said mr welby had previously resisted calls to step aside over his response to the case since 2013 but amid mounting pressure he said in a statement on tuesday he must take personal and institutional responsibility the prime ministers spokeswoman said keir starmer respects the decision to step down and his thoughts first and foremost remain with all the victims” when did the abuse allegations first surface smyth was under police investigation when he died smyths abuse was first reported to the charity iwerne trust where he had been chairman in the early 1980s a report detailing his horrific beatings of teenaged boys was presented to some church leaders in 1982 but the recipients of that report participated in an active coverup to prevent its findings including that crimes had been committed coming to light the makin review said smyths abuse in the uk reemerged in 2012 when a church officer in cambridgeshire received a letter “out of the blue” from a fellow survivor the review stated that five police forces were told of the abuse between 2013 and 2016 church leaders however did not lodge a formal report it was not until 2017 after a channel 4 documentary revealed details about smyths abuse to the public that police launched a full investigation smyth is believed to have continued his abuse in south africa until his death in 2018 how much did welby know about smyth mr welby worked at summer camps in dorset where smyth met some of his victims but the archbishop said he was unaware of the nature of the allegations until 2013 a member of the clergy warned mr welby about smyth in the 1980s but the archbishop told the review this had been vague and there was no indication given of the abuses which later came to light after the channel 4 documentary was broadcast in 2017 mr welby apologised unreservedly to smyths victims but did not resign following the makin review this month the archbishop said he had considered resigning over its findings and repeated his apology mr welby acknowledged that the review made clear he had personally failed to ensure it was energetically investigated but on tuesday following a petition set up by members of the churchs parliament the general synod and mounting pressure to go mr welby resigned what did his critics say diocese of newcastle bishop hartley said it was hard to find the words to respond to last weeks report critics included bishop of newcastle helenann hartley who said mr welbys resignation would be a very clear indication that a line has been drawn and that we must move towards independence of safeguarding andrew morse a survivor of smyths abuse also called for mr welby to go saying that he felt the archbishops admission that he had not done enough in response to the reports meant that both he and the church of england had effectively been involved in a coverup the petition calling for his resignation which accused the archbishop of allowing abuse to continue and said his position was no longer tenable was signed by more than 14000 people the prime minister had also publicly said victims of smyth had been failed very very badly but would not comment when asked whether the archbishop should quit how will the new archbishop of canterbury be chosen",
    "summary": "By 2013, the Church of England \"knew, at the highest level\" about Smyth's abuse, including Mr Welby who took up the Church's top job that year.\nMr Welby had previously resisted calls to step aside over his response to the case since 2013.\nIt was not until 2017, after a Channel 4 documentary revealed details about Smyth's abuse to the public, that police launched a full investigation.\nAfter the Channel 4 documentary was broadcast in 2017, Mr Welby apologised \"unreservedly\" to Smyth's victims but did not resign.\nBut on Tuesday, following a petition set up by members of the Church's parliament - the General Synod - and mounting pressure to go, Mr Welby resigned.",
    "keywords": [
      "smyth",
      "resign",
      "justin",
      "smyths",
      "welby",
      "review",
      "uk",
      "church",
      "scandal",
      "mr",
      "abuse",
      "archbishop",
      "report",
      "canterbury"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/8103/live/881c70e0-a122-11ef-b580-8d99e8d7f9ec.jpg"
  },
  "https://www.bbc.com/news/articles/c14l6mv6107o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c14l6mv6107o",
    "date": "2024-11-27",
    "time": "00:00:00",
    "title": "Mohamed Al Fayed's daughter cleared of robbing brother",
    "body": "Al Fayed's daughter cleared of robbing brother\n\n27 November 2024 Share Save Daniel Sexton • @DanSextonBBC BBC News, South East Share Save\n\nGetty Images Camilla Fayed previously pleaded not guilty to robbing Omar Fayed of his £1,900 iPhone\n\nMohamed Al Fayed's daughter has been cleared of robbing her brother of his phone after the prosecution offered no evidence. Camilla Fayed, 39, previously pleaded not guilty to robbing Omar Fayed of his £1,900 iPhone in the gym of the family's Grade I listed estate, Barrow Green Court, near Oxted in Surrey, on 18 May, 2020. She was accused of a single count of robbery alongside her husband Mohamad Esreb, 44, Matthew Littlewood, 35, and Andrew Bott, 52, in relation to the same alleged incident. Mr Esreb and Mr Bott pleaded not guilty to the charge at a hearing in May, and Mr Littlewood denied the count at the beginning of a hearing at Guildford Crown Court on Wednesday.\n\nA trial was due to start in February next year but the prosecution offered no evidence in respect of all the defendants at a hearing at Guildford Crown Court on Wednesday. Prosecutor Eloise Marshall KC told the court: \"I advised the CPS (Crown Prosecution Service) on quite a number of issues and ultimately the decision was made due to a combination of factors.\" She added there were difficulties around \"material provided directly from the complainant himself\". Judge Patricia Lees said: \"In those circumstances then the court will enter not guilty verdicts in respect of each defendant. \"As far as they are concerned they are discharged from the court.\" Ms Fayed, of Park Lane, central London, did not attend the hearing on Wednesday but Mr Esreb, also of Park Lane, Mr Littlewood, of Haydock Road, Colburn, North Yorkshire, and Mr Bott, of Coppice Wood, County Durham, appeared via a video link. Former Harrods owner Mohamed Al Fayed died last year at the age of 94. After his death, allegations emerged accusing the late businessman of sexually abusing women, many of which had been employees at Harrods.\n\nAdditional reporting by PA Media.\n\nFollow BBC Surrey on Facebook, and on X. Send your story ideas to southeasttoday@bbc.co.uk or WhatsApp us on 08081 002250.",
    "clean_body": "al fayeds daughter cleared of robbing brother 27 november 2024 share save daniel sexton • dansextonbbc bbc news south east share save getty images camilla fayed previously pleaded not guilty to robbing omar fayed of his £1900 iphone mohamed al fayeds daughter has been cleared of robbing her brother of his phone after the prosecution offered no evidence camilla fayed 39 previously pleaded not guilty to robbing omar fayed of his £1900 iphone in the gym of the familys grade i listed estate barrow green court near oxted in surrey on 18 may 2020 she was accused of a single count of robbery alongside her husband mohamad esreb 44 matthew littlewood 35 and andrew bott 52 in relation to the same alleged incident mr esreb and mr bott pleaded not guilty to the charge at a hearing in may and mr littlewood denied the count at the beginning of a hearing at guildford crown court on wednesday a trial was due to start in february next year but the prosecution offered no evidence in respect of all the defendants at a hearing at guildford crown court on wednesday prosecutor eloise marshall kc told the court i advised the cps crown prosecution service on quite a number of issues and ultimately the decision was made due to a combination of factors she added there were difficulties around material provided directly from the complainant himself judge patricia lees said in those circumstances then the court will enter not guilty verdicts in respect of each defendant as far as they are concerned they are discharged from the court ms fayed of park lane central london did not attend the hearing on wednesday but mr esreb also of park lane mr littlewood of haydock road colburn north yorkshire and mr bott of coppice wood county durham appeared via a video link former harrods owner mohamed al fayed died last year at the age of 94 after his death allegations emerged accusing the late businessman of sexually abusing women many of which had been employees at harrods additional reporting by pa media follow bbc surrey on facebook and on x send your story ideas to southeasttodaybbccouk or whatsapp us on 08081 002250",
    "summary": "Al Fayed's daughter cleared of robbing brother27 November 2024 Share Save Daniel Sexton • @DanSextonBBC BBC News, South East Share SaveGetty Images Camilla Fayed previously pleaded not guilty to robbing Omar Fayed of his £1,900 iPhoneMohamed Al Fayed's daughter has been cleared of robbing her brother of his phone after the prosecution offered no evidence.\nCamilla Fayed, 39, previously pleaded not guilty to robbing Omar Fayed of his £1,900 iPhone in the gym of the family's Grade I listed estate, Barrow Green Court, near Oxted in Surrey, on 18 May, 2020.\nMr Esreb and Mr Bott pleaded not guilty to the charge at a hearing in May, and Mr Littlewood denied the count at the beginning of a hearing at Guildford Crown Court on Wednesday.\nJudge Patricia Lees said: \"In those circumstances then the court will enter not guilty verdicts in respect of each defendant.\nFormer Harrods owner Mohamed Al Fayed died last year at the age of 94.",
    "keywords": [
      "cleared",
      "prosecution",
      "pleaded",
      "court",
      "guilty",
      "esreb",
      "al",
      "daughter",
      "robbing",
      "mr",
      "fayed",
      "littlewood",
      "hearing",
      "brother",
      "mohamed",
      "fayeds"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/1267/live/429107f0-acaf-11ef-b4c3-8930c1af4dca.jpg"
  },
  "https://www.bbc.com/news/articles/c1dp6wgk72ro": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c1dp6wgk72ro",
    "date": "2024-11-18",
    "time": "00:00:00",
    "title": "UK wants 'strong' relationship with China, says Keir Starmer",
    "body": "We want 'strong' UK-China relationship, says Starmer\n\n18 November 2024 Share Save Sam Francis & Jennifer McKiernan Political reporter Share Save\n\nReuters\n\nSir Keir Starmer has met President Xi Jinping at the G20 summit, and emphasised the importance of a \"strong UK-China relationship\" for both countries. The meeting was the first time a UK prime minister has met the Chinese president in person since 2018, following a recent souring in relations. Sir Keir raised the case of the jailed Hong Kong pro-democracy activist, Jimmy Lai, saying he was concerned about reports of a \"deterioration\" in his health. The PM also signalled a desire for greater business co-operation, particularly on \"areas of mutual cooperation\" such as international stability, climate change and economic growth.\n\nSir Keir met President Xi on the fringes of the G20 summit in Rio de Janeiro, Brazil and, speaking at the start of the meeting, said: \"We want our relations to be consistent, durable, respectful, as we have agreed, avoid surprises where possible.\" He added: \"The UK will be a predictable, consistent, sovereign actor committed to the rule of law.\" Speaking through a translator, Xi told Sir Keir that the two countries should commit to mutual respect and openness, saying: \"China and the UK have broad space for co-operation across various domains, including trade, investment, clean energy, financial services, healthcare and improving our peoples' well-being.\" A read-out of the closed door meeting said the PM set out the leaders' shared responsibility to work together in pursuit of global stability, economic co-operation and trade, and efforts to move away from fossil fuels to renewables. Climate change was a focus for the PM, and a Downing Street spokesperson said the PM wants China's support on global efforts, particularly in light of President-elect Trump's expected roll back of green policies. However, Sir Keir also stressed his government's approach would \"always be rooted in the national interests of the UK, but that we would be a predictable and pragmatic partner\" to China. With China's military support for Russia's war in Ukraine having prompted criticism from the UK and other Western countries, the PM also said he wanted to \"engage honestly and frankly\" on areas of disagreement, including on Hong Kong, human rights and Russia’s war in Ukraine. Their first meeting follows an initial phone conversation in August after Labour's election victory and Sir Keir has now proposed a full bilateral meeting in Beijing or London. The pair also agreed Chancellor Rachel Reeves should visit Beijing next year to discuss economic and financial cooperation with her counterpart, Vice Premier He Lifeng. The Conservative's shadow foreign secretary Priti Patel said: “Britain's standing on the world stage risks being weakened if the prime minister does not robustly defend our national interest.\" She said constructive dialogue was important but that Sir Keir \"should have been stronger in raising our concerns over human rights, the repressive nature of the national security laws imposed on Hong Kong, and the security, safety and wellbeing of British nationals, like Jimmy Lai, who should be freed from custody\". \"Starmer must set out, as part of his supposed reset, what assurances he received from President Xi on the UK’s areas of concern.”\n\nBefore the meeting in Brazil, the prime minister said it was important to engage with economies like China - and Foreign Secretary David Lammy held talks with his Chinese counterpart Wang Yi, as well as Vice Premier Ding Xuexiang, in Beijing last month. The last British prime minister to meet President Xi was Theresa May, who hailed a \"golden era\" for UK-China relations during her 2018 visit to the country. But since then there have been tensions over issues including China's treatment of the Uyghur minority group in Xinjiang and pro-democracy activists in Hong Kong. Last year, then-Conservative Prime Minister Rishi Sunak said China was \"the biggest state-based threat to our economic security\". But like the current government, he also said it was necessary to engage with China on issues like climate change and the global economy. Dr Yu Jie, a China expert from the Chatham House international think tank, said the G20 meeting was \"critical\" for UK-China relations to thaw after a six-year freeze - and suggested there could be a trade deal in sight, despite significant diplomatic tensions. \"Judging from the readout given by both sides, the tone of the conversation seemed to be positive,\" said Dr Yu. \"But when they came to specifics it seems on the thorny issues they have not really reached any agreement at all.\" Dr Yu warned both sides' efforts could still be overshadowed by pressure from the US. \"That's something quite difficult for the British government, if the US is going to be adding extra pressure for the UK to be in line with the US on China policy,\" she said, describing how she expected the US policy towards China to be \"hawkish\" under Trump.\n\nReuters Jimmy Lai - a pro-democracy activist and British citizen - was arrested in 2020 and his release from a Hong Kong prison is a \"priority\", the UK government says\n\nSpeaking to reporters on his way to the summit in Rio de Janeiro, Sir Keir also said \"shoring up support for Ukraine\" was top of his agenda. Before the meeting, Downing Street said the prime minister will urge other G20 nations to step up their support for Ukraine or face \"unfathomable consequences\" if Russia is allowed to be victorious. The summit follows large-scale missile and drone attacks by Russia across Ukraine over the weekend, and will take place as the conflict approaches its 1,000th day. And it comes amid reports that the US has authorised the use of long-range missiles it supplies to Ukraine to strike Russia. The weapons have so far only been used by Kyiv on Russian-occupied targets within its own territory. The UK has also supplied Ukraine with its Storm Shadow missiles and defence officials and ministers have been making the case for Kyiv to be permitted to use them to hit targets inside Russia. But they were not willing to act alone - and had been waiting for the White House to change its mind. Sir Keir said he was \"not going to get into operational details\" with regards to missiles in Ukraine.\n\nSir Keir is holding talks with other G20 leaders, representing 19 of the world’s largest economies and the African Union and the European Union. The summit is overshadowed by the absence of President-elect Donald Trump. Trump has called for allies to take a more aggressive approach towards China and may trigger a global trade war if he imposes a promised 60% tariff on Chinese goods entering the US. This summit will provide world leaders a first chance to compare notes and prepare for Trump's upcoming return to the White House.",
    "clean_body": "we want strong ukchina relationship says starmer 18 november 2024 share save sam francis jennifer mckiernan political reporter share save reuters sir keir starmer has met president xi jinping at the g20 summit and emphasised the importance of a strong ukchina relationship for both countries the meeting was the first time a uk prime minister has met the chinese president in person since 2018 following a recent souring in relations sir keir raised the case of the jailed hong kong prodemocracy activist jimmy lai saying he was concerned about reports of a deterioration in his health the pm also signalled a desire for greater business cooperation particularly on areas of mutual cooperation such as international stability climate change and economic growth sir keir met president xi on the fringes of the g20 summit in rio de janeiro brazil and speaking at the start of the meeting said we want our relations to be consistent durable respectful as we have agreed avoid surprises where possible he added the uk will be a predictable consistent sovereign actor committed to the rule of law speaking through a translator xi told sir keir that the two countries should commit to mutual respect and openness saying china and the uk have broad space for cooperation across various domains including trade investment clean energy financial services healthcare and improving our peoples wellbeing a readout of the closed door meeting said the pm set out the leaders shared responsibility to work together in pursuit of global stability economic cooperation and trade and efforts to move away from fossil fuels to renewables climate change was a focus for the pm and a downing street spokesperson said the pm wants chinas support on global efforts particularly in light of presidentelect trumps expected roll back of green policies however sir keir also stressed his governments approach would always be rooted in the national interests of the uk but that we would be a predictable and pragmatic partner to china with chinas military support for russias war in ukraine having prompted criticism from the uk and other western countries the pm also said he wanted to engage honestly and frankly on areas of disagreement including on hong kong human rights and russia’s war in ukraine their first meeting follows an initial phone conversation in august after labours election victory and sir keir has now proposed a full bilateral meeting in beijing or london the pair also agreed chancellor rachel reeves should visit beijing next year to discuss economic and financial cooperation with her counterpart vice premier he lifeng the conservatives shadow foreign secretary priti patel said “britains standing on the world stage risks being weakened if the prime minister does not robustly defend our national interest she said constructive dialogue was important but that sir keir should have been stronger in raising our concerns over human rights the repressive nature of the national security laws imposed on hong kong and the security safety and wellbeing of british nationals like jimmy lai who should be freed from custody starmer must set out as part of his supposed reset what assurances he received from president xi on the uk’s areas of concern” before the meeting in brazil the prime minister said it was important to engage with economies like china and foreign secretary david lammy held talks with his chinese counterpart wang yi as well as vice premier ding xuexiang in beijing last month the last british prime minister to meet president xi was theresa may who hailed a golden era for ukchina relations during her 2018 visit to the country but since then there have been tensions over issues including chinas treatment of the uyghur minority group in xinjiang and prodemocracy activists in hong kong last year thenconservative prime minister rishi sunak said china was the biggest statebased threat to our economic security but like the current government he also said it was necessary to engage with china on issues like climate change and the global economy dr yu jie a china expert from the chatham house international think tank said the g20 meeting was critical for ukchina relations to thaw after a sixyear freeze and suggested there could be a trade deal in sight despite significant diplomatic tensions judging from the readout given by both sides the tone of the conversation seemed to be positive said dr yu but when they came to specifics it seems on the thorny issues they have not really reached any agreement at all dr yu warned both sides efforts could still be overshadowed by pressure from the us thats something quite difficult for the british government if the us is going to be adding extra pressure for the uk to be in line with the us on china policy she said describing how she expected the us policy towards china to be hawkish under trump reuters jimmy lai a prodemocracy activist and british citizen was arrested in 2020 and his release from a hong kong prison is a priority the uk government says speaking to reporters on his way to the summit in rio de janeiro sir keir also said shoring up support for ukraine was top of his agenda before the meeting downing street said the prime minister will urge other g20 nations to step up their support for ukraine or face unfathomable consequences if russia is allowed to be victorious the summit follows largescale missile and drone attacks by russia across ukraine over the weekend and will take place as the conflict approaches its 1000th day and it comes amid reports that the us has authorised the use of longrange missiles it supplies to ukraine to strike russia the weapons have so far only been used by kyiv on russianoccupied targets within its own territory the uk has also supplied ukraine with its storm shadow missiles and defence officials and ministers have been making the case for kyiv to be permitted to use them to hit targets inside russia but they were not willing to act alone and had been waiting for the white house to change its mind sir keir said he was not going to get into operational details with regards to missiles in ukraine sir keir is holding talks with other g20 leaders representing 19 of the world’s largest economies and the african union and the european union the summit is overshadowed by the absence of presidentelect donald trump trump has called for allies to take a more aggressive approach towards china and may trigger a global trade war if he imposes a promised 60 tariff on chinese goods entering the us this summit will provide world leaders a first chance to compare notes and prepare for trumps upcoming return to the white house",
    "summary": "The meeting was the first time a UK prime minister has met the Chinese president in person since 2018, following a recent souring in relations.\nSir Keir raised the case of the jailed Hong Kong pro-democracy activist, Jimmy Lai, saying he was concerned about reports of a \"deterioration\" in his health.\nLast year, then-Conservative Prime Minister Rishi Sunak said China was \"the biggest state-based threat to our economic security\".\nSir Keir said he was \"not going to get into operational details\" with regards to missiles in Ukraine.\nSir Keir is holding talks with other G20 leaders, representing 19 of the world’s largest economies and the African Union and the European Union.",
    "keywords": [
      "sir",
      "summit",
      "starmer",
      "xi",
      "china",
      "wants",
      "relationship",
      "uk",
      "minister",
      "ukraine",
      "keir",
      "meeting",
      "strong",
      "prime"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/7da6/live/57245240-a5b0-11ef-b66d-1dda764fa469.jpg"
  },
  "https://www.bbc.com/news/articles/c7v3p7qm1dmo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c7v3p7qm1dmo",
    "date": "2024-11-27",
    "time": "00:00:00",
    "title": "Suspected methanol poisoning: Victims' families call for answers",
    "body": "Families of Australians killed in Laos call for answers\n\n\"We miss our daughters desperately. I was happy to hear that there’s been some movement over in Laos - we cannot have our girls passing and this continuing to happen,\" Ms Jones's father Mark told reporters.\n\nThe bodies of the Australians were flown home to Melbourne late on Tuesday, accompanied by their relatives.\n\nBianca Jones and Holly Bowles, both 19, were among six foreign tourists who died after apparently consuming the toxic substance, which is commonly added to bootleg alcohol.\n\nThe families of two Australian teenagers killed in a suspected methanol poisoning in Laos have welcomed news that eight people have been detained during a police investigation into the incident.\n\nThe eight people detained for questioning on Tuesday were staff at the Nana Backpackers hostel where all the victims had been staying, according to local media.\n\nThe owners of the hostel, which is now closed, have previously denied serving illicit alcohol.\n\nSpeaking at Melbourne Airport, Mr Jones urged the government in Laos to \"continue to pursue\" the case, adding that the families involved would try to \"raise awareness of methanol poisoning\".\n\nThe other four victims have been named as Simone White, a 28-year-old lawyer from the UK; James Louis Hutson, a 57-year-old American; and Danish citizens Anne-Sofie Orkild Coyman, 20, and Freja Vennervald Sorensen, 21.\n\nMr Hutson was found dead in his bedroom at the hostel on 13 November with several empty glasses nearby. On the same morning Ms Orkild Coyman and Ms Vennervald Sorensen were also found unconscious in their rooms and rushed to the local hospital.\n\nIt is unclear how many other people may have fallen ill from the suspected poisoning and an investigation into the deaths is continuing.\n\nThe hostel's manager was among several people questioned by police last week. Earlier, he told the Associated Press that Ms Jones and Ms Bowles had been the only tourists staying at the venue to have become unwell after drinking free shots there before heading out for the night.\n\nMethanol - which is commonly found in industrial and household products such as paint thinners - is a colourless chemical substance sometimes used in bootleg alcohol.\n\nConsuming just 25ml - which amounts to roughly half a shot - can be lethal, but it can take up to 24 hours for victims to start showing signs of illness, via symptoms such as vomiting and abdominal pain.\n\nMethanol poisoning has long been an issue across South East Asia, particularly in the poorer countries along the Mekong river, and the broader region has the highest prevalence of incidents worldwide.\n\nThe recent spate of deaths has cast a spotlight on Vang Vieng - which is a notorious party town - and prompted renewed warnings from governments around the world about drinking spirits in Laos.",
    "clean_body": "families of australians killed in laos call for answers we miss our daughters desperately i was happy to hear that there’s been some movement over in laos we cannot have our girls passing and this continuing to happen ms joness father mark told reporters the bodies of the australians were flown home to melbourne late on tuesday accompanied by their relatives bianca jones and holly bowles both 19 were among six foreign tourists who died after apparently consuming the toxic substance which is commonly added to bootleg alcohol the families of two australian teenagers killed in a suspected methanol poisoning in laos have welcomed news that eight people have been detained during a police investigation into the incident the eight people detained for questioning on tuesday were staff at the nana backpackers hostel where all the victims had been staying according to local media the owners of the hostel which is now closed have previously denied serving illicit alcohol speaking at melbourne airport mr jones urged the government in laos to continue to pursue the case adding that the families involved would try to raise awareness of methanol poisoning the other four victims have been named as simone white a 28yearold lawyer from the uk james louis hutson a 57yearold american and danish citizens annesofie orkild coyman 20 and freja vennervald sorensen 21 mr hutson was found dead in his bedroom at the hostel on 13 november with several empty glasses nearby on the same morning ms orkild coyman and ms vennervald sorensen were also found unconscious in their rooms and rushed to the local hospital it is unclear how many other people may have fallen ill from the suspected poisoning and an investigation into the deaths is continuing the hostels manager was among several people questioned by police last week earlier he told the associated press that ms jones and ms bowles had been the only tourists staying at the venue to have become unwell after drinking free shots there before heading out for the night methanol which is commonly found in industrial and household products such as paint thinners is a colourless chemical substance sometimes used in bootleg alcohol consuming just 25ml which amounts to roughly half a shot can be lethal but it can take up to 24 hours for victims to start showing signs of illness via symptoms such as vomiting and abdominal pain methanol poisoning has long been an issue across south east asia particularly in the poorer countries along the mekong river and the broader region has the highest prevalence of incidents worldwide the recent spate of deaths has cast a spotlight on vang vieng which is a notorious party town and prompted renewed warnings from governments around the world about drinking spirits in laos",
    "summary": "Families of Australians killed in Laos call for answers\"We miss our daughters desperately.\nThe families of two Australian teenagers killed in a suspected methanol poisoning in Laos have welcomed news that eight people have been detained during a police investigation into the incident.\nSpeaking at Melbourne Airport, Mr Jones urged the government in Laos to \"continue to pursue\" the case, adding that the families involved would try to \"raise awareness of methanol poisoning\".\nOn the same morning Ms Orkild Coyman and Ms Vennervald Sorensen were also found unconscious in their rooms and rushed to the local hospital.\nIt is unclear how many other people may have fallen ill from the suspected poisoning and an investigation into the deaths is continuing.",
    "keywords": [
      "hostel",
      "answers",
      "ms",
      "suspected",
      "tourists",
      "families",
      "told",
      "jones",
      "victims",
      "methanol",
      "laos",
      "vennervald",
      "poisoning"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f7fc/live/540601b0-ac47-11ef-bfca-7d99fb9e396c.jpg"
  },
  "https://www.bbc.com/news/live/cvg52lgeglxt": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/cvg52lgeglxt",
    "date": "2024-11-29",
    "time": "00:00:00",
    "title": "First look inside rebuilt Notre-Dame as Macron calls its reopening a 'shock of hope'",
    "body": "Notre-Dame Cathedral stands tall again five years on\n\nHollie Cole\n\nLive reporter\n\nImage source, Reuters\n\nMore than five years after Notre-Dame Cathedral caught fire, it has risen from the ashes and been transformed into a spectacular sight.\n\nEarlier today, we watched France's President Emmanuel Macron tour the rebuilt cathedral, with its impressive height, colourful stained glass, and restored sculptures.\n\nHe ended his tour with a speech, thanking those involved in restoring the Parisian building, saying: \"You did your alchemy here on this site to turn charred coals into art.\"\n\nYou won't have to wait long to step inside Notre-Dame Cathedral yourself - it'll open its doors to the public on 7 December.\n\nCan't wait until then? Our Paris correspondent, Hugh Schofield, has been reporting from inside the cathedral today.\n\nWe're wrapping up our live coverage now - thanks for joining us today! This page was brought together by me, Amanda Kirton, Henri Astier, and Tinshui Yeung.",
    "clean_body": "notredame cathedral stands tall again five years on hollie cole live reporter image source reuters more than five years after notredame cathedral caught fire it has risen from the ashes and been transformed into a spectacular sight earlier today we watched frances president emmanuel macron tour the rebuilt cathedral with its impressive height colourful stained glass and restored sculptures he ended his tour with a speech thanking those involved in restoring the parisian building saying you did your alchemy here on this site to turn charred coals into art you wont have to wait long to step inside notredame cathedral yourself itll open its doors to the public on 7 december cant wait until then our paris correspondent hugh schofield has been reporting from inside the cathedral today were wrapping up our live coverage now thanks for joining us today this page was brought together by me amanda kirton henri astier and tinshui yeung",
    "summary": "Notre-Dame Cathedral stands tall again five years onHollie ColeLive reporterImage source, ReutersMore than five years after Notre-Dame Cathedral caught fire, it has risen from the ashes and been transformed into a spectacular sight.\nEarlier today, we watched France's President Emmanuel Macron tour the rebuilt cathedral, with its impressive height, colourful stained glass, and restored sculptures.\nYou won't have to wait long to step inside Notre-Dame Cathedral yourself - it'll open its doors to the public on 7 December.\nOur Paris correspondent, Hugh Schofield, has been reporting from inside the cathedral today.\nThis page was brought together by me, Amanda Kirton, Henri Astier, and Tinshui Yeung.",
    "keywords": [
      "watched",
      "tour",
      "look",
      "yeung",
      "rebuilt",
      "shock",
      "inside",
      "wont",
      "wrapping",
      "wait",
      "calls",
      "cathedral",
      "today",
      "hope",
      "notredame",
      "macron",
      "reopening"
    ],
    "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png"
  },
  "https://www.bbc.com/news/articles/c0qdz1jne91o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c0qdz1jne91o",
    "date": "2024-11-08",
    "time": "00:00:00",
    "title": "China is trying to fix its economy - Trump could derail those plans",
    "body": "China is trying to fix its economy - Trump could derail those plans\n\n8 November 2024 Share Save João da Silva Business reporter Share Save\n\nReuters Donald Trump and Xi Jinping at their last face-to-face meeting in 2019\n\nChina has unveiled new measures aimed at boosting its flagging economy, as it braces for a second Donald Trump presidency. The country plans to tackle tens of billions of dollars of local government debt to prevent it being a drag on growth. Trump won the US election on a platform that promised steep import taxes, including tariffs as high as 60% on Chinese-made goods. His victory is now likely to hinder Xi Jinping’s plans to transform the country into a technology powerhouse – and further strain relations between the world’s two biggest economies. A property slump, rising government debt and unemployment, and low consumption have slowed down Chinese growth since the pandemic.\n\nSo the stakes are higher than ever for the latest announcement from the Standing Committee of the National People’s Congress (NPC), the executive body of China's legislature. During his first term in office Trump hit Chinese goods with tariffs of as much as 25%. China analyst Bill Bishop says Trump should be taken at his word about his new tariff plans. \"I think we should believe that he means it when [he] talks about tariffs, that he sees China as having reneged on his trade deal, that he thinks China and Covid cost him the 2020 election\". The pressure from Washington did not ease after Trump left the White House in 2021. The Biden administration kept the measures in place and in some cases widened them. While the first wave of Trump tariffs were painful for China, the country is now in a much more vulnerable position. The economy has been struggling to return to pre-pandemic levels of growth since abruptly abandoning its tight Covid restrictions two years ago. Instead of delivering a widely expected fast-paced recovery, China became a regular source of disappointing economic news. Even before Trump's election victory and after China began rolling out measures to support its economy in September, the International Monetary Fund (IMF) lowered its annual growth target for the country. The IMF now expects the Chinese economy to expand by 4.8% in 2024, at the lower end of Beijing's \"about 5%\" target. Next year, it projects China's annual growth rate will drop further to 4.5%. The latest plan involves using an additional 6 trillion yuan ($840bn) from now until 2026 to bail out local governments which have piled up unsustainable levels of debt. For decades, local governments have helped drive growth throughout the country by borrowing massive sums of money - much of which paid for infrastructure projects. But a downturn in the property industry has left some cities unable to pay their bills.\n\nBut the country's leaders were not caught entirely off guard by the end to decades of super-fast growth. Speaking in 2017, President Xi said his country planned to transition from \"rapid growth to a stage of high-quality development.\" The term has since been used repeatedly by Chinese officials to describe a shift to an economy driven by advanced manufacturing and green industries. But some economists say China cannot simply export itself out of trouble. China risks falling into the type of decades-long stagnation that Japan endured after a stock and property bubble burst in the 1990s, Morgan Stanley Asia's former chairman, Stephen Roach, says. To avoid that fate, he says China should draw \"on untapped consumer demand\" and move away from \"export and investment-led growth\". That would not only encourage more sustainable growth but also lower \"trade tensions and [China's] vulnerability to external shocks,\" he says. This more robust economic model could help China fend off the kind of threats posed by Trump's return to power.\n\nNew economy, old problems",
    "clean_body": "china is trying to fix its economy trump could derail those plans 8 november 2024 share save joão da silva business reporter share save reuters donald trump and xi jinping at their last facetoface meeting in 2019 china has unveiled new measures aimed at boosting its flagging economy as it braces for a second donald trump presidency the country plans to tackle tens of billions of dollars of local government debt to prevent it being a drag on growth trump won the us election on a platform that promised steep import taxes including tariffs as high as 60 on chinesemade goods his victory is now likely to hinder xi jinping’s plans to transform the country into a technology powerhouse – and further strain relations between the world’s two biggest economies a property slump rising government debt and unemployment and low consumption have slowed down chinese growth since the pandemic so the stakes are higher than ever for the latest announcement from the standing committee of the national people’s congress npc the executive body of chinas legislature during his first term in office trump hit chinese goods with tariffs of as much as 25 china analyst bill bishop says trump should be taken at his word about his new tariff plans i think we should believe that he means it when he talks about tariffs that he sees china as having reneged on his trade deal that he thinks china and covid cost him the 2020 election the pressure from washington did not ease after trump left the white house in 2021 the biden administration kept the measures in place and in some cases widened them while the first wave of trump tariffs were painful for china the country is now in a much more vulnerable position the economy has been struggling to return to prepandemic levels of growth since abruptly abandoning its tight covid restrictions two years ago instead of delivering a widely expected fastpaced recovery china became a regular source of disappointing economic news even before trumps election victory and after china began rolling out measures to support its economy in september the international monetary fund imf lowered its annual growth target for the country the imf now expects the chinese economy to expand by 48 in 2024 at the lower end of beijings about 5 target next year it projects chinas annual growth rate will drop further to 45 the latest plan involves using an additional 6 trillion yuan 840bn from now until 2026 to bail out local governments which have piled up unsustainable levels of debt for decades local governments have helped drive growth throughout the country by borrowing massive sums of money much of which paid for infrastructure projects but a downturn in the property industry has left some cities unable to pay their bills but the countrys leaders were not caught entirely off guard by the end to decades of superfast growth speaking in 2017 president xi said his country planned to transition from rapid growth to a stage of highquality development the term has since been used repeatedly by chinese officials to describe a shift to an economy driven by advanced manufacturing and green industries but some economists say china cannot simply export itself out of trouble china risks falling into the type of decadeslong stagnation that japan endured after a stock and property bubble burst in the 1990s morgan stanley asias former chairman stephen roach says to avoid that fate he says china should draw on untapped consumer demand and move away from export and investmentled growth that would not only encourage more sustainable growth but also lower trade tensions and chinas vulnerability to external shocks he says this more robust economic model could help china fend off the kind of threats posed by trumps return to power new economy old problems",
    "summary": "China is trying to fix its economy - Trump could derail those plans8 November 2024 Share Save João da Silva Business reporter Share SaveReuters Donald Trump and Xi Jinping at their last face-to-face meeting in 2019China has unveiled new measures aimed at boosting its flagging economy, as it braces for a second Donald Trump presidency.\nThe country plans to tackle tens of billions of dollars of local government debt to prevent it being a drag on growth.\nA property slump, rising government debt and unemployment, and low consumption have slowed down Chinese growth since the pandemic.\nWhile the first wave of Trump tariffs were painful for China, the country is now in a much more vulnerable position.\nThe IMF now expects the Chinese economy to expand by 4.8% in 2024, at the lower end of Beijing's \"about 5%\" target.",
    "keywords": [
      "plans",
      "xi",
      "economy",
      "china",
      "country",
      "chinese",
      "trump",
      "property",
      "trying",
      "fix",
      "derail",
      "growth",
      "tariffs"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/886b/live/ebc3ef50-9ccd-11ef-aa41-998bb22e478c.jpg"
  },
  "https://www.bbc.com/news/articles/c0mzy0e2kyro": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c0mzy0e2kyro",
    "date": "2024-11-21",
    "time": "00:00:00",
    "title": "The Simpsons: Milhouse voice actress Pamela Hayden retires from US series",
    "body": "Milhouse voice actress retires from The Simpsons\n\n21 November 2024 Share Save Steven McIntosh Entertainment reporter Share Save\n\nGetty Images Pamela Hayden said she would \"always have a special place in my heart for that blue-haired 10-year-old boy\"\n\nPamela Hayden, the actress who voices the Simpsons character Milhouse, has announced her retirement from the show. Hayden has worked on the US animated series since 1989 and appeared in nearly 700 episodes. In a statement, 70-year-old Hayden said: “The time has come for me to hang up my microphone.” “It’s been an honour and a joy to have worked on such a funny, witty, and groundbreaking show... I’ll always have a special place in my heart for that blue-haired 10-year-old boy with glasses.”\n\nFox/Alamy Milhouse has been a popular recurring character on the show for 35 years",
    "clean_body": "milhouse voice actress retires from the simpsons 21 november 2024 share save steven mcintosh entertainment reporter share save getty images pamela hayden said she would always have a special place in my heart for that bluehaired 10yearold boy pamela hayden the actress who voices the simpsons character milhouse has announced her retirement from the show hayden has worked on the us animated series since 1989 and appeared in nearly 700 episodes in a statement 70yearold hayden said “the time has come for me to hang up my microphone” “it’s been an honour and a joy to have worked on such a funny witty and groundbreaking show i’ll always have a special place in my heart for that bluehaired 10yearold boy with glasses” foxalamy milhouse has been a popular recurring character on the show for 35 years",
    "summary": "Milhouse voice actress retires from The Simpsons21 November 2024 Share Save Steven McIntosh Entertainment reporter Share SaveGetty Images Pamela Hayden said she would \"always have a special place in my heart for that blue-haired 10-year-old boy\"Pamela Hayden, the actress who voices the Simpsons character Milhouse, has announced her retirement from the show.\nHayden has worked on the US animated series since 1989 and appeared in nearly 700 episodes.\nIn a statement, 70-year-old Hayden said: “The time has come for me to hang up my microphone.” “It’s been an honour and a joy to have worked on such a funny, witty, and groundbreaking show... I’ll always have a special place in my heart for that blue-haired 10-year-old boy with glasses.”Fox/Alamy Milhouse has been a popular recurring character on the show for 35 years",
    "keywords": [
      "worked",
      "bluehaired",
      "special",
      "character",
      "voice",
      "pamela",
      "share",
      "heart",
      "milhouse",
      "actress",
      "hayden",
      "retires",
      "place",
      "series",
      "simpsons"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/b7c2/live/5926ebc0-a7ef-11ef-bdf5-b7cb2fa86e10.jpg"
  },
  "https://www.bbc.com/news/articles/c5yr40qjegeo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c5yr40qjegeo",
    "date": "2024-11-23",
    "time": "00:00:00",
    "title": "Your pictures: Storm Bert brings snow, wind and rain to UK",
    "body": "Your pictures: Storm Bert brings snow, wind and rain to UK\n\nWaves crash into the seafront in Devon on Saturday\n\nStorm Bert has brought heavy snowfall, rain and strong winds as it sweeps through parts of the UK, causing widespread disruption.\n\nSnow has fallen across Scotland and parts of northern and central England, alongside the heavy rain and wind that has also hit southern England and Wales.\n\nA number of yellow weather warnings remain in place after an earlier amber warning was lifted, and communities have been warned of flooding and power cuts.\n\nTravel routes are heavily disrupted in some areas with trains cancelled and roads closed.\n\nWe've put together a selection of your pictures showcasing the weather around the UK, all sent into us through the BBC's Weather Watchers group. Scroll down to have a look.",
    "clean_body": "your pictures storm bert brings snow wind and rain to uk waves crash into the seafront in devon on saturday storm bert has brought heavy snowfall rain and strong winds as it sweeps through parts of the uk causing widespread disruption snow has fallen across scotland and parts of northern and central england alongside the heavy rain and wind that has also hit southern england and wales a number of yellow weather warnings remain in place after an earlier amber warning was lifted and communities have been warned of flooding and power cuts travel routes are heavily disrupted in some areas with trains cancelled and roads closed weve put together a selection of your pictures showcasing the weather around the uk all sent into us through the bbcs weather watchers group scroll down to have a look",
    "summary": "Your pictures: Storm Bert brings snow, wind and rain to UKWaves crash into the seafront in Devon on SaturdayStorm Bert has brought heavy snowfall, rain and strong winds as it sweeps through parts of the UK, causing widespread disruption.\nSnow has fallen across Scotland and parts of northern and central England, alongside the heavy rain and wind that has also hit southern England and Wales.\nA number of yellow weather warnings remain in place after an earlier amber warning was lifted, and communities have been warned of flooding and power cuts.\nTravel routes are heavily disrupted in some areas with trains cancelled and roads closed.\nWe've put together a selection of your pictures showcasing the weather around the UK, all sent into us through the BBC's Weather Watchers group.",
    "keywords": [
      "pictures",
      "storm",
      "weather",
      "heavy",
      "brings",
      "bert",
      "rain",
      "uk",
      "parts",
      "england",
      "snow",
      "wind",
      "yellow"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4781/live/ca492360-a9aa-11ef-bef1-d35c5a47a07a.jpg"
  },
  "https://www.bbc.com/news/articles/cqxwg9pq4e4o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cqxwg9pq4e4o",
    "date": "2024-11-07",
    "time": "00:00:00",
    "title": "Gladiator II: Paul Mescal at Dublin premiere",
    "body": "Paul Mescal in Dublin for Gladiator II premiere\n\n7 November 2024 Share Save Share Save\n\nGetty Images Paul Mescal posed for a selfie with fans at the \"Gladiator II\" Irish premiere in Dublin\n\nIrish stars and fans arrived for the premiere of Ridley Scott’s Gladiator II in Dublin’s Lighthouse Cinema on Thursday. The film stars Kildare actor Paul Mescal, playing the character Lucius alongside co-star and two-time Oscar winner Denzel Washington. Sir Ridley's first film in 2000, which starred Russell Crowe as soldier-turned-gladiator Maximus, won five Oscars including best actor and best picture. Gladiator II is set to be released in the UK and Ireland on 15 November.\n\nParamount Paul Mescal plays Lucius, whose character was the grandson of Roman emperor Marcus Aurelius in the first Gladiator film\n\nSpeaking to RTÉ, Mescal expressed his admiration for the fans, saying he was \"always blown away by Irish fans who come and stand and wait to meet us.\" Mescal showed his delight to be back in his home country and said: “I’m fundamentally proud to be Irish, so to feel this when you come home is very difficult to put into words.\" Acknowledging the current crop of Irish stars, he said “whatever is in the water at the moment for Irish actors, it must be coming within these borders,” adding that he would love to work on a film with other talents from the island, including Cillian Murphy and Saoirse Ronan. Mescal also praised the director: “The fact I’ve had the opportunity to work with Ridley Scott on one of his best films, is very difficult to put into words.”\n\nGetty Oylimpic champion Daniel Wiffen claims his celebration was inspired by Russell Crowe in the first Gladiator film",
    "clean_body": "paul mescal in dublin for gladiator ii premiere 7 november 2024 share save share save getty images paul mescal posed for a selfie with fans at the gladiator ii irish premiere in dublin irish stars and fans arrived for the premiere of ridley scott’s gladiator ii in dublin’s lighthouse cinema on thursday the film stars kildare actor paul mescal playing the character lucius alongside costar and twotime oscar winner denzel washington sir ridleys first film in 2000 which starred russell crowe as soldierturnedgladiator maximus won five oscars including best actor and best picture gladiator ii is set to be released in the uk and ireland on 15 november paramount paul mescal plays lucius whose character was the grandson of roman emperor marcus aurelius in the first gladiator film speaking to rté mescal expressed his admiration for the fans saying he was always blown away by irish fans who come and stand and wait to meet us mescal showed his delight to be back in his home country and said “i’m fundamentally proud to be irish so to feel this when you come home is very difficult to put into words acknowledging the current crop of irish stars he said “whatever is in the water at the moment for irish actors it must be coming within these borders” adding that he would love to work on a film with other talents from the island including cillian murphy and saoirse ronan mescal also praised the director “the fact i’ve had the opportunity to work with ridley scott on one of his best films is very difficult to put into words” getty oylimpic champion daniel wiffen claims his celebration was inspired by russell crowe in the first gladiator film",
    "summary": "Paul Mescal in Dublin for Gladiator II premiere7 November 2024 Share Save Share SaveGetty Images Paul Mescal posed for a selfie with fans at the \"Gladiator II\" Irish premiere in DublinIrish stars and fans arrived for the premiere of Ridley Scott’s Gladiator II in Dublin’s Lighthouse Cinema on Thursday.\nThe film stars Kildare actor Paul Mescal, playing the character Lucius alongside co-star and two-time Oscar winner Denzel Washington.\nSir Ridley's first film in 2000, which starred Russell Crowe as soldier-turned-gladiator Maximus, won five Oscars including best actor and best picture.\nGladiator II is set to be released in the UK and Ireland on 15 November.\nParamount Paul Mescal plays Lucius, whose character was the grandson of Roman emperor Marcus Aurelius in the first Gladiator filmSpeaking to RTÉ, Mescal expressed his admiration for the fans, saying he was \"always blown away by Irish fans who come and stand and wait to meet us.\"",
    "keywords": [
      "work",
      "best",
      "premiere",
      "stars",
      "paul",
      "ii",
      "film",
      "mescal",
      "irish",
      "gladiator",
      "dublin",
      "fans"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f993/live/4d49e350-9dc9-11ef-9396-03f1765db8ca.jpg"
  },
  "https://www.bbc.com/news/articles/c62l00g0k65o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c62l00g0k65o",
    "date": "2024-11-12",
    "time": "00:00:00",
    "title": "Jack Teixeira: US airman sentenced to 15 years in prison",
    "body": "US airman Jack Teixeira sentenced to 15 years in prison\n\nAmong the documents he shared was confidential information about the war in Ukraine.\n\nWhile he worked at an Air National Guard base, Teixeira obtained materials including maps, satellite images and intelligence on US allies, and then posted those documents to an online platform popular with gamers.\n\nTeixeira, 22, pleaded guilty to the wilful retention and transmission of national defence information in March.\n\nJack Teixeira, a US Air National Guardsman who leaked Pentagon documents last year in one of the highest-profile intelligence cases in recent years, has been sentenced to 15 years in prison.\n\nProsecutors asked US District Court Judge Indira Talwani to impose a 16 and a half-year sentence on Teixeira. His defence lawyers asked for an 11-year sentence.\n\nIn their request for a lenient sentence, Teixeira's lawyers argued in court filings that the airman was the target of bullying while in high school and his military unit, and that he had suffered from isolation.\n\nMeanwhile, prosecutors argued for a longer prison term, saying that the airman had \"perpetrated one of the most significant and consequential violations of the Espionage Act in American history\".\n\n\"Teixeira understood the risk to his country and did it anyways,\" prosecutors told Judge Talwani on Tuesday.\n\nPassing sentence, Judge Talwani said to Teixeira: \"You are young and you have a future ahead of you, but it is such a serious crime.\"\n\nTeixeira apologised before the court, and said he understood that \"all the responsibility and consequences fall on my shoulders alone\", according to reporters inside the Boston court.\n\nTeixeira began with a small group of gun and military enthusiasts on a Discord server, or chatroom, in late 2022. While the documents stayed in that chatroom initially, the information was later re-shared on more public channels.\n\nThe documents were later picked up by pro-Kremlin Telegram channels and military bloggers.\n\nTeixeira enlisted in the Massachusetts Air National Guard, a reserve of the US Air Force, in 2019. In that role, he had top-secret security clearance.\n\nIn order to get this clearance, Teixeira signed a \"lifetime binding non-disclosure agreement\" acknowledging that the \"unauthorized disclosure of protected information could result in criminal charges\", according to court documents.\n\nTeixeira's leak prompted the Pentagon to examine its systems for handling classified information.",
    "clean_body": "us airman jack teixeira sentenced to 15 years in prison among the documents he shared was confidential information about the war in ukraine while he worked at an air national guard base teixeira obtained materials including maps satellite images and intelligence on us allies and then posted those documents to an online platform popular with gamers teixeira 22 pleaded guilty to the wilful retention and transmission of national defence information in march jack teixeira a us air national guardsman who leaked pentagon documents last year in one of the highestprofile intelligence cases in recent years has been sentenced to 15 years in prison prosecutors asked us district court judge indira talwani to impose a 16 and a halfyear sentence on teixeira his defence lawyers asked for an 11year sentence in their request for a lenient sentence teixeiras lawyers argued in court filings that the airman was the target of bullying while in high school and his military unit and that he had suffered from isolation meanwhile prosecutors argued for a longer prison term saying that the airman had perpetrated one of the most significant and consequential violations of the espionage act in american history teixeira understood the risk to his country and did it anyways prosecutors told judge talwani on tuesday passing sentence judge talwani said to teixeira you are young and you have a future ahead of you but it is such a serious crime teixeira apologised before the court and said he understood that all the responsibility and consequences fall on my shoulders alone according to reporters inside the boston court teixeira began with a small group of gun and military enthusiasts on a discord server or chatroom in late 2022 while the documents stayed in that chatroom initially the information was later reshared on more public channels the documents were later picked up by prokremlin telegram channels and military bloggers teixeira enlisted in the massachusetts air national guard a reserve of the us air force in 2019 in that role he had topsecret security clearance in order to get this clearance teixeira signed a lifetime binding nondisclosure agreement acknowledging that the unauthorized disclosure of protected information could result in criminal charges according to court documents teixeiras leak prompted the pentagon to examine its systems for handling classified information",
    "summary": "US airman Jack Teixeira sentenced to 15 years in prisonAmong the documents he shared was confidential information about the war in Ukraine.\nJack Teixeira, a US Air National Guardsman who leaked Pentagon documents last year in one of the highest-profile intelligence cases in recent years, has been sentenced to 15 years in prison.\nProsecutors asked US District Court Judge Indira Talwani to impose a 16 and a half-year sentence on Teixeira.\nPassing sentence, Judge Talwani said to Teixeira: \"You are young and you have a future ahead of you, but it is such a serious crime.\"\nTeixeira enlisted in the Massachusetts Air National Guard, a reserve of the US Air Force, in 2019.",
    "keywords": [
      "national",
      "sentenced",
      "military",
      "judge",
      "jack",
      "court",
      "prison",
      "air",
      "airman",
      "talwani",
      "documents",
      "sentence",
      "15",
      "information",
      "teixeira"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f5b2/live/393adb20-a10d-11ef-9d70-9564a3cc52f2.jpg"
  },
  "https://www.bbc.com/news/articles/c0enj90r5d0o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c0enj90r5d0o",
    "date": "2024-11-23",
    "time": "00:00:00",
    "title": "Listeria outbreak: Recall issued as US says infant died",
    "body": "US listeria outbreak kills infant and prompts recall of meat products\n\n23 November 2024 Share Save Mallory Moench BBC News Share Save\n\nGetty Images\n\nAn infant in California died in a listeria outbreak that has now prompted a recall of ready-to-eat meat, the Centers for Disease Control and Prevention (CDC) said. The child's pregnant mother also fell ill with listeria. The child's twin died as well, but testing could not find listeria in that infant. The CDC said eleven people had been reported as infected in four states between October 2021 and July 2024. It was not clear when the baby died. The outbreak led to a recall this month of ready-to-eat meat products manufactured by Yu Shang Food Inc.\n\nThe South-Carolina based company recalled more than 72,000 pounds of food after its products tested positive for listeria on 21 October.\n\nFSIS Ready-to-eat meat products recalled",
    "clean_body": "us listeria outbreak kills infant and prompts recall of meat products 23 november 2024 share save mallory moench bbc news share save getty images an infant in california died in a listeria outbreak that has now prompted a recall of readytoeat meat the centers for disease control and prevention cdc said the childs pregnant mother also fell ill with listeria the childs twin died as well but testing could not find listeria in that infant the cdc said eleven people had been reported as infected in four states between october 2021 and july 2024 it was not clear when the baby died the outbreak led to a recall this month of readytoeat meat products manufactured by yu shang food inc the southcarolina based company recalled more than 72000 pounds of food after its products tested positive for listeria on 21 october fsis readytoeat meat products recalled",
    "summary": "US listeria outbreak kills infant and prompts recall of meat products23 November 2024 Share Save Mallory Moench BBC News Share SaveGetty ImagesAn infant in California died in a listeria outbreak that has now prompted a recall of ready-to-eat meat, the Centers for Disease Control and Prevention (CDC) said.\nThe child's twin died as well, but testing could not find listeria in that infant.\nThe outbreak led to a recall this month of ready-to-eat meat products manufactured by Yu Shang Food Inc.\nThe South-Carolina based company recalled more than 72,000 pounds of food after its products tested positive for listeria on 21 October.\nFSIS Ready-to-eat meat products recalled",
    "keywords": [
      "listeria",
      "infant",
      "issued",
      "share",
      "meat",
      "recalled",
      "recall",
      "died",
      "products",
      "readytoeat",
      "outbreak"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/86db/live/2d24b1a0-a9bc-11ef-8ab9-9192db313061.jpg"
  },
  "https://www.bbc.com/news/articles/c2071ny8jl4o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c2071ny8jl4o",
    "date": "2024-11-04",
    "time": "00:00:00",
    "title": "Drake and DeMar DeRozan beef: What's going on?",
    "body": "Drake's beef with former Toronto Raptors All-Star explained\n\n4 November 2024 Share Save Share Save\n\nGetty Images Sacramento Kings' DeMar DeRozan is a former Toronto Raptors All-Star\n\nDrake has had his fair share of beef with other rappers, but some people might not have seen his latest row with a basketball player coming. The rap megastar is famously a fan of Toronto Raptors - the NBA's only Canadian team - and is regularly seen courtside watching games. He's also said to have made friends with current and former players, including DeMar DeRozan, who returned to the Raptors' Scotiabank Arena as a member of opponents Sacramento Kings on Saturday. But the Hotline Bling star didn't exactly welcome his old friend back with open arms.\n\nGetty Images Drake caught up with ex-Raptors player Vince Carter before his number 15 jersey was retired\n\nDuring the weekend's match-up the Raptors retired the jersey of legend Vince Carter. It's a common tribute NBA teams perform to honour significant former players, hanging their numbers from banners high up inside stadiums. DeRozan is a six-time NBA All-Star who played for the Raptors from 2009 to 2018, making him a good candidate for the same treatment. But speaking on Canadian Sports network TSN, Drake said: \"If you ever put a DeRozan banner up, I'll go up there and pull it down myself.\" Speaking to reporters after the game, he clapped back at the rapper when asked about his comments. \"He's going to have a long way to climb to take it down, so tell him good luck,\" he said.\n\nDeRozan appeared in the video for Kendrick Lamar's Not Like Us - the fiery diss track aimed at Drake that blew up the internet when it dropped earlier this year. The basketball star also appeared on stage with Lamar when he performed the track in Los Angeles over the summer. DeRozan told reporters at the time that he still considered Drake a friend, and compared the feud to a spectacle along the lines of Michael Jordan facing Kobe Bryant one-on-one. Based on Drake's brief comment, the rapper might not feel quite the same. But he can at least take comfort in the fact that the Raptors beat the Kings by 131-128.",
    "clean_body": "drakes beef with former toronto raptors allstar explained 4 november 2024 share save share save getty images sacramento kings demar derozan is a former toronto raptors allstar drake has had his fair share of beef with other rappers but some people might not have seen his latest row with a basketball player coming the rap megastar is famously a fan of toronto raptors the nbas only canadian team and is regularly seen courtside watching games hes also said to have made friends with current and former players including demar derozan who returned to the raptors scotiabank arena as a member of opponents sacramento kings on saturday but the hotline bling star didnt exactly welcome his old friend back with open arms getty images drake caught up with exraptors player vince carter before his number 15 jersey was retired during the weekends matchup the raptors retired the jersey of legend vince carter its a common tribute nba teams perform to honour significant former players hanging their numbers from banners high up inside stadiums derozan is a sixtime nba allstar who played for the raptors from 2009 to 2018 making him a good candidate for the same treatment but speaking on canadian sports network tsn drake said if you ever put a derozan banner up ill go up there and pull it down myself speaking to reporters after the game he clapped back at the rapper when asked about his comments hes going to have a long way to climb to take it down so tell him good luck he said derozan appeared in the video for kendrick lamars not like us the fiery diss track aimed at drake that blew up the internet when it dropped earlier this year the basketball star also appeared on stage with lamar when he performed the track in los angeles over the summer derozan told reporters at the time that he still considered drake a friend and compared the feud to a spectacle along the lines of michael jordan facing kobe bryant oneonone based on drakes brief comment the rapper might not feel quite the same but he can at least take comfort in the fact that the raptors beat the kings by 131128",
    "summary": "Drake's beef with former Toronto Raptors All-Star explained4 November 2024 Share Save Share SaveGetty Images Sacramento Kings' DeMar DeRozan is a former Toronto Raptors All-StarDrake has had his fair share of beef with other rappers, but some people might not have seen his latest row with a basketball player coming.\nThe rap megastar is famously a fan of Toronto Raptors - the NBA's only Canadian team - and is regularly seen courtside watching games.\nHe's also said to have made friends with current and former players, including DeMar DeRozan, who returned to the Raptors' Scotiabank Arena as a member of opponents Sacramento Kings on Saturday.\nBut speaking on Canadian Sports network TSN, Drake said: \"If you ever put a DeRozan banner up, I'll go up there and pull it down myself.\"\n\"He's going to have a long way to climb to take it down, so tell him good luck,\" he said.",
    "keywords": [
      "drake",
      "toronto",
      "beef",
      "share",
      "star",
      "speaking",
      "derozan",
      "kings",
      "track",
      "demar",
      "whats",
      "vince",
      "going",
      "raptors"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/313f/live/0855f6e0-9a99-11ef-9260-19e6a950e830.jpg"
  },
  "https://www.bbc.com/news/articles/c3vl4w36wypo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c3vl4w36wypo",
    "date": "2024-11-25",
    "time": "00:00:00",
    "title": "Hezbollah fires rocket barrages into Israel after deadly Beirut strikes",
    "body": "Hezbollah fires rocket barrages into Israel after deadly Beirut strikes\n\nAlso on Sunday, Israeli media widely reported that Israel and Lebanon were moving towards a ceasefire agreement to end the fighting with the Iran-backed militia, Hezbollah.\n\nThe attacks followed an Israeli air strike on central Beirut on Saturday, in which the Lebanese health ministry said 29 people were killed.\n\nSeveral people were injured and buildings damaged in northern and central Israel, some of them near Tel Aviv, Israel's police said.\n\nIsrael's military says around 250 rockets have been fired by Hezbollah across the border from Lebanon, marking one of the heaviest bombardments of Israel since fighting intensified in September.\n\nFollowing reports of heavy fire from Lebanon, Israel's police said it had received reports of rocket debris falling in the Tel Aviv area.\n\nThe Israel Defense Forces (IDF) said a direct hit on one neighbourhood had left \"houses in flames and ruins\".\n\nRockets fell in Petah Tikva, near Tel Aviv, and in some northern areas: Haifa, Nahariya and Kfar Blum, Israeli media reported.\n\nHezbollah, which has previously vowed to respond to attacks on Beirut by targeting Tel Aviv, said it had launched precision missiles at two military sites in the city and nearby.\n\nLater, the IDF said it had completed strikes on 12 Hezbollah command centres in Dahieh, a stronghold for the group in Beirut's southern suburbs.\n\nLebanon's health ministry on Sunday raised the death toll from 20 to 29 from a massive Israeli strike launched without warning on central Beirut. It said a total of 84 people had been killed in the country Saturday.\n\nThe IDF has not commented on Saturday's attack, but Israeli media reported at the time that it was an attempt to kill Mohammed Haydar, a top Hezbollah official.\n\nIsrael’s stated goal in its war against Hezbollah is to allow the return of about 60,000 residents who have been displaced from communities in northern Israel because of the group’s attacks.\n\nIn Lebanon, more than 3,670 people have been killed and at least 15,400 injured since October 2023, according to Lebanese authorities, with more than one million forced from their homes.\n\nOver the past fortnight, Israel has intensified its campaign against Hezbollah.\n\nOn Sunday the Israeli public broadcaster Kan, citing Israeli and US officials, reported that Israel had given the \"green light\" to advance a US-proposed ceasefire deal with Lebanon, but indicated some gaps remained.",
    "clean_body": "hezbollah fires rocket barrages into israel after deadly beirut strikes also on sunday israeli media widely reported that israel and lebanon were moving towards a ceasefire agreement to end the fighting with the iranbacked militia hezbollah the attacks followed an israeli air strike on central beirut on saturday in which the lebanese health ministry said 29 people were killed several people were injured and buildings damaged in northern and central israel some of them near tel aviv israels police said israels military says around 250 rockets have been fired by hezbollah across the border from lebanon marking one of the heaviest bombardments of israel since fighting intensified in september following reports of heavy fire from lebanon israels police said it had received reports of rocket debris falling in the tel aviv area the israel defense forces idf said a direct hit on one neighbourhood had left houses in flames and ruins rockets fell in petah tikva near tel aviv and in some northern areas haifa nahariya and kfar blum israeli media reported hezbollah which has previously vowed to respond to attacks on beirut by targeting tel aviv said it had launched precision missiles at two military sites in the city and nearby later the idf said it had completed strikes on 12 hezbollah command centres in dahieh a stronghold for the group in beiruts southern suburbs lebanons health ministry on sunday raised the death toll from 20 to 29 from a massive israeli strike launched without warning on central beirut it said a total of 84 people had been killed in the country saturday the idf has not commented on saturdays attack but israeli media reported at the time that it was an attempt to kill mohammed haydar a top hezbollah official israel’s stated goal in its war against hezbollah is to allow the return of about 60000 residents who have been displaced from communities in northern israel because of the group’s attacks in lebanon more than 3670 people have been killed and at least 15400 injured since october 2023 according to lebanese authorities with more than one million forced from their homes over the past fortnight israel has intensified its campaign against hezbollah on sunday the israeli public broadcaster kan citing israeli and us officials reported that israel had given the green light to advance a usproposed ceasefire deal with lebanon but indicated some gaps remained",
    "summary": "Hezbollah fires rocket barrages into Israel after deadly Beirut strikesAlso on Sunday, Israeli media widely reported that Israel and Lebanon were moving towards a ceasefire agreement to end the fighting with the Iran-backed militia, Hezbollah.\nSeveral people were injured and buildings damaged in northern and central Israel, some of them near Tel Aviv, Israel's police said.\nFollowing reports of heavy fire from Lebanon, Israel's police said it had received reports of rocket debris falling in the Tel Aviv area.\nRockets fell in Petah Tikva, near Tel Aviv, and in some northern areas: Haifa, Nahariya and Kfar Blum, Israeli media reported.\nThe IDF has not commented on Saturday's attack, but Israeli media reported at the time that it was an attempt to kill Mohammed Haydar, a top Hezbollah official.",
    "keywords": [
      "deadly",
      "tel",
      "israeli",
      "barrages",
      "northern",
      "strikes",
      "lebanon",
      "beirut",
      "hezbollah",
      "israel",
      "media",
      "rocket",
      "reported",
      "fires",
      "aviv"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/fab0/live/dd6d08b0-aace-11ef-bdf5-b7cb2fa86e10.jpg"
  },
  "https://www.bbc.com/news/articles/cx2ypyr4742o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cx2ypyr4742o",
    "date": "2024-11-14",
    "time": "00:00:00",
    "title": "Meta fined €798m over 'unfair' Facebook Marketplace",
    "body": "Meta fined €798m over 'unfair' Facebook Marketplace\n\nMeta has been fined €798m (£664m) for breaking competition law by embedding Facebook Marketplace within its social network.\n\nThe European Commission said this meant alternative classified ads services had faced \"unfair trading conditions\", making it harder for them to compete.\n\nIn addition to the fine, it has ordered Meta to stop imposing these conditions on other services.\n\nMeta said it rejected the Commission's findings and would appeal.\n\nEU antitrust head Margrethe Vestager said Facebook had impeded other online classified ads service providers.\n\n\"It did so to benefit its own service Facebook Marketplace, thereby giving it advantages that other online classified ads service providers could not match,\" she added,\n\nShe said Meta \"must stop this behaviour\", with the EU asking the firm to \"refrain from repeating\" the infringement.\n\nMeta said the Commission had provided \"no evidence\" of harm either to competitors or consumers.\n\n\"This decision ignores the market realities, and will only serve to protect incumbent marketplaces from competition.\"\n\nThe ruling is the result of an investigation which the Commission opened in 2021, after Meta's rivals complained that Facebook Marketplace gave it an unfair advantage.",
    "clean_body": "meta fined €798m over unfair facebook marketplace meta has been fined €798m £664m for breaking competition law by embedding facebook marketplace within its social network the european commission said this meant alternative classified ads services had faced unfair trading conditions making it harder for them to compete in addition to the fine it has ordered meta to stop imposing these conditions on other services meta said it rejected the commissions findings and would appeal eu antitrust head margrethe vestager said facebook had impeded other online classified ads service providers it did so to benefit its own service facebook marketplace thereby giving it advantages that other online classified ads service providers could not match she added she said meta must stop this behaviour with the eu asking the firm to refrain from repeating the infringement meta said the commission had provided no evidence of harm either to competitors or consumers this decision ignores the market realities and will only serve to protect incumbent marketplaces from competition the ruling is the result of an investigation which the commission opened in 2021 after metas rivals complained that facebook marketplace gave it an unfair advantage",
    "summary": "Meta fined €798m over 'unfair' Facebook MarketplaceMeta has been fined €798m (£664m) for breaking competition law by embedding Facebook Marketplace within its social network.\nThe European Commission said this meant alternative classified ads services had faced \"unfair trading conditions\", making it harder for them to compete.\nIn addition to the fine, it has ordered Meta to stop imposing these conditions on other services.\nEU antitrust head Margrethe Vestager said Facebook had impeded other online classified ads service providers.\nThe ruling is the result of an investigation which the Commission opened in 2021, after Meta's rivals complained that Facebook Marketplace gave it an unfair advantage.",
    "keywords": [
      "online",
      "meta",
      "classified",
      "facebook",
      "service",
      "ads",
      "marketplace",
      "unfair",
      "commission",
      "stop",
      "798m",
      "fined"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3604/live/6bc43280-a29d-11ef-8ab9-9192db313061.jpg"
  },
  "https://www.bbc.com/news/articles/cx2l4dn802lo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cx2l4dn802lo",
    "date": "2024-11-17",
    "time": "00:00:00",
    "title": "China's Xi Jinping says he is ready to work with Trump in last meeting with Joe Biden",
    "body": "Xi says he will work with Trump in last meeting with Biden\n\n17 November 2024 Share Save Frances Mao BBC News Share Save\n\nReuters The leaders met on the sidelines of the Asia-Pacific Economic Cooperation summit in Peru on Saturday\n\nChinese leader Xi Jinping has pledged to work with incoming President Donald Trump in his final meeting with current US leader Joe Biden. But president Xi also took the opportunity to state China’s objectives in what appears to be a message to Donald Trump and the next administration in Washington. In a robust readout of the meeting released afterwards, Beijing said President Xi had underscored that \"a new Cold War should not be fought and cannot be won. Containing China is unwise, unacceptable and bound to fail\". Xi also said a stable relationship between China and the United States was \"critical to both parties and the world\".\n\nThe two met on Saturday on the sidelines of the annual Asia-Pacific Economic Cooperation (Apec) summit in Peru where they acknowledged \"ups and downs\" in relations over Biden's four years in office. Speaking at Saturday's meeting, which was held at President Xi's hotel in Lima, the leader said that if the US and China \"treat each other as opponents or enemies, engage in vicious competition and mutual harm, China-US relations will suffer setbacks or even regressions\". He added that Beijing's goal of a stable relationship with Washington would remain unchanged and that he would work with the new US administration \"to maintain communication, expand cooperation and manage differences.\" Biden, meanwhile, said strategic competition between the two global powers should not escalate into war. \"Our two countries cannot let any of this competition veer into conflict. That is our responsibility and over the last four years I think we've proven it's possible to have this relationship,\" he said. Both leaders highlighted progress in lowering tensions on issues such as trade and Taiwan. Analysts say US-China relations could become more volatile when Trump returns to office in two months, driven by factors including a promise to raise tariffs on Chinese imports. The president-elect has pledged 60% tariffs on all imports from China. He has also appointed prominent China hawks to top foreign and defence positions. During his first term, Trump labelled Beijing a “strategic competitor”. Relations worsened when he labelled Covid a “Chinese virus” during the pandemic.",
    "clean_body": "xi says he will work with trump in last meeting with biden 17 november 2024 share save frances mao bbc news share save reuters the leaders met on the sidelines of the asiapacific economic cooperation summit in peru on saturday chinese leader xi jinping has pledged to work with incoming president donald trump in his final meeting with current us leader joe biden but president xi also took the opportunity to state china’s objectives in what appears to be a message to donald trump and the next administration in washington in a robust readout of the meeting released afterwards beijing said president xi had underscored that a new cold war should not be fought and cannot be won containing china is unwise unacceptable and bound to fail xi also said a stable relationship between china and the united states was critical to both parties and the world the two met on saturday on the sidelines of the annual asiapacific economic cooperation apec summit in peru where they acknowledged ups and downs in relations over bidens four years in office speaking at saturdays meeting which was held at president xis hotel in lima the leader said that if the us and china treat each other as opponents or enemies engage in vicious competition and mutual harm chinaus relations will suffer setbacks or even regressions he added that beijings goal of a stable relationship with washington would remain unchanged and that he would work with the new us administration to maintain communication expand cooperation and manage differences biden meanwhile said strategic competition between the two global powers should not escalate into war our two countries cannot let any of this competition veer into conflict that is our responsibility and over the last four years i think weve proven its possible to have this relationship he said both leaders highlighted progress in lowering tensions on issues such as trade and taiwan analysts say uschina relations could become more volatile when trump returns to office in two months driven by factors including a promise to raise tariffs on chinese imports the presidentelect has pledged 60 tariffs on all imports from china he has also appointed prominent china hawks to top foreign and defence positions during his first term trump labelled beijing a “strategic competitor” relations worsened when he labelled covid a “chinese virus” during the pandemic",
    "summary": "Xi says he will work with Trump in last meeting with Biden17 November 2024 Share Save Frances Mao BBC News Share SaveReuters The leaders met on the sidelines of the Asia-Pacific Economic Cooperation summit in Peru on SaturdayChinese leader Xi Jinping has pledged to work with incoming President Donald Trump in his final meeting with current US leader Joe Biden.\nBut president Xi also took the opportunity to state China’s objectives in what appears to be a message to Donald Trump and the next administration in Washington.\nIn a robust readout of the meeting released afterwards, Beijing said President Xi had underscored that \"a new Cold War should not be fought and cannot be won.\nXi also said a stable relationship between China and the United States was \"critical to both parties and the world\".\nThat is our responsibility and over the last four years I think we've proven it's possible to have this relationship,\" he said.",
    "keywords": [
      "xi",
      "ready",
      "work",
      "jinping",
      "chinas",
      "china",
      "president",
      "leader",
      "trump",
      "relationship",
      "joe",
      "meeting",
      "biden",
      "relations",
      "cooperation"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/c9c6/live/224c3360-a4e5-11ef-9f37-ed0c7c7d2c31.png"
  },
  "https://www.bbc.com/news/articles/cx275kdzx1ko": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cx275kdzx1ko",
    "date": "2024-11-03",
    "time": "00:00:00",
    "title": "US woman in 1990 'killer clown' case released from prison",
    "body": "US woman in 1990 'killer clown' case released from prison\n\nAfter years of mystery and intrigue surrounding the killing, investigators tied Keen-Warren to the case and arrested her in 2017, though she maintains her innocence.\n\nLast year, Keen-Warren agreed to plead guilty to second degree murder charges. Authorities said she shot Marlene Warren while dressed up in a clown costume more than 30 years ago.\n\nSheila Keen-Warren, 61, spent 18 months in prison over her involvement in the infamous \"killer clown\" case.\n\nA women who pleaded guilty in the 1990 murder of her husband's previous wife in Florida has been released from prison.\n\nKeen-Warren was sentenced to 12 years in prison in 2023.\n\nHer release was not unexpected - Florida law offered her credit towards an early release for good behaviour.\n\n\"Sheila Keen-Warren will always be an admitted convicted murderer and will wear that stain for every day for the rest of her life,\" Palm Beach County State Attorney Dave Aronberg said in a statement Saturday to the Associated Press.\n\nKeen-Warren took the plea deal because she would be released quickly and might otherwise have faced a life sentence if the case went to trial, Greg Rosenfeld, Kenn-Warren's lawyer, told the Associated Press.\n\n\"We are absolutely thrilled that Ms. Keen-Warren has been released from prison and is returning to her family,\" Mr Rosenfeld told the news outlet. \"As we've stated from the beginning, she did not commit this crime.\"\n\nThe son of the victim, Joseph Ahrens, told authorities the doorbell rang at their family home and his mother answered the door to a person dressed as a clown. The person handed her some balloons and then shot her in the face.\n\nAuthorities said that Keen-Warren was having an affair with the victim's husband but it wasn't until DNA testing improved that investigators connected Keen-Warren to the crime.\n\nIn 2002, Keen-Warren married Michael Warren.",
    "clean_body": "us woman in 1990 killer clown case released from prison after years of mystery and intrigue surrounding the killing investigators tied keenwarren to the case and arrested her in 2017 though she maintains her innocence last year keenwarren agreed to plead guilty to second degree murder charges authorities said she shot marlene warren while dressed up in a clown costume more than 30 years ago sheila keenwarren 61 spent 18 months in prison over her involvement in the infamous killer clown case a women who pleaded guilty in the 1990 murder of her husbands previous wife in florida has been released from prison keenwarren was sentenced to 12 years in prison in 2023 her release was not unexpected florida law offered her credit towards an early release for good behaviour sheila keenwarren will always be an admitted convicted murderer and will wear that stain for every day for the rest of her life palm beach county state attorney dave aronberg said in a statement saturday to the associated press keenwarren took the plea deal because she would be released quickly and might otherwise have faced a life sentence if the case went to trial greg rosenfeld kennwarrens lawyer told the associated press we are absolutely thrilled that ms keenwarren has been released from prison and is returning to her family mr rosenfeld told the news outlet as weve stated from the beginning she did not commit this crime the son of the victim joseph ahrens told authorities the doorbell rang at their family home and his mother answered the door to a person dressed as a clown the person handed her some balloons and then shot her in the face authorities said that keenwarren was having an affair with the victims husband but it wasnt until dna testing improved that investigators connected keenwarren to the crime in 2002 keenwarren married michael warren",
    "summary": "US woman in 1990 'killer clown' case released from prisonAfter years of mystery and intrigue surrounding the killing, investigators tied Keen-Warren to the case and arrested her in 2017, though she maintains her innocence.\nAuthorities said she shot Marlene Warren while dressed up in a clown costume more than 30 years ago.\nSheila Keen-Warren, 61, spent 18 months in prison over her involvement in the infamous \"killer clown\" case.\nA women who pleaded guilty in the 1990 murder of her husband's previous wife in Florida has been released from prison.\n\"We are absolutely thrilled that Ms. Keen-Warren has been released from prison and is returning to her family,\" Mr Rosenfeld told the news outlet.",
    "keywords": [
      "keenwarren",
      "case",
      "prison",
      "clown",
      "killer",
      "told",
      "shot",
      "released",
      "rosenfeld",
      "warren",
      "woman",
      "1990",
      "release"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/1e78/live/5c5cd010-9a12-11ef-9852-95dc1d6e0bb6.jpg"
  },
  "https://www.bbc.com/news/articles/czr78x0e5yzo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/czr78x0e5yzo",
    "date": "2024-11-05",
    "time": "00:00:00",
    "title": "Hundreds of police officers sacked and barred for bad behaviour",
    "body": "Hundreds of police officers sacked for bad behaviour\n\nDishonesty was the most common reason for being kicked out of the police force, followed by sexual offences or misconduct and discriminatory behaviour.\n\nThe National Police Chiefs’ Council, a group of senior leaders who work together on important policing matters, has said it is committed to getting rid of officers who are not fit to serve the public.\n\nNearly 600 officers were dismissed from the service in the 12 months before March this year, up from almost 400 the previous year, according to the College of Policing.\n\nNew figures show a 50% rise in the number of police officers sacked and barred from returning to work in England and Wales.\n\nGroups of officers have been punished for sharing deeply offensive WhatsApp messages, while 18 were sacked for possessing indecent images of children and 33 for abusing their position for a sexual purpose.\n\nThe number of officers sacked - 593 - is less than 0.5% of the overall workforce of more than 147,000 across England and Wales.\n\nMost of those who lost their jobs were constables. More than three quarters of the officers and specials who were dismissed were male.\n\n\"These figures show that there is nowhere to hide for people who fail to meet the high standards set across our police forces,\" Assistant Chief Constable Tom Harding, operational standards director at the College of Policing, said.\n\n\"The service will continue working to ensure we attract the right people into policing, ensuring that those who fail to meet these high standards have no future in policing.\"\n\nThese figures come at a time when concerns remain high about the culture in UK policing following the murder of Sarah Everard by a serving officer in 2021.\n\nIn another case, former Metropolitan police sergeant David Carrick was jailed in 2023 after admitting dozens of rapes and sexual offences against 12 women over two decades.\n\nChief Constable Craig Guildford QPM, the National Police Chiefs’ Council's complaints lead, has stressed the importance of disciplinary hearings.\n\n“Misconduct proceedings provide a tightly regulated, balanced and transparent process to maintain public confidence in policing and ensure our workforce operates to the high standards of integrity our communities deserve,\" he said.",
    "clean_body": "hundreds of police officers sacked for bad behaviour dishonesty was the most common reason for being kicked out of the police force followed by sexual offences or misconduct and discriminatory behaviour the national police chiefs’ council a group of senior leaders who work together on important policing matters has said it is committed to getting rid of officers who are not fit to serve the public nearly 600 officers were dismissed from the service in the 12 months before march this year up from almost 400 the previous year according to the college of policing new figures show a 50 rise in the number of police officers sacked and barred from returning to work in england and wales groups of officers have been punished for sharing deeply offensive whatsapp messages while 18 were sacked for possessing indecent images of children and 33 for abusing their position for a sexual purpose the number of officers sacked 593 is less than 05 of the overall workforce of more than 147000 across england and wales most of those who lost their jobs were constables more than three quarters of the officers and specials who were dismissed were male these figures show that there is nowhere to hide for people who fail to meet the high standards set across our police forces assistant chief constable tom harding operational standards director at the college of policing said the service will continue working to ensure we attract the right people into policing ensuring that those who fail to meet these high standards have no future in policing these figures come at a time when concerns remain high about the culture in uk policing following the murder of sarah everard by a serving officer in 2021 in another case former metropolitan police sergeant david carrick was jailed in 2023 after admitting dozens of rapes and sexual offences against 12 women over two decades chief constable craig guildford qpm the national police chiefs’ councils complaints lead has stressed the importance of disciplinary hearings “misconduct proceedings provide a tightly regulated balanced and transparent process to maintain public confidence in policing and ensure our workforce operates to the high standards of integrity our communities deserve he said",
    "summary": "Hundreds of police officers sacked for bad behaviourDishonesty was the most common reason for being kicked out of the police force, followed by sexual offences or misconduct and discriminatory behaviour.\nNew figures show a 50% rise in the number of police officers sacked and barred from returning to work in England and Wales.\nThe number of officers sacked - 593 - is less than 0.5% of the overall workforce of more than 147,000 across England and Wales.\n\"The service will continue working to ensure we attract the right people into policing, ensuring that those who fail to meet these high standards have no future in policing.\"\nChief Constable Craig Guildford QPM, the National Police Chiefs’ Council's complaints lead, has stressed the importance of disciplinary hearings.",
    "keywords": [
      "workforce",
      "sexual",
      "figures",
      "work",
      "behaviour",
      "bad",
      "barred",
      "sacked",
      "service",
      "hundreds",
      "policing",
      "high",
      "officers",
      "standards"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/fcbf/live/d3adc6e0-9b68-11ef-82c3-45a801b7330b.jpg"
  },
  "https://www.bbc.com/news/articles/c9dln20ql4eo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c9dln20ql4eo",
    "date": "2024-11-18",
    "time": "00:00:00",
    "title": "Harshita Brella murder: Police tracing husband Pankaj Lamba",
    "body": "Police seek husband of murdered Harshita Brella\n\n18 November 2024 Share Save Harriet Heywood & Helen Burchell BBC News, Northamptonshire Share Save\n\nNorthamptonshire Police Police have released a photo of Pankaj Lamba, who they believe has fled the country\n\nPolice have said they are searching for the husband of Harshita Brella after her body was found in the boot of a car. They believe Pankaj Lamba murdered 24-year-old Ms Brella in Northamptonshire earlier this month. Mr Lamba is suspected to have fled the country after transporting her body by car to Ilford, east London. Ch Insp Paul Cash, from Northamptonshire Police, said: \"I urge anyone listening to or reading this statement, that if you saw anything suspicious in the past week or have any information, no matter how small, please contact us.\"\n\nNorthamptonshire Police Police say they will continue to appeal for any information to help piece together exactly what happened to Ms Brella\n\nMs Brella, from Corby, Northamptonshire, was found by officers in the early hours of Thursday in a vehicle on Brisbane Road, Ilford. Northamptonshire Police had been contacted on Wednesday regarding concerns for her welfare, which led to the discovery of her body and the launch of a murder investigation. The force said it had made a mandatory referral to the Independent Office for Police Conduct because there was previous contact with Ms Brella. Northamptonshire Telegraph first reported she was the subject of a domestic violence protection order, saying it was made in early September and lasted 28 days. Police have since confirmed the order had been in place before Ms Brella's death.\n\nMs Brella's body was found about 100 miles away from her home in Corby\n\nCh Insp Cash described her as a young woman in her early 20s, with her whole life ahead of her and everything to live for. \"It is absolutely tragic that her life has been cut short in this way,\" he said.\n\nNorthamptonshire Police More than 60 detectives are working on the case and are following numerous lines of inquiry\n\nThe East Midlands Special Operations Major Crime Unit and Northamptonshire Police are working with the Metropolitan Police to establish the circumstances behind Ms Brella’s death. This included determining the exact location and timeframe in which it took place, the unit said. Northamptonshire Police said a forensic post-mortem examination, which took place at Leicester Royal Infirmary on Friday, established Ms Brella was murdered. The force said there would be extra neighbourhood officer patrols in Corby in the coming days to reassure the public.\n\nOn Sunday, police were in the area where Ms Brella lived",
    "clean_body": "police seek husband of murdered harshita brella 18 november 2024 share save harriet heywood helen burchell bbc news northamptonshire share save northamptonshire police police have released a photo of pankaj lamba who they believe has fled the country police have said they are searching for the husband of harshita brella after her body was found in the boot of a car they believe pankaj lamba murdered 24yearold ms brella in northamptonshire earlier this month mr lamba is suspected to have fled the country after transporting her body by car to ilford east london ch insp paul cash from northamptonshire police said i urge anyone listening to or reading this statement that if you saw anything suspicious in the past week or have any information no matter how small please contact us northamptonshire police police say they will continue to appeal for any information to help piece together exactly what happened to ms brella ms brella from corby northamptonshire was found by officers in the early hours of thursday in a vehicle on brisbane road ilford northamptonshire police had been contacted on wednesday regarding concerns for her welfare which led to the discovery of her body and the launch of a murder investigation the force said it had made a mandatory referral to the independent office for police conduct because there was previous contact with ms brella northamptonshire telegraph first reported she was the subject of a domestic violence protection order saying it was made in early september and lasted 28 days police have since confirmed the order had been in place before ms brellas death ms brellas body was found about 100 miles away from her home in corby ch insp cash described her as a young woman in her early 20s with her whole life ahead of her and everything to live for it is absolutely tragic that her life has been cut short in this way he said northamptonshire police more than 60 detectives are working on the case and are following numerous lines of inquiry the east midlands special operations major crime unit and northamptonshire police are working with the metropolitan police to establish the circumstances behind ms brella’s death this included determining the exact location and timeframe in which it took place the unit said northamptonshire police said a forensic postmortem examination which took place at leicester royal infirmary on friday established ms brella was murdered the force said there would be extra neighbourhood officer patrols in corby in the coming days to reassure the public on sunday police were in the area where ms brella lived",
    "summary": "They believe Pankaj Lamba murdered 24-year-old Ms Brella in Northamptonshire earlier this month.\nThe force said it had made a mandatory referral to the Independent Office for Police Conduct because there was previous contact with Ms Brella.\nPolice have since confirmed the order had been in place before Ms Brella's death.\nNorthamptonshire Police said a forensic post-mortem examination, which took place at Leicester Royal Infirmary on Friday, established Ms Brella was murdered.\nOn Sunday, police were in the area where Ms Brella lived",
    "keywords": [
      "body",
      "working",
      "pankaj",
      "brella",
      "ms",
      "early",
      "brellas",
      "murdered",
      "tracing",
      "northamptonshire",
      "place",
      "murder",
      "lamba",
      "harshita",
      "husband"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/47ff/live/14a4b790-a5a9-11ef-bfe2-2bf0019b3b67.jpg"
  },
  "https://www.bbc.com/news/articles/c79z0vje935o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c79z0vje935o",
    "date": "2024-11-25",
    "time": "00:00:00",
    "title": "Russia and Ukraine trade missile and drone strikes",
    "body": "Russia and Ukraine trade missile and drone strikes\n\n25 November 2024 Share Save Robert Greenall BBC News Share Save\n\nKharkiv region emergencies department\n\nRussia and Ukraine have traded air strikes, after a week of intensifying rhetoric in which Russia tested a new missile on Ukraine. Russia has made close to 1,500 strikes on Ukraine since Sunday evening on about half of the country's regions causing dozens of injuries, Ukrainian President Volodymyr Zelensky said. Meanwhile Ukraine's military said it had struck a key oil depot south of Moscow, and targets in the Bryansk and Kursk border regions. Russia's use of the Oreshnik intermediate-range ballistic missile on the Ukrainian city of Dnipro capped a week of escalation in the war that also saw Ukraine fire US and British missiles into Russia for the first time.\n\nReuters Russian military bloggers say Atacms missiles were fired at an air base in Kursk region\n\nUS President Joe Biden is reported to have given Ukraine permission to use longer-range Atacms missiles against targets inside Russia as a response to Moscow's use of North Korean troops. Kharkiv Governor Oleh Synehubov said that 23 people had been injured in a missile strike on the city of Kharkiv, where a rescue operation was currently under way. An S-400 missile was used in the attack, he said. Odesa's emergencies department said 10 people had been injured in a missile attack, which damaged residential buildings, schools and a university sports hall. Regional officials said three more people were injured in strikes on Kherson region, and one each in Zaporizhzhya and Chernihiv regions.",
    "clean_body": "russia and ukraine trade missile and drone strikes 25 november 2024 share save robert greenall bbc news share save kharkiv region emergencies department russia and ukraine have traded air strikes after a week of intensifying rhetoric in which russia tested a new missile on ukraine russia has made close to 1500 strikes on ukraine since sunday evening on about half of the countrys regions causing dozens of injuries ukrainian president volodymyr zelensky said meanwhile ukraines military said it had struck a key oil depot south of moscow and targets in the bryansk and kursk border regions russias use of the oreshnik intermediaterange ballistic missile on the ukrainian city of dnipro capped a week of escalation in the war that also saw ukraine fire us and british missiles into russia for the first time reuters russian military bloggers say atacms missiles were fired at an air base in kursk region us president joe biden is reported to have given ukraine permission to use longerrange atacms missiles against targets inside russia as a response to moscows use of north korean troops kharkiv governor oleh synehubov said that 23 people had been injured in a missile strike on the city of kharkiv where a rescue operation was currently under way an s400 missile was used in the attack he said odesas emergencies department said 10 people had been injured in a missile attack which damaged residential buildings schools and a university sports hall regional officials said three more people were injured in strikes on kherson region and one each in zaporizhzhya and chernihiv regions",
    "summary": "Russia and Ukraine trade missile and drone strikes25 November 2024 Share Save Robert Greenall BBC News Share SaveKharkiv region emergencies departmentRussia and Ukraine have traded air strikes, after a week of intensifying rhetoric in which Russia tested a new missile on Ukraine.\nRussia has made close to 1,500 strikes on Ukraine since Sunday evening on about half of the country's regions causing dozens of injuries, Ukrainian President Volodymyr Zelensky said.\nRussia's use of the Oreshnik intermediate-range ballistic missile on the Ukrainian city of Dnipro capped a week of escalation in the war that also saw Ukraine fire US and British missiles into Russia for the first time.\nOdesa's emergencies department said 10 people had been injured in a missile attack, which damaged residential buildings, schools and a university sports hall.\nRegional officials said three more people were injured in strikes on Kherson region, and one each in Zaporizhzhya and Chernihiv regions.",
    "keywords": [
      "ukrainian",
      "russia",
      "missile",
      "week",
      "trade",
      "strikes",
      "drone",
      "ukraine",
      "regions",
      "targets",
      "injured",
      "missiles"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/7de0/live/3bff2770-ab22-11ef-8487-d5a0de19ffaf.jpg"
  },
  "https://www.bbc.com/news/articles/cy0l1ep34pro": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cy0l1ep34pro",
    "date": "2024-11-19",
    "time": "00:00:00",
    "title": "Israel hit part of Iran nuclear programme, Netanyahu says",
    "body": "Israel hit part of Iran's nuclear programme, Netanyahu says\n\nAxios reported last week that a “nuclear weapons research facility“ at Parchin was hit in late October\n\nThere was no immediate comment from Iran, but it has previously said the Israeli strikes caused limited damage to radar systems and that its nuclear activities are entirely peaceful.\n\nHe gave no details, but last week Axios reported that a “nuclear weapons research facility” making plastic explosives at the Parchin military complex was destroyed .\n\n“It’s not a secret. It was published,” Benjamin Netanyahu told the Israeli parliament. “There is a specific component in their nuclear programme that was hit.”\n\nIsrael’s prime minister says it hit part of Iran’s nuclear programme last month, despite pleas from the US not to do so during the strikes it carried out in response to a missile attack.\n\nIran has also insisted that it does not seek nuclear weapons, although evidence collected by the International Atomic Energy Agency (IAEA) suggests that until 2003 it conducted activities relevant to the development of a bomb. The agency says Iran has not yet answered outstanding questions related to its nuclear activity.\n\nThe IAEA also says Iran has produced enough highly enriched uranium to build several nuclear weapons since the US abandoned a nuclear deal and reinstated crippling sanctions six years ago with Netanyahu’s support.\n\nOn 26 October, the Israeli military announced it had conducted “precise strikes on military targets in Iran” in response to the 1 October attack that saw almost 200 ballistic missiles launched towards Israel.\n\nThe military said the targets included missile manufacturing facilities, as well as surface-to-air missile arrays and aerial capabilities intended to restrict Israel’s freedom of operation inside Iran.\n\nIran’s military said the attacks caused “limited and minor damage” to several radar systems and that four Iranian military officers and one civilian were killed. Iran’s Supreme Leader, Ayatollah Ali Khamenei, said the effect of the attacks should not be “magnified or downplayed”.\n\nSatellite images analysed by the BBC showed damage to four structures at Parchin, about 30km (18.5 miles) east of Tehran.\n\nExperts from the Institute for Science and International Security said three of the structures were related to missile production, and that the fourth, known as Taleghan 2, was previously involved in high explosive testing related to the development of nuclear weapons.\n\nAxios’s report cited unnamed US and Israeli officials as saying that intelligence services had detected recent activity at the Taleghan 2 facility that was “part of an effort inside the Iranian government to conduct research that could be used for the development of nuclear weapons but could also be presented as research for civilian purposes”.\n\nOne former Israeli official said the strike destroyed “sophisticated equipment used to design the plastic explosives that surround uranium in a nuclear device and are needed to detonate it”, according to the report.\n\nBenjamin Netanyahu told Israel’s parliament that “a nuclear Iran poses a massive threat to our existence, to the peace agreements we aim to achieve with more of our neighbours and to global peace”.\n\n“We will be tested on our ability to thwart their nuclear ambitions,” he added.\n\nHe then mentioned the attack on the “specific component” of Iran’s nuclear programme before warning that the “programme itself, its capacity to act here, has not yet been thwarted”.\n\nBefore the Israeli strikes took place, US President Joe Biden had said publicly that he did not support attacks on Iran’s nuclear or oil facilities.\n\nPresident-elect Donald Trump, who is expected to take a harder line with Iran when he takes office in January, meanwhile said he had advised Netanyahu to “hit the nuclear first and worry about the rest later”.\n\nLast week, Iranian President Massoud Pezeshkian told the head of the IAEA, Rafael Grossi, that Iran was committed to resolving “doubts and ambiguities” surrounding its nuclear activities.\n\nMr Grossi visited Tehran ahead of a meeting of the IAEA’s board of governors this week, at which the UK, France and Germany are expected to pass a resolution critical of Iran’s co-operation.\n\nIranian Foreign Minister Abbas Araqchi warned that Tehran would \"take countermeasures and new actions in our nuclear programme\" in response to any such resolution.\n\nHe also strongly denied media reports that Iran’s ambassador to the UN, Amir Saeed Iravani, had met Trump ally Elon Musk to defuse US-Iran tensions.\n\n“We are still waiting for the new US administration to clarify its policies, and based on that, we will adjust our own policies. Right now, it is neither the time for such meetings nor is it appropriate,\" he said.",
    "clean_body": "israel hit part of irans nuclear programme netanyahu says axios reported last week that a “nuclear weapons research facility“ at parchin was hit in late october there was no immediate comment from iran but it has previously said the israeli strikes caused limited damage to radar systems and that its nuclear activities are entirely peaceful he gave no details but last week axios reported that a “nuclear weapons research facility” making plastic explosives at the parchin military complex was destroyed “it’s not a secret it was published” benjamin netanyahu told the israeli parliament “there is a specific component in their nuclear programme that was hit” israel’s prime minister says it hit part of iran’s nuclear programme last month despite pleas from the us not to do so during the strikes it carried out in response to a missile attack iran has also insisted that it does not seek nuclear weapons although evidence collected by the international atomic energy agency iaea suggests that until 2003 it conducted activities relevant to the development of a bomb the agency says iran has not yet answered outstanding questions related to its nuclear activity the iaea also says iran has produced enough highly enriched uranium to build several nuclear weapons since the us abandoned a nuclear deal and reinstated crippling sanctions six years ago with netanyahu’s support on 26 october the israeli military announced it had conducted “precise strikes on military targets in iran” in response to the 1 october attack that saw almost 200 ballistic missiles launched towards israel the military said the targets included missile manufacturing facilities as well as surfacetoair missile arrays and aerial capabilities intended to restrict israel’s freedom of operation inside iran iran’s military said the attacks caused “limited and minor damage” to several radar systems and that four iranian military officers and one civilian were killed iran’s supreme leader ayatollah ali khamenei said the effect of the attacks should not be “magnified or downplayed” satellite images analysed by the bbc showed damage to four structures at parchin about 30km 185 miles east of tehran experts from the institute for science and international security said three of the structures were related to missile production and that the fourth known as taleghan 2 was previously involved in high explosive testing related to the development of nuclear weapons axios’s report cited unnamed us and israeli officials as saying that intelligence services had detected recent activity at the taleghan 2 facility that was “part of an effort inside the iranian government to conduct research that could be used for the development of nuclear weapons but could also be presented as research for civilian purposes” one former israeli official said the strike destroyed “sophisticated equipment used to design the plastic explosives that surround uranium in a nuclear device and are needed to detonate it” according to the report benjamin netanyahu told israel’s parliament that “a nuclear iran poses a massive threat to our existence to the peace agreements we aim to achieve with more of our neighbours and to global peace” “we will be tested on our ability to thwart their nuclear ambitions” he added he then mentioned the attack on the “specific component” of iran’s nuclear programme before warning that the “programme itself its capacity to act here has not yet been thwarted” before the israeli strikes took place us president joe biden had said publicly that he did not support attacks on iran’s nuclear or oil facilities presidentelect donald trump who is expected to take a harder line with iran when he takes office in january meanwhile said he had advised netanyahu to “hit the nuclear first and worry about the rest later” last week iranian president massoud pezeshkian told the head of the iaea rafael grossi that iran was committed to resolving “doubts and ambiguities” surrounding its nuclear activities mr grossi visited tehran ahead of a meeting of the iaea’s board of governors this week at which the uk france and germany are expected to pass a resolution critical of iran’s cooperation iranian foreign minister abbas araqchi warned that tehran would take countermeasures and new actions in our nuclear programme in response to any such resolution he also strongly denied media reports that iran’s ambassador to the un amir saeed iravani had met trump ally elon musk to defuse usiran tensions “we are still waiting for the new us administration to clarify its policies and based on that we will adjust our own policies right now it is neither the time for such meetings nor is it appropriate he said",
    "summary": "Israel hit part of Iran's nuclear programme, Netanyahu saysAxios reported last week that a “nuclear weapons research facility“ at Parchin was hit in late OctoberThere was no immediate comment from Iran, but it has previously said the Israeli strikes caused limited damage to radar systems and that its nuclear activities are entirely peaceful.\n“There is a specific component in their nuclear programme that was hit.”Israel’s prime minister says it hit part of Iran’s nuclear programme last month, despite pleas from the US not to do so during the strikes it carried out in response to a missile attack.\nBenjamin Netanyahu told Israel’s parliament that “a nuclear Iran poses a massive threat to our existence, to the peace agreements we aim to achieve with more of our neighbours and to global peace”.\nHe then mentioned the attack on the “specific component” of Iran’s nuclear programme before warning that the “programme itself, its capacity to act here, has not yet been thwarted”.\nIranian Foreign Minister Abbas Araqchi warned that Tehran would \"take countermeasures and new actions in our nuclear programme\" in response to any such resolution.",
    "keywords": [
      "research",
      "military",
      "week",
      "israeli",
      "programme",
      "nuclear",
      "hit",
      "strikes",
      "irans",
      "netanyahu",
      "israel",
      "weapons",
      "iran"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/0c43/live/08bfaf70-a671-11ef-ab08-d557dc688749.jpg"
  },
  "https://www.bbc.com/news/articles/c0enx32z5d1o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c0enx32z5d1o",
    "date": "2024-11-12",
    "time": "00:00:00",
    "title": "Megan Fox and Machine Gun Kelly expecting first child",
    "body": "Megan Fox expecting first child with Machine Gun Kelly\n\nMegan Fox has announced she and US rapper Machine Gun Kelly are expecting their first child together.\n\nThe Transformers actress tagged the musician in a photo which showed her kneeling, covered in a black substance and cradling a baby bump.\n\nFox, who last year revealed that a previous pregnancy had ended in a miscarriage, also posted a picture of a positive pregnancy test alongside the portrait.\n\nThe actress, who has been dating Kelly since 2020, captioned the images with: \"Nothing is ever really lost. welcome back\".",
    "clean_body": "megan fox expecting first child with machine gun kelly megan fox has announced she and us rapper machine gun kelly are expecting their first child together the transformers actress tagged the musician in a photo which showed her kneeling covered in a black substance and cradling a baby bump fox who last year revealed that a previous pregnancy had ended in a miscarriage also posted a picture of a positive pregnancy test alongside the portrait the actress who has been dating kelly since 2020 captioned the images with nothing is ever really lost welcome back",
    "summary": "Megan Fox expecting first child with Machine Gun KellyMegan Fox has announced she and US rapper Machine Gun Kelly are expecting their first child together.\nThe Transformers actress tagged the musician in a photo which showed her kneeling, covered in a black substance and cradling a baby bump.\nFox, who last year revealed that a previous pregnancy had ended in a miscarriage, also posted a picture of a positive pregnancy test alongside the portrait.\nThe actress, who has been dating Kelly since 2020, captioned the images with: \"Nothing is ever really lost.\nwelcome back\".",
    "keywords": [
      "machine",
      "transformers",
      "welcome",
      "megan",
      "fox",
      "actress",
      "expecting",
      "child",
      "gun",
      "kelly",
      "pregnancy"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/d886/live/aec5a1f0-a0e4-11ef-ab9e-0f3465e07d68.jpg"
  },
  "https://www.bbc.com/news/articles/crr91nn9n79o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/crr91nn9n79o",
    "date": "2024-11-19",
    "time": "00:00:00",
    "title": "Russia vows 'tangible' response if US missiles used against its territory",
    "body": "Russia vows 'tangible' response if US missiles used against its territory\n\n19 November 2024 Share Save Paulin Kola BBC News Share Save\n\nREX/Shutterstock The Russian foreign ministry issued a statement on Monday\n\nRussia says the use of US long-range missiles by Ukraine will lead to \"an appropriate and tangible\" response. Such an attack inside Russian territory \"would represent the direct involvement of the United States and its satellites in hostilities against Russia\", a foreign ministry statement said. President Joe Biden approved the use of the missiles on targets in Russia in a major change of US policy - two months before he is due to leave the White House. It is not clear if his successor, President-elect Donald Trump, was consulted or whether he will stick by the decision, having promised to end the Russia-Ukraine war.\n\nUkraine has had US ATACMS (Army Tactical Missile System) with a range of 300km (190 miles) - as well as French and British Storm Shadow missiles of a similar range - but the Western allies had barred Kyiv from hitting Russia with them. Biden's decision to lift that condition is a significant moment in the war, which marks its 1,000th day on Tuesday. Russia launched a full-scale invasion of Ukraine on 24 February 2022. Moscow has now intensified attacks on Ukrainian infrastructure as the sides appear to have reached a stalemate on the battlefield. Could missiles change the course of the war?\n\nRosenberg: Fury in Russia\n\nWhat we know about North Korean soldiers in Russia\n\nUkraine in maps: Tracking the war with Russia The US decision also follows the arrival in Russia's western Kursk region - where Ukrainian forces captured and are holding onto a small piece of territory - of more than 10,000 troops from North Korea to help President Vladimir Putin's forces. Unconfirmed reports say North Korea may send as many as 100,000 soldiers, in addition to artillery and other weapons to its ally.\n\nUkraine's President Volodymyr Zelensky has indicated there may be no formal announcement of the US deal - \"the missiles will speak for themselves,\" he said on Sunday. Ukraine may use the ATACMS in Kursk first - in fact some reports suggest the US may have restricted their use there as a signal to North Korea to stop sending aid to Russia and to Moscow itself. Biden's approval of the long-range missiles - which may be followed by similar authorisations by the UK and France - is being seen in the West as a way of signalling to the Russian leader that he cannot win the Ukraine war militarily. Putin has not commented on the latest move. In September, the Russian leader said the use of such missiles by Ukraine would represent the \"direct participation\" of Nato countries in the war. On Monday, Putin's spokesman said the US was \"adding oil to the fire\". But Jon Finer, US deputy national security adviser, said Washington had made it \"clear to the Russians that we would respond\" - both to the presence of North Korean forces and the \"major escalation\" in Russian aerial attacks on infrastructure across Ukraine. The weekend saw intense Russian attacks against Ukraine's power grid, causing large-scale blackouts. Several people were killed or injured. On Monday, a Russian strike on Odesa killed another 10 people and injured nearly 50.",
    "clean_body": "russia vows tangible response if us missiles used against its territory 19 november 2024 share save paulin kola bbc news share save rexshutterstock the russian foreign ministry issued a statement on monday russia says the use of us longrange missiles by ukraine will lead to an appropriate and tangible response such an attack inside russian territory would represent the direct involvement of the united states and its satellites in hostilities against russia a foreign ministry statement said president joe biden approved the use of the missiles on targets in russia in a major change of us policy two months before he is due to leave the white house it is not clear if his successor presidentelect donald trump was consulted or whether he will stick by the decision having promised to end the russiaukraine war ukraine has had us atacms army tactical missile system with a range of 300km 190 miles as well as french and british storm shadow missiles of a similar range but the western allies had barred kyiv from hitting russia with them bidens decision to lift that condition is a significant moment in the war which marks its 1000th day on tuesday russia launched a fullscale invasion of ukraine on 24 february 2022 moscow has now intensified attacks on ukrainian infrastructure as the sides appear to have reached a stalemate on the battlefield could missiles change the course of the war rosenberg fury in russia what we know about north korean soldiers in russia ukraine in maps tracking the war with russia the us decision also follows the arrival in russias western kursk region where ukrainian forces captured and are holding onto a small piece of territory of more than 10000 troops from north korea to help president vladimir putins forces unconfirmed reports say north korea may send as many as 100000 soldiers in addition to artillery and other weapons to its ally ukraines president volodymyr zelensky has indicated there may be no formal announcement of the us deal the missiles will speak for themselves he said on sunday ukraine may use the atacms in kursk first in fact some reports suggest the us may have restricted their use there as a signal to north korea to stop sending aid to russia and to moscow itself bidens approval of the longrange missiles which may be followed by similar authorisations by the uk and france is being seen in the west as a way of signalling to the russian leader that he cannot win the ukraine war militarily putin has not commented on the latest move in september the russian leader said the use of such missiles by ukraine would represent the direct participation of nato countries in the war on monday putins spokesman said the us was adding oil to the fire but jon finer us deputy national security adviser said washington had made it clear to the russians that we would respond both to the presence of north korean forces and the major escalation in russian aerial attacks on infrastructure across ukraine the weekend saw intense russian attacks against ukraines power grid causing largescale blackouts several people were killed or injured on monday a russian strike on odesa killed another 10 people and injured nearly 50",
    "summary": "Russia vows 'tangible' response if US missiles used against its territory19 November 2024 Share Save Paulin Kola BBC News Share SaveREX/Shutterstock The Russian foreign ministry issued a statement on MondayRussia says the use of US long-range missiles by Ukraine will lead to \"an appropriate and tangible\" response.\nSuch an attack inside Russian territory \"would represent the direct involvement of the United States and its satellites in hostilities against Russia\", a foreign ministry statement said.\nBiden's decision to lift that condition is a significant moment in the war, which marks its 1,000th day on Tuesday.\nUnconfirmed reports say North Korea may send as many as 100,000 soldiers, in addition to artillery and other weapons to its ally.\nIn September, the Russian leader said the use of such missiles by Ukraine would represent the \"direct participation\" of Nato countries in the war.",
    "keywords": [
      "forces",
      "used",
      "war",
      "russia",
      "president",
      "korea",
      "russian",
      "decision",
      "tangible",
      "ukraine",
      "north",
      "response",
      "missiles",
      "territory",
      "vows"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/0e66/live/78787020-a678-11ef-9594-01270c2bfaac.jpg"
  },
  "https://www.bbc.com/news/articles/crezr3ydpwjo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/crezr3ydpwjo",
    "date": "2024-11-25",
    "time": "00:00:00",
    "title": "New film to mark Bradford Valley Parade fire tragedy anniversary",
    "body": "New film to mark Bradford fire tragedy anniversary\n\n25 November 2024 Share Save Hayley Coyle BBC News, Yorkshire Share Save\n\nBBC The wooden stand at Bradford City's Valley Parade ground became engulfed in just four minutes\n\nA new documentary marking the 40th anniversary of the Bradford City stadium fire, which claimed the lives of 56 people, will be released next year, the BBC has said. The blaze broke out in one of the wooden stands at the club's Valley Parade ground on 11 May 1985 during a match between Bradford and Lincoln. The new film, with a working title of Unforgotten: The Bradford City Fire, would feature the personal testimonies of those who were there, many of whom would be speaking for the first time, according to the BBC. Jaimie D’Cruz, executive producer, said because the tragedy was in danger of fading from memory, it was a \"privilege and a responsibility\" to make the documentary.\n\nIt is believed the fire, which caused the deaths of 54 Bradford fans and two Lincoln fans, and which left more than 260 people injured, was caused by a discarded cigarette. The stand where the fire broke out had been officially condemned and was due to be demolished and replaced with a steel structure.\n\n'Collective memory'\n\nThe creators of the documentary said it would combine \"extraordinary access\" to the people who survived, as well as family members of the bereaved and members of the emergency crews who attended the scene. The aim of the film was to celebrate \"community, resilience and collective memory\" and the strength of the human spirit in the wake of such devastation, they said. Simon Young, BBC Head of Commissioning, History, said: “This film gets at the heart of a modern dilemma: in a world where everything is recorded on film, how do we sensitively remember and commemorate?\" \"What should remain off limits? And how do we ensure that a tragedy is marked and the lessons learned for future generations?\" he asked. Mr Young said it was an \"honour\" to be working on the project with the people of Bradford \"to ensure this anniversary is not forgotten\".\n\nFloral tributes were left after the disaster that left 56 dead on 11 May 1985",
    "clean_body": "new film to mark bradford fire tragedy anniversary 25 november 2024 share save hayley coyle bbc news yorkshire share save bbc the wooden stand at bradford citys valley parade ground became engulfed in just four minutes a new documentary marking the 40th anniversary of the bradford city stadium fire which claimed the lives of 56 people will be released next year the bbc has said the blaze broke out in one of the wooden stands at the clubs valley parade ground on 11 may 1985 during a match between bradford and lincoln the new film with a working title of unforgotten the bradford city fire would feature the personal testimonies of those who were there many of whom would be speaking for the first time according to the bbc jaimie d’cruz executive producer said because the tragedy was in danger of fading from memory it was a privilege and a responsibility to make the documentary it is believed the fire which caused the deaths of 54 bradford fans and two lincoln fans and which left more than 260 people injured was caused by a discarded cigarette the stand where the fire broke out had been officially condemned and was due to be demolished and replaced with a steel structure collective memory the creators of the documentary said it would combine extraordinary access to the people who survived as well as family members of the bereaved and members of the emergency crews who attended the scene the aim of the film was to celebrate community resilience and collective memory and the strength of the human spirit in the wake of such devastation they said simon young bbc head of commissioning history said “this film gets at the heart of a modern dilemma in a world where everything is recorded on film how do we sensitively remember and commemorate what should remain off limits and how do we ensure that a tragedy is marked and the lessons learned for future generations he asked mr young said it was an honour to be working on the project with the people of bradford to ensure this anniversary is not forgotten floral tributes were left after the disaster that left 56 dead on 11 may 1985",
    "summary": "New film to mark Bradford fire tragedy anniversary25 November 2024 Share Save Hayley Coyle BBC News, Yorkshire Share SaveBBC The wooden stand at Bradford City's Valley Parade ground became engulfed in just four minutesA new documentary marking the 40th anniversary of the Bradford City stadium fire, which claimed the lives of 56 people, will be released next year, the BBC has said.\nThe blaze broke out in one of the wooden stands at the club's Valley Parade ground on 11 May 1985 during a match between Bradford and Lincoln.\nSimon Young, BBC Head of Commissioning, History, said: “This film gets at the heart of a modern dilemma: in a world where everything is recorded on film, how do we sensitively remember and commemorate?\"\nAnd how do we ensure that a tragedy is marked and the lessons learned for future generations?\"\nMr Young said it was an \"honour\" to be working on the project with the people of Bradford \"to ensure this anniversary is not forgotten\".",
    "keywords": [
      "bbc",
      "bradford",
      "working",
      "anniversary",
      "stand",
      "left",
      "mark",
      "parade",
      "wooden",
      "film",
      "young",
      "valley",
      "tragedy"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/6f2f/live/eb9326b0-ab44-11ef-bc5a-77e18f986f00.jpg"
  },
  "https://www.bbc.com/news/articles/c20ng49373ro": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c20ng49373ro",
    "date": "2024-11-14",
    "time": "00:00:00",
    "title": "Charles Manson spoke of more killings in prison tapes",
    "body": "Charles Manson spoke of more killings in prison tapes\n\n14 November 2024 Share Save George Wright BBC News Share Save\n\nGetty Images Manson's followers, known as the Manson Family, killed nine people in 1969\n\nA new recording has emerged of notorious cult leader Charles Manson appearing to admit to additional killings. Manson's followers, known as the Manson Family, killed nine people in 1969. The cult leader directed the killings in the hope they would start a race war. He died in prison in 2017. In newly released audio recorded while he was in jail and featured in a new documentary, Manson appears to speak about previously unknown killings.\n\n“See, there’s a whole part of my life that nobody knows about,” Manson is heard saying in one of the tapes, which feature in a new documentary series Making Manson. “I lived in Mexico for a while. I went to Acapulco, stole some cars. I just got involved in stuff over my head, man. Got involved in a couple of killings. I left my .357 Magnum in Mexico City, and I left some dead people on the beach.” Associates of Manson, as well as his former cellmate, Phil Kaufman, are also interviewed. “Charlie was very good at being evil and not showing it,” says Mr Kaufman in the series teaser. “Anything that detracted from his game plan at that time, he would squash it, but he did it with velvet gloves.” In the series, Manson \"recounts the early crimes that led to the murder spree in the summer of ‘69\", according to the Peacock streaming service.\n\nGetty Images Manson died of natural causes behind bars in 2017",
    "clean_body": "charles manson spoke of more killings in prison tapes 14 november 2024 share save george wright bbc news share save getty images mansons followers known as the manson family killed nine people in 1969 a new recording has emerged of notorious cult leader charles manson appearing to admit to additional killings mansons followers known as the manson family killed nine people in 1969 the cult leader directed the killings in the hope they would start a race war he died in prison in 2017 in newly released audio recorded while he was in jail and featured in a new documentary manson appears to speak about previously unknown killings “see there’s a whole part of my life that nobody knows about” manson is heard saying in one of the tapes which feature in a new documentary series making manson “i lived in mexico for a while i went to acapulco stole some cars i just got involved in stuff over my head man got involved in a couple of killings i left my 357 magnum in mexico city and i left some dead people on the beach” associates of manson as well as his former cellmate phil kaufman are also interviewed “charlie was very good at being evil and not showing it” says mr kaufman in the series teaser “anything that detracted from his game plan at that time he would squash it but he did it with velvet gloves” in the series manson recounts the early crimes that led to the murder spree in the summer of ‘69 according to the peacock streaming service getty images manson died of natural causes behind bars in 2017",
    "summary": "Charles Manson spoke of more killings in prison tapes14 November 2024 Share Save George Wright BBC News Share SaveGetty Images Manson's followers, known as the Manson Family, killed nine people in 1969A new recording has emerged of notorious cult leader Charles Manson appearing to admit to additional killings.\nManson's followers, known as the Manson Family, killed nine people in 1969.\nThe cult leader directed the killings in the hope they would start a race war.\nIn newly released audio recorded while he was in jail and featured in a new documentary, Manson appears to speak about previously unknown killings.\n“See, there’s a whole part of my life that nobody knows about,” Manson is heard saying in one of the tapes, which feature in a new documentary series Making Manson.",
    "keywords": [
      "charles",
      "known",
      "share",
      "prison",
      "leader",
      "manson",
      "left",
      "spoke",
      "killings",
      "series",
      "mexico",
      "mansons",
      "tapes"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/6100/live/535ad2c0-a271-11ef-8f42-3b1b720c6f90.jpg"
  },
  "https://www.bbc.com/news/articles/c5yr9dpp99no": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c5yr9dpp99no",
    "date": "2024-11-14",
    "time": "00:00:00",
    "title": "US man faked kayaking death and fled to Europe, authorities say",
    "body": "Authorities say US man faked kayaking death and fled to Europe\n\nOfficials found evidence that Mr Borgwardt had used his passport after his disappearance and may have travelled to Europe.\n\nRyan Borgwardt, 45, a married father of three, was last seen on 12 August at Green Lake while on a solo fishing trip.\n\n“We believe that he is alive. We know that he's not in our lake,” Matthew Vande Kolk, Chief Deputy Sheriff for Green Lake County, told the BBC.\n\nAuthorities in Green Lake, Wisconsin, say that a local man who went missing while kayaking this summer may have staged his own death and fled to Europe.\n\nMr Borgwardt had last texted his wife on the night of 11 August. The message said he was turning his kayak around and heading to shore soon.\n\nBut when he failed to return home, his family contacted law enforcement who sent out a search-and-rescue team, which found his capsized kayak and life jacket on the lake.\n\nMr Borgwardt’s car, trailer, fishing rod and wallet were all left at the park nearby.\n\nAfter 54 days of extensive search efforts of divers, drones, sonar and cadaver dogs, no body was recovered and no evidence turned up.\n\nThat caused the sheriff's office to widen its scope.\n\nThe case took a turn in October when investigators discovered Mr Borgwardt's name had been checked by border officials in Canada on 13 August, the day after he was reported missing.\n\nInvestigators then learned that Mr Borgwardt had reported his passport lost or stolen and was issued a new one prior to his disappearance.\n\nHis previous passport was later recovered from his wife, indicating he may have travelled on the new document.\n\nFollowing this lead, officials conducted a digital forensic analysis of Mr Borgwardt’s laptop, and they found that he had taken out a $375,000 life insurance policy, had transferred funds to a foreign bank account, photographed his new passport, and altered his email address before he vanished.\n\nAnd after doing this, they discovered that Mr Borgwardt had replaced the laptop’s hard drive and cleared his browser history the day he disappeared.\n\nAuthorities also found indications that he may have traveled to a location in Europe.\n\nWhile the investigation continues, the sheriff’s office told the BBC they are evaluating the appropriate criminal charges that could include obstruction and fraudulent activity.\n\nBorgwardt’s family is cooperating and the chief deputy sheriff said his wife has been “extremely strong.”\n\n“She has done everything that we have asked of her in regards to helping us with information, and holding on to information,\" Mr Vande Kolk told the BBC. \"Unfortunately, we had to keep this quiet for about a month from the time that we started thinking that he was somewhere else, until we had enough information that we could share with the world, and she did that.”\n\n“Our hope is then, at some point we'll be able to hold Ryan accountable for his actions and request restitution,” he added.\n\nAuthorities said that they are continuing to look for Mr. Borgwardt, who they believe is alive and in Eastern Europe, and anyone who may have assisted him in faking his death and fleeing.",
    "clean_body": "authorities say us man faked kayaking death and fled to europe officials found evidence that mr borgwardt had used his passport after his disappearance and may have travelled to europe ryan borgwardt 45 a married father of three was last seen on 12 august at green lake while on a solo fishing trip “we believe that he is alive we know that hes not in our lake” matthew vande kolk chief deputy sheriff for green lake county told the bbc authorities in green lake wisconsin say that a local man who went missing while kayaking this summer may have staged his own death and fled to europe mr borgwardt had last texted his wife on the night of 11 august the message said he was turning his kayak around and heading to shore soon but when he failed to return home his family contacted law enforcement who sent out a searchandrescue team which found his capsized kayak and life jacket on the lake mr borgwardt’s car trailer fishing rod and wallet were all left at the park nearby after 54 days of extensive search efforts of divers drones sonar and cadaver dogs no body was recovered and no evidence turned up that caused the sheriffs office to widen its scope the case took a turn in october when investigators discovered mr borgwardts name had been checked by border officials in canada on 13 august the day after he was reported missing investigators then learned that mr borgwardt had reported his passport lost or stolen and was issued a new one prior to his disappearance his previous passport was later recovered from his wife indicating he may have travelled on the new document following this lead officials conducted a digital forensic analysis of mr borgwardt’s laptop and they found that he had taken out a 375000 life insurance policy had transferred funds to a foreign bank account photographed his new passport and altered his email address before he vanished and after doing this they discovered that mr borgwardt had replaced the laptop’s hard drive and cleared his browser history the day he disappeared authorities also found indications that he may have traveled to a location in europe while the investigation continues the sheriff’s office told the bbc they are evaluating the appropriate criminal charges that could include obstruction and fraudulent activity borgwardt’s family is cooperating and the chief deputy sheriff said his wife has been “extremely strong” “she has done everything that we have asked of her in regards to helping us with information and holding on to information mr vande kolk told the bbc unfortunately we had to keep this quiet for about a month from the time that we started thinking that he was somewhere else until we had enough information that we could share with the world and she did that” “our hope is then at some point well be able to hold ryan accountable for his actions and request restitution” he added authorities said that they are continuing to look for mr borgwardt who they believe is alive and in eastern europe and anyone who may have assisted him in faking his death and fleeing",
    "summary": "Authorities say US man faked kayaking death and fled to EuropeOfficials found evidence that Mr Borgwardt had used his passport after his disappearance and may have travelled to Europe.\nWe know that he's not in our lake,” Matthew Vande Kolk, Chief Deputy Sheriff for Green Lake County, told the BBC.\nAuthorities in Green Lake, Wisconsin, say that a local man who went missing while kayaking this summer may have staged his own death and fled to Europe.\nMr Borgwardt’s car, trailer, fishing rod and wallet were all left at the park nearby.\nAnd after doing this, they discovered that Mr Borgwardt had replaced the laptop’s hard drive and cleared his browser history the day he disappeared.",
    "keywords": [
      "say",
      "kayaking",
      "green",
      "lake",
      "fled",
      "death",
      "told",
      "faked",
      "man",
      "borgwardt",
      "passport",
      "borgwardts",
      "europe",
      "authorities",
      "mr",
      "information",
      "wife"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/9016/live/3bd74220-a224-11ef-8c9a-cbc4cc82e48d.jpg"
  },
  "https://www.bbc.com/news/articles/c8rl6jp78dyo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c8rl6jp78dyo",
    "date": "2024-11-25",
    "time": "00:00:00",
    "title": "British man captured by Russia while fighting with Ukraine",
    "body": "British man captured while fighting with Ukraine\n\nThe foreign secretary said: \"We will do all we can to offer this UK national all the support we can.\"\n\nRussian state news agency Tass quotes a military source saying that what they call a \"UK mercenary\" has been \"taken prisoner in the Kursk area\" of Russia, part of which Ukraine has held since launching a surprise offensive in August.\n\nIn a video circulating online, a man dressed in military clothing identifies himself as James Scott Rhys Anderson, 22, and says he formerly served in the British Army.\n\nA British man has been captured by Russian forces while fighting for Ukraine, according to reports.\n\nAsked about reports of Mr Anderson's capture, David Lammy said he had \"been updated about that development in the last couple of days\".\n\nScott Anderson, Mr Anderson's father, said he had begged his son not to go to Ukraine.\n\n\"He wanted to go out there because he thought he was doing what was right,\" Mr Anderson told the Daily Mail.\n\n\"I’m hoping he’ll be used as a bargaining chip, but my son told me they torture their prisoners and I’m so frightened he’ll be tortured.\"\n\nMr Anderson said he was sent the video by his son’s commander and was left \"in complete shock and tears\".\n\n\"I could see straight away it was him. He looks frightened, scared and worried,\" he added.\n\nIn the video, first posted to the Telegram messaging platform, Mr Anderson tells a man questioning him from behind a camera that he served as a private in the British Army from 2019 to 2023.\n\nHe says he joined the Ukraine's International Legion - a military unit made up of foreign volunteers - after losing his job and seeing reports on television about the war.\n\nHe says he flew to Krakow in Poland from Luton and travelled from there by bus to the Ukrainian border.\n\nUkraine launched a surprise attack into Kursk on 6 August, advancing up to 18 miles (29km) and taking control of around 1,000 square kilometres of Russian territory.\n\nRussia has deployed some 50,000 troops to the region, and has begun retaking territory amid fierce fighting.\n\nThe Foreign Office said it was \"supporting the family of a British man following reports of his detention\".",
    "clean_body": "british man captured while fighting with ukraine the foreign secretary said we will do all we can to offer this uk national all the support we can russian state news agency tass quotes a military source saying that what they call a uk mercenary has been taken prisoner in the kursk area of russia part of which ukraine has held since launching a surprise offensive in august in a video circulating online a man dressed in military clothing identifies himself as james scott rhys anderson 22 and says he formerly served in the british army a british man has been captured by russian forces while fighting for ukraine according to reports asked about reports of mr andersons capture david lammy said he had been updated about that development in the last couple of days scott anderson mr andersons father said he had begged his son not to go to ukraine he wanted to go out there because he thought he was doing what was right mr anderson told the daily mail i’m hoping he’ll be used as a bargaining chip but my son told me they torture their prisoners and i’m so frightened he’ll be tortured mr anderson said he was sent the video by his son’s commander and was left in complete shock and tears i could see straight away it was him he looks frightened scared and worried he added in the video first posted to the telegram messaging platform mr anderson tells a man questioning him from behind a camera that he served as a private in the british army from 2019 to 2023 he says he joined the ukraines international legion a military unit made up of foreign volunteers after losing his job and seeing reports on television about the war he says he flew to krakow in poland from luton and travelled from there by bus to the ukrainian border ukraine launched a surprise attack into kursk on 6 august advancing up to 18 miles 29km and taking control of around 1000 square kilometres of russian territory russia has deployed some 50000 troops to the region and has begun retaking territory amid fierce fighting the foreign office said it was supporting the family of a british man following reports of his detention",
    "summary": "British man captured while fighting with UkraineThe foreign secretary said: \"We will do all we can to offer this UK national all the support we can.\"\nA British man has been captured by Russian forces while fighting for Ukraine, according to reports.\nScott Anderson, Mr Anderson's father, said he had begged his son not to go to Ukraine.\n\"He wanted to go out there because he thought he was doing what was right,\" Mr Anderson told the Daily Mail.\nThe Foreign Office said it was \"supporting the family of a British man following reports of his detention\".",
    "keywords": [
      "russia",
      "military",
      "captured",
      "uk",
      "man",
      "anderson",
      "reports",
      "ukraine",
      "mr",
      "video",
      "fighting",
      "foreign",
      "british"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4b21/live/011f7ca0-ab0d-11ef-a4fe-a3e9a6c5d640.jpg"
  },
  "https://www.bbc.com/news/articles/c8ek5l04yy7o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c8ek5l04yy7o",
    "date": "2024-11-14",
    "time": "00:00:00",
    "title": "CDC says US drug overdose deaths have declined",
    "body": "Experts hopeful as US drug overdose deaths fall below 100,000\n\nMore than 108,000 people died from overdose deaths in the 12 months leading up to both June 2022 and 2023, but by this June that number had dropped to 97,000.\n\nIt's an encouraging sign, experts say. Overdose deaths had been on a steady rise since the 1990s, with a jump during the pandemic, according to CDC data.\n\nOverall, overdose deaths declined by roughly 14% from June 2023 to June 2024.\n\nThe number of people dying from drug overdoses in the US has decreased, the Centers for Disease Control and Prevention (CDC) said in a new report.\n\n\"While these data are cause for optimism, we must not lose sight of the fact that nearly 100,000 people are still estimated to be dying annually from drug overdose in the US,\" said Nora Volkow, director of the National Institute on Drug Abuse, in a statement to CBS, the BBC's US partner.\n\nSome of the states that saw the largest rates of decrease were North Carolina (-30%), Ohio (-24%) and Virginia (-23%).\n\nThe decline marks a notable change in overdose trends that have troubled the US for three decades, initially fuelled by prescription opioids and later by the rise of heroin and synthetic opioids like fentanyl.\n\nPrescription opioids overdose deaths rose sharply from 3,442 in 1999 to 17,029 in 2017. Deaths declined afterwards but rose again in 2020 during the Covid-19 pandemic amid increasing social isolation.\n\nExperts are unsure of what exactly is causing the current decline in overdose deaths but attribute some of it to a post-pandemic return to normalcy.\n\nMoney going into the hardest hit communities has increased the availability of the overdose-reversing drug naloxone and addiction treatments such as buprenorphine.\n\nBillions of dollars in legal settlements against opioid companies are also suspected to be playing a role in the decrease.\n\nIn the latest CDC data, overdose death reports are down in most US states, though some did see an increase.\n\nIn Alaska, Nevada, Oregon, Utah and Washington the number of overdose death reports rose.",
    "clean_body": "experts hopeful as us drug overdose deaths fall below 100000 more than 108000 people died from overdose deaths in the 12 months leading up to both june 2022 and 2023 but by this june that number had dropped to 97000 its an encouraging sign experts say overdose deaths had been on a steady rise since the 1990s with a jump during the pandemic according to cdc data overall overdose deaths declined by roughly 14 from june 2023 to june 2024 the number of people dying from drug overdoses in the us has decreased the centers for disease control and prevention cdc said in a new report while these data are cause for optimism we must not lose sight of the fact that nearly 100000 people are still estimated to be dying annually from drug overdose in the us said nora volkow director of the national institute on drug abuse in a statement to cbs the bbcs us partner some of the states that saw the largest rates of decrease were north carolina 30 ohio 24 and virginia 23 the decline marks a notable change in overdose trends that have troubled the us for three decades initially fuelled by prescription opioids and later by the rise of heroin and synthetic opioids like fentanyl prescription opioids overdose deaths rose sharply from 3442 in 1999 to 17029 in 2017 deaths declined afterwards but rose again in 2020 during the covid19 pandemic amid increasing social isolation experts are unsure of what exactly is causing the current decline in overdose deaths but attribute some of it to a postpandemic return to normalcy money going into the hardest hit communities has increased the availability of the overdosereversing drug naloxone and addiction treatments such as buprenorphine billions of dollars in legal settlements against opioid companies are also suspected to be playing a role in the decrease in the latest cdc data overdose death reports are down in most us states though some did see an increase in alaska nevada oregon utah and washington the number of overdose death reports rose",
    "summary": "Experts hopeful as US drug overdose deaths fall below 100,000More than 108,000 people died from overdose deaths in the 12 months leading up to both June 2022 and 2023, but by this June that number had dropped to 97,000.\nOverdose deaths had been on a steady rise since the 1990s, with a jump during the pandemic, according to CDC data.\nOverall, overdose deaths declined by roughly 14% from June 2023 to June 2024.\nPrescription opioids overdose deaths rose sharply from 3,442 in 1999 to 17,029 in 2017.\nExperts are unsure of what exactly is causing the current decline in overdose deaths but attribute some of it to a post-pandemic return to normalcy.",
    "keywords": [
      "rose",
      "declined",
      "number",
      "deaths",
      "opioids",
      "reports",
      "drug",
      "cdc",
      "rise",
      "states",
      "overdose"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/5d28/live/f4df11d0-a283-11ef-a4fe-a3e9a6c5d640.jpg"
  },
  "https://www.bbc.com/news/articles/c2067q7k613o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c2067q7k613o",
    "date": "2024-11-26",
    "time": "00:00:00",
    "title": "Vaibhav Suryavanshi: The 13-year-old Indian cricketer who won a $130,500 IPL deal",
    "body": "The 13-year-old Indian cricketer who won a $130,500 IPL deal\n\n26 November 2024 Share Save Neyaz Farooquee BBC News, Delhi Share Save\n\nIPL Vaibhav Suryavanshi was sold to Rajasthan Royals (RR) for 11m rupees ($130,500; £103,789)\n\nA 13-year-old has become the youngest player to get a deal in the Indian Premier League (IPL), the world's richest cricket tournament. Vaibhav Suryavanshi from the eastern state of Bihar was bought by Rajasthan Royals (RR) for 11m rupees ($130,500; £103,789) in the recently-concluded auctions in Saudi Arabia. The left-handed batter has represented his state in national championships, such as Ranji and Mushtaq Ali trophies, and India in the Under-19 internationals. Delhi Capitals and RR bid for him starting from 3m rupees but RR, where he had trained previously, managed to seal the deal.\n\nIndian cricket was traditionally dominated by urban centres such as Mumbai, Delhi and Bengaluru but IPL has managed to attract a wider pool of cricketers from far-off villages and small towns of India. Suryavanshi, who is in Dubai to play India Under-19 Asia Cup, made his Ranji debut at the age of 12 in January with Bihar against Mumbai. In his five Ranji matches, he has scored a highest of 41. But the highlight of his career has been his 58-ball century as an opener in an Under-19 unofficial Test against Australia a few weeks ago – which also made him the youngest to score a century in youth cricket. He has also made an unbeaten 332 in an Under-19 tournament in Bihar. RR saw raw potential in the youngster as he impressed their coaching staff during a training session. \"He's an incredible talent and, of course, you got to have the confidence so he can step up to the IPL level,\" the team's CEO Jake Lush McCrum told ESPN Cricinfo after the auction ended. He said that Suryavanshi’s development would require work, but \"he is a hell of a talent and we're really excited to have him as part of the franchise\".\n\nVaibhav Suryavanshi/Instagram Vaibhav Suryavanshi made his Ranji debut with Bihar at the age of 12 earlier this year against heavyweight Mumbai",
    "clean_body": "the 13yearold indian cricketer who won a 130500 ipl deal 26 november 2024 share save neyaz farooquee bbc news delhi share save ipl vaibhav suryavanshi was sold to rajasthan royals rr for 11m rupees 130500 £103789 a 13yearold has become the youngest player to get a deal in the indian premier league ipl the worlds richest cricket tournament vaibhav suryavanshi from the eastern state of bihar was bought by rajasthan royals rr for 11m rupees 130500 £103789 in the recentlyconcluded auctions in saudi arabia the lefthanded batter has represented his state in national championships such as ranji and mushtaq ali trophies and india in the under19 internationals delhi capitals and rr bid for him starting from 3m rupees but rr where he had trained previously managed to seal the deal indian cricket was traditionally dominated by urban centres such as mumbai delhi and bengaluru but ipl has managed to attract a wider pool of cricketers from faroff villages and small towns of india suryavanshi who is in dubai to play india under19 asia cup made his ranji debut at the age of 12 in january with bihar against mumbai in his five ranji matches he has scored a highest of 41 but the highlight of his career has been his 58ball century as an opener in an under19 unofficial test against australia a few weeks ago – which also made him the youngest to score a century in youth cricket he has also made an unbeaten 332 in an under19 tournament in bihar rr saw raw potential in the youngster as he impressed their coaching staff during a training session hes an incredible talent and of course you got to have the confidence so he can step up to the ipl level the teams ceo jake lush mccrum told espn cricinfo after the auction ended he said that suryavanshi’s development would require work but he is a hell of a talent and were really excited to have him as part of the franchise vaibhav suryavanshiinstagram vaibhav suryavanshi made his ranji debut with bihar at the age of 12 earlier this year against heavyweight mumbai",
    "summary": "The 13-year-old Indian cricketer who won a $130,500 IPL deal26 November 2024 Share Save Neyaz Farooquee BBC News, Delhi Share SaveIPL Vaibhav Suryavanshi was sold to Rajasthan Royals (RR) for 11m rupees ($130,500; £103,789)A 13-year-old has become the youngest player to get a deal in the Indian Premier League (IPL), the world's richest cricket tournament.\nVaibhav Suryavanshi from the eastern state of Bihar was bought by Rajasthan Royals (RR) for 11m rupees ($130,500; £103,789) in the recently-concluded auctions in Saudi Arabia.\nDelhi Capitals and RR bid for him starting from 3m rupees but RR, where he had trained previously, managed to seal the deal.\nSuryavanshi, who is in Dubai to play India Under-19 Asia Cup, made his Ranji debut at the age of 12 in January with Bihar against Mumbai.\nVaibhav Suryavanshi/Instagram Vaibhav Suryavanshi made his Ranji debut with Bihar at the age of 12 earlier this year against heavyweight Mumbai",
    "keywords": [
      "india",
      "indian",
      "cricketer",
      "suryavanshi",
      "bihar",
      "rr",
      "won",
      "ipl",
      "vaibhav",
      "13yearold",
      "under19",
      "rupees",
      "mumbai",
      "130500",
      "ranji",
      "deal"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/1e06/live/711de7e0-abcf-11ef-bf89-3587f5ea0a74.jpg"
  },
  "https://www.bbc.com/news/articles/c207gzprr33o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c207gzprr33o",
    "date": "2024-11-01",
    "time": "00:00:00",
    "title": "China watching North Korea's friendship with Russia",
    "body": "Kim Jong Un is China's ally - but has become the 'comrade from hell'\n\n1 November 2024 Share Save Laura Bicker BBC News Reporting from Fangchuan, China-Russia-North Korea border Share Save\n\nBBC A tall building on the edge of Fangchuan has become a tourist attraction for the view it offers of North Korea\n\nChinese tourists huddle together against the brisk autumn breeze on a 12-storey building, vying for the best spot to photograph the point where their country meets Russia and North Korea. The three national flags overlap on a map on the wall, which explains that Fangchuan in China’s north-east corner is a unique place for that reason. “I feel very proud to be standing here… with Russia on my left and North Korea on my right,” declares one woman on a trip with her co-workers. “There are no borders among the people.” That might be overly optimistic. Like the sliver of sandwiched Chinese territory she has travelled to see, Beijing too is caught between its sanctioned neighbours. Fears over the budding alliance between Vladimir Putin and Kim Jong Un have peaked in recent weeks, with reports of North Korea deploying thousands of troops to support Russia’s invasion of Ukraine. And that was before Pyongyang fired a banned intercontinental missile on Thursday, on the longest flight recorded yet – after turning up the rhetoric against Seoul for weeks. “China seeks a relationship with a reasonable, high level of control over North Korea,” says Christopher Green, an analyst from the International Crisis Group. “And North Korea’s relationship with Russia threatens to undermine that.” If Chinese leader Xi Jinping is unable shape the Putin-Kim alliance to suit his interests, China may well remain stuck in the middle as western anger and anxiety grows.\n\nMoscow and Pyongyang deny that North Korean soldiers are headed for Ukraine, widely seen as a significant escalation. But the United States says it has seen evidence of this, following allegations by South Korean and Ukrainian intelligence. The first reports emerged just before Xi met his Russian counterpart at the Brics summit earlier in October, overshadowing a gathering that was meant to send the West a defiant message. It increasingly appears as though China’s allies are spiralling out of its control. Beijing, the senior partner in the triad, seeks to be the stable leader of a new world order, one that is not led by the US. But that’s difficult to do when one ally has started a war in Europe, and another is accused of aiding the invasion. “China is unhappy with the way things are going,” Mr Green says, “but they are trying to keep their discontent relatively quiet.” It’s certainly a sensitive topic for Beijing, judging by the response to our presence in the border town, where it seems tourists are welcome - but journalists are not. We were in public areas at all times, and yet the team was stopped, repeatedly questioned, followed and our footage deleted. The hotel demanded to keep my passport for “my safety and the safety of others”. Police visited our hotel rooms, and they also blocked the road to the port at Hunchun, which would have given us a closer view of the current trade between Russia and China.\n\n'Lips and teeth'\n\nOn the viewing platform in Fangchuan, it’s clear that most tourists have come to see North Korea. “I saw a person cycling,” says one girl peering through a telescope. Her friend rushes over to see: “Ooooh! It’s such a mysterious country.” Close by is the Tumen river that gently cuts through all three countries. It is China’s gateway into the Sea of Japan, where it has territorial disputes with Tokyo. The 1,400km-long (870 mile) Chinese border has some of the only platforms with a clear view into North Korea. South Korea’s frontier with the North is an almost impenetrable barrier, the heavily mined and fortified Demilitarized Zone. Someone offers me a pair of binoculars. Some people are cycling through the village on ageing bicycles, but there are few other signs of life. One of the largest buildings is a school with a sign calling for children to “learn well for Chosun”, another name for North Korea. “North Korea has always been our neighbour. It’s no stranger to us,” says a middle-aged man. “To be able to see how they live makes me realise China is prosperous and strong.”\n\nChina offers some of the only glimpses into isolated North Korea\n\nChinese tourists are eager to know more about their reclusive neighbour\n\nKim Jong Un’s regime would certainly struggle to survive without its biggest benefactor, China, which accounts for more than 90% of foreign trade, including food and fuel. That was not always the case. In the early 1960s it was the Chinese who fled famine across the Tumen river. Some even went to school in North Korea because they believed its education system at the time was better. The North Korean economy crashed after the fall of the Soviet Union in 1991 – which had been its main source of aid and cheap oil - sparking severe food shortages and, eventually, famine. Soon, North Korean refugees began wading through an often freezing river at the risk of being shot dead to escape hunger, poverty and repression. There are now more than 30,000 of them in South Korea and an unknown number still live in China. “Since the collapse of the Soviet Union, North Korea hasn’t really had any choice but to maintain good relations with China, which has been its sole benefactor,” Mr Green says. But now, he adds, Russia “is offering an alternative and the North Koreans are seeking to exploit that”. Mao Zedong, the first leader of the People’s Republic of China, had likened the relationship between Beijing and Pyongyang to the closeness between “lips and teeth”: “If the lips are gone, the teeth will be cold.”\n\nThe three-way alliance has long worried the West - and the recent closeness between Moscow and Pyongyang has only aggravated fears\n\n‘The comrade from hell’\n\nNow, Beijing finds itself smarting from a lack of gratitude as Kim’s lips are “kissing elsewhere”, according to sociologist Aidan Foster-Carter, who has studied North Korea for several decades. “North Korea has consistently been the comrade from hell to both Russia and China. They take as much money as they can and [then] do what they like.” Analysts have noted that Kim has consistently flattered Putin over Xi in the last year. While Kim hasn’t met Xi since 2019, he has met Putin twice in the past year or so. Russia’s invasion of Ukraine has drawn the two sanctioned leaders closer than ever. Putin seeks more support for his war and Kim wants to bolster his regime with alliances and attention. From the Chinese border, it’s easy to see the burgeoning relationship between the two sides. The whistle of a train interrupts the tourist chatter, and a steam engine pulling a long line of freight carriages slowly chugs across the railway bridge from Russia to North Korea. It stops in front of a Korean sign facing China which reads: “Towards a new victory!”\n\nThe so-called friendship bridge connecting Russia and North Korea has become a crucial trade route\n\nThe US estimates that Kim has sold more than a million artillery shells and Grad rockets to Moscow for use in Ukraine, which North Korea denies. But there is no doubt that the pair have stepped up cooperation after signing a security pact in June to help each other in the event of \"aggression\" against either country. “You have very stiff and formal language to Xi Jinping on the occasion of what is actually an historically important event – the 75th anniversary of relations of the People’s Republic of China,” Mr Foster-Carter says. “And yet on Putin’s birthday, Kim calls him ‘my closest comrade’. If you are Xi Jinping, what are you thinking?”\n\n'Through gritted teeth'\n\nIt’s hard to know, because China has shown no signs of interfering with the Russia-North Korea alliance. The US has noticed Beijing’s disquiet and for once the two rivals may have similar goals. In the last week, State Department officials have raised the issue of North Korean troops in Russia with Chinese diplomats. Beijing does have options - in the past, they have cut supplies of oil and coal to North Korea, and complied with US-led sanctions to curb Pyongyang’s nuclear programme. Already, China is battling US accusations that it is selling components to Russia that aid its invasion of Ukraine. Beijing’s trade with Moscow is also flourishing, even as it tries to cope with Western tariffs. Xi has kept Russia close because he needs Putin’s help to challenge the US-led world order. But he has not stopped trying to repair ties with Europe, the UK and even the US. China has also been holding talks with Japan and South Korea to ease historic tensions. But Kim’s increasingly aggressive rhetoric against Seoul has the South once again debating whether it should have its own nuclear arsenal. North Korean troops on a Ukrainian battlefield would only further unravel Beijing’s plans. The possibility has already seen South Korean President Yoon Suk Yeol discuss \"concrete counter-measures\" and talk of strengthening security cooperation with Ukraine and Nato.\n\nGetty Images What China doesn't want: More instability in East Asia because of a Putin-Kim alliance\n\nA nuclear-armed South Korea or an “East Asian Nato” are not ideal in a region where China wants greater sway. An emboldened Kim could also draw a stronger show of support from the US – in the form of warships or even weapons - towards its allies, Seoul and Tokyo. “For a very long time, China has had a policy of three nos in Northeast Asia – one of those nos was a no nuclear North Korea. Obviously that has been a failure,” Mr Green says. Now Beijing fears that the alliance with Russia could destabilise North Korea, he adds: “That could even benefit Vladimir Putin in a way it really would not benefit Xi Jinping.” Experts say Beijing is just as worried as the West about what military technology Putin might sell to Kim in exchange for troops. “Satellites, for sure,” Mr Foster-Carter says. “But Putin is bad – not mad. Russia knows just as China knows that North Korea is a loose cannon. Giving [Kim] more technology for nukes is not a good thing for anybody.” Experts believe Xi is unlikely to do anything drastic because China needs a stable North Korea – if he cuts off aid, he would likely have a refugee crisis at the border.\n\nAFP Another meeting on the cards? Xi Jinping and Kim Jong Un haven't met since 2019",
    "clean_body": "kim jong un is chinas ally but has become the comrade from hell 1 november 2024 share save laura bicker bbc news reporting from fangchuan chinarussianorth korea border share save bbc a tall building on the edge of fangchuan has become a tourist attraction for the view it offers of north korea chinese tourists huddle together against the brisk autumn breeze on a 12storey building vying for the best spot to photograph the point where their country meets russia and north korea the three national flags overlap on a map on the wall which explains that fangchuan in china’s northeast corner is a unique place for that reason “i feel very proud to be standing here… with russia on my left and north korea on my right” declares one woman on a trip with her coworkers “there are no borders among the people” that might be overly optimistic like the sliver of sandwiched chinese territory she has travelled to see beijing too is caught between its sanctioned neighbours fears over the budding alliance between vladimir putin and kim jong un have peaked in recent weeks with reports of north korea deploying thousands of troops to support russia’s invasion of ukraine and that was before pyongyang fired a banned intercontinental missile on thursday on the longest flight recorded yet – after turning up the rhetoric against seoul for weeks “china seeks a relationship with a reasonable high level of control over north korea” says christopher green an analyst from the international crisis group “and north korea’s relationship with russia threatens to undermine that” if chinese leader xi jinping is unable shape the putinkim alliance to suit his interests china may well remain stuck in the middle as western anger and anxiety grows moscow and pyongyang deny that north korean soldiers are headed for ukraine widely seen as a significant escalation but the united states says it has seen evidence of this following allegations by south korean and ukrainian intelligence the first reports emerged just before xi met his russian counterpart at the brics summit earlier in october overshadowing a gathering that was meant to send the west a defiant message it increasingly appears as though china’s allies are spiralling out of its control beijing the senior partner in the triad seeks to be the stable leader of a new world order one that is not led by the us but that’s difficult to do when one ally has started a war in europe and another is accused of aiding the invasion “china is unhappy with the way things are going” mr green says “but they are trying to keep their discontent relatively quiet” it’s certainly a sensitive topic for beijing judging by the response to our presence in the border town where it seems tourists are welcome but journalists are not we were in public areas at all times and yet the team was stopped repeatedly questioned followed and our footage deleted the hotel demanded to keep my passport for “my safety and the safety of others” police visited our hotel rooms and they also blocked the road to the port at hunchun which would have given us a closer view of the current trade between russia and china lips and teeth on the viewing platform in fangchuan it’s clear that most tourists have come to see north korea “i saw a person cycling” says one girl peering through a telescope her friend rushes over to see “ooooh it’s such a mysterious country” close by is the tumen river that gently cuts through all three countries it is china’s gateway into the sea of japan where it has territorial disputes with tokyo the 1400kmlong 870 mile chinese border has some of the only platforms with a clear view into north korea south korea’s frontier with the north is an almost impenetrable barrier the heavily mined and fortified demilitarized zone someone offers me a pair of binoculars some people are cycling through the village on ageing bicycles but there are few other signs of life one of the largest buildings is a school with a sign calling for children to “learn well for chosun” another name for north korea “north korea has always been our neighbour it’s no stranger to us” says a middleaged man “to be able to see how they live makes me realise china is prosperous and strong” china offers some of the only glimpses into isolated north korea chinese tourists are eager to know more about their reclusive neighbour kim jong un’s regime would certainly struggle to survive without its biggest benefactor china which accounts for more than 90 of foreign trade including food and fuel that was not always the case in the early 1960s it was the chinese who fled famine across the tumen river some even went to school in north korea because they believed its education system at the time was better the north korean economy crashed after the fall of the soviet union in 1991 – which had been its main source of aid and cheap oil sparking severe food shortages and eventually famine soon north korean refugees began wading through an often freezing river at the risk of being shot dead to escape hunger poverty and repression there are now more than 30000 of them in south korea and an unknown number still live in china “since the collapse of the soviet union north korea hasn’t really had any choice but to maintain good relations with china which has been its sole benefactor” mr green says but now he adds russia “is offering an alternative and the north koreans are seeking to exploit that” mao zedong the first leader of the people’s republic of china had likened the relationship between beijing and pyongyang to the closeness between “lips and teeth” “if the lips are gone the teeth will be cold” the threeway alliance has long worried the west and the recent closeness between moscow and pyongyang has only aggravated fears ‘the comrade from hell’ now beijing finds itself smarting from a lack of gratitude as kim’s lips are “kissing elsewhere” according to sociologist aidan fostercarter who has studied north korea for several decades “north korea has consistently been the comrade from hell to both russia and china they take as much money as they can and then do what they like” analysts have noted that kim has consistently flattered putin over xi in the last year while kim hasn’t met xi since 2019 he has met putin twice in the past year or so russia’s invasion of ukraine has drawn the two sanctioned leaders closer than ever putin seeks more support for his war and kim wants to bolster his regime with alliances and attention from the chinese border it’s easy to see the burgeoning relationship between the two sides the whistle of a train interrupts the tourist chatter and a steam engine pulling a long line of freight carriages slowly chugs across the railway bridge from russia to north korea it stops in front of a korean sign facing china which reads “towards a new victory” the socalled friendship bridge connecting russia and north korea has become a crucial trade route the us estimates that kim has sold more than a million artillery shells and grad rockets to moscow for use in ukraine which north korea denies but there is no doubt that the pair have stepped up cooperation after signing a security pact in june to help each other in the event of aggression against either country “you have very stiff and formal language to xi jinping on the occasion of what is actually an historically important event – the 75th anniversary of relations of the people’s republic of china” mr fostercarter says “and yet on putin’s birthday kim calls him ‘my closest comrade’ if you are xi jinping what are you thinking” through gritted teeth it’s hard to know because china has shown no signs of interfering with the russianorth korea alliance the us has noticed beijing’s disquiet and for once the two rivals may have similar goals in the last week state department officials have raised the issue of north korean troops in russia with chinese diplomats beijing does have options in the past they have cut supplies of oil and coal to north korea and complied with usled sanctions to curb pyongyang’s nuclear programme already china is battling us accusations that it is selling components to russia that aid its invasion of ukraine beijing’s trade with moscow is also flourishing even as it tries to cope with western tariffs xi has kept russia close because he needs putin’s help to challenge the usled world order but he has not stopped trying to repair ties with europe the uk and even the us china has also been holding talks with japan and south korea to ease historic tensions but kim’s increasingly aggressive rhetoric against seoul has the south once again debating whether it should have its own nuclear arsenal north korean troops on a ukrainian battlefield would only further unravel beijing’s plans the possibility has already seen south korean president yoon suk yeol discuss concrete countermeasures and talk of strengthening security cooperation with ukraine and nato getty images what china doesnt want more instability in east asia because of a putinkim alliance a nucleararmed south korea or an “east asian nato” are not ideal in a region where china wants greater sway an emboldened kim could also draw a stronger show of support from the us – in the form of warships or even weapons towards its allies seoul and tokyo “for a very long time china has had a policy of three nos in northeast asia – one of those nos was a no nuclear north korea obviously that has been a failure” mr green says now beijing fears that the alliance with russia could destabilise north korea he adds “that could even benefit vladimir putin in a way it really would not benefit xi jinping” experts say beijing is just as worried as the west about what military technology putin might sell to kim in exchange for troops “satellites for sure” mr fostercarter says “but putin is bad – not mad russia knows just as china knows that north korea is a loose cannon giving kim more technology for nukes is not a good thing for anybody” experts believe xi is unlikely to do anything drastic because china needs a stable north korea – if he cuts off aid he would likely have a refugee crisis at the border afp another meeting on the cards xi jinping and kim jong un havent met since 2019",
    "summary": "Moscow and Pyongyang deny that North Korean soldiers are headed for Ukraine, widely seen as a significant escalation.\n'Lips and teeth'On the viewing platform in Fangchuan, it’s clear that most tourists have come to see North Korea.\nThe 1,400km-long (870 mile) Chinese border has some of the only platforms with a clear view into North Korea.\nIn the last week, State Department officials have raised the issue of North Korean troops in Russia with Chinese diplomats.\nRussia knows just as China knows that North Korea is a loose cannon.",
    "keywords": [
      "russia",
      "xi",
      "watching",
      "china",
      "south",
      "korean",
      "koreas",
      "beijing",
      "north",
      "putin",
      "korea",
      "friendship",
      "kim"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4c9b/live/0d795bf0-9844-11ef-8538-e1655f5a8342.jpg"
  }
}