{
  "https://www.cnbc.com/2024/07/02/what-taylor-swifts-the-eras-tour-says-about-passion-tourism.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/what-taylor-swifts-the-eras-tour-says-about-passion-tourism.html",
    "date": "2024-07-02",
    "time": "16:00:18 UTC",
    "title": "What Taylor Swift's The Eras Tour says about 'passion tourism'",
    "body": "Taylor Swift performs on stage during The Eras Tour on June 28, 2024 in Dublin, Ireland. Charles Mcquillan/tas24 | Getty Images Entertainment | Getty Images\n\nTaylor Swift's European tour was top of mind for Nikita Rao when planning where to go for her family's annual summer vacation. Rao, her husband and two kids, who live in Bethesda, Maryland, headed overseas this past weekend: They have tickets to the pop star's concert in Amsterdam on Thursday. The family built a weeklong itinerary around The Eras Tour event, spending a few days in London before making their way to the Netherlands for the show. They would have likely visited the two cities at some point in the future, but the Swift concert accelerated their timeline, said Rao, 43, who also saw a performance in Cincinnati last year with her daughter. \"My view on it was, we should do this — London and Amsterdam — because she'll be there,\" Rao said. \"If I can get tickets, that'll just make the whole vacation amazing,\" she said of her thought process.\n\nWhy Taylor Swift is unique to 'passion tourism'\n\nTaylor Swift fans gather outside Santiago Bernabéu Stadium for a concert in Madrid, Spain, on May 29, 2024. David Benito | Getty Images Entertainment | Getty Images\n\nIt's not just the Rao family. Americans are flocking overseas to see Taylor Swift, perhaps the most prominent recent example of so-called \"passion tourism,\" according to travel experts. Passion tourism revolves (unsurprisingly) around people's passions. While place is also generally important, these trips are generally guided by personal interest, hobby or a cultural event, experts said. This isn't a new concept. In fact, there are many recent and upcoming examples: February's annual Carnival festival in Rio de Janeiro, Brazil; April's total solar eclipse in North America; the 2024 Paris Olympics that start this month; and the ongoing UEFA European Football Championship (known as the Euro Cup) in Germany. \"Memorable events are driving travel trends, whether it is for concerts or sporting events,\" Mastercard wrote recently in its annual travel trends report. More from Personal Finance:\n\nFlying is cheaper in 2024. But not for some destinations\n\nVacationers expect to carry summer travel debt\n\n5 ways to maximize your vacation days However, what distinguishes Taylor Swift concerts in the realm of passion tourism is the broad interest and enthusiasm among Americans who want to travel abroad, according to travel agents. \"I've never seen this excitement to travel to go see an artist,\" said Jessica Griscavage, a travel advisor and founder of Runway Travel. The most recent example that might come close is a Spice Girls concert in the 1990s, she said. Griscavage, who put together the Rao family's itinerary, also assembled a separate Swift-centered trip to Paris for a daughter, mother and grandmother. More than half of Americans, 53%, identify as fans of Taylor Swift, according to a poll by Morning Consult. About 16% consider themselves \"avid\" fans.\n\nwatch now\n\n\"Beyoncé is big, too, but we don't usually get requests like, 'I have Beyoncé tickets for Europe and we want to build a trip around it,'\" said Sofia Markovich, a travel advisor and founder of Sofia's Travel. She assembled trips for two U.S. clients who had tickets for Taylor Swift shows in England and Switzerland, respectively. \"Just as Grateful Dead fans were known to follow the band from city to city to be part of a unique community, Swifties — often with friends and family in tow — have made traveling to her concerts part of the experience,\" Joshua Friedlander, vice president of research at the U.S. Travel Association, wrote recently about the so-called \"Swift Lift.\"\n\n'Inevitable' that Swifties will travel to new places\n\nAbout 15.9 million Americans traveled internationally in the first quarter of 2024, an all-time high, according to Mastercard's travel report. Consumers are also spending for travel at record levels globally, it said. Passion tourism generally provides an economic boost to host nations, experts said. For example, spending by tourists at restaurants, bars and grocery stores during the 2024 Carnival in Rio was 156% above normal, Mastercard found. During the solar eclipse, hotel sales within the U.S. path of totality rose 71%, it said.\n\nSpectators looking up at the solar eclipse at the Indianapolis Motor Speedway in Indianapolis, Indiana, on April 8, 2024. Nurphoto | Getty Images\n\nAbout 1.2 million fans will see a Taylor Swift concert this summer across four cities in the United Kingdom (Edinburgh, Liverpool, Cardiff and London), according to a recent Barclays analysis. Each fan will spend an average 848 British pounds (about $1,073) on tickets, travel, accommodation, outfits and other expenses, amounting to a total 997 million British pounds (about $1.3 billion), Barclays estimated. Accommodation accounts for the largest outlay after tickets, followed by travel, according to the Barclays analysis. Searches for Airbnb stays in European cities during Taylor Swift's The Eras Tour dates are up about 70% relative to the same period in 2023, according to a recent analysis.\n\nBeyoncé is big, too, but we don't usually get requests like, 'I have Beyoncé tickets for Europe and we want to build a trip around it.' Sofia Markovich travel advisor\n\nRome and Paris are traditionally among Americans' top destinations to visit abroad. However, it's \"inevitable\" that Swift fans will end up in a city they may have previously overlooked, like Edinburgh, said Christopher Nulty, global head of corporate communications and public affairs at Airbnb. When tickets went on sale last year for Edinburgh concert dates, searches for lodging in the city by Americans jumped 500%, Nulty said. A concert \"combines the opportunity to travel somewhere incredible with the opportunity to see an artist they love,\" he said.",
    "summary": "Taylor Swift performs on stage during The Eras Tour on June 28, 2024 in Dublin, Ireland.\nWhy Taylor Swift is unique to 'passion tourism'Taylor Swift fans gather outside Santiago Bernabéu Stadium for a concert in Madrid, Spain, on May 29, 2024.\nAmericans are flocking overseas to see Taylor Swift, perhaps the most prominent recent example of so-called \"passion tourism,\" according to travel experts.\nMore than half of Americans, 53%, identify as fans of Taylor Swift, according to a poll by Morning Consult.\nShe assembled trips for two U.S. clients who had tickets for Taylor Swift shows in England and Switzerland, respectively.",
    "keywords": [
      "americans",
      "concert",
      "tour",
      "according",
      "swift",
      "travel",
      "tickets",
      "rao",
      "tourism",
      "eras",
      "taylor",
      "swifts",
      "recent",
      "2024",
      "passion"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/108000528-1719861917936-gettyimages-2159715391-mq1_6770_716xipz1_20240628081211_zfspvfua.jpeg?v=1719861998&w=1920&h=1080",
    "clean_body": "taylor swift performs stage era tour june dublin ireland charles mcquillantas getty image entertainment getty image taylor swift european tour top mind nikita rao planning go family annual summer vacation rao husband two kid live bethesda maryland headed overseas past weekend ticket pop star concert amsterdam thursday family built weeklong itinerary around era tour event spending day london making way netherlands show would likely visited two city point future swift concert accelerated timeline said rao also saw performance cincinnati last year daughter view -- london amsterdam -- shell rao said get ticket thatll make whole vacation amazing said thought process taylor swift unique passion tourism taylor swift fan gather outside santiago bernabeu stadium concert madrid spain may david benito getty image entertainment getty image rao family american flocking overseas see taylor swift perhaps prominent recent example socalled passion tourism according travel expert passion tourism revolves unsurprisingly around people passion place also generally important trip generally guided personal interest hobby cultural event expert said isnt new concept fact many recent upcoming example february annual carnival festival rio de janeiro brazil april total solar eclipse north america paris olympics start month ongoing uefa european football championship known euro cup germany memorable event driving travel trend whether concert sporting event mastercard wrote recently annual travel trend report personal finance flying cheaper destination vacationer expect carry summer travel debt way maximize vacation day however distinguishes taylor swift concert realm passion tourism broad interest enthusiasm among american want travel abroad according travel agent ive never seen excitement travel go see artist said jessica griscavage travel advisor founder runway travel recent example might come close spice girl concert said griscavage put together rao family itinerary also assembled separate swiftcentered trip paris daughter mother grandmother half american identify fan taylor swift according poll morning consult consider avid fan watch beyonce big dont usually get request like beyonce ticket europe want build trip around said sofia markovich travel advisor founder sofia travel assembled trip two u client ticket taylor swift show england switzerland respectively grateful dead fan known follow band city city part unique community swifties -- often friend family tow -- made traveling concert part experience joshua friedlander vice president research u travel association wrote recently socalled swift lift inevitable swifties travel new place million american traveled internationally first quarter alltime high according mastercards travel report consumer also spending travel record level globally said passion tourism generally provides economic boost host nation expert said example spending tourist restaurant bar grocery store carnival rio normal mastercard found solar eclipse hotel sale within u path totality rose said spectator looking solar eclipse indianapolis motor speedway indianapolis indiana april nurphoto getty image million fan see taylor swift concert summer across four city united kingdom edinburgh liverpool cardiff london according recent barclays analysis fan spend average british pound ticket travel accommodation outfit expense amounting total million british pound billion barclays estimated accommodation account largest outlay ticket followed travel according barclays analysis search airbnb stay european city taylor swift era tour date relative period according recent analysis beyonce big dont usually get request like beyonce ticket europe want build trip around sofia markovich travel advisor rome paris traditionally among american top destination visit abroad however inevitable swift fan end city may previously overlooked like edinburgh said christopher nulty global head corporate communication public affair airbnb ticket went sale last year edinburgh concert date search lodging city american jumped nulty said concert combine opportunity travel somewhere incredible opportunity see artist love said",
    "sentiment": 0.11470215857202155,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/paramount-shares-pop-9percent-on-news-of-preliminary-skydance-media-deal.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/paramount-shares-pop-9percent-on-news-of-preliminary-skydance-media-deal.html",
    "date": "2024-07-02",
    "time": "23:49:00 UTC",
    "title": "Skydance and National Amusements near Paramount deal as special committee reviews terms",
    "body": "David Ellison's Skydance has reached a preliminary deal with Shari Redstone's National Amusements to merge with Paramount , according to two people familiar with the matter, resurrecting a deal which failed just weeks earlier.\n\nControlling shareholder National Amusements has referred the deal to the Paramount special committee, according to people familiar with the matter. Paramount's special committee is currently reviewing and voting on the deal, according to a person familiar with the matter. A spokesperson for Paramount declined to comment.\n\nParamount shares surged as much as 9% on the news.\n\nThe resurrected deal will see Redstone receive a reduced consideration of $1.75 billion, according to a person familiar with the matter. The other financial terms of the deal, which CNBC previously reported, will remain unchanged: Skydance will acquire roughly half of Paramount's controlling shares at $15 per share, for $4.5 billion, and contribute $1.5 billion towards Paramount's balance sheet.\n\nRedstone killed the initial bid in June as it was near the finish line. One of Redstone's reasons was feeling as though Skydance had retraded the deal by asking her to take hundreds of millions of dollars less than the previously agreed to payment, according to one of the people.\n\nThe winding deal process had already led to the departure of CEO Bob Bakish earlier this year, leaving in place a three-headed office of the CEO to run the company. Other interested bids included a joint effort from private equity firm Apollo and Sony , as well as a recent entreaty from Barry Diller, chairman of media conglomerate IAC as well as a former Paramount executive.\n\nThe preliminary agreement was first reported by The New York Times and the Wall Street Journal.\n\n— CNBC's Julia Boorstin contributed to this report.",
    "summary": "David Ellison's Skydance has reached a preliminary deal with Shari Redstone's National Amusements to merge with Paramount , according to two people familiar with the matter, resurrecting a deal which failed just weeks earlier.\nControlling shareholder National Amusements has referred the deal to the Paramount special committee, according to people familiar with the matter.\nParamount's special committee is currently reviewing and voting on the deal, according to a person familiar with the matter.\nParamount shares surged as much as 9% on the news.\nThe resurrected deal will see Redstone receive a reduced consideration of $1.75 billion, according to a person familiar with the matter.",
    "keywords": [
      "shares",
      "skydance",
      "matter",
      "committee",
      "according",
      "national",
      "paramount",
      "amusements",
      "familiar",
      "terms",
      "billion",
      "reviews",
      "deal",
      "near",
      "special",
      "paramounts"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107350564-17031713842019-10-22t041207z_147379966_rc1e0ea01810_rtrmadp_0_usa-wsjtechlive.jpeg?v=1706913678&w=1920&h=1080",
    "clean_body": "david ellison skydance reached preliminary deal shari redstones national amusement merge paramount according two people familiar matter resurrecting deal failed week earlier controlling shareholder national amusement referred deal paramount special committee according people familiar matter paramounts special committee currently reviewing voting deal according person familiar matter spokesperson paramount declined comment paramount share surged much news resurrected deal see redstone receive reduced consideration billion according person familiar matter financial term deal cnbc previously reported remain unchanged skydance acquire roughly half paramounts controlling share per share billion contribute billion towards paramounts balance sheet redstone killed initial bid june near finish line one redstones reason feeling though skydance retraded deal asking take hundred million dollar le previously agreed payment according one people winding deal process already led departure ceo bob bakish earlier year leaving place threeheaded office ceo run company interested bid included joint effort private equity firm apollo sony well recent entreaty barry diller chairman medium conglomerate iac well former paramount executive preliminary agreement first reported new york time wall street journal -- cnbcs julia boorstin contributed report",
    "sentiment": 0.04764223871366729,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/peloton-staves-off-liquidity-crunch-in-global-refinance.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/peloton-staves-off-liquidity-crunch-in-global-refinance.html",
    "date": "2024-07-02",
    "time": "16:19:30 UTC",
    "title": "Peloton staved off the cash crunch that threatened its business. Where does it go now?",
    "body": "In this article PTON Follow your favorite stocks CREATE FREE ACCOUNT\n\nA Peloton Bike inside a showroom in New York, US, on Wednesday, Nov. 1, 2023. Peloton Interactive Inc. is scheduled to release earnings figures on November 2. Michael Nagle | Bloomberg | Getty Images\n\nPeloton no longer faces an imminent liquidity crunch after a massive debt refinancing, but the company still has a long road ahead to fix its business and get back to profitability. In late May, the connected fitness company secured a new $1 billion term loan, raised $350 million in convertible senior notes and received a new $100 million line of credit from JP Morgan and Goldman Sachs. All of those are due in 2029. The refinance reduced Peloton's debt from about $1.75 billion to around $1.55 billion and pushed off looming due dates on loans that it likely wouldn't have had the cash to pay back. Before the refinancing, Peloton would have needed to pay around $800 million toward its debt by November 2025. If it managed to pay that, about another $200 million still would have been due around three months later. The term loan would have been due in May 2027. For Peloton, which hasn't turned a net profit since December 2020 and has seen sales fall for nine straight quarters, the debt pile posed an existential threat and fueled investor concerns about a possible bankruptcy. Now that it has refinanced, Peloton has eased investor concerns about liquidity and has the breathing room it needs to try to turn around its business. The fact that it was able to secure these loans signals investors believe in its ability to rightsize its business and eventually pay them back, restructuring experts told CNBC. \"This refinancing is now putting us in a much better position for sustainable, profitable growth and just a much stronger financial footing than where we were before, and our investors saw that,\" finance chief Liz Coddington told CNBC in an interview. \"I think they believe in the story. They believe in what we're trying to do, as do we, and in the transformation of the business. And so it was just a great vote of confidence for Peloton's future.\"\n\nPeloton faces risks ahead\n\nWhile the refinance may have bought Peloton some time, it's far from a panacea. Under the terms, Peloton will now be spending about $133 million annually in interest, up from around $89 million previously. It will make Peloton's efforts to sustain positive free cash flow more difficult. Coddington acknowledged to CNBC that the higher interest expense is going to \"impact\" free cash flow, but said that's partly why the company started to cut costs in early May. The plan is expected to reduce annual run-rate expenses by more than $200 million. Even with the higher interest payments, Coddington expects the company will be able to sustain positive free cash flow without having the business \"materially grow in the near term.\" \"The cost reduction plan made us much more comfortable with that,\" said Coddington. While Peloton insists that investors bought into its refinance because they believe in its strategy, some could be trying to put themselves in a better position if the company fails. Two of Peloton's largest debt holders, Soros Fund Management and Silver Point Capital, are known to sometimes invest in distressed companies. Since the Peloton loans they invested in are secured, they are near the top of the capital structure. If Peloton can't turn its business around and ends up in a position where it's considering or filing for bankruptcy, its creditors would be in a strong position to take control of the company. \"I would describe this refinancing slash recapitalization as sort of opportunistic,\" said Evan DuFaux, a special situations analyst at CreditSights and an expert in distressed debt. \"I think that's just sort of a smart, opportunistic and kind of tricky move.\" Silver Point declined to comment. Soros didn't return a request for comment.\n\nMore cost cuts to come?\n\nPeloton is in a far better cash position than it was a few months ago, but the company still needs to address the demand issues that have plagued it since the Covid-19 pandemic wound down and figure out what kind of business it will be in the future. \"It really is an exercise in kicking the can down the road because the refinancing itself buys time, but it doesn't actually fix any of the underlying problems at Peloton,\" said Neil Saunders, managing director of GlobalData Retail. \"Those are very different issues to the refinancing.\" Following former CEO Barry McCarthy's departure and with two board members, Karen Boone and Chris Bruzzo, now in charge, Peloton needs to decide: is it a content company, like the Netflix for fitness, or is it a hardware company that needs to develop new strategies to sell its pricey equipment? So far, straddling both has proven to be unsuccessful. \"They're going to have to make some decisions about which parts of the model are survivable, which parts are not, or things that they can do to advance forward without losing the great brand value that they still currently have, especially with the loyal following that they have,\" said Scott Stuart, the CEO of the Turnaround Management Association and an expert in corporate restructurings. \"Money doesn't fix everything, and the issue becomes the more money you take and the more you refinance ... the more problematic it becomes,\" he added. Simeon Siegel, a retail analyst for BMO Capital Markets, said Peloton can start addressing its issues by forgetting about trying to grow the business for now and instead focus on \"bear hugging\" its millions of brand loyalists. He pointed out that the company makes about $1.6 billion in recurring, high-margin subscription revenue and sees more than $1.1 billion in gross profit from that side of the business. \"The problem is, they lose money. How do you lose money if you're generating a billion one of recurring gross profit dollars?\" said Siegel. \"Well, you take all of that gross profit and you spend it to try and chase new growth.\" He said Peloton could generate around $500 million in EBITDA if it cuts research and development, marketing and other corporate expenses. For example, Peloton's marketing budget is around 25% of annual sales, and if the company reduces it to even 10%, it would still be in the \"upper echelon of most brands,\" said Siegel. \"Their debt is scary on a company that's burning cash, their debt's not scary at all on a company that can make half a billion dollars of EBITDA,\" he said. \"They have a business that's generating a tremendous amount of cash. They need to stop spending it.\" In May, Peloton announced it would cut 15% of its corporate workforce, but it may be more reluctant to back off its growth strategy. Peloton founder John Foley set a goal of growing to 100 million members, and McCarthy adopted the target when he took over. As of the end of March, Peloton had about 6.6 million members — woefully behind that long-term target. Since the company announced its cost cutting plan, McCarthy's departure and another disastrous earnings report in early May, Peloton has been largely mum on its strategy. It said that it's searching for a new permanent CEO, and the person it hires will offer clues about the company's direction. If it hires another \"hyper growth tech CEO\" like McCarthy – who had done stints at Netflix and Spotify – then Peloton will likely face the same issues, Siegel said. But if it taps someone different, it could signal a strategy shift.\n\nContent magic",
    "summary": "Before the refinancing, Peloton would have needed to pay around $800 million toward its debt by November 2025.\nNow that it has refinanced, Peloton has eased investor concerns about liquidity and has the breathing room it needs to try to turn around its business.\nPeloton faces risks aheadWhile the refinance may have bought Peloton some time, it's far from a panacea.\nUnder the terms, Peloton will now be spending about $133 million annually in interest, up from around $89 million previously.\nAs of the end of March, Peloton had about 6.6 million members — woefully behind that long-term target.",
    "keywords": [
      "refinancing",
      "staved",
      "does",
      "threatened",
      "crunch",
      "cash",
      "pelotons",
      "debt",
      "business",
      "billion",
      "company",
      "million",
      "peloton",
      "position"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107327243-1698864973814-gettyimages-1757875748-PELOTON_EARNS.jpeg?v=1719877146&w=1920&h=1080",
    "clean_body": "article pton follow favorite stock create free account peloton bike inside showroom new york u wednesday nov peloton interactive inc scheduled release earnings figure november michael nagle bloomberg getty image peloton longer face imminent liquidity crunch massive debt refinancing company still long road ahead fix business get back profitability late may connected fitness company secured new billion term loan raised million convertible senior note received new million line credit jp morgan goldman sachs due refinance reduced pelotons debt billion around billion pushed looming due date loan likely wouldnt cash pay back refinancing peloton would needed pay around million toward debt november managed pay another million still would due around three month later term loan would due may peloton hasnt turned net profit since december seen sale fall nine straight quarter debt pile posed existential threat fueled investor concern possible bankruptcy refinanced peloton eased investor concern liquidity breathing room need try turn around business fact able secure loan signal investor believe ability rightsize business eventually pay back restructuring expert told cnbc refinancing putting u much better position sustainable profitable growth much stronger financial footing investor saw finance chief liz coddington told cnbc interview think believe story believe trying transformation business great vote confidence pelotons future peloton face risk ahead refinance may bought peloton time far panacea term peloton spending million annually interest around million previously make pelotons effort sustain positive free cash flow difficult coddington acknowledged cnbc higher interest expense going impact free cash flow said thats partly company started cut cost early may plan expected reduce annual runrate expense million even higher interest payment coddington expects company able sustain positive free cash flow without business materially grow near term cost reduction plan made u much comfortable said coddington peloton insists investor bought refinance believe strategy could trying put better position company fails two pelotons largest debt holder soros fund management silver point capital known sometimes invest distressed company since peloton loan invested secured near top capital structure peloton cant turn business around end position considering filing bankruptcy creditor would strong position take control company would describe refinancing slash recapitalization sort opportunistic said evan dufaux special situation analyst creditsights expert distressed debt think thats sort smart opportunistic kind tricky move silver point declined comment soros didnt return request comment cost cut come peloton far better cash position month ago company still need address demand issue plagued since covid pandemic wound figure kind business future really exercise kicking road refinancing buy time doesnt actually fix underlying problem peloton said neil saunders managing director globaldata retail different issue refinancing following former ceo barry mccarthy departure two board member karen boone chris bruzzo charge peloton need decide content company like netflix fitness hardware company need develop new strategy sell pricey equipment far straddling proven unsuccessful theyre going make decision part model survivable part thing advance forward without losing great brand value still currently especially loyal following said scott stuart ceo turnaround management association expert corporate restructurings money doesnt fix everything issue becomes money take refinance problematic becomes added simeon siegel retail analyst bmo capital market said peloton start addressing issue forgetting trying grow business instead focus bear hugging million brand loyalist pointed company make billion recurring highmargin subscription revenue see billion gross profit side business problem lose money lose money youre generating billion one recurring gross profit dollar said siegel well take gross profit spend try chase new growth said peloton could generate around million ebitda cut research development marketing corporate expense example pelotons marketing budget around annual sale company reduces even would still upper echelon brand said siegel debt scary company thats burning cash debt scary company make half billion dollar ebitda said business thats generating tremendous amount cash need stop spending may peloton announced would cut corporate workforce may reluctant back growth strategy peloton founder john foley set goal growing million member mccarthy adopted target took end march peloton million member -- woefully behind longterm target since company announced cost cutting plan mccarthy departure another disastrous earnings report early may peloton largely mum strategy said searching new permanent ceo person hire offer clue company direction hire another hyper growth tech ceo like mccarthy - done stint netflix spotify - peloton likely face issue siegel said tap someone different could signal strategy shift content magic",
    "sentiment": 0.13872812732036036,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/fda-approves-eli-lilly-alzheimers-drug-donanemab.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/fda-approves-eli-lilly-alzheimers-drug-donanemab.html",
    "date": "2024-07-02",
    "time": "19:56:28 UTC",
    "title": "FDA approves Eli Lilly Alzheimer’s drug, expanding treatment options in the U.S.",
    "body": "A sign with the company logo sits outside of the headquarters campus of Eli Lilly and Company on March 17, 2024 in Indianapolis, Indiana.\n\nThe Food and Drug Administration on Tuesday approved Eli Lilly 's Alzheimer's drug donanemab, expanding the limited treatment options for the mind-wasting disease in the U.S.\n\nThe agency approved the treatment, which will be sold under the brand name Kisunla, for adults with early symptomatic Alzheimer's disease, according to the company.\n\nNearly 7 million Americans have the condition, the fifth-leading cause of death for adults over 65, according to the Alzheimer's Association. By 2050, that group is projected to rise to almost 13 million in the U.S.\n\n\"This is real progress. Today's approval allows people more options and greater opportunity to have more time,\" said Joanne Pike, president and CEO of the Alzheimer's Association. \"Having multiple treatment options is the kind of advancement we've all been waiting for — all of us who have been touched, even blindsided, by this difficult and devastating disease.\"\n\nIt's a long-awaited win for Eli Lilly after donanemab faced obstacles in its path to market. The FDA rejected the drug's approval last year due to insufficient data, then surprisingly delayed it again in March. Last month, an advisory panel to the agency recommended the treatment for full approval, saying the benefits outweigh its risks.",
    "summary": "A sign with the company logo sits outside of the headquarters campus of Eli Lilly and Company on March 17, 2024 in Indianapolis, Indiana.\nThe Food and Drug Administration on Tuesday approved Eli Lilly 's Alzheimer's drug donanemab, expanding the limited treatment options for the mind-wasting disease in the U.S.\nThe agency approved the treatment, which will be sold under the brand name Kisunla, for adults with early symptomatic Alzheimer's disease, according to the company.\n\"Having multiple treatment options is the kind of advancement we've all been waiting for — all of us who have been touched, even blindsided, by this difficult and devastating disease.\"\nIt's a long-awaited win for Eli Lilly after donanemab faced obstacles in its path to market.",
    "keywords": [
      "approves",
      "donanemab",
      "disease",
      "expanding",
      "drug",
      "approval",
      "treatment",
      "fda",
      "alzheimers",
      "eli",
      "options",
      "million",
      "lilly"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/108001068-1719946337795-Untitled-5.jpg?v=1719946386&w=1920&h=1080",
    "clean_body": "sign company logo sits outside headquarters campus eli lilly company march indianapolis indiana food drug administration tuesday approved eli lilly alzheimers drug donanemab expanding limited treatment option mindwasting disease u agency approved treatment sold brand name kisunla adult early symptomatic alzheimers disease according company nearly million american condition fifthleading cause death adult according alzheimers association group projected rise almost million u real progress today approval allows people option greater opportunity time said joanne pike president ceo alzheimers association multiple treatment option kind advancement weve waiting -- u touched even blindsided difficult devastating disease longawaited win eli lilly donanemab faced obstacle path market fda rejected drug approval last year due insufficient data surprisingly delayed march last month advisory panel agency recommended treatment full approval saying benefit outweigh risk",
    "sentiment": 0.13703007518796995,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/florida-panthers-games-local-broadcast-stations.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/florida-panthers-games-local-broadcast-stations.html",
    "date": "2024-07-02",
    "time": "20:46:06 UTC",
    "title": "Florida Panthers games are moving from cable to local broadcast stations",
    "body": "Sergei Bobrovsky, #72, and the Florida Panthers celebrate the Stanley Cup win following a 2-1 victory over the Edmonton Oilers in Game 7 of the NHL Stanley Cup Final at Amerant Bank Arena in Sunrise, Florida, on June 24, 2024.\n\nThe Florida Panthers are skating to a new TV home.\n\nThe National Hockey League Stanley Cup champions have inked a deal to air regular season games on local broadcast networks in Florida and leave behind the cable TV regional sports network that has long been their home.\n\nThe Panthers, which have appeared in the Stanley Cup finals two years in a row, signed a multiyear deal with E.W. Scripps that allows the broadcast station owner to televise all locally produced Panthers preseason and regular season games as well as round one of the playoffs.\n\nThe Panthers are also working with Scripps Sports to launch a streaming service, with further details expected prior to the start of the 2024 season.\n\nTerms of the deal, which begins this coming season, were not disclosed.\n\nProfessional sports teams have been increasingly opting for deals with local broadcast station owners as the regional sports network business is dragged down by consumers leaving the pay TV bundle in favor of streaming.\n\nIn particular, Diamond Sports Group — the owner of the Panthers' prior TV home, Bally Sports Florida — has been under bankruptcy protection since March 2023.\n\n\"After careful review and dialogue, Diamond reached a mutual agreement with the Florida Panthers to end our existing telecast rights contract,\" a Diamond spokesperson said in a statement. \"We greatly value the relationships we have built with the Panthers and their fans, and we wish them the best. We remain in productive discussions with the NHL around go-forward arrangements with our remaining team partners under contract and are focused on reorganizing as a sustainable and profitable entity.\"",
    "summary": "Sergei Bobrovsky, #72, and the Florida Panthers celebrate the Stanley Cup win following a 2-1 victory over the Edmonton Oilers in Game 7 of the NHL Stanley Cup Final at Amerant Bank Arena in Sunrise, Florida, on June 24, 2024.\nThe Florida Panthers are skating to a new TV home.\nThe Panthers, which have appeared in the Stanley Cup finals two years in a row, signed a multiyear deal with E.W.\nScripps that allows the broadcast station owner to televise all locally produced Panthers preseason and regular season games as well as round one of the playoffs.\n\"After careful review and dialogue, Diamond reached a mutual agreement with the Florida Panthers to end our existing telecast rights contract,\" a Diamond spokesperson said in a statement.",
    "keywords": [
      "moving",
      "games",
      "tv",
      "deal",
      "stanley",
      "local",
      "station",
      "diamond",
      "panthers",
      "cup",
      "stations",
      "broadcast",
      "cable",
      "season",
      "florida"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107432782-1719318318618-gettyimages-2159162431-bbs70722_oppwl5t3.jpeg?v=1719950319&w=1920&h=1080",
    "clean_body": "sergei bobrovsky florida panther celebrate stanley cup win following victory edmonton oiler game nhl stanley cup final amerant bank arena sunrise florida june florida panther skating new tv home national hockey league stanley cup champion inked deal air regular season game local broadcast network florida leave behind cable tv regional sport network long home panther appeared stanley cup final two year row signed multiyear deal ew scripps allows broadcast station owner televise locally produced panther preseason regular season game well round one playoff panther also working scripps sport launch streaming service detail expected prior start season term deal begin coming season disclosed professional sport team increasingly opting deal local broadcast station owner regional sport network business dragged consumer leaving pay tv bundle favor streaming particular diamond sport group -- owner panther prior tv home bally sport florida -- bankruptcy protection since march careful review dialogue diamond reached mutual agreement florida panther end existing telecast right contract diamond spokesperson said statement greatly value relationship built panther fan wish best remain productive discussion nhl around goforward arrangement remaining team partner contract focused reorganizing sustainable profitable entity",
    "sentiment": 0.06945542380324989,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/gm-q2-2024-auto-sales.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/gm-q2-2024-auto-sales.html",
    "date": "2024-07-02",
    "time": "16:20:14 UTC",
    "title": "GM reports best U.S. quarterly sales since 2020",
    "body": "Vehicles are offered for sale at a GM dealership in Lincolnwood, Illinois, on June 20, 2024.\n\nDETROIT — General Motors reported its best quarterly sales in more than three years, including notable increases in full-size pickup trucks and all-electric vehicles.\n\nThe Detroit automaker on Tuesday reported sales of 696,086 for the second quarter, up 0.6% from a year earlier and its highest quarterly units sold since the fourth quarter of 2020.\n\nIts EV deliveries increased 40% compared to a year earlier to 21,930 units. Still, EVs made up only 3.2% of its total second-quarter sales.\n\nSales of GM's full-size pickup trucks were roughly 229,000 during the second quarter, up about 6% from a year earlier and the best quarterly sales since 2021.\n\nGM's total sales through the first half of the year were down 0.4%, however, compared to a year earlier to roughly 1.3 million vehicles.\n\nGM's second-quarter sales are expected to slightly outpace the overall industry. Auto industry forecasters such as Cox Automotive and Edmunds expect second-quarter sales industrywide, including July 1, to be roughly level from a year earlier amid slowing retail demand.\n\nAn unknown outlier in the second quarter is how much of an effect cyberattacks on dealer software provider CDK Global will have on sales. The June 19 ransomware attack forced CDK, a market leader, to shut down its dealer management system, affecting close to half of all dealerships in North America.\n\n\"The CDK cyberattacks have thrown a monkey wrench into sales during the second half of June, affecting what is arguably one of the most lucrative and busiest times of the month and quarter for dealerships,\" said Jessica Caldwell, Edmunds' head of insights.\n\nGM, in a statement, said its \"dealers who use the CDK platform are working to meet strong customer demand under difficult circumstances. Some deliveries may be delayed until Q3.\"\n\nDealers, including the industry's largest publicly traded ones, were forced to delay sales or figure out workarounds to sell vehicles since the attacks occurred.\n\nAll six of the major publicly traded franchised dealership groups have disclosed their exposure to the CDK issue. Five of the six — Asbury Automotive Group , AutoNation Inc. , Group 1 Automotive Inc. , Lithia Motors Inc. and Sonic Automotive Inc. — use CDK as their primary dealership management system provider, according to Automotive News.\n\n\"The good news is — unlike other black swan events that the industry has contended with in the past — sales shouldn't be lost or severely deferred, but rather pushed into the third quarter,\" Caldwell said.\n\nSeparately on Tuesday, Toyota reported its second-quarter sales. The company's U.S. sales totaled 621,549 vehicles during the period, up 9.2% compared to a year earlier.\n\nThe Hyundai brand sold 214,719 vehicles during the second quarter, up 2.2% compared to a year earlier.\n\nKia, which reports sales on a monthly basis, reported a 6.5% decrease in its June sales. Its sales for the first half of the year were down about 2% to 386,460 vehicles sold.",
    "summary": "The Detroit automaker on Tuesday reported sales of 696,086 for the second quarter, up 0.6% from a year earlier and its highest quarterly units sold since the fourth quarter of 2020.\nStill, EVs made up only 3.2% of its total second-quarter sales.\nSales of GM's full-size pickup trucks were roughly 229,000 during the second quarter, up about 6% from a year earlier and the best quarterly sales since 2021.\nGM's second-quarter sales are expected to slightly outpace the overall industry.\nKia, which reports sales on a monthly basis, reported a 6.5% decrease in its June sales.",
    "keywords": [
      "second",
      "automotive",
      "reported",
      "reports",
      "best",
      "cdk",
      "vehicles",
      "quarterly",
      "sales",
      "earlier",
      "gm",
      "half",
      "2020",
      "quarter",
      "secondquarter"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107431363-1718909257983-gettyimages-2158470387-l1073322copy_nejuxqbs.jpeg?v=1719937045&w=1920&h=1080",
    "clean_body": "vehicle offered sale gm dealership lincolnwood illinois june detroit -- general motor reported best quarterly sale three year including notable increase fullsize pickup truck allelectric vehicle detroit automaker tuesday reported sale second quarter year earlier highest quarterly unit sold since fourth quarter ev delivery increased compared year earlier unit still ev made total secondquarter sale sale gm fullsize pickup truck roughly second quarter year earlier best quarterly sale since gm total sale first half year however compared year earlier roughly million vehicle gm secondquarter sale expected slightly outpace overall industry auto industry forecaster cox automotive edmunds expect secondquarter sale industrywide including july roughly level year earlier amid slowing retail demand unknown outlier second quarter much effect cyberattacks dealer software provider cdk global sale june ransomware attack forced cdk market leader shut dealer management system affecting close half dealership north america cdk cyberattacks thrown monkey wrench sale second half june affecting arguably one lucrative busiest time month quarter dealership said jessica caldwell edmunds head insight gm statement said dealer use cdk platform working meet strong customer demand difficult circumstance delivery may delayed q dealer including industry largest publicly traded one forced delay sale figure workarounds sell vehicle since attack occurred six major publicly traded franchised dealership group disclosed exposure cdk issue five six -- asbury automotive group autonation inc group automotive inc lithia motor inc sonic automotive inc -- use cdk primary dealership management system provider according automotive news good news -- unlike black swan event industry contended past -- sale shouldnt lost severely deferred rather pushed third quarter caldwell said separately tuesday toyota reported secondquarter sale company u sale totaled vehicle period compared year earlier hyundai brand sold vehicle second quarter compared year earlier kia report sale monthly basis reported decrease june sale sale first half year vehicle sold",
    "sentiment": 0.042803030303030315,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/media-mogul-barry-diller-weighs-a-bid-to-gain-control-of-paramount.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/media-mogul-barry-diller-weighs-a-bid-to-gain-control-of-paramount.html",
    "date": "2024-07-02",
    "time": "20:50:05 UTC",
    "title": "Media mogul Barry Diller weighs a bid to gain control of Paramount",
    "body": "A new suitor for Paramount Global has emerged.\n\nMedia mogul Barry Diller is taking a look at acquiring National Amusements Inc., the company owned by Shari Redstone and the controlling shareholder of Paramount, CNBC's David Faber reported on Tuesday.\n\nDiller's IAC , an internet media and publishing company, has signed a nondisclosure agreement and is looking in the data room of National Amusements, Faber said Tuesday. IAC could make a decision in the near term to place a bid on National Amusements, which would give it a controlling stake in Paramount, he said, citing sources.\n\nThese discussions come weeks after National Amusements stopped talks with Skydance on a proposed merger with Paramount.\n\nFollowing months of deal talks with a consortium that included David Ellison's Skydance and private equity firms RedBird Capital and KKR, the deal was called off as it awaited signoff from Redstone. National Amusements, which Redstone controls, holds 77% of class A Paramount shares.\n\nPrior to calling off the proposed merger, National Amusements had agreed to financial terms of the deal, CNBC reported. The proposed deal would have seen Redstone receive $2 billion for National Amusements, with Skydance buying out nearly 50% of class B Paramount shares at $15 apiece, or $4.5 billion. Skydance and RedBird had also agreed to contribute $1.5 billion in cash to Paramount's balance sheet to help reduce debt.",
    "summary": "Media mogul Barry Diller is taking a look at acquiring National Amusements Inc., the company owned by Shari Redstone and the controlling shareholder of Paramount, CNBC's David Faber reported on Tuesday.\nDiller's IAC , an internet media and publishing company, has signed a nondisclosure agreement and is looking in the data room of National Amusements, Faber said Tuesday.\nThese discussions come weeks after National Amusements stopped talks with Skydance on a proposed merger with Paramount.\nNational Amusements, which Redstone controls, holds 77% of class A Paramount shares.\nPrior to calling off the proposed merger, National Amusements had agreed to financial terms of the deal, CNBC reported.",
    "keywords": [
      "proposed",
      "talks",
      "skydance",
      "reported",
      "national",
      "mogul",
      "paramount",
      "control",
      "barry",
      "amusements",
      "gain",
      "bid",
      "redstone",
      "billion",
      "diller",
      "deal",
      "media",
      "weighs"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/106216489-1572545732717nup_187507_0391.jpg?v=1572545981&w=1920&h=1080",
    "clean_body": "new suitor paramount global emerged medium mogul barry diller taking look acquiring national amusement inc company owned shari redstone controlling shareholder paramount cnbcs david faber reported tuesday dillers iac internet medium publishing company signed nondisclosure agreement looking data room national amusement faber said tuesday iac could make decision near term place bid national amusement would give controlling stake paramount said citing source discussion come week national amusement stopped talk skydance proposed merger paramount following month deal talk consortium included david ellison skydance private equity firm redbird capital kkr deal called awaited signoff redstone national amusement redstone control hold class paramount share prior calling proposed merger national amusement agreed financial term deal cnbc reported proposed deal would seen redstone receive billion national amusement skydance buying nearly class b paramount share apiece billion skydance redbird also agreed contribute billion cash paramounts balance sheet help reduce debt",
    "sentiment": 0.042045454545454546,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/nfl-redbird-everpass-sunday-ticket-bars-restaurants.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/nfl-redbird-everpass-sunday-ticket-bars-restaurants.html",
    "date": "2024-07-02",
    "time": "14:43:38 UTC",
    "title": "NFL 'Sunday Ticket' streaming is coming to bars and restaurants this season",
    "body": "Football fans watch the NFL Super Bowl XLVIII game between the Denver Broncos and the Seattle Seahawks on at a sports bar in New Jersey on February 2, 2014.\n\nA satellite dish is no longer the only way bars and restaurants can air the National Football League's package of \"Sunday Ticket\" games.\n\nEverPass Media, the joint venture between the league and private equity firm RedBird Capital Partners that owns the commercial rights to \"Sunday Ticket,\" acquired UPshow, a platform with the tech capabilities to allow commercial establishments to stream live sports. Terms of the deal were undisclosed.\n\nWith this acquisition, bars, restaurants, casinos and other businesses will be able to stream \"Sunday Ticket\" games. Until recently, they could only do so through a subscription to satellite TV provider DirecTV.\n\nDirecTV will remain as a distributor to bars and restaurants, however. EverPass signed a nonexclusive deal with DirecTV last year to continue to distribute \"Sunday Ticket\" games, giving it the ability to reach deals with other distribution platforms.\n\n\"More content is moving to streaming. Regardless of the streaming economics, it's become pretty clear that live sports is an important piece of that,\" said EverPass CEO Alex Kaplan. \"We're going to think about how to deliver a product and service to our customers that's becoming increasingly more challenging for them to sort of aggregate in a meaningful way. We're still in the early days ... but this is a big step for us.\"\n\nThe new distribution option will be available this coming NFL season.\n\nThe acquisition for EverPass comes as more live sports games are being offered exclusively on streaming services — a new frontier for business establishments that have long subscribed to traditional pay TV packages to offer live sports.\n\n\"Sunday Ticket\" is an integral sports package for bars and restaurants since it provides all out-of-market NFL games.\n\nIn late 2022, Google' s YouTube TV acquired the residential rights to \"Sunday Ticket\" for roughly $2 billion a year, a deal which runs over seven years. DirecTV had been the owner and exclusive residential and commercial distributor of the games since the package's inception in 1994.\n\nThis followed a deal for Amazon' s Prime Video to become the exclusive home of \"Thursday Night Football\" — part of the 11-year NFL media rights agreement worth more than $100 billion.\n\nSince then, the media rights owners of NFL games have begun to offer games simultaneously on their streaming services — and in some cases exclusively. Earlier this year Comcast 's NBCUniversal aired an NFL wild-card game on Peacock, the first time a postseason game was exclusively offered via streaming. Netflix also recently won the rights to air two NFL games on Christmas this year, and at least one on the holiday in the following two years.",
    "summary": "A satellite dish is no longer the only way bars and restaurants can air the National Football League's package of \"Sunday Ticket\" games.\nWith this acquisition, bars, restaurants, casinos and other businesses will be able to stream \"Sunday Ticket\" games.\n\"Sunday Ticket\" is an integral sports package for bars and restaurants since it provides all out-of-market NFL games.\nSince then, the media rights owners of NFL games have begun to offer games simultaneously on their streaming services — and in some cases exclusively.\nNetflix also recently won the rights to air two NFL games on Christmas this year, and at least one on the holiday in the following two years.",
    "keywords": [
      "games",
      "tv",
      "coming",
      "live",
      "ticket",
      "streaming",
      "nfl",
      "restaurants",
      "rights",
      "bars",
      "deal",
      "season"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/101781397-466642769.jpg?v=1719868337&w=1920&h=1080",
    "clean_body": "football fan watch nfl super bowl xlviii game denver bronco seattle seahawks sport bar new jersey february satellite dish longer way bar restaurant air national football league package sunday ticket game everpass medium joint venture league private equity firm redbird capital partner owns commercial right sunday ticket acquired upshow platform tech capability allow commercial establishment stream live sport term deal undisclosed acquisition bar restaurant casino business able stream sunday ticket game recently could subscription satellite tv provider directv directv remain distributor bar restaurant however everpass signed nonexclusive deal directv last year continue distribute sunday ticket game giving ability reach deal distribution platform content moving streaming regardless streaming economics become pretty clear live sport important piece said everpass ceo alex kaplan going think deliver product service customer thats becoming increasingly challenging sort aggregate meaningful way still early day big step u new distribution option available coming nfl season acquisition everpass come live sport game offered exclusively streaming service -- new frontier business establishment long subscribed traditional pay tv package offer live sport sunday ticket integral sport package bar restaurant since provides outofmarket nfl game late google youtube tv acquired residential right sunday ticket roughly billion year deal run seven year directv owner exclusive residential commercial distributor game since package inception followed deal amazon prime video become exclusive home thursday night football -- part year nfl medium right agreement worth billion since medium right owner nfl game begun offer game simultaneously streaming service -- case exclusively earlier year comcast nbcuniversal aired nfl wildcard game peacock first time postseason game exclusively offered via streaming netflix also recently right air two nfl game christmas year least one holiday following two year",
    "sentiment": 0.1008059316569955,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/powell-says-fed-has-made-quite-a-bit-of-progress-on-inflation-but-needs-more-confidence-before-cutting.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/powell-says-fed-has-made-quite-a-bit-of-progress-on-inflation-but-needs-more-confidence-before-cutting.html",
    "date": "2024-07-02",
    "time": "15:59:34 UTC",
    "title": "Powell says Fed has made 'quite a bit of progress' on inflation but needs more confidence before cutting",
    "body": "U.S. Federal Reserve Bank Chair Jerome Powell announces that interest rates will remain unchanged during a news conference at the Federal Reserves’ William McChesney Martin building on June 12, 2024 in Washington, DC.\n\nFederal Reserve Chair Jerome Powell expressed satisfaction Tuesday with the progress on inflation over the past year but said he wants to see more before being confident enough to start cutting interest rates.\n\n\"We've made quite a bit of progress and in bringing inflation back down to our target,\" Powell said at a central banking forum in Sintra, Portugal.\n\n\"The last [inflation] reading and the one before it to a lesser extent, suggest that we are getting back on the disinflationary path. We want to be more confident that inflation is moving sustainably down toward 2% before we start the process of reducing or loosening policy,\" he added.\n\nPowell spoke at a forum that also included European Central Bank President Christine Lagarde and Brazil central bank Governor Roberto Campos Neto. The forum was presented by the ECB and the discussion was moderated by CNBC's Sara Eisen.\n\nThe comments come with markets closely watching moves from the Fed and its global counterparts as inflation shows signs of easing and some central banks, including the ECB, have slowly started rolling back interest rates.\n\nThe Commerce Department's personal consumption expenditures price index, which the Fed focuses on as its main inflation gauge, rose at a 2.6% 12-month pace in May. That level has come down steadily after being around 4% a year ago, though policymakers do not expect it to reach the Fed's 2% goal until 2026.\n\nWhile Powell said he sees progress on inflation, he's wary of moving too soon and threatening the downward path of price increases, which hit their highest pace since the early 1980s two years ago.\n\n\"We're well aware that if we go too soon, that we can undo the good work we've done,\" he said. \"If we do it too late, we could unnecessarily undermine the recovery and the expansion.\"\n\nRisks of moving too late as opposed to too soon have come into better balance this year as inflation has ebbed and the economy and labor market have stayed strong, Powell added. By contrast, the Fed spent much of the past year worried that cutting rates too soon and allowing inflation to resume its upward trek posed the greater risk.\n\nEarlier this year, markets had expected at least six Fed rate cuts of a quarter percentage point each. Market pricing has since adjusted to anticipate two reductions, one in September and another before the end of the year. However, members of the rate-setting Federal Open Market Committee at their June meeting penciled in just one.\n\nAsked if he thought the Fed might cut in September, Powell responded, \"I'm not going to be landing on any specific dates here today.\"\n\nHe also was asked about whether he was concerned about the political climate and specifically should Donald Trump, a fierce Powell critic, win the November presidential election.\n\n\"I am not focused on that at all, and that's not just a talking point. I really think that we just keep doing our jobs,\" he said.",
    "summary": "Federal Reserve Chair Jerome Powell expressed satisfaction Tuesday with the progress on inflation over the past year but said he wants to see more before being confident enough to start cutting interest rates.\n\"We've made quite a bit of progress and in bringing inflation back down to our target,\" Powell said at a central banking forum in Sintra, Portugal.\nWe want to be more confident that inflation is moving sustainably down toward 2% before we start the process of reducing or loosening policy,\" he added.\nPowell spoke at a forum that also included European Central Bank President Christine Lagarde and Brazil central bank Governor Roberto Campos Neto.\nBy contrast, the Fed spent much of the past year worried that cutting rates too soon and allowing inflation to resume its upward trek posed the greater risk.",
    "keywords": [
      "central",
      "forum",
      "moving",
      "cutting",
      "soon",
      "quite",
      "interest",
      "needs",
      "powell",
      "bit",
      "market",
      "progress",
      "fed",
      "confidence",
      "inflation"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107428179-1718218960225-gettyimages-2157336596-_s2_1692_j2j3phk2.jpeg?v=1718219096&w=1920&h=1080",
    "clean_body": "u federal reserve bank chair jerome powell announces interest rate remain unchanged news conference federal reserve ' william mcchesney martin building june washington dc federal reserve chair jerome powell expressed satisfaction tuesday progress inflation past year said want see confident enough start cutting interest rate weve made quite bit progress bringing inflation back target powell said central banking forum sintra portugal last inflation reading one lesser extent suggest getting back disinflationary path want confident inflation moving sustainably toward start process reducing loosening policy added powell spoke forum also included european central bank president christine lagarde brazil central bank governor roberto campos neto forum presented ecb discussion moderated cnbcs sara eisen comment come market closely watching move fed global counterpart inflation show sign easing central bank including ecb slowly started rolling back interest rate commerce department personal consumption expenditure price index fed focus main inflation gauge rose month pace may level come steadily around year ago though policymakers expect reach fed goal powell said see progress inflation he wary moving soon threatening downward path price increase hit highest pace since early two year ago well aware go soon undo good work weve done said late could unnecessarily undermine recovery expansion risk moving late opposed soon come better balance year inflation ebbed economy labor market stayed strong powell added contrast fed spent much past year worried cutting rate soon allowing inflation resume upward trek posed greater risk earlier year market expected least six fed rate cut quarter percentage point market pricing since adjusted anticipate two reduction one september another end year however member ratesetting federal open market committee june meeting penciled one asked thought fed might cut september powell responded im going landing specific date today also asked whether concerned political climate specifically donald trump fierce powell critic win november presidential election focused thats talking point really think keep job said",
    "sentiment": 0.04795918367346938,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/watch-fed-chair-powell-ecbs-lagarde-speak-live-at-central-bank-policy-forum.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/watch-fed-chair-powell-ecbs-lagarde-speak-live-at-central-bank-policy-forum.html",
    "date": "2024-07-02",
    "time": "15:33:19 UTC",
    "title": "Watch Fed Chair Powell, ECB's Lagarde speak live at central bank policy forum",
    "body": "[The stream is slated to start at 9:30 a.m. ET. Please refresh the page if you do not see a player above at that time.]\n\nFederal Reserve Chair Jerome Powell joins a panel including his global counterparts Tuesday at a European Central Bank forum.\n\nPowell will join ECB President Christine Lagarde and Brazil Central Bank Governor Roberto Campos Neto at the ECB Forum on Central Banking in Sintra, Portugal. CNBC's Sara Eisen will moderate. The forum happens with investors closely watching how central bank policymakers will react to inflation dynamics around the world.\n\nIn the U.S., the Powell-led Fed has kept its main policy rate steady for the past year despite inflation rates well off their mid-2022 peaks. Lagarde's ECB enacted a quarter-percentage-point cut that took its rate down to 4.25%, while Neto's bank cut by a quarter point in May to take its primary rate down to 10.5%.\n\nTraders largely expect the Fed to start cutting in September with another reduction by the end of the year and quarterly moves lower through at least September 2025. However, Fed officials in June indicated they expect just one reduction this year.\n\nRead more:\n\nThe Fed is 'playing with fire' by not cutting rates, says creator of 'Sahm Rule' recession indicator\n\nFed holds rates steady, indicates only one cut coming this year\n\nFed and European Central Bank could cut interest rates in September, Morgan Stanley strategist says\n\nSubscribe to CNBC on YouTube.",
    "summary": "Federal Reserve Chair Jerome Powell joins a panel including his global counterparts Tuesday at a European Central Bank forum.\nPowell will join ECB President Christine Lagarde and Brazil Central Bank Governor Roberto Campos Neto at the ECB Forum on Central Banking in Sintra, Portugal.\nThe forum happens with investors closely watching how central bank policymakers will react to inflation dynamics around the world.\nIn the U.S., the Powell-led Fed has kept its main policy rate steady for the past year despite inflation rates well off their mid-2022 peaks.\nLagarde's ECB enacted a quarter-percentage-point cut that took its rate down to 4.25%, while Neto's bank cut by a quarter point in May to take its primary rate down to 10.5%.",
    "keywords": [
      "forum",
      "speak",
      "steady",
      "watch",
      "reduction",
      "chair",
      "bank",
      "policy",
      "fed",
      "cut",
      "ecbs",
      "central",
      "ecb",
      "powell",
      "lagarde",
      "rate",
      "start",
      "live",
      "rates"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107428173-17182187492024-06-12t185800z_1231664203_rc2o98a4feuz_rtrmadp_0_usa-fed.jpeg?v=1718218795&w=1920&h=1080",
    "clean_body": "stream slated start et please refresh page see player time federal reserve chair jerome powell join panel including global counterpart tuesday european central bank forum powell join ecb president christine lagarde brazil central bank governor roberto campos neto ecb forum central banking sintra portugal cnbcs sara eisen moderate forum happens investor closely watching central bank policymakers react inflation dynamic around world u powellled fed kept main policy rate steady past year despite inflation rate well mid peak lagardes ecb enacted quarterpercentagepoint cut took rate netos bank cut quarter point may take primary rate trader largely expect fed start cutting september another reduction end year quarterly move lower least september however fed official june indicated expect one reduction year read fed playing fire cutting rate say creator sahm rule recession indicator fed hold rate steady indicates one cut coming year fed european central bank could cut interest rate september morgan stanley strategist say subscribe cnbc youtube",
    "sentiment": 0.019703243616287093,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.cnbc.com/2024/07/02/euro-zone-inflation-june-2024.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/07/02/euro-zone-inflation-june-2024.html",
    "date": "2024-07-02",
    "time": "12:08:57 UTC",
    "title": "Euro zone inflation eases to 2.5% as core print misses estimate",
    "body": "watch now\n\nHeadline inflation in the euro area dipped to 2.5% in June, the European Union's statistics agency said Tuesday, while the closely watched core and services prints held steady. The headline figure was in line with the expectations of economists polled by Reuters. Inflation had nudged up from 2.4% in April to 2.6% in May. Core inflation, excluding the volatile effects of energy, food, alcohol and tobacco, stayed at 2.9% from the prior month, narrowly missing the 2.8% economists had forecast. The rate of price rises in services also failed to budge, holding at 4.1%.\n\nInvestors will now parse what the latest data means for the trajectory of interest rates in the 20-nation euro zone, following the European Central Bank's initial 25 basis point cut in June. Volatility in the consumer price index has long been expected this year, as choppy base effects from the energy market unwind. In June, year-on-year energy inflation in the euro zone was 0.2%, a sharp switch from earlier in the year when the sector had a strong disinflationary pull. On Tuesday, ECB Vice President Luis de Guindos told CNBC's Annette Weisbach that, while the central bank was confident that inflation would converge to its 2% target, the coming months would be a \"bumpy road\" and there is no \"predetermined path\" for monetary policy. He was commenting on the sidelines of the ECB Forum on Central Banking in Sintra, Portugal.\n\nwatch now",
    "summary": "watch nowHeadline inflation in the euro area dipped to 2.5% in June, the European Union's statistics agency said Tuesday, while the closely watched core and services prints held steady.\nCore inflation, excluding the volatile effects of energy, food, alcohol and tobacco, stayed at 2.9% from the prior month, narrowly missing the 2.8% economists had forecast.\nInvestors will now parse what the latest data means for the trajectory of interest rates in the 20-nation euro zone, following the European Central Bank's initial 25 basis point cut in June.\nVolatility in the consumer price index has long been expected this year, as choppy base effects from the energy market unwind.\nIn June, year-on-year energy inflation in the euro zone was 0.2%, a sharp switch from earlier in the year when the sector had a strong disinflationary pull.",
    "keywords": [
      "central",
      "price",
      "eases",
      "25",
      "services",
      "economists",
      "estimate",
      "zone",
      "effects",
      "misses",
      "core",
      "print",
      "euro",
      "energy",
      "european",
      "inflation"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/108000700-1719915292949-gettyimages-2156473169-AA_11062024_1723373.jpeg?v=1719915303&w=1920&h=1080",
    "clean_body": "watch headline inflation euro area dipped june european union statistic agency said tuesday closely watched core service print held steady headline figure line expectation economist polled reuters inflation nudged april may core inflation excluding volatile effect energy food alcohol tobacco stayed prior month narrowly missing economist forecast rate price rise service also failed budge holding investor parse latest data mean trajectory interest rate nation euro zone following european central bank initial basis point cut june volatility consumer price index long expected year choppy base effect energy market unwind june yearonyear energy inflation euro zone sharp switch earlier year sector strong disinflationary pull tuesday ecb vice president luis de guindos told cnbcs annette weisbach central bank confident inflation would converge target coming month would bumpy road predetermined path monetary policy commenting sideline ecb forum central banking sintra portugal watch",
    "sentiment": -0.01875,
    "sentiment_category": "negative",
    "t": 313
  },
  "https://www1.cbn.com/cbnnews/us/2024/july/good-samaritan-saves-day-after-discovering-mystery-bible-launching-months-long-quest-to-find-owner": {
    "source": "CBN",
    "url": "https://www1.cbn.com/cbnnews/us/2024/july/good-samaritan-saves-day-after-discovering-mystery-bible-launching-months-long-quest-to-find-owner",
    "date": "2024-07-02",
    "time": "20:22:22 UTC",
    "title": "Good Samaritan Saves Day After Discovering Mystery Bible, Launching Months-Long Quest to Find Owner",
    "body": "It once was lost, but now it’s found.\n\nThat’s the story surrounding a Georgia man’s beloved Bible, which had gone missing for months before the persistence of a good Samaritan changed everything.\n\nListen to the latest episode of “Quick Start”\n\nWilliam Bailey lost his Bible in January, when it fell off his car before he went to church one Wednesday. Bailey told The Courier Herald he had prepared a message to share at church that night and had it tucked inside his Bible before he set the book on his car for a moment.\n\n“We were getting ready to leave, and I sat [the Bible] on top of my car, and my granddaughter called and wanted me to come back inside the house for something,” he told the outlet, explaining he forgot to grab the Bible and put it in the car before driving off. “We got to church, got out, and I thought I had forgotten my Bible.”\n\nThat’s when he realized the book was gone. He and his wife, Dot, prayed for it to be found, but months went by, according to The Courier Herald.\n\nBailey said he was “sick” over the loss and felt he would simply never find it again. Still, being selfless at his core, Bailey told his wife he hoped “whoever found it got some good out of it.”\n\nLittle did he know, someone did find the Bible. A man named Barron Howard, Jr. discovered it in the family’s driveway. And when his grandma, Barbara James, heard about the surprising find, she set out on a mission to locate its rightful owner.\n\n“If I lost my Bible, I would really want it back,” she told The Courier Herald. “I would hope that whoever found it would go the extra steps to find it and get it back to me. I just couldn’t rest.”\n\nJames truly didn’t stop trying, but she wasn’t getting anywhere; she couldn’t find any information in the Bible that would lead her back to the mystery owner. James reportedly did find a number inside the Bible and phoned it twice a day — but no one answered.\n\nThat misfortune changed, though, when she noticed a zipper she had previously overlooked. Inside, she discovered a pamphlet for Faith Baptist Church. It was just the lead James had been desperately looking for. She called the pastor and found out about Bailey’s search for the Bible.\n\nThen, the preacher told Bailey about James, and the two connected — a blessed miracle for Bailey, who was convinced his beloved Bible had been long obliterated by a lawn mower.\n\nJames recently brought the Bible to Dot, who works at a nursing home, and the families connected. Bailey is ecstatic, realizing not everyone would have gone to such lengths to get it back to its owner.\n\n“That’s sentimental stuff to me,” Bailey said of sermon notes and personal commentary inside the Bible. “I thank the Lord that I got it back.”\n\nJames is simply overjoyed she was able to help. Bailey gave her a financial gift for returning his beloved Bible.\n\n***As the number of voices facing big-tech censorship continues to grow, please sign up for Faithwire’s daily newsletter and download the CBN News app, to stay up-to-date with the latest news from a distinctly Christian perspective.***",
    "summary": "That’s the story surrounding a Georgia man’s beloved Bible, which had gone missing for months before the persistence of a good Samaritan changed everything.\nListen to the latest episode of “Quick Start”William Bailey lost his Bible in January, when it fell off his car before he went to church one Wednesday.\nStill, being selfless at his core, Bailey told his wife he hoped “whoever found it got some good out of it.”Little did he know, someone did find the Bible.\n“If I lost my Bible, I would really want it back,” she told The Courier Herald.\nJames reportedly did find a number inside the Bible and phoned it twice a day — but no one answered.",
    "keywords": [
      "lost",
      "samaritan",
      "day",
      "gone",
      "bible",
      "saves",
      "quest",
      "discovering",
      "bailey",
      "launching",
      "good",
      "car",
      "owner",
      "courier",
      "church",
      "inside",
      "james",
      "told",
      "monthslong",
      "mystery"
    ],
    "image_url": "https://www2.cbn.com/sites/default/files/media/slider/images/missingbible_hdv.jpg",
    "clean_body": "lost 's found 's story surrounding georgia man 's beloved bible gone missing month persistence good samaritan changed everything listen latest episode `` quick start '' william bailey lost bible january fell car went church one wednesday bailey told courier herald prepared message share church night tucked inside bible set book car moment '' getting ready leave sat bible top car granddaughter called wanted come back inside house something '' told outlet explaining forgot grab bible put car driving `` got church got thought forgotten bible '' 's realized book gone wife dot prayed found month went according courier herald bailey said `` sick '' loss felt would simply never find still selfless core bailey told wife hoped `` whoever found got good '' little know someone find bible man named barron howard jr discovered family 's driveway grandma barbara james heard surprising find set mission locate rightful owner '' lost bible would really want back '' told courier herald `` would hope whoever found would go extra step find get back could n't rest '' james truly n't stop trying n't getting anywhere could n't find information bible would lead back mystery owner james reportedly find number inside bible phoned twice day -- one answered misfortune changed though noticed zipper previously overlooked inside discovered pamphlet faith baptist church lead james desperately looking called pastor found bailey 's search bible preacher told bailey james two connected -- blessed miracle bailey convinced beloved bible long obliterated lawn mower james recently brought bible dot work nursing home family connected bailey ecstatic realizing everyone would gone length get back owner '' 's sentimental stuff '' bailey said sermon note personal commentary inside bible `` thank lord got back '' james simply overjoyed able help bailey gave financial gift returning beloved bible number voice facing bigtech censorship continues grow please sign faithwire 's daily newsletter download cbn news app stay uptodate latest news distinctly christian perspective",
    "sentiment": 0.12610780423280424,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www1.cbn.com/cbnnews/us/2024/july/want-to-connect-with-gen-z-invite-them-over-for-dinner": {
    "source": "CBN",
    "url": "https://www1.cbn.com/cbnnews/us/2024/july/want-to-connect-with-gen-z-invite-them-over-for-dinner",
    "date": "2024-07-02",
    "time": "20:02:49 UTC",
    "title": "Want to Connect with Gen Z? Invite Them Over for Dinner",
    "body": "ANALYSIS\n\nGen Z is maturing within an unprecedented culture of media saturation. The entire world, via the internet, is available to them at all times on their smartphones.\n\nAnd it’s not always a happy place, nor is it one that’s particularly easy to make sense of. As such, their relationship with media, with themselves — and with other people — is complicated in a number of ways we are still realizing.\n\nBut what if I told you they, just like us, crave and seek out the advice and consolation of trusted people in their real lives when they’re struggling? What if I told you that most prefer to connect face-to-face rather than through technology?\n\nYou might be surprised. After all, the mainstream depiction of Gen Z is often a teen endlessly scrolling on their phone, beset by depression and anxiety, falling slowly away from family and faith.\n\nBut that’s not what they’re like at all. According to recent data in The RELATE Project, the majority of Gen Z wants to talk to trusted parents, mentors, and friends when they’re struggling. Gen Z is seeking connection and intentional relationships. They are surprisingly grounded, community-oriented, prayerful, and intentional as a demographic.\n\nThankfully, breaking down the walls between Gen Z and older generations seems to be something anyone and everyone can do, if they choose. The adolescents interviewed for The RELATE Project were quick to express a desire for authentic, no-fuss dinner-table conversations, recognizing that such an environment lends itself towards engaging in meaningful discussions about life and what’s on their minds. Sharing life and authentic conversations—where both sides listen—also promotes relationship.\n\nThat means that any one of us can make a difference in the lives of Gen Z. Any one of us can open our homes to them, welcome them into our families, and invite them to share their lives, struggles, and joys at our side.\n\nSo invite them for dinner. Ask them to stay awhile. If we want them to flourish, we must unabashedly fling open the doors of our homes to the younger people in our midst, allowing them access to our dinner table, yes, but most importantly to our experiences, our lived wisdom, our relationship with God, our kindness, our time, and even our challenges.\n\nWhy? Because face-to-face interactions in an intimate, authentic setting can be the catalyst for a meaningful, long-term relationship of trust and respect. These relationships provide emerging adults with the tools – and the relationships – they need to thrive now and later on.\n\nOf course, feeding them isn’t the only thing you need to do when they sit down at your table. The most important thing is to listen to them without judgment. They may not always want or even need our advice, but they do need us to actively listen – so be engaged and attentive. A simple “Tell me more,” “Go on,” or “What else?” shows that you are listening and creating space for those at your table to share with ease. Just as Kelly Corrigan advocates in her show Tell Me More, asking thoughtful questions leads to better connections and conversations.\n\nMy family made a practice of intentionally sharing our daily highs and lows at dinner. We found that, in doing so, we laid the groundwork for more complicated, personal, probing conversations — conversations that involved community concerns, faith, friendships, sorrows, and the future. These conversations were a tremendous gift to all of us, and I cherish the intimacy and authenticity we shared over those meals.\n\nThe kitchen table became a place to share the funny stories of our days, the struggles, and how we saw God showing up in our lives. I think our adult kids still feel safe to come to us now thanks in part to relationships built around the dinner table when they were young.\n\nBut this sense of safety, belonging, and trust shouldn’t be limited to our own children or immediate family. It can be extended to every person whose lives we touch, though it may look very different from home to home or from person to person.\n\nYou can, for instance, become the available parent or grandparent, the house where all the kids hang out after school, and create a space of hospitality – where all are welcome. Because it’s in those moments of carpooling, dishing out snacks, and opening your home after baseball or dance practice that opportunities arise to express that they are welcome, valued, and cared about — and that they belong.\n\nCarving out time to build authentic relationships with Gen Z matters. They’ve told us they need us. They’ve told us how they need us. So let’s listen.\n\nDr. Kimberly Nollan is the director of research and evaluation at Young Life.",
    "summary": "According to recent data in The RELATE Project, the majority of Gen Z wants to talk to trusted parents, mentors, and friends when they’re struggling.\nThankfully, breaking down the walls between Gen Z and older generations seems to be something anyone and everyone can do, if they choose.\nThat means that any one of us can make a difference in the lives of Gen Z.\nWe found that, in doing so, we laid the groundwork for more complicated, personal, probing conversations — conversations that involved community concerns, faith, friendships, sorrows, and the future.\nCarving out time to build authentic relationships with Gen Z matters.",
    "keywords": [
      "dinner",
      "gen",
      "conversations",
      "table",
      "need",
      "lives",
      "connect",
      "told",
      "authentic",
      "invite",
      "z",
      "relationships"
    ],
    "image_url": "https://www2.cbn.com/sites/default/files/media/slider/images/peopletalking2.png",
    "clean_body": "analysis gen z maturing within unprecedented culture medium saturation entire world via internet available time smartphones 's always happy place one 's particularly easy make sense relationship medium -- people -- complicated number way still realizing told like u crave seek advice consolation trusted people real life 're struggling told prefer connect facetoface rather technology might surprised mainstream depiction gen z often teen endlessly scrolling phone beset depression anxiety falling slowly away family faith 's 're like according recent data relate project majority gen z want talk trusted parent mentor friend 're struggling gen z seeking connection intentional relationship surprisingly grounded communityoriented prayerful intentional demographic thankfully breaking wall gen z older generation seems something anyone everyone choose adolescent interviewed relate project quick express desire authentic nofuss dinnertable conversation recognizing environment lends towards engaging meaningful discussion life 's mind sharing life authentic conversation -- side listen -- also promotes relationship mean one u make difference life gen z one u open home welcome family invite share life struggle joy side invite dinner ask stay awhile want flourish must unabashedly fling open door home younger people midst allowing access dinner table yes importantly experience lived wisdom relationship god kindness time even challenge facetoface interaction intimate authentic setting catalyst meaningful longterm relationship trust respect relationship provide emerging adult tool - relationship - need thrive later course feeding n't thing need sit table important thing listen without judgment may always want even need advice need u actively listen - engaged attentive simple `` tell '' `` go '' `` else '' show listening creating space table share ease kelly corrigan advocate show tell asking thoughtful question lead better connection conversation family made practice intentionally sharing daily high low dinner found laid groundwork complicated personal probing conversation -- conversation involved community concern faith friendship sorrow future conversation tremendous gift u cherish intimacy authenticity shared meal kitchen table became place share funny story day struggle saw god showing life think adult kid still feel safe come u thanks part relationship built around dinner table young sense safety belonging trust n't limited child immediate family extended every person whose life touch though may look different home home person person instance become available parent grandparent house kid hang school create space hospitality - welcome 's moment carpooling dishing snack opening home baseball dance practice opportunity arise express welcome valued cared -- belong carving time build authentic relationship gen z matter 've told u need u 've told u need u let 's listen dr kimberly nollan director research evaluation young life",
    "sentiment": 0.2392429792429793,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.theguardian.com/money/article/2024/jul/03/private-rents-in-great-britain-hit-record-high-data-shows": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/money/article/2024/jul/03/private-rents-in-great-britain-hit-record-high-data-shows",
    "date": "2024-07-02",
    "time": "23:01:51 UTC",
    "title": "Private rents in Great Britain hit record high, data shows",
    "body": "Average private rents in Great Britain have climbed to record highs, prompting a call for the next government to prioritise measures to help create an extra 120,000 rental properties.\n\nData shows that the typical advertised rent outside London reached a record £1,316 a calendar month in May, the property website Rightmove said. The figure for London was £2,652 a month – almost three times the £894 asked for in north-east England.\n\nRightmove said the average advertised rent outside London in May was an inflation-busting 7% higher than a year earlier.\n\nIn the capital, meanwhile, an improvement in the balance between supply and demand meant annual rent growth has slowed from its peak of 18% in 2022 to 4% in May this year, still higher than the 2% official consumer prices index (CPI) inflation figure for May.\n\nRightmove called on the next government “to accelerate housebuilding and incentivise landlords to invest in more homes for tenants” to help tackle the supply and demand imbalances and stabilise rental growth.\n\nIt said its analysis showed about 120,000 more rental properties were needed to return rent growth to “more normal levels” of about 2% a year, based on current demand.\n\nRent rises have been blamed largely on demand greatly outstripping supply, exacerbated by landlords with buy-to-let mortgages trying to pass on sizeable increases in their costs caused by higher interest rates.\n\nIn many areas there were “nowhere near enough homes to satisfy the number of tenants looking to move”, Rightmove said.\n\nScotland was the hardest hit by supply and demand imbalances, the property company said. By contrast, the situation had improved in London owing to fewer tenants looking to move and an increase in available properties to rent.\n\nTim Bannister, Rightmove’s property expert, said: “It’s easy to forget there was a time before the pandemic where rental price growth was more stable. [Annual] price growth at 7% suggests we are still out of balance.”\n\nHe added: “The next government should be prioritising an improvement to the planning process, an acceleration of housebuilding, and encouraging more supply into the rental market.”\n\nSeparate figures from Propertymark, a professional body for estate and letting agents, showed there were about nine new applicants registered for each available UK property in May.\n\nIt said that though most of its members reported that rents were continuing to increase or were static, there was some good news for prospective tenants with 18% of firms reporting rents falling against 12% in April.",
    "summary": "Average private rents in Great Britain have climbed to record highs, prompting a call for the next government to prioritise measures to help create an extra 120,000 rental properties.\nData shows that the typical advertised rent outside London reached a record £1,316 a calendar month in May, the property website Rightmove said.\nRightmove said the average advertised rent outside London in May was an inflation-busting 7% higher than a year earlier.\nIn many areas there were “nowhere near enough homes to satisfy the number of tenants looking to move”, Rightmove said.\nScotland was the hardest hit by supply and demand imbalances, the property company said.",
    "keywords": [
      "growth",
      "rents",
      "high",
      "britain",
      "supply",
      "great",
      "rental",
      "higher",
      "tenants",
      "shows",
      "private",
      "property",
      "data",
      "rent",
      "record",
      "hit",
      "london",
      "demand"
    ],
    "image_url": "https://i.guim.co.uk/img/media/5589e152eb6e305527a3c801f479e772b5a6d94c/0_400_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=42b6746028a64decd9180cda6c949ee7",
    "clean_body": "average private rent great britain climbed record high prompting call next government prioritise measure help create extra rental property data show typical advertised rent outside london reached record PS calendar month may property website rightmove said figure london PS month - almost three time PS asked northeast england rightmove said average advertised rent outside london may inflationbusting higher year earlier capital meanwhile improvement balance supply demand meant annual rent growth slowed peak may year still higher official consumer price index cpi inflation figure may rightmove called next government `` accelerate housebuilding incentivise landlord invest home tenant '' help tackle supply demand imbalance stabilise rental growth said analysis showed rental property needed return rent growth `` normal level '' year based current demand rent rise blamed largely demand greatly outstripping supply exacerbated landlord buytolet mortgage trying pas sizeable increase cost caused higher interest rate many area `` nowhere near enough home satisfy number tenant looking move '' rightmove said scotland hardest hit supply demand imbalance property company said contrast situation improved london owing fewer tenant looking move increase available property rent tim bannister rightmove 's property expert said `` 's easy forget time pandemic rental price growth stable annual price growth suggests still balance '' added `` next government prioritising improvement planning process acceleration housebuilding encouraging supply rental market '' separate figure propertymark professional body estate letting agent showed nine new applicant registered available uk property may said though member reported rent continuing increase static good news prospective tenant firm reporting rent falling april",
    "sentiment": 0.2433518862090291,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.theguardian.com/money/article/2024/jul/02/a-stranger-seems-to-have-taken-over-our-address": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/money/article/2024/jul/02/a-stranger-seems-to-have-taken-over-our-address",
    "date": "2024-07-02",
    "time": "06:00:37 UTC",
    "title": "A stranger seems to have taken over our address",
    "body": "For the last three months, we have been receiving mail addressed to a stranger. We have lived at our address for over 40 years.\n\nThey have been from the Department for Work and Pensions, the police about speeding tickets, and our local council. He’s even put his name on our water bills.\n\nMy guess is he is trying to show proof of address to get benefits. I have sent it all back explaining this person is a fraudster, even alerting Action Fraud. How can I stop our home being used for fraud?\n\nJN, London\n\nThis is an unnerving experience. It does seem likely the stranger has used your address to validate a fake identity to claim benefits or credit. The good news is that he does not appear to have stolen your names and therefore you don’t face a trashed credit rating.\n\nCredit reports are based on an individual, not an address, and you are not liable for any bills or fines he incurs using your address.\n\nThe bad news is there’s no simple way of stopping the flow of mail other than sending it back marked “not known at this address”.\n\nScratch out the barcode on the envelope in case a human eye does not read and note your message. Keep your household’s entry on the electoral register up to date so that anyone not resident is removed, and keep an eye on bank statements.\n\nThe time to worry is if unfamiliar transactions start appearing in your name. You could consider applying for protective registration with the crime prevention agency Cifas.\n\nA warning flag against your name and address will show you are at heightened risk of identity fraud, so organisations will know to carry out extra checks to ensure they are dealing with you, not a fraudster.\n\nEmail your.problems@observer.co.uk. Include an address and phone number. Submission and publication are subject to our terms and conditions",
    "summary": "For the last three months, we have been receiving mail addressed to a stranger.\nMy guess is he is trying to show proof of address to get benefits.\nIt does seem likely the stranger has used your address to validate a fake identity to claim benefits or credit.\nCredit reports are based on an individual, not an address, and you are not liable for any bills or fines he incurs using your address.\nScratch out the barcode on the envelope in case a human eye does not read and note your message.",
    "keywords": [
      "fraud",
      "eye",
      "used",
      "credit",
      "mail",
      "does",
      "taken",
      "benefits",
      "identity",
      "address",
      "stranger"
    ],
    "image_url": "https://i.guim.co.uk/img/media/0fa6d07e1ad7afce19033943cceb77bbff5855a6/0_0_4288_2573/master/4288.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=16bb332e0c48c929f64e51902584596a",
    "clean_body": "last three month receiving mail addressed stranger lived address year department work pension police speeding ticket local council 's even put name water bill guess trying show proof address get benefit sent back explaining person fraudster even alerting action fraud stop home used fraud jn london unnerving experience seem likely stranger used address validate fake identity claim benefit credit good news appear stolen name therefore n't face trashed credit rating credit report based individual address liable bill fine incurs using address bad news 's simple way stopping flow mail sending back marked `` known address '' scratch barcode envelope case human eye read note message keep household 's entry electoral register date anyone resident removed keep eye bank statement time worry unfamiliar transaction start appearing name could consider applying protective registration crime prevention agency cifas warning flag name address show heightened risk identity fraud organisation know carry extra check ensure dealing fraudster email yourproblemsobservercouk include address phone number submission publication subject term condition",
    "sentiment": -0.03186274509803921,
    "sentiment_category": "negative",
    "t": 313
  },
  "https://www.theguardian.com/commentisfree/article/2024/jul/02/labour-plans-britain-private-finance-blackrock": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/02/labour-plans-britain-private-finance-blackrock",
    "date": "2024-07-02",
    "time": "15:30:41 UTC",
    "title": "Labour is putting its plans for Britain in the hands of private finance. It could end badly | Daniela Gabor",
    "body": "The Labour party has a plan for returning to power: it will get BlackRock to rebuild Britain. Its reasoning is straightforward. A cash-strapped government that wants to avoid tax increases or austerity has no choice but to partner with big finance, attracting private investment to rebuild the infrastructure that is crumbling after years of Tory underinvestment. Labour has already done the arithmetic: to mobilise £3 of private capital from institutional investors, you need to offer them £1 in public subsidies. But every time you hear Labour announce such an infrastructure partnership, think of the hidden politics. BlackRock will privatise Britain – our housing, education, health, nature and green energy – with our taxpayer money as sweetener.\n\nBlackRock has long peddled the idea of public-private partnerships for infrastructure, climate and development. Yet its political momentum has recently accelerated. When its chair, Larry Fink, the world’s most powerful financier, sat with world leaders at the G7 summit last month, he promised the following: rich countries need growth, infrastructure investment can deliver that growth, but public debt is too high for the state alone to invest the estimated $75tn (£59tn) necessary by 2040. Trillions, however, are available to asset managers who look after our pensions and insurance contributions (BlackRock, the largest of these firms, manages about $10tn, as a shrinking welfare state pushes us – future pensioners – into its arms).\n\nIf governments work with big finance, Fink explained, they can unlock these trillions. But to do so, they will need to mint public infrastructure into investable assets that can generate steady returns for investors. Why does BlackRock need the state? Why can’t it deploy trillions without the government’s helping hand? The British public remembers all too well PFIs, the private finance initiatives through which the state ended up paying extortionate amounts to private contractors that designed, built, financed or operated public services such as prisons, schools and hospitals before handing them back to the state, often in poor condition.\n\nBut for big finance, there is more now at stake. In this golden age of infrastructure, financiers plan to own our infrastructure outright and transform it into a source of steady revenue. Since buying Global Infrastructure Partners in January 2024, BlackRock holds about $150bn in infrastructure assets, including US renewable energy companies, wastewater services in France and airports in England and Australia. It plans to expand aggressively, just like other private infrastructure funds. Direct ownership is the main game, but not the only one. Big finance can also invest in infrastructure indirectly, by lending to private infrastructure companies. The key is returns. For this, BlackRock wants the state to “derisk” investments. This financial jargon was included in the 2024 Labour manifesto, and it in essence involves the state stepping in to improve the returns on infrastructure assets.\n\nThe choice here is not merely between public and private financing of public goods, but whether British citizens should tolerate the government handing out public subsidies for privatised infrastructure. Housing is only one example of the areas where these investors can already be glimpsed. Institutional landlords – the most prominent being Blackstone, the private equity fund – can acquire residential housing by participating in the privatisation of public housing. After the global financial crisis, the firm also bought up nonperforming mortgages, and since then it has gone on a global shopping spree, snapping up homes across the US and Europe. In the past year, Blackstone bought new rental homes in Britain worth about £1.4bn from the housebuilding company Vistry.\n\nLook behind Blackstone’s returns – which come from rents and rising house prices – and you will find the state’s footprint. The government has helped to guarantee and derisk these returns through regulations that favour asset owners over renters, through economic policies that support house price inflation and through the provision of income support – such as housing benefit – that allows renters to continue paying their institutional landlords. Although we’re told that partnering with these investors is a means of solving the housing crisis, it often delivers the opposite: higher rents, the displacement of lower-income tenants who are often from minority groups, and less affordable housing. This explains the backlash against institutional landlords, from Copenhagen to Berlin, Dublin and Madrid. Yet such public pressure will only be effective once the state returns to building public housing.\n\nLabour’s strategy raises a bigger set of questions about the type of state we want. Starmer’s vision for government-by-BlackRock reduces the question of state capacity to “how do I get BlackRock to invest in infrastructure assets?” This model involves the state in effect subsidising the privatisation of everyday life. This doesn’t only make it harder to bring public goods back into public ownership; it also allows big finance to tighten the grip on the social contract with citizens, and to become the ultimate arbiter of climate, energy and welfare politics, which will have profound distributional, structural and political consequences.\n\nAlready, BlackRock is betting on becoming a key provider of green energy infrastructure – though its actual commitment to tackling the climate crisis only extends so far. The firm has lobbied heavily against European proposals to regulate its lending to fossil fuel interests with penalties, and has instead called for voluntary climate commitments. It is aiming to rapidly grow its green energy profits by tapping the government subsidies that will probably be provided through Starmer’s GB Energy, and through the US Inflation Reduction Act.\n\nBut the profits BlackRock will hope to generate through investing in green energy are likely to come at a huge cost. In Britain, we know that the public ownership of green energy is more effective at lowering consumer bills, accelerating the green transition and creating good jobs. The risk is not only that our climate future will be vastly more expensive if actors such as BlackRock are driving it, but that this future will also produce a more unequal society, where citizens equate green measures with unaffordable public services. This may well provide the kindling for authoritarian, far-right fossil-fuel politics that reject the green transition and frame it as an assault on people’s living standards.\n\nInstead, we should plan creatively for a future where extreme climate events necessitate permanent state intervention, from price controls to buffer stocks and public ownership. What’s needed is a big green state. For this, we first need to repair a serious failure of macroeconomic policy imagination that regards the public purse as too small to fund transformative public infrastructure. To do so will require a radical transformation of the state. The state that Rachel Reeves, the likely future chancellor, promises us must break down the neoliberal walls between monetary, fiscal and industrial policy, and scrap low-tax regimes for multinational corporations and individuals with high net worths. It must shrink the power of big finance. This would be a gigantic undertaking, but it is the only realistic one we have.\n\nDaniela Gabor is professor of economics and macrofinance at UWE Bristol",
    "summary": "BlackRock will privatise Britain – our housing, education, health, nature and green energy – with our taxpayer money as sweetener.\nIf governments work with big finance, Fink explained, they can unlock these trillions.\nBut to do so, they will need to mint public infrastructure into investable assets that can generate steady returns for investors.\nIt plans to expand aggressively, just like other private infrastructure funds.\nBig finance can also invest in infrastructure indirectly, by lending to private infrastructure companies.",
    "keywords": [
      "end",
      "green",
      "britain",
      "finance",
      "public",
      "labour",
      "putting",
      "big",
      "housing",
      "blackrock",
      "private",
      "plans",
      "infrastructure",
      "energy",
      "hands",
      "gabor",
      "state",
      "daniela"
    ],
    "image_url": "https://i.guim.co.uk/img/media/c071e20b82c15daf8cf031d488d449abda0349dc/0_76_5486_3291/master/5486.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=b03fbf7c3a8684eeece0e3845b572697",
    "clean_body": "labour party plan returning power get blackrock rebuild britain reasoning straightforward cashstrapped government want avoid tax increase austerity choice partner big finance attracting private investment rebuild infrastructure crumbling year tory underinvestment labour already done arithmetic mobilise PS private capital institutional investor need offer PS public subsidy every time hear labour announce infrastructure partnership think hidden politics blackrock privatise britain - housing education health nature green energy - taxpayer money sweetener blackrock long peddled idea publicprivate partnership infrastructure climate development yet political momentum recently accelerated chair larry fink world 's powerful financier sat world leader g summit last month promised following rich country need growth infrastructure investment deliver growth public debt high state alone invest estimated tn PStn necessary trillion however available asset manager look pension insurance contribution blackrock largest firm manages tn shrinking welfare state push u - future pensioner - arm government work big finance fink explained unlock trillion need mint public infrastructure investable asset generate steady return investor blackrock need state ca n't deploy trillion without government 's helping hand british public remembers well pfis private finance initiative state ended paying extortionate amount private contractor designed built financed operated public service prison school hospital handing back state often poor condition big finance stake golden age infrastructure financier plan infrastructure outright transform source steady revenue since buying global infrastructure partner january blackrock hold bn infrastructure asset including u renewable energy company wastewater service france airport england australia plan expand aggressively like private infrastructure fund direct ownership main game one big finance also invest infrastructure indirectly lending private infrastructure company key return blackrock want state `` derisk '' investment financial jargon included labour manifesto essence involves state stepping improve return infrastructure asset choice merely public private financing public good whether british citizen tolerate government handing public subsidy privatised infrastructure housing one example area investor already glimpsed institutional landlord - prominent blackstone private equity fund - acquire residential housing participating privatisation public housing global financial crisis firm also bought nonperforming mortgage since gone global shopping spree snapping home across u europe past year blackstone bought new rental home britain worth PSbn housebuilding company vistry look behind blackstone 's return - come rent rising house price - find state 's footprint government helped guarantee derisk return regulation favour asset owner renter economic policy support house price inflation provision income support - housing benefit - allows renter continue paying institutional landlord although 're told partnering investor mean solving housing crisis often delivers opposite higher rent displacement lowerincome tenant often minority group le affordable housing explains backlash institutional landlord copenhagen berlin dublin madrid yet public pressure effective state return building public housing labour 's strategy raise bigger set question type state want starmer 's vision governmentbyblackrock reduces question state capacity `` get blackrock invest infrastructure asset '' model involves state effect subsidising privatisation everyday life n't make harder bring public good back public ownership also allows big finance tighten grip social contract citizen become ultimate arbiter climate energy welfare politics profound distributional structural political consequence already blackrock betting becoming key provider green energy infrastructure - though actual commitment tackling climate crisis extends far firm lobbied heavily european proposal regulate lending fossil fuel interest penalty instead called voluntary climate commitment aiming rapidly grow green energy profit tapping government subsidy probably provided starmer 's gb energy u inflation reduction act profit blackrock hope generate investing green energy likely come huge cost britain know public ownership green energy effective lowering consumer bill accelerating green transition creating good job risk climate future vastly expensive actor blackrock driving future also produce unequal society citizen equate green measure unaffordable public service may well provide kindling authoritarian farright fossilfuel politics reject green transition frame assault people 's living standard instead plan creatively future extreme climate event necessitate permanent state intervention price control buffer stock public ownership 's needed big green state first need repair serious failure macroeconomic policy imagination regard public purse small fund transformative public infrastructure require radical transformation state state rachel reef likely future chancellor promise u must break neoliberal wall monetary fiscal industrial policy scrap lowtax regime multinational corporation individual high net worth must shrink power big finance would gigantic undertaking realistic one daniela gabor professor economics macrofinance uwe bristol",
    "sentiment": 0.041791486291486275,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.theguardian.com/business/live/2024/jul/02/sainsburys-sales-slow-euro-2024-boost-argos-eurozone-inflation-expected-slow-business-live": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/live/2024/jul/02/sainsburys-sales-slow-euro-2024-boost-argos-eurozone-inflation-expected-slow-business-live",
    "date": "2024-07-02",
    "time": "14:35:29 UTC",
    "title": "Sainsbury’s boss says rate cuts needed to spur consumer spending; eurozone inflation dips to 2.5% – as it happened",
    "body": "11.38 CEST UK rate cuts needed to spur consumer spending, says Sainsbury's boss\n\nThe boss of Sainsbury’s said Britain needs several interest rate cuts to stimulate consumer spending, particularly on non-essential things.\n\nSimon Roberts, the chief executive of Sainsbury’s, said:\n\nCustomers are continuing to be cautious, particularly in the areas of discretionary spending.\n\nHe said consumers’ caution was\n\nnot surprising given everything households have been through in the cost of living crisis. Until we see sequential interest rate cuts, hopefully as soon as possible, that caution from consumers is going to continue on those more discretionary items.\n\nRoberts said when the weather improved, people spent more on things other than food. Last week, when Britain enjoyed a “mini-heatwave” Sainsbury’s sold more fans and cooling equipment than it had sold so far this year.\n\nIt just shows that when the weather does turn, customers do want to buy into what they need to enjoy the summer.\n\nSainsbury’s said shoppers continued to buy more items of food from its shelves than a year before but grocery sales growth slowed to 4.8% in the latest quarter from 7.3% in the previous quarter as inflation across the market eased.\n\nAt its Argos chain, sales fell by 6.2%, even though it sold 25% more TVs than a year before as sports fans prepared to watch the men’s Euro 2024 football tournament.\n\nThe retailer said the decline reflected “an unseasonal start to summer”, with cold and wet weather hitting sales of summer goods such as paddling pools and garden furniture that did well in a hot start to the summer last year.",
    "summary": "11.38 CEST UK rate cuts needed to spur consumer spending, says Sainsbury's bossThe boss of Sainsbury’s said Britain needs several interest rate cuts to stimulate consumer spending, particularly on non-essential things.\nSimon Roberts, the chief executive of Sainsbury’s, said:Customers are continuing to be cautious, particularly in the areas of discretionary spending.\nUntil we see sequential interest rate cuts, hopefully as soon as possible, that caution from consumers is going to continue on those more discretionary items.\nLast week, when Britain enjoyed a “mini-heatwave” Sainsbury’s sold more fans and cooling equipment than it had sold so far this year.\nIt just shows that when the weather does turn, customers do want to buy into what they need to enjoy the summer.",
    "keywords": [
      "needed",
      "weather",
      "sainsburys",
      "cuts",
      "rate",
      "quarter",
      "summer",
      "spending",
      "sales",
      "start",
      "dips",
      "spur",
      "inflation",
      "sold",
      "happened",
      "eurozone"
    ],
    "image_url": "https://i.guim.co.uk/img/media/cfd0ae8766e8bc9310cc8e468f0845a0075cb810/0_200_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=639360a41f55b64dc62c2fa13c56d74a",
    "clean_body": "cest uk rate cut needed spur consumer spending say sainsburys bos bos sainsbury 's said britain need several interest rate cut stimulate consumer spending particularly nonessential thing simon robert chief executive sainsbury 's said customer continuing cautious particularly area discretionary spending said consumer ' caution surprising given everything household cost living crisis see sequential interest rate cut hopefully soon possible caution consumer going continue discretionary item robert said weather improved people spent thing food last week britain enjoyed `` miniheatwave '' sainsbury 's sold fan cooling equipment sold far year show weather turn customer want buy need enjoy summer sainsbury 's said shopper continued buy item food shelf year grocery sale growth slowed latest quarter previous quarter inflation across market eased argo chain sale fell even though sold tv year sport fan prepared watch men 's euro football tournament retailer said decline reflected `` unseasonal start summer '' cold wet weather hitting sale summer good paddling pool garden furniture well hot start summer last year",
    "sentiment": 0.13659420289855073,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.theguardian.com/business/article/2024/jul/02/eurozone-inflation-eases-but-ecb-likely-to-keeping-interest-rates-on-hold": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/business/article/2024/jul/02/eurozone-inflation-eases-but-ecb-likely-to-keeping-interest-rates-on-hold",
    "date": "2024-07-02",
    "time": "11:56:21 UTC",
    "title": "Eurozone inflation eases but ECB likely to keep interest rates on hold",
    "body": "Inflation across the eurozone slowed to 2.5% in June despite lingering pressure on households from price increases in the service sector, leaving the European Central Bank on track to keep interest rates on hold this month.\n\nAnnual inflation in consumer prices across the 20-country bloc eased from 2.6% in May, according to a flash estimate from the EU statistical agency Eurostat, matching financial market expectations.\n\nHowever, core inflation – which strips out food, energy, alcohol and tobacco – remained unchanged at 2.9%, marginally higher than predicted by economists in a reflection of stubborn inflationary pressures.\n\nAnalysts said the figures were unlikely to encourage the ECB to cut interest rates again at its next policy meeting on 18 July, after it became the first big global central bank to reduce official borrowing costs, in June.\n\n“Nothing in these figures would make the ECB cut again in July, and we think it’ll be eagerly awaiting data over the summer before seriously debating a next rate cut in September,” said Bert Colijn, the senior eurozone economist at the Dutch bank ING.\n\n“The summer is set to be relatively boring [for the ECB]. It can afford not to carry out another rate cut based on the too-high core inflation reading and labour market strength, and will likely just await incoming data on wages, inflation and growth. It can also see how market turmoil around the French elections plays out.”\n\nIn its flash estimate for June, Eurostat figures showed services had the highest annual inflation rate at 4.1%, a stable rate compared with May. Annual price growth for food, alcohol and tobacco slowed from 2.6% in May to 2.5%.\n\nRiccardo Marcelli Fabiani, a senior economist at the consultancy Oxford Economics, said: “Inflation resumed its descent after it had been temporarily interrupted in May, and it will continue to fall as inflationary pressures wane thanks to easing wage growth, lower energy prices and normalised price expectations. But core inflation remaining stable reminds us that the disinflationary process will be bumpy.”\n\nThe ECB cut its main deposit rate last month to 3.75% from a record high of 4%, putting it ahead of the US Federal Reserve and the Bank of England, which have yet to cut interest rates. It was the first time that the main eurozone interest rate had been reduced in almost five years.\n\nHowever, the central bank’s president, Christine Lagarde, said on Monday that benign economic developments suggest that further interest rate cuts are not urgent, with a robust labour market and resilient wage growth.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe latest figures come as European stocks fell on Tuesday to the lowest level in two weeks, amid worries about the outcome of the French election and heightened economic uncertainty across the eurozone.\n\nPierre Roke, a senior analyst at Validus Risk Management, said rising political uncertainty and inflationary pressures could force the ECB to keep rates on hold for longer than anticipated in financial markets, where traders are poised for a second rate cut in September.\n\nA second rate cut “feels ambitious”, he said. “We certainly see higher rates as a bigger risk from here than lower.”",
    "summary": "Inflation across the eurozone slowed to 2.5% in June despite lingering pressure on households from price increases in the service sector, leaving the European Central Bank on track to keep interest rates on hold this month.\nAnalysts said the figures were unlikely to encourage the ECB to cut interest rates again at its next policy meeting on 18 July, after it became the first big global central bank to reduce official borrowing costs, in June.\nIt can afford not to carry out another rate cut based on the too-high core inflation reading and labour market strength, and will likely just await incoming data on wages, inflation and growth.\nIt was the first time that the main eurozone interest rate had been reduced in almost five years.\nA second rate cut “feels ambitious”, he said.",
    "keywords": [
      "eases",
      "ecb",
      "hold",
      "rate",
      "interest",
      "bank",
      "figures",
      "market",
      "senior",
      "rates",
      "inflation",
      "likely",
      "cut",
      "eurozone"
    ],
    "image_url": "https://i.guim.co.uk/img/media/79e944df44865965d665a8658861335d7ed8a22a/0_265_7952_4774/master/7952.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fc76507f4fe37a80720286a6b484cd55",
    "clean_body": "inflation across eurozone slowed june despite lingering pressure household price increase service sector leaving european central bank track keep interest rate hold month annual inflation consumer price across country bloc eased may according flash estimate eu statistical agency eurostat matching financial market expectation however core inflation - strip food energy alcohol tobacco - remained unchanged marginally higher predicted economist reflection stubborn inflationary pressure analyst said figure unlikely encourage ecb cut interest rate next policy meeting july became first big global central bank reduce official borrowing cost june '' nothing figure would make ecb cut july think 'll eagerly awaiting data summer seriously debating next rate cut september '' said bert colijn senior eurozone economist dutch bank ing '' summer set relatively boring ecb afford carry another rate cut based toohigh core inflation reading labour market strength likely await incoming data wage inflation growth also see market turmoil around french election play '' flash estimate june eurostat figure showed service highest annual inflation rate stable rate compared may annual price growth food alcohol tobacco slowed may riccardo marcelli fabiani senior economist consultancy oxford economics said `` inflation resumed descent temporarily interrupted may continue fall inflationary pressure wane thanks easing wage growth lower energy price normalised price expectation core inflation remaining stable reminds u disinflationary process bumpy '' ecb cut main deposit rate last month record high putting ahead u federal reserve bank england yet cut interest rate first time main eurozone interest rate reduced almost five year however central bank 's president christine lagarde said monday benign economic development suggest interest rate cut urgent robust labour market resilient wage growth skip past newsletter promotion sign business today free daily newsletter get set working day - well point business news analysis need every morning enter email address sign privacy notice newsletter may contain info charity online ad content funded outside party information see newsletter may contain info charity online ad content funded outside party information see privacy policy use google recaptcha protect website google privacy policy term service apply newsletter promotion latest figure come european stock fell tuesday lowest level two week amid worry outcome french election heightened economic uncertainty across eurozone pierre roke senior analyst validus risk management said rising political uncertainty inflationary pressure could force ecb keep rate hold longer anticipated financial market trader poised second rate cut september second rate cut `` feel ambitious '' said `` certainly see higher rate bigger risk lower ''",
    "sentiment": 0.055215946843853815,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.theguardian.com/global-development/article/2024/jul/02/obsession-with-growth-is-enriching-elites-and-killing-the-planet-we-need-an-economy-based-on-human-rights-olivier-de-schutter": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/global-development/article/2024/jul/02/obsession-with-growth-is-enriching-elites-and-killing-the-planet-we-need-an-economy-based-on-human-rights-olivier-de-schutter",
    "date": "2024-07-02",
    "time": "05:00:34 UTC",
    "title": "Obsession with growth is enriching elites and killing the planet. We need an economy based on human rights",
    "body": "Economic growth will bring prosperity to all. This is the mantra that guides the decision-making of the vast majority of politicians, economists and even human rights bodies.\n\nYet the reality – as detailed in a report to the United Nations Human Rights Council this month – shows that while poverty eradication has historically been promised through the “trickling down” or “redistribution” of wealth, economic growth largely “gushes up” to a privileged few.\n\nIn the past four years alone the world’s five richest men have more than doubled their fortunes, while nearly 5 billion people have been made poorer. If current trends continue, 575 million people will still be trapped in extreme poverty in 2030 – the deadline set by the world’s governments to eradicate it. Currently, more than 4 billion people have no access whatsoever to social protection.\n\nHundreds of millions of people are struggling to survive in a world that has never been wealthier; many are driven to exhaustion in poorly paid, often dangerous jobs to satisfy the needs of the elite and to boost corporate profits. In low-income countries, where significant investment is still required, growth can still serve a useful role. In practice, however, it is often extractive, relying on the exploitation of a cheap workforce and the plundering of natural resources.\n\nConcrete steps can be taken now, starting with choosing measures of progress other than gross domestic product\n\nThe endless quest for growth at all costs, and the escalating use of the natural resources it demands, is pushing our planet way beyond its limits. Six of the nine “planetary boundaries” – Earth’s life-support systems – have already been crossed. For too long, the health of our planet has been sacrificed for inequitable material gain.\n\nOur economies are failing us. We urgently need to look beyond profit, beyond the short term and beyond the interests of the few.\n\nA “human rights economy” can deliver for people and the planet because it shifts our focus from growth to humanity – grounding the purpose of the economy in fundamental, universal human values. It offers human rights as a guardrail to keep the economy on track – meeting the challenges of the climate crisis, addressing inequalities and eradicating poverty.\n\nThis proposition is not some fairytale. Concrete steps can be taken now, starting with choosing measures of progress other than gross domestic product (GDP) – which tells us nothing about the ecological or social fallout of economic activity.\n\nAnd we need to start valuing what really counts. GDP has no way of accounting for the estimated 16.4bn hours spent every day worldwide on unpaid work, largely carried out by women, that underpins the global economy: caring for children, people with disabilities and older citizens.\n\nUnpaid domestic and care work should be remunerated through paid parental and carers’ leave, included in pension calculations, and supported through access to safe water, sanitation, affordable childcare facilities and other essential services.\n\nFinancing these services while reducing our dependence on GDP growth is achievable through progressive tax policies such as inheritance and wealth taxes, preventing illegal financial flows and tax evasion, and tackling corruption. More effective international cooperation on tax, debt and social protection is also needed.\n\nskip past newsletter promotion Sign up to Global Dispatch Free newsletter Get a different world view with a roundup of the best news, features and pictures, curated by our global development team Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThis is a major undertaking. The barriers are real: most people have been led to believe that economic growth equals human progress. Yet a growing movement is rallying against our growth-driven economic model: climate activists, workers and trade unions, scientists and academics, young people, environmental and human rights defenders, Indigenous peoples, progressive economists, and activists fighting inequality, gender disparities and colonialism are speaking out.\n\nAs world leaders prepare to gather for the Summit of the Future in September – a UN initiative that aims to forge a global consensus around what our future should look like – this groundswell of support for an alternative vision of progress must be embraced. Without a roadmap for a global economy that protects human rights, including the right to a clean, healthy and sustainable environment, the final document leaders agree in New York will continue to lead us down the path to extinction.",
    "summary": "Economic growth will bring prosperity to all.\nThis is the mantra that guides the decision-making of the vast majority of politicians, economists and even human rights bodies.\nA “human rights economy” can deliver for people and the planet because it shifts our focus from growth to humanity – grounding the purpose of the economy in fundamental, universal human values.\nIt offers human rights as a guardrail to keep the economy on track – meeting the challenges of the climate crisis, addressing inequalities and eradicating poverty.\nThe barriers are real: most people have been led to believe that economic growth equals human progress.",
    "keywords": [
      "growth",
      "obsession",
      "social",
      "planet",
      "elites",
      "need",
      "human",
      "tax",
      "enriching",
      "global",
      "economy",
      "killing",
      "progress",
      "rights",
      "economic",
      "world"
    ],
    "image_url": "https://i.guim.co.uk/img/media/f4f44d4a4627404169f3480e498acd4672d62a80/0_276_5184_3110/master/5184.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=fe45a09166f7376d69208f83c498c690",
    "clean_body": "economic growth bring prosperity mantra guide decisionmaking vast majority politician economist even human right body yet reality - detailed report united nation human right council month - show poverty eradication historically promised `` trickling '' `` redistribution '' wealth economic growth largely `` gush '' privileged past four year alone world 's five richest men doubled fortune nearly billion people made poorer current trend continue million people still trapped extreme poverty - deadline set world 's government eradicate currently billion people access whatsoever social protection hundred million people struggling survive world never wealthier many driven exhaustion poorly paid often dangerous job satisfy need elite boost corporate profit lowincome country significant investment still required growth still serve useful role practice however often extractive relying exploitation cheap workforce plundering natural resource concrete step taken starting choosing measure progress gross domestic product endless quest growth cost escalating use natural resource demand pushing planet way beyond limit six nine `` planetary boundary '' - earth 's lifesupport system - already crossed long health planet sacrificed inequitable material gain economy failing u urgently need look beyond profit beyond short term beyond interest `` human right economy '' deliver people planet shift focus growth humanity - grounding purpose economy fundamental universal human value offer human right guardrail keep economy track - meeting challenge climate crisis addressing inequality eradicating poverty proposition fairytale concrete step taken starting choosing measure progress gross domestic product gdp - tell u nothing ecological social fallout economic activity need start valuing really count gdp way accounting estimated bn hour spent every day worldwide unpaid work largely carried woman underpins global economy caring child people disability older citizen unpaid domestic care work remunerated paid parental carers ' leave included pension calculation supported access safe water sanitation affordable childcare facility essential service financing service reducing dependence gdp growth achievable progressive tax policy inheritance wealth tax preventing illegal financial flow tax evasion tackling corruption effective international cooperation tax debt social protection also needed skip past newsletter promotion sign global dispatch free newsletter get different world view roundup best news feature picture curated global development team enter email address sign privacy notice newsletter may contain info charity online ad content funded outside party information see newsletter may contain info charity online ad content funded outside party information see privacy policy use google recaptcha protect website google privacy policy term service apply newsletter promotion major undertaking barrier real people led believe economic growth equal human progress yet growing movement rallying growthdriven economic model climate activist worker trade union scientist academic young people environmental human right defender indigenous people progressive economist activist fighting inequality gender disparity colonialism speaking world leader prepare gather summit future september - un initiative aim forge global consensus around future look like - groundswell support alternative vision progress must embraced without roadmap global economy protects human right including right clean healthy sustainable environment final document leader agree new york continue lead u path extinction",
    "sentiment": 0.09353022708285869,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://news.sky.com/story/general-election-2024-what-the-markets-are-making-of-the-results-13162466": {
    "source": "Skynews",
    "url": "https://news.sky.com/story/general-election-2024-what-the-markets-are-making-of-the-results-13162466",
    "date": "2024-07-02",
    "time": "15:15:00 UTC",
    "title": "General election 2024: Markets buoyed by Labour landslide after Tory turmoil",
    "body": "The pound has remained stable and the markets have reacted positively to Labour's landslide election victory.\n\nShares in leading companies on the UK stock exchange have risen reflecting expectations among investors of a period of stability after years of market volatility under the Conservatives.\n\nThe top-flight FTSE 100 rose up to 0.4% at the open before falling back after recording its best day in almost two months in the previous session.\n\nElection latest: Results as they are declared\n\nIt was outpaced by the domestically focussed FTSE 250 which was up 1.8% at one point, hitting its highest level since April 2022, and despite a slight paring saw sustained gains.\n\nEuropean stocks also rose to more than one-week highs in response to the UK election result.\n\nThe pan-European STOXX 600 index was up 0.4%, touching its highest level since 26 June.\n\nMeanwhile, the pound held firm after the big win by Sir Keir Starmer's party, ending 14 years of Conservative government.\n\nSterling rose 0.1% against the dollar to $1.27 - the highest level since mid June - and was up 0.01% on the euro at €1.18.\n\nAdvertisement\n\nLabour's victory had been widely expected and priced into financial markets.\n\nHow to watch and follow the election All the information you need to see the results come in, wherever or however you like. Tap here\n\nThe cost of UK state borrowing also dipped slightly as trading opened.\n\nThe rate the government has to pay to borrow money through the benchmark 10-year bond, initially fell 0.8 percentage points on Friday morning.\n\nThe dip largely held as trading progressed through the morning with the rate settling at 4.18%.\n\nRead more:\n\nAnalysis: Was this a 'loveless landslide'?\n\nWhy this election has shattered records\n\nWho is your local MP now? Find out here\n\nBen Ritchie, head of developed market equities at abrdn said: \"A landslide victory provides the sort of clarity and\n\nstability that equity markets need in an increasingly volatile world.\n\n\"If the new government get this right, businesses with significant exposure to the UK economy should be the likely winners.\"\n\nPlease use Chrome browser for a more accessible video player 2:34 Public service cuts under both Labour and Tories - thinktank\n\nDan Coatsworth, investment analyst at AJ Bell, said: \"The general election has resulted in a significant political shift for the UK and investors appear to welcome the changing of the guard, judging by how the more domestically focused FTSE 250 got off to a very strong start.\"\n\nHe added: \"The FTSE 100's 0.4% gain today is the best market reaction for the first day of a new UK prime minister since the blue-chip index was created in 1984.\"\n\nSterling has edged up since Rishi Sunak called the election on 22 May, earlier than anticipated.\n\nIt is the strongest-performing major currency against the dollar this year, with a gain of 0.3%.\n\nOn a trade-weighted basis, the pound is now back where it was in 2016, at the time of the Brexit vote, reflecting a belief among traders that a period of market turmoil may be drawing to a close.\n\nKenneth Broux of Societe Generale said: \"We know Labour were going to win, so this doesn't change much and this isn't a game-changer for sterling.\n\n\"We now want to know what Labour's plans are.\"\n\nPlease use Chrome browser for a more accessible video player 2:46 'Never seen electoral collapse like this'\n\nLabour under Jeremy Corbyn in 2019 was widely seen as negative for the economy by the City but, under Sir Keir's leadership, the party has shifted towards more traditional Tory territory.\n\nThe party has promised a focus on bolstering economic growth, improving the country's relationship with the EU and providing business with a policy clear path ahead.\n\nIn opposition it cashed in on the frustrations of the last parliament for investors amid a series of own goals, such as the fallout from the mini-budget under the short-lived Downing Street tenure of Liz Truss, who has now lost her seat.\n\nBut Rachel Reeves, who is poised to become the country's first female chancellor, is likely to enjoy only a short honeymoon period.\n\nFollow Sky News on WhatsApp Keep up with all the latest news from the UK and around the world by following Sky News Tap here\n\nStretched public finances, largely a result of COVID pandemic support and aid for energy bills following Russia's invasion of Ukraine, will limit Labour's ability to splash the cash given the party's commitment not to raise the mainstream taxes.\n\nBe the first to get Breaking News Install the Sky News app for free\n\nDespite that, expect a flood of demands for what is available from investors and business groups alike ahead of the first budget of the new parliament, expected in the autumn.",
    "summary": "The pound has remained stable and the markets have reacted positively to Labour's landslide election victory.\nThe top-flight FTSE 100 rose up to 0.4% at the open before falling back after recording its best day in almost two months in the previous session.\nEuropean stocks also rose to more than one-week highs in response to the UK election result.\nMeanwhile, the pound held firm after the big win by Sir Keir Starmer's party, ending 14 years of Conservative government.\nHow to watch and follow the election All the information you need to see the results come in, wherever or however you like.",
    "keywords": [
      "uk",
      "level",
      "ftse",
      "general",
      "investors",
      "pound",
      "turmoil",
      "sky",
      "labour",
      "party",
      "rose",
      "market",
      "tory",
      "election",
      "2024",
      "landslide",
      "markets",
      "buoyed"
    ],
    "image_url": "https://e3.365dm.com/23/09/1600x900/skynews-keir-starmer-rachel-reeves_6293951.jpg?20230922130337",
    "clean_body": "pound remained stable market reacted positively labour landslide election victory share leading company uk stock exchange risen reflecting expectation among investor period stability year market volatility conservative topflight ftse rose open falling back recording best day almost two month previous session election latest result declared outpaced domestically focussed ftse one point hitting highest level since april despite slight paring saw sustained gain european stock also rose oneweek high response uk election result paneuropean stoxx index touching highest level since june meanwhile pound held firm big win sir keir starmers party ending year conservative government sterling rose dollar highest level since mid june euro EUR advertisement labour victory widely expected priced financial market watch follow election information need see result come wherever however like tap cost uk state borrowing also dipped slightly trading opened rate government pay borrow money benchmark year bond initially fell percentage point friday morning dip largely held trading progressed morning rate settling read analysis loveless landslide election shattered record local mp find ben ritchie head developed market equity abrdn said landslide victory provides sort clarity stability equity market need increasingly volatile world new government get right business significant exposure uk economy likely winner please use chrome browser accessible video player public service cut labour tory thinktank dan coatsworth investment analyst aj bell said general election resulted significant political shift uk investor appear welcome changing guard judging domestically focused ftse got strong start added ftse gain today best market reaction first day new uk prime minister since bluechip index created sterling edged since rishi sunak called election may earlier anticipated strongestperforming major currency dollar year gain tradeweighted basis pound back time brexit vote reflecting belief among trader period market turmoil may drawing close kenneth broux societe generale said know labour going win doesnt change much isnt gamechanger sterling want know labour plan please use chrome browser accessible video player never seen electoral collapse like labour jeremy corbyn widely seen negative economy city sir keirs leadership party shifted towards traditional tory territory party promised focus bolstering economic growth improving country relationship eu providing business policy clear path ahead opposition cashed frustration last parliament investor amid series goal fallout minibudget shortlived downing street tenure liz truss lost seat rachel reef poised become country first female chancellor likely enjoy short honeymoon period follow sky news whatsapp keep latest news uk around world following sky news tap stretched public finance largely result covid pandemic support aid energy bill following russia invasion ukraine limit labour ability splash cash given party commitment raise mainstream tax first get breaking news install sky news app free despite expect flood demand available investor business group alike ahead first budget new parliament expected autumn",
    "sentiment": 0.21701976911976908,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/business/economy/auto-sales-second-quarter.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/business/economy/auto-sales-second-quarter.html",
    "date": "2024-07-02",
    "time": "19:19:27 UTC",
    "title": "Auto Sales Grew Slightly in Second Quarter",
    "body": "Much of the auto industry, with the notable exception of Tesla, reported modest sales growth in the three months through June as high interest rates, high vehicle prices and uncertainty about the economy weighed on consumers.\n\nSales in late June were also slowed by disruptions at car dealers stemming from a cyberattack on a company that supplies software and data services to dealerships.\n\nCox Automotive, a market research firm, estimated on Tuesday that 4.1 million new cars and trucks were sold in the second quarter in the United States, up a little from the period in 2023. That’s a marked slowdown from the year’s first three months, when sales grew 5 percent. In the first six months of 2024, 7.9 million new vehicles were sold, an increase of 3 percent from the first half of last year, Cox said.\n\nSlow growth is likely to continue through the end of the year, said Jonathan Smoke, Cox’s chief economist. “The market is roiled by uncertainty,” he said. “We probably can’t quite keep the pace of sales of the first half, but we aren’t expecting a collapse in sales.”",
    "summary": "Much of the auto industry, with the notable exception of Tesla, reported modest sales growth in the three months through June as high interest rates, high vehicle prices and uncertainty about the economy weighed on consumers.\nSales in late June were also slowed by disruptions at car dealers stemming from a cyberattack on a company that supplies software and data services to dealerships.\nThat’s a marked slowdown from the year’s first three months, when sales grew 5 percent.\nSlow growth is likely to continue through the end of the year, said Jonathan Smoke, Cox’s chief economist.\n“We probably can’t quite keep the pace of sales of the first half, but we aren’t expecting a collapse in sales.”",
    "keywords": [
      "second",
      "growth",
      "slightly",
      "high",
      "sales",
      "market",
      "auto",
      "half",
      "grew",
      "months",
      "uncertainty",
      "quarter",
      "million",
      "sold",
      "weighed"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/02/business/02auto-sales/02auto-sales-facebookJumbo.jpg",
    "clean_body": "much auto industry notable exception tesla reported modest sale growth three month june high interest rate high vehicle price uncertainty economy weighed consumer sale late june also slowed disruption car dealer stemming cyberattack company supply software data service dealership cox automotive market research firm estimated tuesday million new car truck sold second quarter united state little period 's marked slowdown year 's first three month sale grew percent first six month million new vehicle sold increase percent first half last year cox said slow growth likely continue end year said jonathan smoke cox 's chief economist `` market roiled uncertainty '' said `` probably ca n't quite keep pace sale first half n't expecting collapse sale ''",
    "sentiment": 0.055804473304473294,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/us/politics/504-million-tech-hubs-overlooked-regions.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/us/politics/504-million-tech-hubs-overlooked-regions.html",
    "date": "2024-07-02",
    "time": "21:15:16 UTC",
    "title": "U.S. Awards $504 Million for ‘Tech Hubs’ in Overlooked Regions",
    "body": "The Biden administration awarded $504 million on Tuesday to a dozen projects across the country in a bid to transform communities that had been overlooked in the past into technological powerhouses.\n\nThe grants will fund “tech hubs” that aim to bolster the production of critical technologies in regions including western Montana, central Indiana, South Florida and upstate New York. The hubs are meant to accelerate the growth of advanced industries in the United States, such as biomanufacturing, clean energy, artificial intelligence and personalized medicine.\n\nThe program reflects a federal effort to expand America’s science and technology funding beyond Silicon Valley and a few coastal regions, an initiative that Biden administration officials say will help revitalize areas that have traditionally received less government investment. Proponents say the projects will help create “good-paying” jobs and tap into underutilized pools of workers and resources across the country.\n\nThe $10 billion program was authorized by the CHIPS and Science Act, which Congress passed in 2022 to ramp up the domestic manufacturing of semiconductors and increase funding for scientific research. The idea of spreading technology funding beyond Silicon Valley helped the legislation win broader support from lawmakers representing parts of the country that were eager to benefit.",
    "summary": "The Biden administration awarded $504 million on Tuesday to a dozen projects across the country in a bid to transform communities that had been overlooked in the past into technological powerhouses.\nThe grants will fund “tech hubs” that aim to bolster the production of critical technologies in regions including western Montana, central Indiana, South Florida and upstate New York.\nThe hubs are meant to accelerate the growth of advanced industries in the United States, such as biomanufacturing, clean energy, artificial intelligence and personalized medicine.\nProponents say the projects will help create “good-paying” jobs and tap into underutilized pools of workers and resources across the country.\nThe idea of spreading technology funding beyond Silicon Valley helped the legislation win broader support from lawmakers representing parts of the country that were eager to benefit.",
    "keywords": [
      "tech",
      "valley",
      "awards",
      "program",
      "funding",
      "overlooked",
      "technology",
      "hubs",
      "science",
      "projects",
      "say",
      "silicon",
      "million",
      "regions",
      "504"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/02/multimedia/02dc-techhubs-kgmt/02dc-techhubs-kgmt-facebookJumbo.jpg",
    "clean_body": "biden administration awarded million tuesday dozen project across country bid transform community overlooked past technological powerhouse grant fund `` tech hub '' aim bolster production critical technology region including western montana central indiana south florida upstate new york hub meant accelerate growth advanced industry united state biomanufacturing clean energy artificial intelligence personalized medicine program reflects federal effort expand america 's science technology funding beyond silicon valley coastal region initiative biden administration official say help revitalize area traditionally received le government investment proponent say project help create `` goodpaying '' job tap underutilized pool worker resource across country billion program authorized chip science act congress passed ramp domestic manufacturing semiconductor increase funding scientific research idea spreading technology funding beyond silicon valley helped legislation win broader support lawmaker representing part country eager benefit",
    "sentiment": 0.034740259740259745,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/business/france-economy-macron-national-rally.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/business/france-economy-macron-national-rally.html",
    "date": "2024-07-02",
    "time": "20:33:55 UTC",
    "title": "Macron’s Rivals Say They’ll Fix France’s Economy, but Economists Are Skeptical",
    "body": "One of the messages that helped propel the far-right National Rally to the brink of power in France’s parliamentary elections on Sunday — a once-unthinkable shift — is a common refrain in U.S. politics: It’s the economy, stupid.\n\nBoth the National Rally and a coalition of left-wing parties called New Popular Front won large gains in part by tapping into anger over a cost-of-living crisis and a sense that President Emmanuel Macron had grown out of touch and did not understand their struggles. Voting happens in two rounds, and candidates who reached certain thresholds will move on to the next round on Sunday.\n\nA two-year streak of high inflation has left low- and middle-income French families grappling to pay for basics like energy, gas and food, while wages, in some cases, have failed to keep pace. Polls show that worries over “purchasing power” were a top concern of voters, alongside immigration and security. Blue-collar workers turned out in droves to vote for the National Rally, which is promising to aid households and curb immigration. The New Popular Front came in second with promises to raise wages and lower the retirement age.",
    "summary": "One of the messages that helped propel the far-right National Rally to the brink of power in France’s parliamentary elections on Sunday — a once-unthinkable shift — is a common refrain in U.S. politics: It’s the economy, stupid.\nVoting happens in two rounds, and candidates who reached certain thresholds will move on to the next round on Sunday.\nPolls show that worries over “purchasing power” were a top concern of voters, alongside immigration and security.\nBlue-collar workers turned out in droves to vote for the National Rally, which is promising to aid households and curb immigration.\nThe New Popular Front came in second with promises to raise wages and lower the retirement age.",
    "keywords": [
      "rivals",
      "rally",
      "power",
      "workers",
      "national",
      "popular",
      "macrons",
      "economy",
      "fix",
      "won",
      "voting",
      "immigration",
      "frances",
      "economists",
      "theyll",
      "say",
      "worries",
      "skeptical",
      "wages"
    ],
    "image_url": "https://static01.nyt.com/images/2024/06/30/multimedia/00france-econ-explainer-01-fmcw/00france-econ-explainer-01-fmcw-facebookJumbo.jpg",
    "clean_body": "one message helped propel farright national rally brink power france 's parliamentary election sunday -- onceunthinkable shift -- common refrain u politics 's economy stupid national rally coalition leftwing party called new popular front large gain part tapping anger costofliving crisis sense president emmanuel macron grown touch understand struggle voting happens two round candidate reached certain threshold move next round sunday twoyear streak high inflation left low middleincome french family grappling pay basic like energy gas food wage case failed keep pace poll show worry `` purchasing power '' top concern voter alongside immigration security bluecollar worker turned drove vote national rally promising aid household curb immigration new popular front came second promise raise wage lower retirement age",
    "sentiment": 0.013752563226247455,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/business/bruce-bastian-dead.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/business/bruce-bastian-dead.html",
    "date": "2024-07-02",
    "time": "20:43:11 UTC",
    "title": "Bruce Bastian, a Founder of WordPerfect, Is Dead at 76",
    "body": "Bruce Bastian, a founder of the WordPerfect Corporation, whose word processor was the favored tool for writing during the early days of personal computing — and who later, after coming out as gay, renounced his Mormon faith and funded L.G.B.T.Q. causes — died on June 16 at his home in Palm Springs, Calif. He was 76.\n\nMichael Marriott, the executive director of the B.W. Bastian Foundation, said the cause was complications of pulmonary fibrosis.\n\nMr. Bastian was finishing graduate school at Brigham Young University in the late 1970s when he founded the company that became WordPerfect with Alan C. Ashton, his computer science professor and a grandson of David O. McKay, the influential former president of the Church of Jesus Christ of Latter-day Saints.",
    "summary": "Bruce Bastian, a founder of the WordPerfect Corporation, whose word processor was the favored tool for writing during the early days of personal computing — and who later, after coming out as gay, renounced his Mormon faith and funded L.G.B.T.Q.\ncauses — died on June 16 at his home in Palm Springs, Calif.\nMichael Marriott, the executive director of the B.W.\nBastian Foundation, said the cause was complications of pulmonary fibrosis.\nMr. Bastian was finishing graduate school at Brigham Young University in the late 1970s when he founded the company that became WordPerfect with Alan C. Ashton, his computer science professor and a grandson of David O. McKay, the influential former president of the Church of Jesus Christ of Latter-day Saints.",
    "keywords": [
      "bruce",
      "founder",
      "76",
      "bastian",
      "word",
      "science",
      "school",
      "writing",
      "springs",
      "young",
      "dead",
      "university",
      "wordperfect",
      "tool"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/04/multimedia/02Bastian-02-hpbl-print1/02Bastian-02-hpbl-facebookJumbo.jpg",
    "clean_body": "bruce bastian founder wordperfect corporation whose word processor favored tool writing early day personal computing -- later coming gay renounced mormon faith funded lgbtq cause -- died june home palm spring calif michael marriott executive director bw bastian foundation said cause complication pulmonary fibrosis mr bastian finishing graduate school brigham young university late founded company became wordperfect alan c ashton computer science professor grandson david mckay influential former president church jesus christ latterday saint",
    "sentiment": 0.13958333333333334,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/health/alzheimers-treatment-kisunla-donanemab.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/health/alzheimers-treatment-kisunla-donanemab.html",
    "date": "2024-07-02",
    "time": "18:58:44 UTC",
    "title": "New Drug Approved for Early Alzheimer’s",
    "body": "The Food and Drug Administration on Tuesday approved a new drug for Alzheimer’s disease, the latest in a novel class of treatments that has been greeted with hope, disappointment and skepticism.\n\nThe drug, donanemab, to be sold under the brand name Kisunla, was shown in studies to modestly slow the pace of cognitive decline in early stages of the disease. It also had significant safety risks, including swelling and bleeding in the brain.\n\nKisunla, made by Eli Lilly, is similar to another drug, Leqembi, approved last year. Both are intravenous infusions that attack a protein involved in Alzheimer’s, and both can slow the unfolding of dementia by several months. Both also carry similar safety risks. Leqembi, made by Eisai and Biogen, is given every two weeks; Kisunla is given monthly.\n\nKisunla has a significant difference that may appeal to patients, doctors and insurers: Lilly says patients can stop the drug after it clears the protein, amyloid, which clumps into plaques in the brains of people with Alzheimer’s.",
    "summary": "The Food and Drug Administration on Tuesday approved a new drug for Alzheimer’s disease, the latest in a novel class of treatments that has been greeted with hope, disappointment and skepticism.\nIt also had significant safety risks, including swelling and bleeding in the brain.\nKisunla, made by Eli Lilly, is similar to another drug, Leqembi, approved last year.\nBoth are intravenous infusions that attack a protein involved in Alzheimer’s, and both can slow the unfolding of dementia by several months.\nBoth also carry similar safety risks.",
    "keywords": [
      "protein",
      "early",
      "approved",
      "slow",
      "safety",
      "drug",
      "significant",
      "alzheimers",
      "risks",
      "patients",
      "lilly",
      "similar"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/01/multimedia/00AlzheimersDrug-01b-kzjt/00AlzheimersDrug-01b-kzjt-facebookJumbo.jpg",
    "clean_body": "food drug administration tuesday approved new drug alzheimer 's disease latest novel class treatment greeted hope disappointment skepticism drug donanemab sold brand name kisunla shown study modestly slow pace cognitive decline early stage disease also significant safety risk including swelling bleeding brain kisunla made eli lilly similar another drug leqembi approved last year intravenous infusion attack protein involved alzheimer 's slow unfolding dementia several month also carry similar safety risk leqembi made eisai biogen given every two week kisunla given monthly kisunla significant difference may appeal patient doctor insurer lilly say patient stop drug clear protein amyloid clump plaque brain people alzheimer 's",
    "sentiment": 0.023863636363636354,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/business/student-loan-nonpayment.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/business/student-loan-nonpayment.html",
    "date": "2024-07-02",
    "time": "18:01:29 UTC",
    "title": "Student Loan Borrowers Owe $1.6 Trillion. Nearly Half Aren’t Paying.",
    "body": "After an unprecedented three-year timeout on federal student loan payments because of the pandemic, millions of borrowers began repaying their debt when billing resumed late last year. But nearly as many have not.\n\nThat reality, along with court decisions that regularly upend the rules, has complicated the government’s efforts to restart its system for collecting the $1.6 trillion it is owed.\n\nAt the end of March, six months after the hiatus ended, nearly 20 million borrowers were making their payments as scheduled. But almost 19 million were not, leaving their accounts delinquent, in default or still on pause, according to the latest Education Department data.\n\n“The nonpayment rate really is emblematic of a system that’s not doing its job,” said Persis Yu, the managing counsel for the Student Borrower Protection Center, an advocacy group.",
    "summary": "After an unprecedented three-year timeout on federal student loan payments because of the pandemic, millions of borrowers began repaying their debt when billing resumed late last year.\nThat reality, along with court decisions that regularly upend the rules, has complicated the government’s efforts to restart its system for collecting the $1.6 trillion it is owed.\nAt the end of March, six months after the hiatus ended, nearly 20 million borrowers were making their payments as scheduled.\nBut almost 19 million were not, leaving their accounts delinquent, in default or still on pause, according to the latest Education Department data.\n“The nonpayment rate really is emblematic of a system that’s not doing its job,” said Persis Yu, the managing counsel for the Student Borrower Protection Center, an advocacy group.",
    "keywords": [
      "arent",
      "owe",
      "trillion",
      "student",
      "payments",
      "loan",
      "system",
      "borrowers",
      "upend",
      "unprecedented",
      "nearly",
      "paying",
      "half",
      "yu",
      "million",
      "16"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/01/multimedia/00studentloan-nonpayment-01-jgzf/00studentloan-nonpayment-01-jgzf-facebookJumbo.jpg",
    "clean_body": "unprecedented threeyear timeout federal student loan payment pandemic million borrower began repaying debt billing resumed late last year nearly many reality along court decision regularly upend rule complicated government 's effort restart system collecting trillion owed end march six month hiatus ended nearly million borrower making payment scheduled almost million leaving account delinquent default still pause according latest education department data '' nonpayment rate really emblematic system 's job '' said persis yu managing counsel student borrower protection center advocacy group",
    "sentiment": 0.1,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/business/elon-musk-politics-tesla-sales.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/business/elon-musk-politics-tesla-sales.html",
    "date": "2024-07-02",
    "time": "18:58:58 UTC",
    "title": "Elon Musk’s Politics May Be Pushing Some Buyers Away From Tesla",
    "body": "Few auto executives are as closely identified with the companies they manage as Elon Musk, the chief executive of Tesla, is. And probably none are more prolific in broadcasting their political views on social media.\n\nBut as Mr. Musk’s public persona has become increasingly right wing, Tesla appears to be paying a price in sales, especially to liberal and left-leaning customers who are much more likely to buy battery-powered cars than conservatives are, according to analysts and many car owners who responded to a questionnaire on The New York Times’s website about whether his behavior affected their views of Tesla.\n\nHis image as an erratic, impulsive manager appears to have rubbed off on the cars, raising doubts in some people’s minds about their quality and helping to explain why Tesla sales have been falling. On Tuesday, the company reported that its global sales in the second quarter fell 4.8 percent from the same period a year earlier, after an 8.5 percent drop in the first three months of the year.\n\n“Musk is a true lightning rod,” said Ben Rose, the president of Battle Road Research, which has a generally positive view on Tesla’s stock. “There are people who swear by him and people who swear at him. No question, some of his comments are a real turnoff for some people. For a subset, enough to buy another brand.”",
    "summary": "Few auto executives are as closely identified with the companies they manage as Elon Musk, the chief executive of Tesla, is.\nAnd probably none are more prolific in broadcasting their political views on social media.\nHis image as an erratic, impulsive manager appears to have rubbed off on the cars, raising doubts in some people’s minds about their quality and helping to explain why Tesla sales have been falling.\n“Musk is a true lightning rod,” said Ben Rose, the president of Battle Road Research, which has a generally positive view on Tesla’s stock.\n“There are people who swear by him and people who swear at him.",
    "keywords": [
      "york",
      "musks",
      "tesla",
      "buy",
      "wing",
      "away",
      "sales",
      "views",
      "cars",
      "buyers",
      "elon",
      "yearmusk",
      "swear",
      "pushing",
      "appears",
      "politics"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/02/multimedia/02musk-views-mzkf/02musk-views-mzkf-facebookJumbo.jpg",
    "clean_body": "auto executive closely identified company manage elon musk chief executive tesla probably none prolific broadcasting political view social medium mr musk 's public persona become increasingly right wing tesla appears paying price sale especially liberal leftleaning customer much likely buy batterypowered car conservative according analyst many car owner responded questionnaire new york time 's website whether behavior affected view tesla image erratic impulsive manager appears rubbed car raising doubt people 's mind quality helping explain tesla sale falling tuesday company reported global sale second quarter fell percent period year earlier percent drop first three month year '' musk true lightning rod '' said ben rose president battle road research generally positive view tesla 's stock `` people swear people swear question comment real turnoff people subset enough buy another brand ''",
    "sentiment": 0.16108018965161822,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/business/dealbook/biden-donations-calm-democrats.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/business/dealbook/biden-donations-calm-democrats.html",
    "date": "2024-07-02",
    "time": "20:45:22 UTC",
    "title": "Should a Gusher of Donations Calm Democrats?",
    "body": "Political reality is setting in\n\nPresident Biden’s campaign just announced that it raised $127 million in June, the best month yet for this cycle. It’s the latest effort by the president’s camp to allay Democratic fears about his ability to win, following last week’s debate debacle.\n\nBut donors remain wary, even after a call with top Biden campaign aides on Monday that was meant to shore up their support. That leaves Democrats in a state of protracted anxiety, as a Supreme Court ruling heightened their fears about a second Trump administration.\n\n“Everyone just needs to breathe through the nose for a minute,” Chris Korge, the Democratic National Committee’s finance chair, told more than 500 donors on Monday’s call, according to The Times.\n\nRufus Gifford, a Biden finance chair, promised that the June fund-raising numbers would be strong, setting up Tuesday’s announcement.",
    "summary": "Political reality is setting inPresident Biden’s campaign just announced that it raised $127 million in June, the best month yet for this cycle.\nIt’s the latest effort by the president’s camp to allay Democratic fears about his ability to win, following last week’s debate debacle.\nBut donors remain wary, even after a call with top Biden campaign aides on Monday that was meant to shore up their support.\nThat leaves Democrats in a state of protracted anxiety, as a Supreme Court ruling heightened their fears about a second Trump administration.\nRufus Gifford, a Biden finance chair, promised that the June fund-raising numbers would be strong, setting up Tuesday’s announcement.",
    "keywords": [
      "biden",
      "donations",
      "gusher",
      "democratic",
      "calm",
      "democrats",
      "finance",
      "chair",
      "donors",
      "campaign",
      "win",
      "weeks",
      "setting",
      "fears"
    ],
    "image_url": "https://static01.nyt.com/images/2024/07/02/multimedia/02db-newsletter-biden-ltcb/02db-newsletter-biden-ltcb-facebookJumbo.jpg",
    "clean_body": "political reality setting president biden 's campaign announced raised million june best month yet cycle 's latest effort president 's camp allay democratic fear ability win following last week 's debate debacle donor remain wary even call top biden campaign aide monday meant shore support leaf democrat state protracted anxiety supreme court ruling heightened fear second trump administration '' everyone need breathe nose minute '' chris korge democratic national committee 's finance chair told donor monday 's call according time rufus gifford biden finance chair promised june fundraising number would strong setting tuesday 's announcement",
    "sentiment": 0.2939393939393939,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/travel/glamping-outdoor-resorts.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/travel/glamping-outdoor-resorts.html",
    "date": "2024-07-02",
    "time": "09:02:35 UTC",
    "title": "You Won’t Be Roughing It at These Outdoor Resorts",
    "body": "The handsome interiors at this new 32-acre escape in Texas Hill Country look more like hotel rooms than canvas glamping tents. All have king-size beds (some also have additional twin beds) and en suite bathrooms with rain showers, robes and bath products from San Saba Soap Company in nearby Fredericksburg. Created by Outdoorsy, the peer-to-peer R.V. rental company that branched out into travel endeavors, including high-end outdoor accommodations, the property has 22 climate-controlled tents that sleep two or four people, and have wraparound decks, fire pits, kitchenettes and minibars. If you prefer for someone else to make your favorite drink, head to the outdoor bar for local wines, beers, seasonal cocktails and snacks. There’s also a cafe for light bites. When you need provisions like, say, a steak to grill, pop into the country store by the check-in area.\n\nThe property is in the midst of Hill Country’s trails and wineries, and is a short drive to the dance halls of Luckenbach and Albert. It’s also less than a half-hour drive to Fredericksburg, with its boutiques and eye-catching 19th-century buildings. Prefer to stay in? Catch a movie night or play shuffleboard, darts and other games. Prices from $300 a night.",
    "summary": "The handsome interiors at this new 32-acre escape in Texas Hill Country look more like hotel rooms than canvas glamping tents.\nrental company that branched out into travel endeavors, including high-end outdoor accommodations, the property has 22 climate-controlled tents that sleep two or four people, and have wraparound decks, fire pits, kitchenettes and minibars.\nIf you prefer for someone else to make your favorite drink, head to the outdoor bar for local wines, beers, seasonal cocktails and snacks.\nWhen you need provisions like, say, a steak to grill, pop into the country store by the check-in area.\nIt’s also less than a half-hour drive to Fredericksburg, with its boutiques and eye-catching 19th-century buildings.",
    "keywords": [
      "wont",
      "resorts",
      "hill",
      "country",
      "roughing",
      "tents",
      "property",
      "fredericksburg",
      "prefer",
      "drive",
      "company",
      "outdoor",
      "night"
    ],
    "image_url": "https://static01.nyt.com/images/2024/06/26/travel/oakImage-1719416038826/oakImage-1719416038826-facebookJumbo.jpg",
    "clean_body": "handsome interior new acre escape texas hill country look like hotel room canvas glamping tent kingsize bed also additional twin bed en suite bathroom rain shower robe bath product san saba soap company nearby fredericksburg created outdoorsy peertopeer rv rental company branched travel endeavor including highend outdoor accommodation property climatecontrolled tent sleep two four people wraparound deck fire pit kitchenette minibar prefer someone else make favorite drink head outdoor bar local wine beer seasonal cocktail snack 's also cafe light bite need provision like say steak grill pop country store checkin area property midst hill country 's trail winery short drive dance hall luckenbach albert 's also le halfhour drive fredericksburg boutique eyecatching thcentury building prefer stay catch movie night play shuffleboard dart game price night",
    "sentiment": 0.19385521885521884,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.nytimes.com/2024/07/02/technology/ukraine-war-ai-weapons.html": {
    "source": "New York Times",
    "url": "https://www.nytimes.com/2024/07/02/technology/ukraine-war-ai-weapons.html",
    "date": "2024-07-02",
    "time": "13:09:30 UTC",
    "title": "A.I. Begins Ushering In an Age of Killer Robots",
    "body": "In a field on the outskirts of Kyiv, the founders of Vyriy, a Ukrainian drone company, were recently at work on a weapon of the future.\n\nTo demonstrate it, Oleksii Babenko, 25, Vyriy’s chief executive, hopped on his motorcycle and rode down a dirt path. Behind him, a drone followed, as a colleague tracked the movements from a briefcase-size computer.",
    "summary": "In a field on the outskirts of Kyiv, the founders of Vyriy, a Ukrainian drone company, were recently at work on a weapon of the future.\nTo demonstrate it, Oleksii Babenko, 25, Vyriy’s chief executive, hopped on his motorcycle and rode down a dirt path.\nBehind him, a drone followed, as a colleague tracked the movements from a briefcase-size computer.",
    "keywords": [
      "vyriys",
      "robots",
      "ukrainian",
      "ushering",
      "age",
      "ai",
      "recently",
      "work",
      "rode",
      "path",
      "drone",
      "vyriy",
      "begins",
      "tracked",
      "weapon",
      "killer"
    ],
    "image_url": "https://static01.nyt.com/images/2024/06/17/multimedia/00ukraine-ai-drone-yuri-klbv/00ukraine-ai-drone-yuri-klbv-facebookJumbo.jpg",
    "clean_body": "field outskirt kyiv founder vyriy ukrainian drone company recently work weapon future demonstrate oleksii babenko vyriy 's chief executive hopped motorcycle rode dirt path behind drone followed colleague tracked movement briefcasesize computer",
    "sentiment": -0.1388888888888889,
    "sentiment_category": "negative",
    "t": 313
  },
  "https://www.bbc.com/news/articles/cv2g0w81e45o": {
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/cv2g0w81e45o",
    "date": "2024-07-02",
    "time": "06:23:19 UTC",
    "title": "Sainsbury's hit as wet weather dampens Argos sales",
    "body": "Sainsbury's hit as wet weather dampens Argos sales\n\nSainsbury's has reported a slowdown in sales after the soggy spring weather hit trading at its Argos business.\n\nThe UK's second largest supermarket said it had seen strong food sales, but the wet weather hit demand for garden equipment and outdoor furniture at Argos.\n\nCost of living pressures also hit non-food sales, and Sainsbury's boss Simon Roberts said he expected consumers to remain cautious until interest rates start to fall.\n\nOne analyst suggested the Argos business was an \"albatross\" around the supermarket's neck.\n\nSales overall were up 3% in the 16 weeks to 22 June, Sainsbury's said, but this was slower than in the previous quarter.\n\nFood sales rise 4.8%, with Nectar offers and Aldi price matching helping to attract shoppers.\n\nSainsbury's also said its 'Taste the Difference' premium own brand range had seen sales jump by 14%.\n\nHowever, sales of non-food items were down and Argos saw sales drop 6.2%. Along with the wet weather, the retailer said cost-of-living pressures meant shoppers were still cautious about spending on big ticket items.\n\nArgos also saw weaker demand for consumer electronics, particularly in gaming.\n\nMr Roberts said it was not surprising that consumers were being cautious given the pressure on household finances and he did not expect this to change until there were \"sequential\" cuts in interest rates.\n\nHowever, he added that the weather was a key factor in how and when customers choose to spend. The recent spell of hot weather had triggered a spike in sales of items such as fans and paddling pools.",
    "summary": "Sainsbury's hit as wet weather dampens Argos salesSainsbury's has reported a slowdown in sales after the soggy spring weather hit trading at its Argos business.\nThe UK's second largest supermarket said it had seen strong food sales, but the wet weather hit demand for garden equipment and outdoor furniture at Argos.\nSainsbury's also said its 'Taste the Difference' premium own brand range had seen sales jump by 14%.\nHowever, sales of non-food items were down and Argos saw sales drop 6.2%.\nAlong with the wet weather, the retailer said cost-of-living pressures meant shoppers were still cautious about spending on big ticket items.",
    "keywords": [
      "argos",
      "wet",
      "weather",
      "sainsburys",
      "roberts",
      "saw",
      "dampens",
      "sales",
      "cautious",
      "seen",
      "hit"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/a687/live/815989d0-3851-11ef-8c4c-0b2da78a9418.jpg",
    "clean_body": "sainsburys hit wet weather dampens argo sale sainsburys reported slowdown sale soggy spring weather hit trading argo business uk second largest supermarket said seen strong food sale wet weather hit demand garden equipment outdoor furniture argo cost living pressure also hit nonfood sale sainsburys bos simon robert said expected consumer remain cautious interest rate start fall one analyst suggested argo business albatross around supermarket neck sale overall week june sainsburys said slower previous quarter food sale rise nectar offer aldi price matching helping attract shopper sainsburys also said taste difference premium brand range seen sale jump however sale nonfood item argo saw sale drop along wet weather retailer said costofliving pressure meant shopper still cautious spending big ticket item argo also saw weaker demand consumer electronics particularly gaming mr robert said surprising consumer cautious given pressure household finance expect change sequential cut interest rate however added weather key factor customer choose spend recent spell hot weather triggered spike sale item fan paddling pool",
    "sentiment": 0.0265432098765432,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.bbc.com/news/articles/c0dmvrxnk4jo": {
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/c0dmvrxnk4jo",
    "date": "2024-07-02",
    "time": "16:36:41 UTC",
    "title": "Tesla surprises with better than expected car sales",
    "body": "Tesla surprises with better than expected car sales\n\nThe cyber truck has been selling well, although it is a tiny part of Tesla's business\n\nTesla sales, hit by a significant slump earlier this year, may be showing signs of revival.\n\nElon Musk's electric car-maker delivered nearly 444,000 vehicles in the three months ended 30 June, up more than 14% from the prior quarter.\n\nThat was far more than most analysts had expected - though still down nearly 5% from the same period in 2023.\n\nTesla has been navigating a slowdown in demand, as high borrowing costs weigh on buyers and competition increases.\n\nIt has slashed prices repeatedly to try to win back shoppers, while also introducing low-cost borrowing plans.\n\nBut its success in this has been limited.\n\nThe firm, which announced plans in April to sack more than 10% of its workforce, has seen sales fall in the first half of the year.\n\nAt the start of the year, Tesla blamed its poor performance in part on supply shortages due to shipping disruption in the Red Sea and an alleged arson attack at its factory in Germany.\n\nBut analysts say Tesla needs to freshen its line-up, if it hopes to stop rivals from making inroads.\n\nThe company started selling its cyber-truck last year but that remains a tiny part of its business. Its mainstream Model 3 sedan was first released in 2017.",
    "summary": "Tesla surprises with better than expected car salesThe cyber truck has been selling well, although it is a tiny part of Tesla's businessTesla sales, hit by a significant slump earlier this year, may be showing signs of revival.\nThat was far more than most analysts had expected - though still down nearly 5% from the same period in 2023.\nTesla has been navigating a slowdown in demand, as high borrowing costs weigh on buyers and competition increases.\nThe firm, which announced plans in April to sack more than 10% of its workforce, has seen sales fall in the first half of the year.\nBut analysts say Tesla needs to freshen its line-up, if it hopes to stop rivals from making inroads.",
    "keywords": [
      "analysts",
      "workforce",
      "tesla",
      "surprises",
      "borrowing",
      "car",
      "expected",
      "sales",
      "selling",
      "nearly",
      "tiny",
      "yearat",
      "better"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/1b1f/live/57cf8850-3881-11ef-b390-fb401932e653.jpg",
    "clean_body": "tesla surprise better expected car sale cyber truck selling well although tiny part tesla business tesla sale hit significant slump earlier year may showing sign revival elon musk electric carmaker delivered nearly vehicle three month ended june prior quarter far analyst expected though still nearly period tesla navigating slowdown demand high borrowing cost weigh buyer competition increase slashed price repeatedly try win back shopper also introducing lowcost borrowing plan success limited firm announced plan april sack workforce seen sale fall first half year start year tesla blamed poor performance part supply shortage due shipping disruption red sea alleged arson attack factory germany analyst say tesla need freshen lineup hope stop rival making inroad company started selling cybertruck last year remains tiny part business mainstream model sedan first released",
    "sentiment": 0.1134306195596518,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.bbc.com/news/articles/cn385lgk0vjo": {
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/cn385lgk0vjo",
    "date": "2024-07-02",
    "time": "04:06:33 UTC",
    "title": "Tubi: Free Netflix rival set to launch in the UK",
    "body": "Fox set to launch free Netflix rival in UK\n\nRupert Murdoch's Fox Corporation is entering the UK's highly competitive free, ad-supported video streaming market.\n\nTubi will compete with the likes of Netflix, Disney+, ITVX and Channel 4's streaming platform as well as the BBC iPlayer.\n\nThe platform has been quickly gaining market share in the US where, according to Fox, it has almost 80 million monthly active users.\n\nIn the UK, Tubi says it will launch with more than 20,000 films and TV series, including content from Disney, Lionsgate, NBCUniversal and Sony Pictures Entertainment.\n\nThe platform will also include a selection of British, Indian and Nigerian content.\n\nUK viewers will be able to access content on the Tubi webpage, via a smartphone app and on smart TVs.\n\n“Tubi has spent the last decade honing our approach to vast, free and fun streaming in North America, and we feel that now is the perfect time to bring that recipe to UK audiences,” Tubi chief executive Anjali Sud said.\n\nFox Corporation bought Tubi in 2020 for $440m (£348m) as the US media giant looked to attract younger audiences.",
    "summary": "Fox set to launch free Netflix rival in UKRupert Murdoch's Fox Corporation is entering the UK's highly competitive free, ad-supported video streaming market.\nTubi will compete with the likes of Netflix, Disney+, ITVX and Channel 4's streaming platform as well as the BBC iPlayer.\nIn the UK, Tubi says it will launch with more than 20,000 films and TV series, including content from Disney, Lionsgate, NBCUniversal and Sony Pictures Entertainment.\nUK viewers will be able to access content on the Tubi webpage, via a smartphone app and on smart TVs.\nFox Corporation bought Tubi in 2020 for $440m (£348m) as the US media giant looked to attract younger audiences.",
    "keywords": [
      "uk",
      "launch",
      "platform",
      "disney",
      "rival",
      "set",
      "fox",
      "tubi",
      "streaming",
      "free",
      "corporation",
      "netflix"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/6732/live/2531f770-3877-11ef-8a0a-5d92815c72ec.png",
    "clean_body": "fox set launch free netflix rival uk rupert murdoch fox corporation entering uk highly competitive free adsupported video streaming market tubi compete like netflix disney itvx channel streaming platform well bbc iplayer platform quickly gaining market share u according fox almost million monthly active user uk tubi say launch film tv series including content disney lionsgate nbcuniversal sony picture entertainment platform also include selection british indian nigerian content uk viewer able access content tubi webpage via smartphone app smart tv '' tubi spent last decade honing approach vast free fun streaming north america feel perfect time bring recipe uk audience '' tubi chief executive anjali sud said fox corporation bought tubi PSm u medium giant looked attract younger audience",
    "sentiment": 0.233781512605042,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.bbc.com/news/articles/c4nglq80w7eo": {
    "source": "BBC Business",
    "url": "https://www.bbc.com/news/articles/c4nglq80w7eo",
    "date": "2024-07-02",
    "time": "23:05:03 UTC",
    "title": "How Microsoft and Nvidia bet correctly to leapfrog Apple",
    "body": "How Microsoft and Nvidia bet correctly to leapfrog Apple\n\n4 days ago By Zoe Kleinman , Technology editor Share\n\nGetty Images Under Jensen Huang's leadership Nvidia has seen its share price soar\n\nLife comes at you fast. Last month, AI chip giant Nvidia briefly became the world’s richest company, overtaking Microsoft, which had in turn risen above Apple. When this news was mentioned on stage at a tech industry event I attended in Copenhagen, there was spontaneous applause from the audience. As I write, Nvidia is now back in second place, after a fall in its share price took its combined value down to $3tn (£2.4tn) compared with $3.4tn for Microsoft. Two things have propelled these two US tech titans to such a dizzying pinnacle: AI and foresight. Microsoft started investing in OpenAI, the creator of popular AI chatbot ChatGPT, back in 2019. Meanwhile, Nvidia boss Jensen Huang pushed his company towards AI chip development many years before generative AI exploded onto the scene. Both firms took a long-term bet on the current AI boom – and so far, it’s paid off, leaving former top-dog Apple trailing in their wake. But how long will it last?\n\nThis year’s London Tech Week, an annual event for the UK tech scene, may as well have been called London AI Week. The letters AI were emblazoned on every stand, and uttered in every speech. I bumped into Anne Boden, the founder of Starling Bank, a significant fintech disruptor. She was buzzing with excitement. “We thought we knew who the winners and losers were [in tech],” she told me. “But with AI, we are throwing the dice again”. She believes she’s watching the AI revolution re-landscape the tech sector, and she wants to dive back in. That same week I also popped along to Founders Forum, an annual gathering of around 250 high-level entrepreneurs and investors. Some serious money, in other words. It’s a confidential event, but I don’t think I’ll get into too much trouble for saying that much of the chat there was also centred around AI. A few days after that, a headline in the Financial Times caught my eye. “Most stocks hyped as winners from AI boom have fallen this year,” it read, claiming that more than half of the stocks in Citigroup’s “AI winners basket” had fallen in value in 2024. Life comes at you fast indeed.\n\nGetty Images Anne Boden says that AI has completely shaken up the tech sector\n\n“Given how high valuations have leapt for tech companies, missteps ahead could cause big wobbles in share prices,” warns Susannah Streeter, head of money and markets at the investment firm Hargreaves Lansdown. “Just like the dot.com bubble, over-enthusiasm risks spilling over into disappointment.” In 2023 you’d have been forgiven for thinking that anything with the acronym AI in it was guaranteed to open up a lucrative seam of funding, with investment dollars flooding into all things AI. My friend Saurabh Dayal, who is based in Scotland, identifies AI projects for his pharmaceutical firm to potentially collaborate on. He said he soon grew tired of misleading pitches. “I spend a lot of time saying ‘… but that’s not AI’,” he tells me. It seems both investors and clients are finally growing wiser to the term AI, and, as a result, more picky.\n\nSpeaking to the FT, Citi’s Stuart Kaiser said that while AI remained a big theme in the world of stocks and shares, “just saying AI 15 times isn’t going to cut it anymore”. In addition, there is increased awareness of current generative AI products not exactly living up to their own hype. Inaccuracies, misinformation, displays of bias, copyright infringements and some content that’s just plain weird. And early AI-enabled physical devices like the Rabbit R1 and Humane Pin have received bad reviews. “We’re seeing the market around generative AI mature a little right now – early experiments set a lot of grand expectations, but when the rubber hit the road there were too many unexpected outcomes,” says Chris Weston, chief digital and information officer of the tech service firm Jumar. “Businesses have a lot of value tied up in goodwill – the trust and comfort that their clients have in their services. Introducing ungovernable chatbots is a step too far for many right now.” Tech analyst Paolo Pescatore agrees that the pressure is on for AI firms to deliver on their promises. “The bubble will burst the moment one of the giants fails to show any meaningful growth from AI,” he says. But he does not believe that is going to happen any time soon. “Everyone is still jostling for position, and all companies are pinning their strategies on AI,” he adds. “All the players are ramping up their activities, increasing spend and claiming early successes.”\n\nGetty Images ChatGPT is the AI app that has really caught the public's attention",
    "summary": "How Microsoft and Nvidia bet correctly to leapfrog Apple4 days ago By Zoe Kleinman , Technology editor ShareGetty Images Under Jensen Huang's leadership Nvidia has seen its share price soarLife comes at you fast.\nLast month, AI chip giant Nvidia briefly became the world’s richest company, overtaking Microsoft, which had in turn risen above Apple.\nMeanwhile, Nvidia boss Jensen Huang pushed his company towards AI chip development many years before generative AI exploded onto the scene.\nBoth firms took a long-term bet on the current AI boom – and so far, it’s paid off, leaving former top-dog Apple trailing in their wake.\nThis year’s London Tech Week, an annual event for the UK tech scene, may as well have been called London AI Week.",
    "keywords": [
      "tech",
      "winners",
      "leapfrog",
      "apple",
      "ai",
      "share",
      "value",
      "week",
      "bet",
      "saying",
      "nvidia",
      "microsoft",
      "correctly",
      "stocks"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4074/live/45927c90-3789-11ef-9bca-0db727f63d54.jpg",
    "clean_body": "microsoft nvidia bet correctly leapfrog apple day ago zoe kleinman technology editor share getty image jensen huangs leadership nvidia seen share price soar life come fast last month ai chip giant nvidia briefly became world 's richest company overtaking microsoft turn risen apple news mentioned stage tech industry event attended copenhagen spontaneous applause audience write nvidia back second place fall share price took combined value tn PStn compared tn microsoft two thing propelled two u tech titan dizzying pinnacle ai foresight microsoft started investing openai creator popular ai chatbot chatgpt back meanwhile nvidia bos jensen huang pushed company towards ai chip development many year generative ai exploded onto scene firm took longterm bet current ai boom - far 's paid leaving former topdog apple trailing wake long last year 's london tech week annual event uk tech scene may well called london ai week letter ai emblazoned every stand uttered every speech bumped anne boden founder starling bank significant fintech disruptor buzzing excitement `` thought knew winner loser tech '' told `` ai throwing dice '' belief 's watching ai revolution relandscape tech sector want dive back week also popped along founder forum annual gathering around highlevel entrepreneur investor serious money word 's confidential event n't think 'll get much trouble saying much chat also centred around ai day headline financial time caught eye `` stock hyped winner ai boom fallen year '' read claiming half stock citigroup 's `` ai winner basket '' fallen value life come fast indeed getty image anne boden say ai completely shaken tech sector '' given high valuation leapt tech company misstep ahead could cause big wobble share price '' warns susannah streeter head money market investment firm hargreaves lansdown `` like dotcom bubble overenthusiasm risk spilling disappointment '' 'd forgiven thinking anything acronym ai guaranteed open lucrative seam funding investment dollar flooding thing ai friend saurabh dayal based scotland identifies ai project pharmaceutical firm potentially collaborate said soon grew tired misleading pitch `` spend lot time saying ' ... 's ai ' '' tell seems investor client finally growing wiser term ai result picky speaking ft citi 's stuart kaiser said ai remained big theme world stock share `` saying ai time n't going cut anymore '' addition increased awareness current generative ai product exactly living hype inaccuracy misinformation display bias copyright infringement content 's plain weird early aienabled physical device like rabbit r humane pin received bad review `` 're seeing market around generative ai mature little right - early experiment set lot grand expectation rubber hit road many unexpected outcome '' say chris weston chief digital information officer tech service firm jumar `` business lot value tied goodwill - trust comfort client service introducing ungovernable chatbots step far many right '' tech analyst paolo pescatore agrees pressure ai firm deliver promise `` bubble burst moment one giant fails show meaningful growth ai '' say believe going happen time soon `` everyone still jostling position company pinning strategy ai '' add `` player ramping activity increasing spend claiming early success '' getty image chatgpt ai app really caught public attention",
    "sentiment": 0.04927267573696146,
    "sentiment_category": "positive",
    "t": 313
  },
  "https://www.investing.com/analysis/sp-500-are-stock-prices-reaching-mediumterm-highs-200649686": {
    "source": "Investing.com",
    "url": "https://www.investing.com/analysis/sp-500-are-stock-prices-reaching-mediumterm-highs-200649686",
    "date": "2024-07-02",
    "time": "12:48:00 UTC",
    "title": "S&P 500: Are Stock Prices Reaching Medium-Term Highs?",
    "body": "Monday’s trading session didn’t change much, with the gaining 0.27% and extending a short-term consolidation, remaining relatively close to a new record high reached on Friday at 5,523.64. It still looks like a flat correction within an uptrend. Are there any signs that may point to a more meaningful downward correction?\n\nAs I mentioned in my stock price forecast for July yesterday,\n\n“While more advances remain likely, the likelihood of a deeper downward correction also rises. Overall, there have been no confirmed negative signals so far, but the May gain of 4.8% and June gain of 3.5% suggest a more cautionary approach for July. The market will be waiting for the quarterly earnings season in the second half of the month. Plus, there will be a series of economic data, including the CPI release on July 11, the Advance GDP number on July 25, and the FOMC Rate Decision on July 31.”\n\nThis morning, the S&P 500 is likely to open 0.5% lower, as indicated by futures contracts. So, it may see more short-term uncertainty, and possibly more profit-taking action. For now, it still looks like a consolidation within an uptrend though.\n\nLast week, the investor sentiment remained basically unchanged, as indicated by the AAII Investor Sentiment Survey on Wednesday, which showed that 44.5% of individual investors are bullish, while 28.3% of them are bearish (up from last week's reading of 22.5%). The AAII sentiment is a contrary indicator in the sense that highly bullish readings may suggest excessive complacency and a lack of fear in the market. Conversely, bearish readings are favorable for market upturns.\n\nThe S&P 500 index continues sideways after breaking its upward trend line last week, as we can see on the daily chart.\n\nNasdaq 100 Remains Below 20,000\n\nOn Friday, the technology-focused reached a new record high of 20,017.71, before retracing the advance and closing slightly lower. It basically extended a consolidation following the first half of June rally. This morning, the Nasdaq 100 is expected to open 0.6% lower, retracing yesterday’s advance of 0.66%.\n\nVIX Is Still Close to 12\n\nThe , also known as the fear gauge, is derived from option prices. In late May, it set a new medium-term low of 11.52 before rebounding up to around 15 on correction worries. Since the previous Thursday, it has been closing above the 13 level, showing increasing fear in the market, but on Friday, it dipped to a local low of 11.87. Yesterday, the VIX closed slightly above 12, which means that there is basically no fear in the market.\n\nHistorically, a dropping VIX indicates less fear in the market, and rising VIX accompanies stock market downturns. However, the lower the VIX, the higher the probability of the market’s downward reversal.\n\nFutures Contract Is Closer to 5,500\n\nLet’s take a look at the hourly chart of the contract. This morning, it’s trading closer to the 5,500 level after retracing its yesterday’s rebound. The market may be forming a topping pattern; however, the support level is still around 5,500.\n\nConclusion\n\nStocks are likely to open lower this morning, retracing their yesterday’s advances as there is growing uncertainty about a possible correction amid the coming economic data and earnings releases. The risk of a downward correction is increasing; however, it still looks like a flat correction of the uptrend.\n\nQuoting my yesterday’s stock price forecast for July,\n\n“Investors continue pricing in the Fed’s monetary policy easing that is supposed to happen this year. Hence, a medium-term downward reversal still seems a less likely scenario. However, the recent record-breaking rally may be a cause for some short-term concern as a downward correction may be coming.”\n\nFor now, my short-term outlook remains neutral.\n\nHere’s the breakdown:",
    "summary": "Are there any signs that may point to a more meaningful downward correction?\nAs I mentioned in my stock price forecast for July yesterday,“While more advances remain likely, the likelihood of a deeper downward correction also rises.\nThis morning, the Nasdaq 100 is expected to open 0.6% lower, retracing yesterday’s advance of 0.66%.\nHistorically, a dropping VIX indicates less fear in the market, and rising VIX accompanies stock market downturns.\nThe risk of a downward correction is increasing; however, it still looks like a flat correction of the uptrend.",
    "keywords": [
      "sp",
      "500",
      "stock",
      "mediumterm",
      "highs",
      "correction",
      "vix",
      "fear",
      "yesterdays",
      "retracing",
      "downward",
      "morning",
      "reaching",
      "shortterm",
      "prices",
      "lower",
      "market"
    ],
    "image_url": "https://i-invdn-com.investing.com/redesign/images/seo/investingcom_analysis_og.jpg",
    "clean_body": "monday 's trading session n't change much gaining extending shortterm consolidation remaining relatively close new record high reached friday still look like flat correction within uptrend sign may point meaningful downward correction mentioned stock price forecast july yesterday '' advance remain likely likelihood deeper downward correction also rise overall confirmed negative signal far may gain june gain suggest cautionary approach july market waiting quarterly earnings season second half month plus series economic data including cpi release july advance gdp number july fomc rate decision july `` morning sp likely open lower indicated future contract may see shortterm uncertainty possibly profittaking action still look like consolidation within uptrend though last week investor sentiment remained basically unchanged indicated aaii investor sentiment survey wednesday showed individual investor bullish bearish last week reading aaii sentiment contrary indicator sense highly bullish reading may suggest excessive complacency lack fear market conversely bearish reading favorable market upturn sp index continues sideways breaking upward trend line last week see daily chart nasdaq remains friday technologyfocused reached new record high retracing advance closing slightly lower basically extended consolidation following first half june rally morning nasdaq expected open lower retracing yesterday 's advance vix still close also known fear gauge derived option price late may set new mediumterm low rebounding around correction worry since previous thursday closing level showing increasing fear market friday dipped local low yesterday vix closed slightly mean basically fear market historically dropping vix indicates le fear market rising vix accompanies stock market downturn however lower vix higher probability market 's downward reversal future contract closer let 's take look hourly chart contract morning 's trading closer level retracing yesterday 's rebound market may forming topping pattern however support level still around conclusion stock likely open lower morning retracing yesterday 's advance growing uncertainty possible correction amid coming economic data earnings release risk downward correction increasing however still look like flat correction uptrend quoting yesterday 's stock price forecast july '' investor continue pricing fed 's monetary policy easing supposed happen year hence mediumterm downward reversal still seems le likely scenario however recent recordbreaking rally may cause shortterm concern downward correction may coming '' shortterm outlook remains neutral 's breakdown",
    "sentiment": 0.05068580542264754,
    "sentiment_category": "positive",
    "t": 313
  }
}