{
  "https://www.bbc.com/news/articles/c2ldj04p0q2o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c2ldj04p0q2o",
    "date": "2024-12-20",
    "time": "00:00:00",
    "title": "Syria's leaders say their jihadism is in the past",
    "body": "Syria's rebel leaders say they've broken with their jihadist past - can they be trusted?\n\n20 December 2024 Share Save Mina Al-Lami • Minalami Chief jihadist media specialist, BBC Monitoring Share Save\n\nBBC\n\nLast week, while touring Damascus, Syria's new leader Ahmed al-Sharaa (formerly known as Abu Mohammed al-Jolani) was approached by a young woman who asked for a photo with him. He gently requested that she cover her hair before taking the picture. The incident quickly sparked heated debate across Arabic social and mainstream media. What happened may have been small but it was telling because it encapsulated the tightrope that Syria's new rulers Hayat Tahrir al-Sham (HTS) - who are designated as a terrorist organisation by the UN, US, EU and UK - must walk. On one side is the diverse, and, in some cases more liberal, Syrian population, along with the international community, whose acceptance is crucial for HTS's survival and legitimacy. To them, the hair covering incident offered a troubling glimpse into Syria's potential future under HTS, expressing fears that conservative policies could eventually mandate the veil for all women. On the other side, Islamist hardliners criticised al-Sharaa for taking the photo at all, describing the woman as a \"mutabarijah\" - a term for a woman perceived to dress immodestly or wear makeup - and insisting his action violated religious rules. These hardliners hold significant sway over militant factions and could rally opposition within al-Sharaa's own Islamist base. HTS faces the challenge of attempting to reconcile these competing demands - balancing the expectations of the international community and the liberal parts of Syria's population with the demands of the hardline base. Both sides are closely scrutinising HTS's every statement and action.\n\nGetty Images Ahmed al-Sharaa (formerly known as Abu Mohammed al-Jolani)\n\nThe group's ability to navigate these tensions will be critical to maintaining control and pursuing its political ambitions. In his messages, he has focused on coexistence within Syria's diverse society, granted amnesty to former military conscripts, prohibited acts of vigilante revenge against ex-government personnel and loyalists, and adopted neutral and at times conciliatory language when addressing traditional adversaries, including Israel, the US, Iran and Russia. His statements have been deliberately devoid of inflammatory rhetoric or threats, instead centring on themes of reconciliation, stability, and reconstruction, in a clear effort to neutralise opposition and push for the removal of HTS and al-Sharaa himself from international terror lists.\n\nSignificant unease\n\nIt is still unclear whether al-Sharaa's flexible approach represents a genuine ideological shift or a calculated strategy aimed at winning approval and consolidating power before potentially implementing a stricter and more religiously conservative agenda. But already his more progressive moves are sparking significant unease among hardliners in Syria, who insist on an Islamist government rooted in a strict and distinctive Sunni identity. While Sunni Arabs are the dominant ethnic and religious group in Syria, the country is notably diverse, with a range of minority groups including Shia Alawites, of which the ousted president Bashar al-Assad is a member, Kurds, Christians, Druze, Turkmen and Ismailis, in addition to other small groups.\n\nReuters Crowds celebrated in Umayyad Square after the removal of Bashar al-Assad\n\nEven if HTS leadership is sincere in its push for change, the diverse range of Islamist and jihadist factions deeply entrenched in Syria - many of which played key roles in the recent offensive - are unlikely to tolerate anything short of a strict Islamist system. Should HTS deviate from such a path, these factions would likely be prepared to resort to armed resistance to enforce their vision. However this is not a new challenge for HTS.\n\nFrom IS to al-Qaeda to HTS\n\nFor a decade the group, formerly known as al-Nusra Front and with roots in transnational jihadist movements, has been evolving. HTS transitioned from being a covert offshoot of the ultra-hardline IS around 2011 and 2012, to being affiliated to the relatively more flexible al-Qaeda the following year, and by 2016 to an independent faction. It consolidated its control of Idlib province in north-west Syria in 2017, running a civilian \"government\" in the area purportedly with no lasting jihadist connections or ambitions. This evolution reflects al-Sharaa's strategic vision and likely incorporates elements of opportunism and pragmatism aimed at ensuring the group's acceptance and long-term survival. HTS's strategy of signalling that it poses no external threat has already borne fruit.\n\nReuters Hayat Tahrir al-Sham (HTS) became an independent faction in 2016\n\nWhile its former jihadist partners, al-Qaeda and IS, were heavily targeted in Syria by the US-led coalition - resulting in the routine assassination of their leaders, often in Idlib itself - al-Sharaa has operated with relative freedom. Despite a $10m (£7.8m) US bounty on his head, he has been able to frequently appear publicly, attending events and engaging with the population, much like a statesman. However, al-Sharaa's jihadist critics accuse him of being a manipulative politician, willing to compromise on key ideological principles to advance his own career and secure political gains for HTS, at the expense of other militant groups operating in the country.\n\nHow rebels won hearts and minds\n\nHTS solidified its authority in Idlib through a dual strategy: winning the hearts and minds of local populations through offering some form of stability, while using force to stamp out or co-opt rivals and even former allies. The group moved away from distinctive jihadist rhetoric, fighting for religion, and the establishment of Islamic rule (Sharia) in Syria, as part of a wider interconnected global project. Instead, they adopted a more \"revolutionary\" and nationalist narrative, focusing on the singular goal of toppling Syria's president Bashar al-Assad and \"liberating\" Syria.\n\nReuters Before the HTS-led rebel offensive, the group faced widespread anti-HTS protests\n\nThe civilian front established by HTS in 2017 to administer Idlib was called the Syrian Salvation Government (SSG). The aim was to demonstrate HTS's governance capabilities, and bolster its legitimacy. This move was likely also aimed at alleviating fears about militants running a province, seeking to distance itself from the brutal image associated with IS's rule over territories in Syria and Iraq. The SSG operated as a mini-state, complete with a prime minister, ministries and local departments managing key sectors such as education, health and reconstruction, all while adhering to a religious council guided by Sharia (Islamic law). It also established professional-looking military and police academies, frequently showcasing their graduation ceremonies and organising military parades, typically attended by al-Sharaa. The SSG frequently showcased its achievements in reconstruction and service provision. It often contrasted these efforts with the dire conditions and rampant corruption in areas controlled by the Syrian government or rival rebel groups. Al-Sharaa even twice attended Idlib's annual book fair, giving speeches. But HTS faced significant challenges in Idlib, and its rule was far from smooth. Prior to the 27 November HTS-led rebel offensive, the group was dogged by anti-HTS protests, particularly targeting al-Sharaa's leadership. Protesters accused HTS of suppressing dissent through forced disappearances and imprisonment of opponents and critics.\n\nEPA Syrian rebel fighters celebrated in Hama after the Syrian military withdrew its troops\n\nThe group also faced criticism for allegedly colluding with foreign powers to undermine \"the jihad\" in Syria. In 2023, it was further rocked by a scandal involving spies within its top leadership, and was accused by hardliners of deliberately avoiding meaningful combat against government forces to please unnamed foreign backers. During such protests, al-Sharaa was frequently likened to Assad, while HTS's security apparatus was compared to the \"Shabiha\", Assad's notorious loyalist militia. However, it is important to note that many of HTS's critics, past and present, and some of the those imprisoned by the group, were hardliners actively inciting opposition to HTS's project in Idlib. Others were locals and activists who criticised what they described as HTS's monopolisation of power and \"authoritarian\" rule.\n\nHardliners vs liberals: Religious restrictions\n\nAlthough some locals have voiced complaints about religious restrictions in Idlib, as reported by Arab media and NGOs, these grievances have not been widespread. This may be due to HTS's relative flexibility and the fact that most residents of the province are conservative Sunni Muslims who may be generally accepting of the status quo. Indeed, HTS has often come in for harsh criticism by hardliners for being too \"lenient\" and failing to impose strict Sharia rules in Idlib. Al-Sharaa has argued that the imposition of strict rules such as the morality police is an outdated idea that often causes more harm than good. In April 2023 he said: \"We don't want to create a hypocritical society that prays when we're around and doesn't when we're gone.\" He emphasised that he wanted people to adhere to Islamic teachings out of conviction, \"not through the stick [force]\".\n\nReuters In early 2024, Al-Sharaa's Ministry of Interior established a \"public morality police\"\n\nDespite these comments, the group has often responded by employing strict measures in a clear effort to appease hardliners - a pattern that offers insight into how HTS may respond to such pressures in future. For example, despite dissolving various Hisba (morality police) structures that operated under thinly-veiled names and despite the vocal objections of al-Sharaa himself, the SSG nevertheless established a \"public morality police\" under its Ministry of Interior in early 2024. These morality forces regulated shops, ensured women wore compliant religious clothing and limited the mixing of sexes in public spaces. And a few months earlier, the SSG's Ministry of Education had issued a decree mandating that all female students and staff wear \"loose Islamic dress that complies with Sharia\", which includes covering one's hair and avoiding \"fashion and trends\" deemed \"incompatible with our religious teachings\". The decree also prohibited the mixing of sexes in primary and secondary schools.\n\nOther rebel rivalries\n\nUntil recently, the dominant feature of Syria's opposition groups - whether rebel or jihadist - was disunity and fragmentation, often marked by bouts of infighting. Armed factions competed over territory, revenue sources, authority and ideology. For years, this persistent disunity, among other factors, severely hampered their ability to achieve victory over Assad. The recent rebel unity that led to Assad's downfall remains a relatively new development and could still prove fragile. Also, there are internal challenges still posed by rival factions.\n\nGetty Images HTS has a history of tense relations with Syria's other major rebel groups\n\nHTS has long had a strained relationship with the other major rebel bloc in Syria, the Turkey-backed Syrian National Army (SNA). The SNA's focus during the recent offensive has largely aligned with Ankara's priorities - seizing Kurdish-held areas in northern Syria to eliminate what Turkey perceives as a Kurdish \"threat\" along its borders. Whether the two blocs can agree on the division of the strategic locations seized from Kurdish forces - or across Syria more broadly - remains uncertain, particularly as HTS continues to push for complete unity, clearly under its own leadership. IS, which remains active in Syria through both operatives and sleeper cells, has declared its ongoing jihad in the country and denounced the HTS-led rebel authority as \"apostates\" allegedly brought to power by \"infidel\" forces. With the control of the Kurdish-led Syrian Democratic Forces (SDF) weakening in the northeast, IS is likely to set its sights on the prisons and camps in Hasaka that hold IS-linked fighters and their families. A mass release or escape from these facilities could significantly bolster IS's ranks and ability to destabilise Syria. Since the outbreak of the Syrian civil war in 2011 - and Assad's brutal crackdown on the uprising - the country has attracted a wide range of foreign fighters, clerics and transnational jihadist groups, facilitated by porous borders, particularly via Turkey.\n\nReuters A man steps on a torn photograph of ousted Syrian president Bashar al-Assad\n\nTo consolidate its control over Idlib, and possibly as part of deals with foreign powers to contain the jihadist threat in northern Syria, HTS crushed some local and foreign factions and co-opted others, integrating them into its own structures, renaming their units to obscure their foreign origins. These include smaller factions from Central Asia, the Caucasus (Chechens) and China's Uighur minority. Many of these smaller factions, including independent jihadist groups like Ansar al-Islam and Ansar al-Tawhid, actively participated in the latest offensive, which highlights their potential vested interest in shaping the future of the new Syria. In terms of post-Assad messaging, groups like al-Qaeda as well as more moderate Islamist figures and scholars have reminded HTS about its \"obligation\" to ensure the set-up of an Islamic system in Syria, distinguished by a strong Sunni identity.\n\n'Power grab'\n\nWhen asked by a CNN correspondent on 6 December whether HTS intends to impose an Islamic system, al-Sharaa gave a characteristically evasive response. Instead of a direct \"yes\" or \"no\", he stated, \"People who fear Islamic governance either have seen incorrect implementations of it or do not understand it properly.\" This carefully worded answer suggest that HTS likely plans to implement Islamic governance, but perhaps in a more flexible and nuanced form. But already since HTS toppled the Assad government, ideological tensions have begun to resurface after the initial euphoria and unified effort to achieve a common goal. On 9 December HTS issued a decree granting amnesty to former military conscripts, but hardliners in Syria denounced the move as overly \"lenient\" and inconsistent with Sharia law, going so far as to incite disobedience and call for revenge attacks against ex-government loyalists, directly defying the HTS order.\n\nHTS attempted to quell the uproar by issuing a statement clarifying that it would pursue former government personnel and loyalists implicated in war crimes - an apparent attempt to appease critics. At the same time, HTS sought to reinforce its authority, explicitly vowing to punish anyone who defied its decree by engaging in vigilante revenge. Another point of contention arose on 16 December when al-Sharaa announced plans to disband and disarm militant groups and militias in the country, concentrating weapons in the hands of the state and the military alone. Again, hardliners protested, urging factions to retain their arms. They argued the move would consolidate power under HTS, leaving no other groups armed to challenge its authority and paving the way for tyranny. Further discontent emerged over HTS's muted response to repeated Israeli airstrikes in Syria following Assad's fall. After days of silence, on 14 December al-Sharaa criticised the strikes but stated that his group had no intention of engaging in any new conflicts, emphasising its current focus on rebuilding Syria. He also stated that he would not allow Syria to be used as a launchpad for attacks against Israel.\n\nReuters Some hardliners may take up arms against HTS if it strays from their vision of a religious Syria\n\nSome viewed this stance as weak and a betrayal of Islamist principles. Their frustration was amplified by al-Qaeda's recent message urging HTS to prioritise the fight against Israel and fulfil its \"obligation\" to defend Palestinians in Gaza. These tensions suggest that hardliners - both within HTS ranks and external factions - may be willing to take up arms against the group if they perceive it as straying too far from their vision for a new religious Syria. Many of these individuals and factions are deeply invested in the country and are unlikely to relinquish their ambitions easily. They view Syria, much like Afghanistan under the Taliban, as a project for a strong Sunni Islamic state - one that could wield regional influence while serving as a safe haven for persecuted Muslims and jihadist fugitives. Under pressure from liberals and hardliners alike, al-Sharaa and HTS are treading a fine line in an attempt not to antagonise either side too much and the need for flexibility appears to be key. A week ago the young woman wanting a photo was asked to cover her hair. This week al-Sharaa was photographed with two British diplomats, one of whom was Ann Snow, the UK's special representative for Syria. Her hair was uncovered. Top image credit: Getty",
    "clean_body": "syrias rebel leaders say theyve broken with their jihadist past can they be trusted 20 december 2024 share save mina allami • minalami chief jihadist media specialist bbc monitoring share save bbc last week while touring damascus syrias new leader ahmed alsharaa formerly known as abu mohammed aljolani was approached by a young woman who asked for a photo with him he gently requested that she cover her hair before taking the picture the incident quickly sparked heated debate across arabic social and mainstream media what happened may have been small but it was telling because it encapsulated the tightrope that syrias new rulers hayat tahrir alsham hts who are designated as a terrorist organisation by the un us eu and uk must walk on one side is the diverse and in some cases more liberal syrian population along with the international community whose acceptance is crucial for htss survival and legitimacy to them the hair covering incident offered a troubling glimpse into syrias potential future under hts expressing fears that conservative policies could eventually mandate the veil for all women on the other side islamist hardliners criticised alsharaa for taking the photo at all describing the woman as a mutabarijah a term for a woman perceived to dress immodestly or wear makeup and insisting his action violated religious rules these hardliners hold significant sway over militant factions and could rally opposition within alsharaas own islamist base hts faces the challenge of attempting to reconcile these competing demands balancing the expectations of the international community and the liberal parts of syrias population with the demands of the hardline base both sides are closely scrutinising htss every statement and action getty images ahmed alsharaa formerly known as abu mohammed aljolani the groups ability to navigate these tensions will be critical to maintaining control and pursuing its political ambitions in his messages he has focused on coexistence within syrias diverse society granted amnesty to former military conscripts prohibited acts of vigilante revenge against exgovernment personnel and loyalists and adopted neutral and at times conciliatory language when addressing traditional adversaries including israel the us iran and russia his statements have been deliberately devoid of inflammatory rhetoric or threats instead centring on themes of reconciliation stability and reconstruction in a clear effort to neutralise opposition and push for the removal of hts and alsharaa himself from international terror lists significant unease it is still unclear whether alsharaas flexible approach represents a genuine ideological shift or a calculated strategy aimed at winning approval and consolidating power before potentially implementing a stricter and more religiously conservative agenda but already his more progressive moves are sparking significant unease among hardliners in syria who insist on an islamist government rooted in a strict and distinctive sunni identity while sunni arabs are the dominant ethnic and religious group in syria the country is notably diverse with a range of minority groups including shia alawites of which the ousted president bashar alassad is a member kurds christians druze turkmen and ismailis in addition to other small groups reuters crowds celebrated in umayyad square after the removal of bashar alassad even if hts leadership is sincere in its push for change the diverse range of islamist and jihadist factions deeply entrenched in syria many of which played key roles in the recent offensive are unlikely to tolerate anything short of a strict islamist system should hts deviate from such a path these factions would likely be prepared to resort to armed resistance to enforce their vision however this is not a new challenge for hts from is to alqaeda to hts for a decade the group formerly known as alnusra front and with roots in transnational jihadist movements has been evolving hts transitioned from being a covert offshoot of the ultrahardline is around 2011 and 2012 to being affiliated to the relatively more flexible alqaeda the following year and by 2016 to an independent faction it consolidated its control of idlib province in northwest syria in 2017 running a civilian government in the area purportedly with no lasting jihadist connections or ambitions this evolution reflects alsharaas strategic vision and likely incorporates elements of opportunism and pragmatism aimed at ensuring the groups acceptance and longterm survival htss strategy of signalling that it poses no external threat has already borne fruit reuters hayat tahrir alsham hts became an independent faction in 2016 while its former jihadist partners alqaeda and is were heavily targeted in syria by the usled coalition resulting in the routine assassination of their leaders often in idlib itself alsharaa has operated with relative freedom despite a 10m £78m us bounty on his head he has been able to frequently appear publicly attending events and engaging with the population much like a statesman however alsharaas jihadist critics accuse him of being a manipulative politician willing to compromise on key ideological principles to advance his own career and secure political gains for hts at the expense of other militant groups operating in the country how rebels won hearts and minds hts solidified its authority in idlib through a dual strategy winning the hearts and minds of local populations through offering some form of stability while using force to stamp out or coopt rivals and even former allies the group moved away from distinctive jihadist rhetoric fighting for religion and the establishment of islamic rule sharia in syria as part of a wider interconnected global project instead they adopted a more revolutionary and nationalist narrative focusing on the singular goal of toppling syrias president bashar alassad and liberating syria reuters before the htsled rebel offensive the group faced widespread antihts protests the civilian front established by hts in 2017 to administer idlib was called the syrian salvation government ssg the aim was to demonstrate htss governance capabilities and bolster its legitimacy this move was likely also aimed at alleviating fears about militants running a province seeking to distance itself from the brutal image associated with iss rule over territories in syria and iraq the ssg operated as a ministate complete with a prime minister ministries and local departments managing key sectors such as education health and reconstruction all while adhering to a religious council guided by sharia islamic law it also established professionallooking military and police academies frequently showcasing their graduation ceremonies and organising military parades typically attended by alsharaa the ssg frequently showcased its achievements in reconstruction and service provision it often contrasted these efforts with the dire conditions and rampant corruption in areas controlled by the syrian government or rival rebel groups alsharaa even twice attended idlibs annual book fair giving speeches but hts faced significant challenges in idlib and its rule was far from smooth prior to the 27 november htsled rebel offensive the group was dogged by antihts protests particularly targeting alsharaas leadership protesters accused hts of suppressing dissent through forced disappearances and imprisonment of opponents and critics epa syrian rebel fighters celebrated in hama after the syrian military withdrew its troops the group also faced criticism for allegedly colluding with foreign powers to undermine the jihad in syria in 2023 it was further rocked by a scandal involving spies within its top leadership and was accused by hardliners of deliberately avoiding meaningful combat against government forces to please unnamed foreign backers during such protests alsharaa was frequently likened to assad while htss security apparatus was compared to the shabiha assads notorious loyalist militia however it is important to note that many of htss critics past and present and some of the those imprisoned by the group were hardliners actively inciting opposition to htss project in idlib others were locals and activists who criticised what they described as htss monopolisation of power and authoritarian rule hardliners vs liberals religious restrictions although some locals have voiced complaints about religious restrictions in idlib as reported by arab media and ngos these grievances have not been widespread this may be due to htss relative flexibility and the fact that most residents of the province are conservative sunni muslims who may be generally accepting of the status quo indeed hts has often come in for harsh criticism by hardliners for being too lenient and failing to impose strict sharia rules in idlib alsharaa has argued that the imposition of strict rules such as the morality police is an outdated idea that often causes more harm than good in april 2023 he said we dont want to create a hypocritical society that prays when were around and doesnt when were gone he emphasised that he wanted people to adhere to islamic teachings out of conviction not through the stick force reuters in early 2024 alsharaas ministry of interior established a public morality police despite these comments the group has often responded by employing strict measures in a clear effort to appease hardliners a pattern that offers insight into how hts may respond to such pressures in future for example despite dissolving various hisba morality police structures that operated under thinlyveiled names and despite the vocal objections of alsharaa himself the ssg nevertheless established a public morality police under its ministry of interior in early 2024 these morality forces regulated shops ensured women wore compliant religious clothing and limited the mixing of sexes in public spaces and a few months earlier the ssgs ministry of education had issued a decree mandating that all female students and staff wear loose islamic dress that complies with sharia which includes covering ones hair and avoiding fashion and trends deemed incompatible with our religious teachings the decree also prohibited the mixing of sexes in primary and secondary schools other rebel rivalries until recently the dominant feature of syrias opposition groups whether rebel or jihadist was disunity and fragmentation often marked by bouts of infighting armed factions competed over territory revenue sources authority and ideology for years this persistent disunity among other factors severely hampered their ability to achieve victory over assad the recent rebel unity that led to assads downfall remains a relatively new development and could still prove fragile also there are internal challenges still posed by rival factions getty images hts has a history of tense relations with syrias other major rebel groups hts has long had a strained relationship with the other major rebel bloc in syria the turkeybacked syrian national army sna the snas focus during the recent offensive has largely aligned with ankaras priorities seizing kurdishheld areas in northern syria to eliminate what turkey perceives as a kurdish threat along its borders whether the two blocs can agree on the division of the strategic locations seized from kurdish forces or across syria more broadly remains uncertain particularly as hts continues to push for complete unity clearly under its own leadership is which remains active in syria through both operatives and sleeper cells has declared its ongoing jihad in the country and denounced the htsled rebel authority as apostates allegedly brought to power by infidel forces with the control of the kurdishled syrian democratic forces sdf weakening in the northeast is is likely to set its sights on the prisons and camps in hasaka that hold islinked fighters and their families a mass release or escape from these facilities could significantly bolster iss ranks and ability to destabilise syria since the outbreak of the syrian civil war in 2011 and assads brutal crackdown on the uprising the country has attracted a wide range of foreign fighters clerics and transnational jihadist groups facilitated by porous borders particularly via turkey reuters a man steps on a torn photograph of ousted syrian president bashar alassad to consolidate its control over idlib and possibly as part of deals with foreign powers to contain the jihadist threat in northern syria hts crushed some local and foreign factions and coopted others integrating them into its own structures renaming their units to obscure their foreign origins these include smaller factions from central asia the caucasus chechens and chinas uighur minority many of these smaller factions including independent jihadist groups like ansar alislam and ansar altawhid actively participated in the latest offensive which highlights their potential vested interest in shaping the future of the new syria in terms of postassad messaging groups like alqaeda as well as more moderate islamist figures and scholars have reminded hts about its obligation to ensure the setup of an islamic system in syria distinguished by a strong sunni identity power grab when asked by a cnn correspondent on 6 december whether hts intends to impose an islamic system alsharaa gave a characteristically evasive response instead of a direct yes or no he stated people who fear islamic governance either have seen incorrect implementations of it or do not understand it properly this carefully worded answer suggest that hts likely plans to implement islamic governance but perhaps in a more flexible and nuanced form but already since hts toppled the assad government ideological tensions have begun to resurface after the initial euphoria and unified effort to achieve a common goal on 9 december hts issued a decree granting amnesty to former military conscripts but hardliners in syria denounced the move as overly lenient and inconsistent with sharia law going so far as to incite disobedience and call for revenge attacks against exgovernment loyalists directly defying the hts order hts attempted to quell the uproar by issuing a statement clarifying that it would pursue former government personnel and loyalists implicated in war crimes an apparent attempt to appease critics at the same time hts sought to reinforce its authority explicitly vowing to punish anyone who defied its decree by engaging in vigilante revenge another point of contention arose on 16 december when alsharaa announced plans to disband and disarm militant groups and militias in the country concentrating weapons in the hands of the state and the military alone again hardliners protested urging factions to retain their arms they argued the move would consolidate power under hts leaving no other groups armed to challenge its authority and paving the way for tyranny further discontent emerged over htss muted response to repeated israeli airstrikes in syria following assads fall after days of silence on 14 december alsharaa criticised the strikes but stated that his group had no intention of engaging in any new conflicts emphasising its current focus on rebuilding syria he also stated that he would not allow syria to be used as a launchpad for attacks against israel reuters some hardliners may take up arms against hts if it strays from their vision of a religious syria some viewed this stance as weak and a betrayal of islamist principles their frustration was amplified by alqaedas recent message urging hts to prioritise the fight against israel and fulfil its obligation to defend palestinians in gaza these tensions suggest that hardliners both within hts ranks and external factions may be willing to take up arms against the group if they perceive it as straying too far from their vision for a new religious syria many of these individuals and factions are deeply invested in the country and are unlikely to relinquish their ambitions easily they view syria much like afghanistan under the taliban as a project for a strong sunni islamic state one that could wield regional influence while serving as a safe haven for persecuted muslims and jihadist fugitives under pressure from liberals and hardliners alike alsharaa and hts are treading a fine line in an attempt not to antagonise either side too much and the need for flexibility appears to be key a week ago the young woman wanting a photo was asked to cover her hair this week alsharaa was photographed with two british diplomats one of whom was ann snow the uks special representative for syria her hair was uncovered top image credit getty",
    "summary": "Syria's rebel leaders say they've broken with their jihadist past - can they be trusted?\nShould HTS deviate from such a path, these factions would likely be prepared to resort to armed resistance to enforce their vision.\nInstead, they adopted a more \"revolutionary\" and nationalist narrative, focusing on the singular goal of toppling Syria's president Bashar al-Assad and \"liberating\" Syria.\nIt often contrasted these efforts with the dire conditions and rampant corruption in areas controlled by the Syrian government or rival rebel groups.\nOther rebel rivalriesUntil recently, the dominant feature of Syria's opposition groups - whether rebel or jihadist - was disunity and fragmentation, often marked by bouts of infighting.",
    "keywords": [
      "htss",
      "group",
      "say",
      "syrias",
      "jihadist",
      "factions",
      "hts",
      "hardliners",
      "groups",
      "rebel",
      "past",
      "alsharaa",
      "syria",
      "jihadism",
      "leaders"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/2c05/live/13b82a80-b709-11ef-aff0-072ce821b6ab.png"
  },
  "https://www.bbc.com/news/articles/cx2v3ezv24do": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cx2v3ezv24do",
    "date": "2024-12-20",
    "time": "00:00:00",
    "title": "Jersey's Living Wage to increase to £14.13 per hour in 2025",
    "body": "Jersey's living wage to increase in 2025\n\nThe new rate was agreed at a meeting earlier this week\n\nThe recommended living wage rate in Jersey is set to increase to £14.13 per hour in 2025, it has been announced.\n\nThe new rate was agreed at a meeting of the Jersey Living Wage Advisory Group earlier this week.\n\nEarlier this year the Council of Ministers said the minimum wage in Jersey was due to rise from £11.64 to £13 per hour from 1 April 2025 with plans to increase the minimum wage so it equals the living wage level.\n\nThe living wage is defined as the minimum income necessary for a worker to meet their basic needs.",
    "clean_body": "jerseys living wage to increase in 2025 the new rate was agreed at a meeting earlier this week the recommended living wage rate in jersey is set to increase to £1413 per hour in 2025 it has been announced the new rate was agreed at a meeting of the jersey living wage advisory group earlier this week earlier this year the council of ministers said the minimum wage in jersey was due to rise from £1164 to £13 per hour from 1 april 2025 with plans to increase the minimum wage so it equals the living wage level the living wage is defined as the minimum income necessary for a worker to meet their basic needs",
    "summary": "Jersey's living wage to increase in 2025The new rate was agreed at a meeting earlier this weekThe recommended living wage rate in Jersey is set to increase to £14.13 per hour in 2025, it has been announced.\nThe new rate was agreed at a meeting of the Jersey Living Wage Advisory Group earlier this week.\nEarlier this year the Council of Ministers said the minimum wage in Jersey was due to rise from £11.64 to £13 per hour from 1 April 2025 with plans to increase the minimum wage so it equals the living wage level.\nThe living wage is defined as the minimum income necessary for a worker to meet their basic needs.",
    "keywords": [
      "minimum",
      "living",
      "meeting",
      "earlier",
      "increase",
      "jerseys",
      "2025",
      "jersey",
      "hour",
      "1413",
      "agreed",
      "wage",
      "rate"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/326c/live/b57c1700-be34-11ef-a761-a90dfaf55a88.jpg"
  },
  "https://www.bbc.com/news/live/cnvjvy40ljmt": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/cnvjvy40ljmt",
    "date": "2024-12-02",
    "time": "00:00:00",
    "title": "Jonathan Anderson wins designer of the year at UK Fashion Awards",
    "body": "Wizkid closes out this year's star-studded Fashion Awards\n\nRachel Flynn and Seher Asaf\n\nReporting from the Royal Albert Hall\n\nImage source, Getty Images Image caption, Wizkid closes out the Fashion Awards\n\nThe red disco ball has lowered inside the Royal Albert Hall as this year's Fashion Awards comes to a close with a performance by Afrobeats singer Wizkid.\n\nWelcomed by a surprise performance from Blondie, designers, photographers and models were celebrated by the fashion community.\n\nAlex Consani became the first trans woman to win the Model of the Year award, while Tom Ford won the Outstanding Achievement Award. He was introduced by fashion legend Anna Wintour, who praised him for his \"fearlessness\".\n\nJonathan Anderson won the prestigious Designer of the Year award for the second time in a row, telling the crowd that fashion gets him out of bed every morning.\n\nThere was also some impassioned speeches - with Irish fashion designer Simone Rocha and photographer and activist Nan Goldin saying \"Free Palestine\".\n\nWalking along the star-studded hall tonight, we lived out our own Devil Wears Prada moment. Thanks for joining us and goodnight.",
    "clean_body": "wizkid closes out this years starstudded fashion awards rachel flynn and seher asaf reporting from the royal albert hall image source getty images image caption wizkid closes out the fashion awards the red disco ball has lowered inside the royal albert hall as this years fashion awards comes to a close with a performance by afrobeats singer wizkid welcomed by a surprise performance from blondie designers photographers and models were celebrated by the fashion community alex consani became the first trans woman to win the model of the year award while tom ford won the outstanding achievement award he was introduced by fashion legend anna wintour who praised him for his fearlessness jonathan anderson won the prestigious designer of the year award for the second time in a row telling the crowd that fashion gets him out of bed every morning there was also some impassioned speeches with irish fashion designer simone rocha and photographer and activist nan goldin saying free palestine walking along the starstudded hall tonight we lived out our own devil wears prada moment thanks for joining us and goodnight",
    "summary": "Welcomed by a surprise performance from Blondie, designers, photographers and models were celebrated by the fashion community.\nAlex Consani became the first trans woman to win the Model of the Year award, while Tom Ford won the Outstanding Achievement Award.\nJonathan Anderson won the prestigious Designer of the Year award for the second time in a row, telling the crowd that fashion gets him out of bed every morning.\nThere was also some impassioned speeches - with Irish fashion designer Simone Rocha and photographer and activist Nan Goldin saying \"Free Palestine\".\nWalking along the star-studded hall tonight, we lived out our own Devil Wears Prada moment.",
    "keywords": [
      "royal",
      "uk",
      "performance",
      "closes",
      "wins",
      "wizkid",
      "jonathan",
      "designer",
      "award",
      "awards",
      "won",
      "hall",
      "fashion",
      "anderson",
      "starstudded"
    ],
    "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png"
  },
  "https://www.bbc.com/news/articles/c89xy392wjno": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c89xy392wjno",
    "date": "2024-12-11",
    "time": "00:00:00",
    "title": "A Complete Unknown: Timothée Chalamet's portrayal of Bob Dylan praised by critics",
    "body": "Critics praise Chalamet's portrayal of Bob Dylan\n\n11 December 2024 Share Save Steven McIntosh Entertainment reporter Share Save\n\nGetty Images Chalamet sings all the songs in the film himself, rather than lip-syncing to the original Dylan recordings\n\nTimothée Chalamet has been praised by critics for his portrayal of Bob Dylan, in a new film biopic of the US singer-songwriter. A Complete Unknown has already scored three Golden Globe nominations and is likely to be in the Oscars race in the new year. The Guardian said Chalamet showed \"amazing bravado\" in his performance, while Empire said the actor is \"superb\" and his \"musical talent is unimpeachable\". But the Independent said the biopic itself \"plays too safe\" and Screen Rant described the \"serviceable\" film as a \"fascinating yet frustrating\" portrait.\n\nA Complete Unknown is released on Christmas Day in the US, and 17 January in the UK. Dylan himself has endorsed the film, although he had not actually seen it at the time he posted about it last week on X. \"Timmy's a brilliant actor so I'm sure he's going to be completely believable as me. Or a younger me. Or some other me,\" Dylan said.\n\nSearchlight Deadline praised Chalamet's \"remarkable\" portrayal of Dylan\n\nIn her three-star review, the Independent's Clarisse Loughrey said the film \"takes a reverent stance to Dylan's artistry, populated by technically accomplished musical performances\". She said Chalamet's voice \"isn't perfect, but it's undoubtedly impressive\", adding the film is \"shot with a real sensitivity to the emotional landscape of each track\". The film is based on Elijah Wald's 2015 book, Dylan Goes Electric! Set in the early 1960s, it tells the story of Dylan's rise to fame, and the conflict between his folk roots and his desire to expand his repertoire to include rock 'n' roll. The friction is represented by the choice between his use of an acoustic and electric guitar, and Dylan's lyrics gradually become bolder and more reflective of the world he sees around him.\n\nGetty Images Dylan, pictured in 2012, said he was \"sure [Chalamet] is going to be completely believable as me\"\n\nThe film climaxes with a famously chaotic performance at at the Newport Folk Festival in 1965, where Dylan was booed by some members of the audience for playing an electric set with an amplified band. Deadline's Pete Hammond praised the film's production design, costumes and cinematography, as well as its lead performance. \"At the centre of this all is a remarkable performance by Chalamet, who performs all the songs himself in astonishing and authentic fashion. There is no lip-syncing or blending of voices between actor and subject,\" he noted. \"The music of course is worth the price of admission, but in Mangold's hands fortunately there is so much more to add, thus making Bob Dylan a little less than complete unknown by the time the credits roll.\" The film also follows Dylan's romantic relationships with two women in particular - civil rights activist Sylvie Russo (played by Elle Fanning) and folk musician Joan Baez (Monica Barbaro).\n\nReuters Chalamet attended the film's LA premiere on Tuesday with co-stars Monica Barbaro and Elle Fanning\n\nScreen Rant's Mae Abdulbaki reflected: \"I could understand both women more clearly than Chalamet's Dylan. Behind his sunglasses and tight body language, Dylan remains elusive. \"The film is very much about an artist who doesn't explain himself, and I have immense respect for that, but it also creates an emotional disconnect in narrative form. It was as though I was watching a series of events that I couldn't bring myself to care about. That's what Mangold risks by keeping Dylan out of reach.\" There was a rave review from the Guardian's Peter Bradshaw, who awarded the film five stars and praised Chalamet's \"hilarious and seductive portrayal\". \"Interestingly the story, despite the classic music-biopic tropes that Mangold did so much to popularise, does not conform to the classic rise-fall-learning-experience-comeback format,\" he said. It's all rise, but troubled and unclear.\" The Times Kevin Maher was far less enthusiastic, awarding just two stars \"There will be audiences who will regard the recreation of Newport '65 as a monumental cinematic event. But for many it will land with a giant shrug of indifference,\" he noted. \"[Chalamet's] performance is an unhelpful study in blank-eyed lockjaw minimalism, while his singing voice is fine if, occasionally, close to parody (but all Dylan imitators sound like parody).\"\n\nSearchlight Dylan's relationship with folk singer Joan Baez (Monica Barbaro) is explored in the film\n\nWith an acclaimed back catalogue built up over seven decades, Dylan is best known for hits such as Blowin in the Wind, Mr. Tambourine Man, It Ain't Me Babe, Girl From The North Country and The Times They Are a Changin'. \"Perhaps Dylan himself is too mercurial a figure for a biopic to ever capture him completely,\" wrote the Telegraph's Robbie Collin in a four-star review. \"A Complete Unknown comes about as close as one could reasonably hope. \"For the most part, the film plays like a juicy rise-to-power drama rather than a scenic tour of an artist's Wikipedia page.\" Elsewhere, the Evening Standard's Nick Curtis joked the film made him \"really, really want to learn to play harmonica\". \"It's a defiantly unlikeable performance, miles away from Chalamet's romantic leads,\" Curtis noted. \"He captures Dylan's craning stance and the way he used hair and sunglasses as a mask, the insistent buzz and keen of his speaking and singing voice and the odd, touchy, insularity.\" A Complete Unknown also stars Edward Norton and is directed by James Mangold, the filmmaker behind Johnny Cash biopic Walk The Line and films in the X-Men and Indiana Jones franchises.\n\nSearchlight The film is directed by James Mangold, who was also behind Johnny Cash biopic Walk the Line",
    "clean_body": "critics praise chalamets portrayal of bob dylan 11 december 2024 share save steven mcintosh entertainment reporter share save getty images chalamet sings all the songs in the film himself rather than lipsyncing to the original dylan recordings timothée chalamet has been praised by critics for his portrayal of bob dylan in a new film biopic of the us singersongwriter a complete unknown has already scored three golden globe nominations and is likely to be in the oscars race in the new year the guardian said chalamet showed amazing bravado in his performance while empire said the actor is superb and his musical talent is unimpeachable but the independent said the biopic itself plays too safe and screen rant described the serviceable film as a fascinating yet frustrating portrait a complete unknown is released on christmas day in the us and 17 january in the uk dylan himself has endorsed the film although he had not actually seen it at the time he posted about it last week on x timmys a brilliant actor so im sure hes going to be completely believable as me or a younger me or some other me dylan said searchlight deadline praised chalamets remarkable portrayal of dylan in her threestar review the independents clarisse loughrey said the film takes a reverent stance to dylans artistry populated by technically accomplished musical performances she said chalamets voice isnt perfect but its undoubtedly impressive adding the film is shot with a real sensitivity to the emotional landscape of each track the film is based on elijah walds 2015 book dylan goes electric set in the early 1960s it tells the story of dylans rise to fame and the conflict between his folk roots and his desire to expand his repertoire to include rock n roll the friction is represented by the choice between his use of an acoustic and electric guitar and dylans lyrics gradually become bolder and more reflective of the world he sees around him getty images dylan pictured in 2012 said he was sure chalamet is going to be completely believable as me the film climaxes with a famously chaotic performance at at the newport folk festival in 1965 where dylan was booed by some members of the audience for playing an electric set with an amplified band deadlines pete hammond praised the films production design costumes and cinematography as well as its lead performance at the centre of this all is a remarkable performance by chalamet who performs all the songs himself in astonishing and authentic fashion there is no lipsyncing or blending of voices between actor and subject he noted the music of course is worth the price of admission but in mangolds hands fortunately there is so much more to add thus making bob dylan a little less than complete unknown by the time the credits roll the film also follows dylans romantic relationships with two women in particular civil rights activist sylvie russo played by elle fanning and folk musician joan baez monica barbaro reuters chalamet attended the films la premiere on tuesday with costars monica barbaro and elle fanning screen rants mae abdulbaki reflected i could understand both women more clearly than chalamets dylan behind his sunglasses and tight body language dylan remains elusive the film is very much about an artist who doesnt explain himself and i have immense respect for that but it also creates an emotional disconnect in narrative form it was as though i was watching a series of events that i couldnt bring myself to care about thats what mangold risks by keeping dylan out of reach there was a rave review from the guardians peter bradshaw who awarded the film five stars and praised chalamets hilarious and seductive portrayal interestingly the story despite the classic musicbiopic tropes that mangold did so much to popularise does not conform to the classic risefalllearningexperiencecomeback format he said its all rise but troubled and unclear the times kevin maher was far less enthusiastic awarding just two stars there will be audiences who will regard the recreation of newport 65 as a monumental cinematic event but for many it will land with a giant shrug of indifference he noted chalamets performance is an unhelpful study in blankeyed lockjaw minimalism while his singing voice is fine if occasionally close to parody but all dylan imitators sound like parody searchlight dylans relationship with folk singer joan baez monica barbaro is explored in the film with an acclaimed back catalogue built up over seven decades dylan is best known for hits such as blowin in the wind mr tambourine man it aint me babe girl from the north country and the times they are a changin perhaps dylan himself is too mercurial a figure for a biopic to ever capture him completely wrote the telegraphs robbie collin in a fourstar review a complete unknown comes about as close as one could reasonably hope for the most part the film plays like a juicy risetopower drama rather than a scenic tour of an artists wikipedia page elsewhere the evening standards nick curtis joked the film made him really really want to learn to play harmonica its a defiantly unlikeable performance miles away from chalamets romantic leads curtis noted he captures dylans craning stance and the way he used hair and sunglasses as a mask the insistent buzz and keen of his speaking and singing voice and the odd touchy insularity a complete unknown also stars edward norton and is directed by james mangold the filmmaker behind johnny cash biopic walk the line and films in the xmen and indiana jones franchises searchlight the film is directed by james mangold who was also behind johnny cash biopic walk the line",
    "summary": "A Complete Unknown has already scored three Golden Globe nominations and is likely to be in the Oscars race in the new year.\nA Complete Unknown is released on Christmas Day in the US, and 17 January in the UK.\nThere was a rave review from the Guardian's Peter Bradshaw, who awarded the film five stars and praised Chalamet's \"hilarious and seductive portrayal\".\n\"[Chalamet's] performance is an unhelpful study in blank-eyed lockjaw minimalism, while his singing voice is fine if, occasionally, close to parody (but all Dylan imitators sound like parody).\"\n\"A Complete Unknown comes about as close as one could reasonably hope.",
    "keywords": [
      "portrayal",
      "performance",
      "chalamets",
      "biopic",
      "dylans",
      "critics",
      "complete",
      "chalamet",
      "dylan",
      "praised",
      "bob",
      "film",
      "unknown",
      "timothée"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/cac4/live/6d8c52f0-b7d3-11ef-aff0-072ce821b6ab.jpg"
  },
  "https://www.bbc.com/news/articles/c75w16g05vdo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c75w16g05vdo",
    "date": "2024-12-20",
    "time": "00:00:00",
    "title": "Michael Mosley: Cause of death 'indeterminate', coroner finds",
    "body": "Mosley's cause of death 'indeterminate', coroner finds\n\n20 December 2024 Share Save Amy Walker BBC News Share Save\n\nBBC/PA Media\n\nAn inquest into the death of broadcaster Dr Michael Mosley has not been able to determine a cause, with the coroner instead recording an open conclusion. The 67-year-old science journalist went missing in June after going for a walk on the Greek island of Symi. His disappearance sparked a high-profile search effort by emergency services and his body was found after four days. In written findings, senior coroner for Buckinghamshire Crispin Butler said the cause of Dr Mosley's death was \"indeterminate\" and \"unascertainable\" - and \"was most likely attributable either to heatstroke (accidental) or non-identified pathological cause\".\n\nMr Butler said Dr Mosley's death was not found to be as a result of homicide, suicide, or an accident related to injuries. An open conclusion by a coroner means there is insufficient evidence to decide how a death came about - the case is left open in case further evidence comes to light. Dr Mosley, a broadcaster for almost 20 years, known for programmes that focused on diet, exercise and medicine, had been staying with family and friends when they travelled to Pedi Beach on the morning of 5 June, a findings document said. Michael Mosley's 'genius' remembered in tribute programmes \"Michael had intentionally left his mobile phone back at the house to prevent it getting wet on the ferry,\" the document added. \"Later in the afternoon Michael decided he was going to walk back home rather than take the ferry.\" The findings said Dr Mosley had a rucksack, a litre of water, a biscuit, a hat and an umbrella with him and was \"described as looking energetic and cheerful as he set off\".\n\nPA Media Following a large search effort, Dr Mosley's body was found next to a fence around 30 minutes walk from Pedi, where he was last seen",
    "clean_body": "mosleys cause of death indeterminate coroner finds 20 december 2024 share save amy walker bbc news share save bbcpa media an inquest into the death of broadcaster dr michael mosley has not been able to determine a cause with the coroner instead recording an open conclusion the 67yearold science journalist went missing in june after going for a walk on the greek island of symi his disappearance sparked a highprofile search effort by emergency services and his body was found after four days in written findings senior coroner for buckinghamshire crispin butler said the cause of dr mosleys death was indeterminate and unascertainable and was most likely attributable either to heatstroke accidental or nonidentified pathological cause mr butler said dr mosleys death was not found to be as a result of homicide suicide or an accident related to injuries an open conclusion by a coroner means there is insufficient evidence to decide how a death came about the case is left open in case further evidence comes to light dr mosley a broadcaster for almost 20 years known for programmes that focused on diet exercise and medicine had been staying with family and friends when they travelled to pedi beach on the morning of 5 june a findings document said michael mosleys genius remembered in tribute programmes michael had intentionally left his mobile phone back at the house to prevent it getting wet on the ferry the document added later in the afternoon michael decided he was going to walk back home rather than take the ferry the findings said dr mosley had a rucksack a litre of water a biscuit a hat and an umbrella with him and was described as looking energetic and cheerful as he set off pa media following a large search effort dr mosleys body was found next to a fence around 30 minutes walk from pedi where he was last seen",
    "summary": "Mosley's cause of death 'indeterminate', coroner finds20 December 2024 Share Save Amy Walker BBC News Share SaveBBC/PA MediaAn inquest into the death of broadcaster Dr Michael Mosley has not been able to determine a cause, with the coroner instead recording an open conclusion.\nIn written findings, senior coroner for Buckinghamshire Crispin Butler said the cause of Dr Mosley's death was \"indeterminate\" and \"unascertainable\" - and \"was most likely attributable either to heatstroke (accidental) or non-identified pathological cause\".\nMr Butler said Dr Mosley's death was not found to be as a result of homicide, suicide, or an accident related to injuries.\nMichael Mosley's 'genius' remembered in tribute programmes \"Michael had intentionally left his mobile phone back at the house to prevent it getting wet on the ferry,\" the document added.\nThe findings said Dr Mosley had a rucksack, a litre of water, a biscuit, a hat and an umbrella with him and was \"described as looking energetic and cheerful as he set off\".",
    "keywords": [
      "cause",
      "dr",
      "michael",
      "indeterminate",
      "coroner",
      "finds",
      "death",
      "open",
      "findings",
      "walk",
      "mosley",
      "mosleys"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/26dc/live/2a90ad40-bed9-11ef-b73c-311ce229ab28.jpg"
  },
  "https://www.bbc.com/news/articles/c8j9pgrypwxo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c8j9pgrypwxo",
    "date": "2024-12-21",
    "time": "00:00:00",
    "title": "Royal Christmas cards: What are they trying to tell us?",
    "body": "What are royal Christmas cards trying to tell us?\n\n21 December 2024 Share Save Sean Coughlan Royal correspondent Share Save\n\nKensington Palace Prince William and Catherine used a picture of their family together in Norfolk\n\nIt's become a seasonal tradition to seek the hidden message or symbolic meaning in the Christmas cards the royals send out, as they keep changing and reinventing the format. This year's card from King Charles and Queen Camilla shows them looking relaxed and maybe relieved - and there is a very personal significance behind this picture. It was the first photoshoot after the King was given the green light that he was well enough to return to public duties, after beginning his cancer treatment. It was said to be a watershed moment for the couple, caught on camera. The same pictures, with images full of spring rebirth, were then used for the official announcement that the King had made sufficient progress with his treatment to go back to public events. The lack of snowy steeples and robins isn't a surprise, as royal Christmas cards rarely seem to show any signs of winter. And the message, printed in red, always looks like a party invitation from the 1950s. Prince Harry and Meghan have given their own twist to royal cards. They've added some glitz, so that it has the feel of film credits as much as a season's greeting.\n\nPrince Harry and Meghan's card included pictures of their children\n\nIt's an upbeat Californian message, sent out as an e-card, with six pictures rather than a single image, showing the couple hugging and laughing. It also drew comments on the rare appearance of their son and daughter. If cards could have an accent, this would undoubtedly sound American. It's a \"Happy Holiday Season\", with no mention of \"Christmas\". But then, they've spent most of their married life in the US.\n\nPA Media This year's card from the King and Queen had a very personal connection\n\nPrince William and Catherine's cards have used more informal pictures in recent years. It's jeans and no ties, a modern family, without any royal imagery. This year's card kept the same relaxed style, but it had a very poignant significance. It was from the video that announced that Catherine had completed her chemotherapy. It shows William and Catherine and their three children in Norfolk in August, from a video that was full of end-of-summer colours and very emotional messages about a tough year since her cancer diagnosis. It was a strikingly different style of royal communication, unashamedly about love and togetherness - and they've used it again for the Christmas card.\n\nPA Media Last year's card echoed the informal, no-jackets-and-ties style\n\nLast year's card from the Prince and Princess of Wales had also been a talking point. It featured the same jackets-off, casual image, but there was also a designer chic, with an arty black-and-white picture that wouldn't have looked out of place in an upmarket jeans advert. The prince is very keen on sustainability, so maybe next year's will be made out of recyclable seaweed. Christmas cards can also be like time capsules, holding a moment. In 1995 Prince William appeared alongside his mother Diana, Princess of Wales, and his brother Prince Harry in this rather haunting image. It really evokes another era.\n\nDiana's card from 1995 captured a moment in time\n\nThere's often a sense of family closeness projected by the cards. The late Queen Elizabeth II was always pictured with Prince Philip. And King Charles and Queen Camilla have continued to use images of themselves as a couple. That's had to be mixed up with some props over the years. For the 2019 card the then Prince Charles and Camilla were pictured in a vintage sports car, in a photo taken on a trip to Cuba. It was more or less made for a Prince of Wheels headline.\n\nGetty Images The cards have always emphasised family, but have experimented with the settings\n\nPA Media The royals gathered around a speed boat in this 1969 Christmas card\n\nThere was also a picture of the Royal Family standing around a speed boat in 1969, looking like winners on a game show.\n\nBelgian royals take a traditional approach to their Christmas card\n\nChristmas cards might be slipping out of fashion - sales of boxes of cards are down 23% in a year, according to retailers John Lewis. But the royals show no sign of losing interest - and that includes European royal families... although their use of a family group in a posh room isn't always that original. The Belgian royal card has a multi-lingual message, which is inclusive and reflects a multi-lingual country, but risks looking like a Eurostar menu. It's also unusually forward-looking, with the date of 2025.\n\nPA Media The Spanish royals used their card to address grievances over this year's floods\n\nSpanish royals this year used their card to send a more serious message. There was a standard family group photo on the front, but inside was a poem that was a tribute to the victims of the Valencia flood. Last month, Spain's king and queen had been pelted with mud when they visited areas hit by the floods.\n\nPA Media Christmas cards don't always conform to what's expected\n\nYou couldn't say that the Christmas card pictures are always predictable or easy to interpret. What was the thinking behind the 2016 card which used a photo of Prince Charles and Camilla on a trip to Croatia? An unexpected Eurovision entry?\n\nGetty Images A wartime Christmas card sent by a young Princess Elizabeth",
    "clean_body": "what are royal christmas cards trying to tell us 21 december 2024 share save sean coughlan royal correspondent share save kensington palace prince william and catherine used a picture of their family together in norfolk its become a seasonal tradition to seek the hidden message or symbolic meaning in the christmas cards the royals send out as they keep changing and reinventing the format this years card from king charles and queen camilla shows them looking relaxed and maybe relieved and there is a very personal significance behind this picture it was the first photoshoot after the king was given the green light that he was well enough to return to public duties after beginning his cancer treatment it was said to be a watershed moment for the couple caught on camera the same pictures with images full of spring rebirth were then used for the official announcement that the king had made sufficient progress with his treatment to go back to public events the lack of snowy steeples and robins isnt a surprise as royal christmas cards rarely seem to show any signs of winter and the message printed in red always looks like a party invitation from the 1950s prince harry and meghan have given their own twist to royal cards theyve added some glitz so that it has the feel of film credits as much as a seasons greeting prince harry and meghans card included pictures of their children its an upbeat californian message sent out as an ecard with six pictures rather than a single image showing the couple hugging and laughing it also drew comments on the rare appearance of their son and daughter if cards could have an accent this would undoubtedly sound american its a happy holiday season with no mention of christmas but then theyve spent most of their married life in the us pa media this years card from the king and queen had a very personal connection prince william and catherines cards have used more informal pictures in recent years its jeans and no ties a modern family without any royal imagery this years card kept the same relaxed style but it had a very poignant significance it was from the video that announced that catherine had completed her chemotherapy it shows william and catherine and their three children in norfolk in august from a video that was full of endofsummer colours and very emotional messages about a tough year since her cancer diagnosis it was a strikingly different style of royal communication unashamedly about love and togetherness and theyve used it again for the christmas card pa media last years card echoed the informal nojacketsandties style last years card from the prince and princess of wales had also been a talking point it featured the same jacketsoff casual image but there was also a designer chic with an arty blackandwhite picture that wouldnt have looked out of place in an upmarket jeans advert the prince is very keen on sustainability so maybe next years will be made out of recyclable seaweed christmas cards can also be like time capsules holding a moment in 1995 prince william appeared alongside his mother diana princess of wales and his brother prince harry in this rather haunting image it really evokes another era dianas card from 1995 captured a moment in time theres often a sense of family closeness projected by the cards the late queen elizabeth ii was always pictured with prince philip and king charles and queen camilla have continued to use images of themselves as a couple thats had to be mixed up with some props over the years for the 2019 card the then prince charles and camilla were pictured in a vintage sports car in a photo taken on a trip to cuba it was more or less made for a prince of wheels headline getty images the cards have always emphasised family but have experimented with the settings pa media the royals gathered around a speed boat in this 1969 christmas card there was also a picture of the royal family standing around a speed boat in 1969 looking like winners on a game show belgian royals take a traditional approach to their christmas card christmas cards might be slipping out of fashion sales of boxes of cards are down 23 in a year according to retailers john lewis but the royals show no sign of losing interest and that includes european royal families although their use of a family group in a posh room isnt always that original the belgian royal card has a multilingual message which is inclusive and reflects a multilingual country but risks looking like a eurostar menu its also unusually forwardlooking with the date of 2025 pa media the spanish royals used their card to address grievances over this years floods spanish royals this year used their card to send a more serious message there was a standard family group photo on the front but inside was a poem that was a tribute to the victims of the valencia flood last month spains king and queen had been pelted with mud when they visited areas hit by the floods pa media christmas cards dont always conform to whats expected you couldnt say that the christmas card pictures are always predictable or easy to interpret what was the thinking behind the 2016 card which used a photo of prince charles and camilla on a trip to croatia an unexpected eurovision entry getty images a wartime christmas card sent by a young princess elizabeth",
    "summary": "What are royal Christmas cards trying to tell us?\nThe lack of snowy steeples and robins isn't a surprise, as royal Christmas cards rarely seem to show any signs of winter.\nPrince Harry and Meghan have given their own twist to royal cards.\nChristmas cards can also be like time capsules, holding a moment.\nPA Media Christmas cards don't always conform to what's expectedYou couldn't say that the Christmas card pictures are always predictable or easy to interpret.",
    "keywords": [
      "tell",
      "royal",
      "card",
      "king",
      "queen",
      "used",
      "prince",
      "family",
      "trying",
      "cards",
      "christmas",
      "royals"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/92e0/live/da42f5e0-be2a-11ef-aff0-072ce821b6ab.jpg"
  },
  "https://www.bbc.com/news/articles/c1elq7lx9qdo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c1elq7lx9qdo",
    "date": "2024-12-27",
    "time": "00:00:00",
    "title": "Estonia navy to protect undersea power link after main cable damaged",
    "body": "Estonia navy to protect undersea power link after main cable damaged\n\n27 December 2024 Share Save Paul Kirby Europe digital editor Share Save\n\nEstonian military The patrol boat Raju's main task will be to protect the Estlink 1 power cable\n\nNato has said it will enhance its military presence in the Baltic Sea, and Estonia has sent a patrol ship to protect its Estlink1 undersea power cable, after Russia was accused of sabotaging its main power link in the Gulf of Finland. A ship named as Eagle S is suspected of damaging the Estlink 2 cable and Finnish coast guard crew have boarded the oil tanker and steered it into Finnish waters. The EU said the Eagle S was part of \"Russia's shadow fleet\" and the failure of the undersea cable was the \"latest in a series of suspected attacks on critical infrastructure\". Estonian Defence Minister Hanno Pevkur said the Raju had set sail early on Friday and he believed Finland would join the operation to protect the remaining cable.\n\nHe told Estonian public radio that the Raju's task was \"to ensure that nothing happens there and that our critical connection with Finland remains operational\". The Kremlin has declined to comment on the damage to the cable, describing it as a \"very narrow issue\" and not an issue for the Russian presidency. Nato Secretary General Mark Rutte said on social media that he had spoken to Finland's president, Alexander Stubb, adding that Nato would boost its presence in the Baltic. A further statement by the alliance said only that \"Nato remains vigilant and is working to provide further support\". Finland and Estonia are both Nato members and Estonian Prime Minister Kristen Michal told public TV that, if necessary, they would invoke Article 4 of the Nato Treaty, which involves consultation if any member state feels threatened. \"Our wish would be to receive reinforcements from Nato in the form of a fleet to act as a deterrent,\" he was quoted as saying by news agency BNS. Estonia's power supply has been dramatically reduced after its 170km (105-mile) Estlink 2 cable was shut down. In its initial assessment on Thursday, Finland's Fingrid company said repairs to the cable could last until the end of July 2025. The damage to Estlink 2 is the third incident in little more than a month in the Baltic Sea.\n\nLast month, two data cables were severed: the Arelion cable between the Swedish island of Gotland and Lithuania on 17 November, and then the C-Lion 1 cable was damaged between the Finnish capital, Helsinki, and the German port of Rostock. A Chinese ship, the Yi Peng 3, was suspected of dragging its anchor over the cables in a separate act of Russian sabotage. In October 2023, another Chinese ship ruptured an undersea gas pipeline between Finland and Estonia. The Yi Peng 3 and Eagle S are both suspected of being part of a so-called shadow fleet of oil tankers that Russia is using to avoid Western sanctions imposed since the full-scale invasion of Ukraine.\n\nEPA-EFE/REX/Shutterstock The Yi Peng 3 eventually set sail from the Kattegat strait last week",
    "clean_body": "estonia navy to protect undersea power link after main cable damaged 27 december 2024 share save paul kirby europe digital editor share save estonian military the patrol boat rajus main task will be to protect the estlink 1 power cable nato has said it will enhance its military presence in the baltic sea and estonia has sent a patrol ship to protect its estlink1 undersea power cable after russia was accused of sabotaging its main power link in the gulf of finland a ship named as eagle s is suspected of damaging the estlink 2 cable and finnish coast guard crew have boarded the oil tanker and steered it into finnish waters the eu said the eagle s was part of russias shadow fleet and the failure of the undersea cable was the latest in a series of suspected attacks on critical infrastructure estonian defence minister hanno pevkur said the raju had set sail early on friday and he believed finland would join the operation to protect the remaining cable he told estonian public radio that the rajus task was to ensure that nothing happens there and that our critical connection with finland remains operational the kremlin has declined to comment on the damage to the cable describing it as a very narrow issue and not an issue for the russian presidency nato secretary general mark rutte said on social media that he had spoken to finlands president alexander stubb adding that nato would boost its presence in the baltic a further statement by the alliance said only that nato remains vigilant and is working to provide further support finland and estonia are both nato members and estonian prime minister kristen michal told public tv that if necessary they would invoke article 4 of the nato treaty which involves consultation if any member state feels threatened our wish would be to receive reinforcements from nato in the form of a fleet to act as a deterrent he was quoted as saying by news agency bns estonias power supply has been dramatically reduced after its 170km 105mile estlink 2 cable was shut down in its initial assessment on thursday finlands fingrid company said repairs to the cable could last until the end of july 2025 the damage to estlink 2 is the third incident in little more than a month in the baltic sea last month two data cables were severed the arelion cable between the swedish island of gotland and lithuania on 17 november and then the clion 1 cable was damaged between the finnish capital helsinki and the german port of rostock a chinese ship the yi peng 3 was suspected of dragging its anchor over the cables in a separate act of russian sabotage in october 2023 another chinese ship ruptured an undersea gas pipeline between finland and estonia the yi peng 3 and eagle s are both suspected of being part of a socalled shadow fleet of oil tankers that russia is using to avoid western sanctions imposed since the fullscale invasion of ukraine epaeferexshutterstock the yi peng 3 eventually set sail from the kattegat strait last week",
    "summary": "Estonia navy to protect undersea power link after main cable damaged27 December 2024 Share Save Paul Kirby Europe digital editor Share SaveEstonian military The patrol boat Raju's main task will be to protect the Estlink 1 power cableNato has said it will enhance its military presence in the Baltic Sea, and Estonia has sent a patrol ship to protect its Estlink1 undersea power cable, after Russia was accused of sabotaging its main power link in the Gulf of Finland.\nThe EU said the Eagle S was part of \"Russia's shadow fleet\" and the failure of the undersea cable was the \"latest in a series of suspected attacks on critical infrastructure\".\nEstonian Defence Minister Hanno Pevkur said the Raju had set sail early on Friday and he believed Finland would join the operation to protect the remaining cable.\nEstonia's power supply has been dramatically reduced after its 170km (105-mile) Estlink 2 cable was shut down.\nIn October 2023, another Chinese ship ruptured an undersea gas pipeline between Finland and Estonia.",
    "keywords": [
      "suspected",
      "main",
      "damaged",
      "protect",
      "nato",
      "ship",
      "estlink",
      "undersea",
      "navy",
      "power",
      "link",
      "cable",
      "finland",
      "estonia"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/b57d/live/e0ef6910-c432-11ef-895e-b1d759fc74a3.jpg"
  },
  "https://www.bbc.com/news/articles/c3rq8r4jdgno": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c3rq8r4jdgno",
    "date": "2024-12-13",
    "time": "00:00:00",
    "title": "Former Carlisle boxer jailed for 'grossly offensive' racist posts",
    "body": "Ex-boxer jailed for racially offensive posts\n\n13 December 2024 Share Save Share Save\n\nCumbria Police Derek Heggie has been jailed for 10 months and two weeks for posting offensive Youtube videos\n\nA former boxer has been jailed for posting racially aggravated comments online during unrest and rioting in the summer. Derek Heggie made two \"ill-informed and potentially dangerous\" YouTube videos between 2 and 8 August, Carlisle Crown Court heard. The 41-year-old, of Welsh Road in Harraby, Carlisle, admitted sending communication of an offensive nature earlier this month. Jailing him for 10 months and two weeks, Judge Nicholas Barker said it was clear that Heggie had wanted his offensive comments about the Muslim faith \"to be read and heard by many\".\n\nThe killings of three children on 29 July in Southport triggered waves of unrest across the country. Heggie, who described himself as an actor and podcast host, was one of several people in north and west Cumbria to be prosecuted for the use of inflammatory online content. Prosecutor Tim Evans said the posts were \"in whole or in part of an offensive nature\". He said that one of Heggie's videos had had almost 500,000 views and that they could be circulated to people who did not subscribe to them.\n\nTime of unrest\n\nThe court heard that the defendant had 32 previous convictions including assaulting a police officer and a racially aggravated public order offence. Tariq Khawam, defending, said: \"He knows what he did was wrong, ill-informed and potentially dangerous.\" Addressing Heggie, Judge Barker said: \"What was clear in your mind was that these statements were to have a broad reach and to be read and heard by many. \"You did this at a time of great unrest and concern. \"It is clear the messages were intended to be grossly offensive, particularly to those of a Muslim faith,\" the judge added.\n\nFollow BBC Cumbria on X, Facebook, Nextdoor and Instagram. Send your story ideas to northeastandcumbria@bbc.co.uk.\n\nRelated stories Former boxer admits racially aggravated posts",
    "clean_body": "exboxer jailed for racially offensive posts 13 december 2024 share save share save cumbria police derek heggie has been jailed for 10 months and two weeks for posting offensive youtube videos a former boxer has been jailed for posting racially aggravated comments online during unrest and rioting in the summer derek heggie made two illinformed and potentially dangerous youtube videos between 2 and 8 august carlisle crown court heard the 41yearold of welsh road in harraby carlisle admitted sending communication of an offensive nature earlier this month jailing him for 10 months and two weeks judge nicholas barker said it was clear that heggie had wanted his offensive comments about the muslim faith to be read and heard by many the killings of three children on 29 july in southport triggered waves of unrest across the country heggie who described himself as an actor and podcast host was one of several people in north and west cumbria to be prosecuted for the use of inflammatory online content prosecutor tim evans said the posts were in whole or in part of an offensive nature he said that one of heggies videos had had almost 500000 views and that they could be circulated to people who did not subscribe to them time of unrest the court heard that the defendant had 32 previous convictions including assaulting a police officer and a racially aggravated public order offence tariq khawam defending said he knows what he did was wrong illinformed and potentially dangerous addressing heggie judge barker said what was clear in your mind was that these statements were to have a broad reach and to be read and heard by many you did this at a time of great unrest and concern it is clear the messages were intended to be grossly offensive particularly to those of a muslim faith the judge added follow bbc cumbria on x facebook nextdoor and instagram send your story ideas to northeastandcumbriabbccouk related stories former boxer admits racially aggravated posts",
    "summary": "Ex-boxer jailed for racially offensive posts13 December 2024 Share Save Share SaveCumbria Police Derek Heggie has been jailed for 10 months and two weeks for posting offensive Youtube videosA former boxer has been jailed for posting racially aggravated comments online during unrest and rioting in the summer.\nDerek Heggie made two \"ill-informed and potentially dangerous\" YouTube videos between 2 and 8 August, Carlisle Crown Court heard.\nThe 41-year-old, of Welsh Road in Harraby, Carlisle, admitted sending communication of an offensive nature earlier this month.\n\"It is clear the messages were intended to be grossly offensive, particularly to those of a Muslim faith,\" the judge added.\nRelated stories Former boxer admits racially aggravated posts",
    "keywords": [
      "clear",
      "boxer",
      "heard",
      "carlisle",
      "judge",
      "youtube",
      "racially",
      "posts",
      "heggie",
      "aggravated",
      "racist",
      "unrest",
      "offensive",
      "grossly",
      "jailed"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/7e28/live/eb869940-b94a-11ef-a0f2-fd81ae5962f4.png"
  },
  "https://www.bbc.com/news/articles/cq8q7jz4725o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cq8q7jz4725o",
    "date": "2024-12-18",
    "time": "00:00:00",
    "title": "The Traitors: Siobhán McSweeney to host Irish version of show",
    "body": "Siobhán McSweeney 'looking forward to meeting delicious Traitors'\n\n18 December 2024 Share Save Share Save\n\nRTÉ Siobhán McSweeney said she was the \"luckiest person the in world\"\n\nSiobhán McSweeney is to host the Irish version of reality show The Traitors, Irish broadcaster RTÉ have announced. McSweeney is best known for her role as sister Michael in the comedy series Derry Girls, as well as hosting The Great Pottery Throw Down. The Traitors Ireland will be filmed on location in Ireland and feature a cast of contestants from around the country. McSweeney said that she \"jumped\" at the opportunity.\n\n\"Like everyone, I am a huge Traitors fan,\" she said. \"I'm looking forward to meeting our loyal Faithful and delicious Traitors. \"The Irish have a charm and ability to deceive while smiling which will make this version rather special, I think.\" McSweeney added that she was the \"luckiest person in the world to watch them close up\". Steve Carson, director of video at RTÉ, said the broadcaster was \"really looking forward to bringing The Traitors Ireland to RTÉ audiences and delighted that Siobhán is going to be at the heart of it\".\n\nCash prize of €50,000\n\nThe programme is due to be shown on RTÉ One and RTÉ Player in 2025, produced by Kite Entertainment. The series will see 22 constants arrive at a remote castle to play a game of deception, betrayal and trust, with a prize of €50,000 up for grabs. Among them are the Traitors, who will attempt to secretly murder a player every night, without getting caught. It's up to the others, the Faithfuls, to try to detect who the Traitors are, and banish them from the game. Each day, the group embark on a series of challenges as they work together to add more money to the prize pot. But if a Traitor remains undetected throughout the game, they'll steal all the money.\n\nPA Media The UK version, hosted by Claudia Winkleman, has been a hit with BBC audiences",
    "clean_body": "siobhán mcsweeney looking forward to meeting delicious traitors 18 december 2024 share save share save rté siobhán mcsweeney said she was the luckiest person the in world siobhán mcsweeney is to host the irish version of reality show the traitors irish broadcaster rté have announced mcsweeney is best known for her role as sister michael in the comedy series derry girls as well as hosting the great pottery throw down the traitors ireland will be filmed on location in ireland and feature a cast of contestants from around the country mcsweeney said that she jumped at the opportunity like everyone i am a huge traitors fan she said im looking forward to meeting our loyal faithful and delicious traitors the irish have a charm and ability to deceive while smiling which will make this version rather special i think mcsweeney added that she was the luckiest person in the world to watch them close up steve carson director of video at rté said the broadcaster was really looking forward to bringing the traitors ireland to rté audiences and delighted that siobhán is going to be at the heart of it cash prize of €50000 the programme is due to be shown on rté one and rté player in 2025 produced by kite entertainment the series will see 22 constants arrive at a remote castle to play a game of deception betrayal and trust with a prize of €50000 up for grabs among them are the traitors who will attempt to secretly murder a player every night without getting caught its up to the others the faithfuls to try to detect who the traitors are and banish them from the game each day the group embark on a series of challenges as they work together to add more money to the prize pot but if a traitor remains undetected throughout the game theyll steal all the money pa media the uk version hosted by claudia winkleman has been a hit with bbc audiences",
    "summary": "Siobhán McSweeney 'looking forward to meeting delicious Traitors'18 December 2024 Share Save Share SaveRTÉ Siobhán McSweeney said she was the \"luckiest person the in world\"Siobhán McSweeney is to host the Irish version of reality show The Traitors, Irish broadcaster RTÉ have announced.\nMcSweeney is best known for her role as sister Michael in the comedy series Derry Girls, as well as hosting The Great Pottery Throw Down.\nThe Traitors Ireland will be filmed on location in Ireland and feature a cast of contestants from around the country.\n\"The Irish have a charm and ability to deceive while smiling which will make this version rather special, I think.\"\nSteve Carson, director of video at RTÉ, said the broadcaster was \"really looking forward to bringing The Traitors Ireland to RTÉ audiences and delighted that Siobhán is going to be at the heart of it\".",
    "keywords": [
      "mcsweeney",
      "siobhán",
      "prize",
      "version",
      "irish",
      "series",
      "traitors",
      "rté",
      "ireland",
      "looking",
      "host"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3a24/live/7b1ea020-bd51-11ef-a2ca-e99d0c9a24e3.png"
  },
  "https://www.bbc.com/news/articles/cn85xj994j8o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cn85xj994j8o",
    "date": "2024-12-09",
    "time": "00:00:00",
    "title": "Golden Globes 2025: Ariana Grande, Nicole Kidman and Timothee Chalamet among nominees",
    "body": "Ariana Grande, Cynthia Erivo and Timothee Chalamet up for Golden Globes\n\n9 December 2024 Share Save Ian Youngs Culture reporter Share Save\n\nReuters Ariana Grande has been entered in the supporting actress categories, while Cynthia Erivo is classed as Wicked's lead actress\n\nWicked's Cynthia Erivo and Ariana Grande are among the stars who have scored nominations for the Golden Globes, as the Hollywood award season kicks off in earnest. British actress Erivo is shortlisted for best female actor in a comedy or musical film for her role as Elphaba, while co-star Grande is in the running for best supporting female actor for playing Glinda. Angelina Jolie, Hugh Grant, Timothee Chalamet, Sebastian Stan, Demi Moore, Pamela Anderson, Kate Winslet and Selena Gomez are among the other big names in contention. The Golden Globes have been through controversy in recent years but remain the first major awards in the film calendar, and provide pointers for who could do well at next year's Oscars.\n\nNetflix musical Emilia Pérez, about a Mexican drug lord who changes gender, leads the nominations overall with 10, including one for Gomez. Other prominent films include heavyweight dramas The Brutalist, about a Hungarian architect who tries to build a new life in the US after World War Two, and Conclave, about a group of scheming cardinals who gather to select the new Pope.\n\nNetflix Selena Gomez (centre) has two acting nominations this year\n\nThe top film nominees: Emilia Perez - 10\n\nThe Brutalist - 7\n\nConclave - 6\n\nAnora - 5\n\nThe Substance - 5 Unlike the Oscars, the Golden Globes also have awards for TV shows, with The Bear, Only Murders in the Building, Shogun and Baby Reindeer the main contenders in those categories.\n\nOscar contenders\n\nJolie is the frontrunner to win best female actor in a drama film for playing legendary opera singer Maria Callas in Maria. She will face competition from Nicole Kidman for Babygirl, as well as Anderson for playing a veteran Las Vegas showgirl in The Last Showgirl. British stars Winslet and Tilda Swinton are also in that category, as is Brazilian actress Fernanda Torres. Winslet has two nominations in total - one on the film side for playing war photographer Lee Miller in Lee, and one for portraying a fictional dictator in her TV show The Regime.\n\nUniversal Pictures Adrien Brody is a strong contender for his performance in The Brutalist\n\nIn the race for best male actor in a drama film, The Brutalist's Adrien Brody and Conclave's Ralph Fiennes are seen as the main contenders. Meanwhile, Stan is nominated for playing Donald Trump in The Apprentice, about the incoming US president's early years, and Chalamet is recognised for portraying singer Bob Dylan in A Complete Unknown. They are joined on the shortlist by former James Bond star Daniel Craig for playing a US expat in 1950s South America in Queer, and Colman Domingo for his role in Sing Sing, about a prison theatre group. All will also have a shot of receiving Oscar nominations when they are announced in January.\n\nNewcomers and veterans\n\nUnlike the Oscars, the Golden Globe split most of their categories in two, with one award for dramas and a separate prize for musicals/comedies. Newcomer Mikey Madison is hotly tipped for the award for best female actor in a musical/comedy film for playing a New York stripper who falls for the son of a Russian oligarch in Anora. She will take on others including Demi Moore, who has won praise for her role as a veteran Hollywood star who goes to extreme lengths to recapture her youth in body horror The Substance. It is Moore's first nomination for 28 years.\n\nNeon US actress Mikey Madison (right) scored her first Globe nomination for Anora\n\nZendaya, Amy Adams and Karla Sofía Gascón are in the same category, as is Erivo, one of four nominations in total for Wicked. The film, based on the Broadway musical about the origin story of the Wicked Witch of the West from the Wizard of Oz, will hope to combine awards acclaim with commercial success after making $455m (£356m) so far at the box office. Grande will go up against fellow singer and former children's TV star Gomez, who plays the wife of the drug lord in Emilia Pérez. Gomez is a double nominee, also being shortlisted for TV comedy Only Murders in the Building.\n\nBritish talent\n\nA number of British stars have made it on to the shortlists. Grant has the seventh Golden Globe nomination of his career, for horror film Heretic, while Felicity Jones has her second for The Brutalist, a decade after her first for The Theory of Everything. Her co-star in the latter, Eddie Redmayne, is also hoping for a Golden Globe this year, for his TV show The Day of the Jackal. He will go up against Gary Oldman for Slow Horses, while his co-star Jack Lowden is listed in one of the supporting categories.\n\nPA Media Keira Knightley attended the premiere of Black Doves in London last week\n\nElsewhere, Keira Knightley is nominated for her new spy drama Black Doves. Her competitors include Emma D'Arcy, who has House of the Dragon's only citation. Richard Gadd stands a strong chance of winning best male actor in a limited series for Baby Reindeer. His rivals include fellow Scot Ewan McGregor, for A Gentleman in Moscow. Baby Reindeer's Jessica Gunning is in the running for best supporting female TV actor. Pop star Robbie Williams is up for the best song award for Forbidden Road, from his forthcoming film biopic Better Man, along with his co-writers Sacha Skarbek and Freddy Wexler. Wallace and Gromit are in the best animated motion picture category for their new film Vengeance Most Fowl, ahead of its premiere on the BBC on Christmas Day. And dramatist Peter Straughan is named for writing the script for Conclave.\n\nSnubs\n\nHowever, there was no nomination for Britain's Marianne Jean-Baptiste, who had been tipped to be recognised for her role in director Mike Leigh's hard-hitting film Hard Truths. And there was nothing for British film Blitz or Saoirse Ronan, who had been in contention for that film and another acclaimed drama, The Outrun. Fellow Irish star Paul Mescal missed out on a nod for Gladiator II, which only received two nominations - one for Denzel Washington in the acting categories, and a nod for cinematic and box office achievement, which was introduced last year to recognise popular films.\n\nParamount Denzel Washington is nominated for Gladiator II, but Paul Mescal is not\n\nThere were also two nominations for Dune: Part Two - best drama film and best original score. But voters overlooked Chalamet's lead performance and Denis Villeneuve's direction. And there was no room for the Dune sequel on the eight-strong shortlist for the cinematic and box office achievement prize despite it being fourth on the global list of the most successful releases of 2024. Wicked is among the hits up for that award this year, although its mastermind Jon M Chu missed out on a nomination for best director.\n\nReuters Comedian Nikki Glaser is a nominee as well as being the ceremony's host",
    "clean_body": "ariana grande cynthia erivo and timothee chalamet up for golden globes 9 december 2024 share save ian youngs culture reporter share save reuters ariana grande has been entered in the supporting actress categories while cynthia erivo is classed as wickeds lead actress wickeds cynthia erivo and ariana grande are among the stars who have scored nominations for the golden globes as the hollywood award season kicks off in earnest british actress erivo is shortlisted for best female actor in a comedy or musical film for her role as elphaba while costar grande is in the running for best supporting female actor for playing glinda angelina jolie hugh grant timothee chalamet sebastian stan demi moore pamela anderson kate winslet and selena gomez are among the other big names in contention the golden globes have been through controversy in recent years but remain the first major awards in the film calendar and provide pointers for who could do well at next years oscars netflix musical emilia pérez about a mexican drug lord who changes gender leads the nominations overall with 10 including one for gomez other prominent films include heavyweight dramas the brutalist about a hungarian architect who tries to build a new life in the us after world war two and conclave about a group of scheming cardinals who gather to select the new pope netflix selena gomez centre has two acting nominations this year the top film nominees emilia perez 10 the brutalist 7 conclave 6 anora 5 the substance 5 unlike the oscars the golden globes also have awards for tv shows with the bear only murders in the building shogun and baby reindeer the main contenders in those categories oscar contenders jolie is the frontrunner to win best female actor in a drama film for playing legendary opera singer maria callas in maria she will face competition from nicole kidman for babygirl as well as anderson for playing a veteran las vegas showgirl in the last showgirl british stars winslet and tilda swinton are also in that category as is brazilian actress fernanda torres winslet has two nominations in total one on the film side for playing war photographer lee miller in lee and one for portraying a fictional dictator in her tv show the regime universal pictures adrien brody is a strong contender for his performance in the brutalist in the race for best male actor in a drama film the brutalists adrien brody and conclaves ralph fiennes are seen as the main contenders meanwhile stan is nominated for playing donald trump in the apprentice about the incoming us presidents early years and chalamet is recognised for portraying singer bob dylan in a complete unknown they are joined on the shortlist by former james bond star daniel craig for playing a us expat in 1950s south america in queer and colman domingo for his role in sing sing about a prison theatre group all will also have a shot of receiving oscar nominations when they are announced in january newcomers and veterans unlike the oscars the golden globe split most of their categories in two with one award for dramas and a separate prize for musicalscomedies newcomer mikey madison is hotly tipped for the award for best female actor in a musicalcomedy film for playing a new york stripper who falls for the son of a russian oligarch in anora she will take on others including demi moore who has won praise for her role as a veteran hollywood star who goes to extreme lengths to recapture her youth in body horror the substance it is moores first nomination for 28 years neon us actress mikey madison right scored her first globe nomination for anora zendaya amy adams and karla sofía gascón are in the same category as is erivo one of four nominations in total for wicked the film based on the broadway musical about the origin story of the wicked witch of the west from the wizard of oz will hope to combine awards acclaim with commercial success after making 455m £356m so far at the box office grande will go up against fellow singer and former childrens tv star gomez who plays the wife of the drug lord in emilia pérez gomez is a double nominee also being shortlisted for tv comedy only murders in the building british talent a number of british stars have made it on to the shortlists grant has the seventh golden globe nomination of his career for horror film heretic while felicity jones has her second for the brutalist a decade after her first for the theory of everything her costar in the latter eddie redmayne is also hoping for a golden globe this year for his tv show the day of the jackal he will go up against gary oldman for slow horses while his costar jack lowden is listed in one of the supporting categories pa media keira knightley attended the premiere of black doves in london last week elsewhere keira knightley is nominated for her new spy drama black doves her competitors include emma darcy who has house of the dragons only citation richard gadd stands a strong chance of winning best male actor in a limited series for baby reindeer his rivals include fellow scot ewan mcgregor for a gentleman in moscow baby reindeers jessica gunning is in the running for best supporting female tv actor pop star robbie williams is up for the best song award for forbidden road from his forthcoming film biopic better man along with his cowriters sacha skarbek and freddy wexler wallace and gromit are in the best animated motion picture category for their new film vengeance most fowl ahead of its premiere on the bbc on christmas day and dramatist peter straughan is named for writing the script for conclave snubs however there was no nomination for britains marianne jeanbaptiste who had been tipped to be recognised for her role in director mike leighs hardhitting film hard truths and there was nothing for british film blitz or saoirse ronan who had been in contention for that film and another acclaimed drama the outrun fellow irish star paul mescal missed out on a nod for gladiator ii which only received two nominations one for denzel washington in the acting categories and a nod for cinematic and box office achievement which was introduced last year to recognise popular films paramount denzel washington is nominated for gladiator ii but paul mescal is not there were also two nominations for dune part two best drama film and best original score but voters overlooked chalamets lead performance and denis villeneuves direction and there was no room for the dune sequel on the eightstrong shortlist for the cinematic and box office achievement prize despite it being fourth on the global list of the most successful releases of 2024 wicked is among the hits up for that award this year although its mastermind jon m chu missed out on a nomination for best director reuters comedian nikki glaser is a nominee as well as being the ceremonys host",
    "summary": "Oscar contendersJolie is the frontrunner to win best female actor in a drama film for playing legendary opera singer Maria Callas in Maria.\nShe will face competition from Nicole Kidman for Babygirl, as well as Anderson for playing a veteran Las Vegas showgirl in The Last Showgirl.\nGrande will go up against fellow singer and former children's TV star Gomez, who plays the wife of the drug lord in Emilia Pérez.\nRichard Gadd stands a strong chance of winning best male actor in a limited series for Baby Reindeer.\nBaby Reindeer's Jessica Gunning is in the running for best supporting female TV actor.",
    "keywords": [
      "timothee",
      "ariana",
      "golden",
      "2025",
      "nominees",
      "grande",
      "actor",
      "kidman",
      "playing",
      "tv",
      "chalamet",
      "nicole",
      "nominations",
      "star",
      "nomination",
      "film",
      "best",
      "globes"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f3e1/live/a5be68b0-b621-11ef-a2ca-e99d0c9a24e3.jpg"
  },
  "https://www.bbc.com/news/articles/ckgz1pp1ne8o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/ckgz1pp1ne8o",
    "date": "2024-12-21",
    "time": "00:00:00",
    "title": "Blake Lively accuses It Ends With Us co-star Justin Baldoni of smear campaign",
    "body": "Blake Lively accuses co-star Justin Baldoni of smear campaign\n\n21 December 2024 Share Save Malu Cursino BBC News Share Save\n\nGetty Images\n\nBlake Lively has filed a legal complaint against It Ends With Us co-star Justin Baldoni, alleging sexual harassment and a campaign to \"destroy\" her reputation. According to the legal filing, she accuses Mr Baldoni and his team of attacking her public image following a meeting in which she brought along her actor husband, Ryan Reynolds, to address \"repeated sexual harassment and other disturbing behavior\" by Mr Baldoni and a producer on the movie. Mr Baldoni's legal team told the BBC the allegations are \"categorically false\" and said they hired a crisis manager because Ms Lively had threatened to derail the film unless her demands were met. In the romantic drama, Ms Lively plays a woman who finds herself in a relationship with a charming but abusive boyfriend, played by Mr Baldoni.\n\nThe meeting between Ms Lively and Mr Baldoni, together with others involved in the movie's production, took place on 4 January this year, and it aimed to address \"the hostile work environment\" on set, says the legal filing. Ms Lively's husband, Deadpool star Mr Reynolds, who did not appear in It Ends With Us, joined her at the showdown, according to the legal complaint, which is one step before a lawsuit. Mr Baldoni, 40, attended the meeting in his capacity as co-chairman and co-founder of the company that produced the film, Wayfarer Studios. He was also the film's director. In the legal complaint, Ms Lively's lawyers allege that both Mr Baldoni and the Wayfarer chief executive officer, Jamey Heath, engaged in \"inappropriate and unwelcome behavior towards Ms Lively and others on the set of It Ends With Us\". In the filing to the California Civil Rights Department, a list of 30 demands relating to the pair's alleged misconduct was made at the meeting to ensure they could continue to produce the film. Among them, Ms Lively, 37, requested that there be no more mention of Mr Baldoni and Mr Heath's previous \"pornography addiction\" to Ms Lively or to other crew members, no more descriptions of their own genitalia to Ms Lively, and \"no more adding of sex scenes, oral sex, or on camera climaxing by BL [Blake Lively] outside the scope of the script BL approved when signing onto the project\", says the complaint. Ms Lively also demanded that Mr Baldoni stop saying he could speak to her dead father.\n\nJose Perez/Bauer-Griffin via Getty Images It Ends With Us has sparked some controversy over how the film depicts domestic violence\n\nMs Lively's legal team further accuse Mr Baldoni and Wayfarer Studios of leading a \"multi-tiered plan\" to wreck her reputation. She alleges this was \"the intended result of a carefully crafted, coordinated, and resourced retaliatory scheme to silence her, and others from speaking out about the hostile environment that Mr Baldoni and Mr Heath created\". Responding to the legal complaint, Mr Baldoni's lawyer, Bryan Freedman, said on Saturday: \"It is shameful that Ms Lively and her representatives would make such serious and categorically false accusations against Mr Baldoni, Wayfarer Studios and its representatives.\" Mr Freedman accused Ms Lively of making numerous demands and threats, including \"threatening to not show up to set, threatening to not promote the film\", which would end up \"ultimately leading to its demise during release, if her demands were not met\". He alleged that Ms Lively's claims were \"intentionally salacious with an intent to publicly hurt and rehash a narrative in the media\". In a statement via her attorneys to the BBC, Ms Lively said: \"I hope that my legal action helps pull back the curtain on these sinister retaliatory tactics to harm people who speak up about misconduct and helps protect others who may be targeted.\" She also denied that she or any of her representatives had planted or spread negative information about Mr Baldoni or Wayfarer.\n\nThe film was a box-office hit, although some critics said it romanticised domestic violence. Soon after the release date in August, another co-star, Brandon Sklenar, hinted in an Instagram post at rumours of a rift between Ms Lively and Mr Baldoni. Speculation of a falling out only grew when they did not appear together on the red carpet. It Ends With Us tells the story of Boston florist Lily Bloom, played by Ms Lively, as she navigates a love triangle between her charming but abusive boyfriend, Ryle Kincaid, played by Mr Baldoni, and her compassionate first love, Atlas Corrigan, played by Mr Sklenar. It is based on a best-selling novel by Colleen Hoover. The 45-year-old author has previously said her inspiration was domestic abuse her mother endured.\n\nGetty Images Lively posed for photos with Sklenar (left) and her husband Ryan Reynolds at the premiere, but not her co-star Baldoni",
    "clean_body": "blake lively accuses costar justin baldoni of smear campaign 21 december 2024 share save malu cursino bbc news share save getty images blake lively has filed a legal complaint against it ends with us costar justin baldoni alleging sexual harassment and a campaign to destroy her reputation according to the legal filing she accuses mr baldoni and his team of attacking her public image following a meeting in which she brought along her actor husband ryan reynolds to address repeated sexual harassment and other disturbing behavior by mr baldoni and a producer on the movie mr baldonis legal team told the bbc the allegations are categorically false and said they hired a crisis manager because ms lively had threatened to derail the film unless her demands were met in the romantic drama ms lively plays a woman who finds herself in a relationship with a charming but abusive boyfriend played by mr baldoni the meeting between ms lively and mr baldoni together with others involved in the movies production took place on 4 january this year and it aimed to address the hostile work environment on set says the legal filing ms livelys husband deadpool star mr reynolds who did not appear in it ends with us joined her at the showdown according to the legal complaint which is one step before a lawsuit mr baldoni 40 attended the meeting in his capacity as cochairman and cofounder of the company that produced the film wayfarer studios he was also the films director in the legal complaint ms livelys lawyers allege that both mr baldoni and the wayfarer chief executive officer jamey heath engaged in inappropriate and unwelcome behavior towards ms lively and others on the set of it ends with us in the filing to the california civil rights department a list of 30 demands relating to the pairs alleged misconduct was made at the meeting to ensure they could continue to produce the film among them ms lively 37 requested that there be no more mention of mr baldoni and mr heaths previous pornography addiction to ms lively or to other crew members no more descriptions of their own genitalia to ms lively and no more adding of sex scenes oral sex or on camera climaxing by bl blake lively outside the scope of the script bl approved when signing onto the project says the complaint ms lively also demanded that mr baldoni stop saying he could speak to her dead father jose perezbauergriffin via getty images it ends with us has sparked some controversy over how the film depicts domestic violence ms livelys legal team further accuse mr baldoni and wayfarer studios of leading a multitiered plan to wreck her reputation she alleges this was the intended result of a carefully crafted coordinated and resourced retaliatory scheme to silence her and others from speaking out about the hostile environment that mr baldoni and mr heath created responding to the legal complaint mr baldonis lawyer bryan freedman said on saturday it is shameful that ms lively and her representatives would make such serious and categorically false accusations against mr baldoni wayfarer studios and its representatives mr freedman accused ms lively of making numerous demands and threats including threatening to not show up to set threatening to not promote the film which would end up ultimately leading to its demise during release if her demands were not met he alleged that ms livelys claims were intentionally salacious with an intent to publicly hurt and rehash a narrative in the media in a statement via her attorneys to the bbc ms lively said i hope that my legal action helps pull back the curtain on these sinister retaliatory tactics to harm people who speak up about misconduct and helps protect others who may be targeted she also denied that she or any of her representatives had planted or spread negative information about mr baldoni or wayfarer the film was a boxoffice hit although some critics said it romanticised domestic violence soon after the release date in august another costar brandon sklenar hinted in an instagram post at rumours of a rift between ms lively and mr baldoni speculation of a falling out only grew when they did not appear together on the red carpet it ends with us tells the story of boston florist lily bloom played by ms lively as she navigates a love triangle between her charming but abusive boyfriend ryle kincaid played by mr baldoni and her compassionate first love atlas corrigan played by mr sklenar it is based on a bestselling novel by colleen hoover the 45yearold author has previously said her inspiration was domestic abuse her mother endured getty images lively posed for photos with sklenar left and her husband ryan reynolds at the premiere but not her costar baldoni",
    "summary": "Blake Lively accuses co-star Justin Baldoni of smear campaign21 December 2024 Share Save Malu Cursino BBC News Share SaveGetty ImagesBlake Lively has filed a legal complaint against It Ends With Us co-star Justin Baldoni, alleging sexual harassment and a campaign to \"destroy\" her reputation.\nIn the romantic drama, Ms Lively plays a woman who finds herself in a relationship with a charming but abusive boyfriend, played by Mr Baldoni.\nMr Baldoni, 40, attended the meeting in his capacity as co-chairman and co-founder of the company that produced the film, Wayfarer Studios.\nMs Lively also demanded that Mr Baldoni stop saying he could speak to her dead father.\nSoon after the release date in August, another co-star, Brandon Sklenar, hinted in an Instagram post at rumours of a rift between Ms Lively and Mr Baldoni.",
    "keywords": [
      "complaint",
      "campaign",
      "legal",
      "smear",
      "ends",
      "blake",
      "ms",
      "justin",
      "accuses",
      "wayfarer",
      "film",
      "baldoni",
      "played",
      "costar",
      "lively",
      "mr"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/2148/live/cd221de0-bfac-11ef-bae2-2dae41e4c833.jpg"
  },
  "https://www.bbc.com/news/articles/cje9kv3q94po": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cje9kv3q94po",
    "date": "2024-12-20",
    "time": "00:00:00",
    "title": "Volkswagen agrees deal to avoid Germany plant closures",
    "body": "Volkswagen agrees deal to avoid German plant closures\n\nAfter drawn-out negotiations which began in September, the union said on Friday that the two had \"succeeded in finding a solution\" that secures jobs and enables future investment.\n\nGermany's largest carmaker had previously warned it might have to shutter plants in the country for the first time in a bid to cut costs.\n\nThe two sides have, however, agreed to cut more than 35,000 jobs across the country in a \"socially responsible manner\" by 2030, in order to save some €15bn (£12.4bn).\n\nVolkswagen has reached a deal with the IG Metall trade union which will avert plant closures in Germany and avoid immediate compulsory redundancies.\n\nVW was considering closing up to three factories in Germany and had been calling on its workforce to accept a 10% pay cut.\n\nAt the time, the union was calling for a 7% increase.\n\nWhile the deal will also see a reduction in production capacity across its plants, it was celebrated by union leaders.\n\n\"No site will be closed, no-one will be laid off for operational reasons and our company wage agreement will be secured for the long term,\" said IG Metall's works council chief Daniela Cavallo.\n\n\"We have achieved a rock-solid solution under the most difficult economic conditions,\" she added.\n\nThe 35,000 job cuts by 2030 are expected to be found through different solutions such as offered early retirement.\n\nUnder the agreement, a 5% wage increase that was previously agreed will also be suspended in 2025 and 2026.\n\nThe union said this would help \"support transformation\" at the company.\n\nThe number of apprenticeships on offer each year in Germany will be reduced from 1,400 to 600 from 2026 too, and it will look at shifting some production to Mexico.\n\nIt is also looking at alternative options for its Dresden and Osnabrueck sites.\n\nBut Oliver Blume, VW's group chief executive, said in a statement that the agreement was \"an important signal for the future viability of the Volkswagen brand\".\n\nFactory closures in Germany would have been unprecedented in the manufacturer's history.\n\nVW, along with other German carmakers, has been badly affected by a decline in demand for its cars in China, previously a lucrative market.\n\nAt the same time, Chinese brands have been moving into Europe, increasing competition for sales.\n\nDuring the talks, some 100,000 workers joined short, so-called \"warning strikes\" at sites across the country, in order to put pressure on the company's management.\n\nThe latest round of talks began on Monday, with negotiators apparently determined to get matters settled before Christmas.\n\nThe German chancellor Olaf Scholz also welcomed the announcement, describing it as a \"good, socially acceptable solution\".",
    "clean_body": "volkswagen agrees deal to avoid german plant closures after drawnout negotiations which began in september the union said on friday that the two had succeeded in finding a solution that secures jobs and enables future investment germanys largest carmaker had previously warned it might have to shutter plants in the country for the first time in a bid to cut costs the two sides have however agreed to cut more than 35000 jobs across the country in a socially responsible manner by 2030 in order to save some €15bn £124bn volkswagen has reached a deal with the ig metall trade union which will avert plant closures in germany and avoid immediate compulsory redundancies vw was considering closing up to three factories in germany and had been calling on its workforce to accept a 10 pay cut at the time the union was calling for a 7 increase while the deal will also see a reduction in production capacity across its plants it was celebrated by union leaders no site will be closed noone will be laid off for operational reasons and our company wage agreement will be secured for the long term said ig metalls works council chief daniela cavallo we have achieved a rocksolid solution under the most difficult economic conditions she added the 35000 job cuts by 2030 are expected to be found through different solutions such as offered early retirement under the agreement a 5 wage increase that was previously agreed will also be suspended in 2025 and 2026 the union said this would help support transformation at the company the number of apprenticeships on offer each year in germany will be reduced from 1400 to 600 from 2026 too and it will look at shifting some production to mexico it is also looking at alternative options for its dresden and osnabrueck sites but oliver blume vws group chief executive said in a statement that the agreement was an important signal for the future viability of the volkswagen brand factory closures in germany would have been unprecedented in the manufacturers history vw along with other german carmakers has been badly affected by a decline in demand for its cars in china previously a lucrative market at the same time chinese brands have been moving into europe increasing competition for sales during the talks some 100000 workers joined short socalled warning strikes at sites across the country in order to put pressure on the companys management the latest round of talks began on monday with negotiators apparently determined to get matters settled before christmas the german chancellor olaf scholz also welcomed the announcement describing it as a good socially acceptable solution",
    "summary": "Volkswagen agrees deal to avoid German plant closuresAfter drawn-out negotiations which began in September, the union said on Friday that the two had \"succeeded in finding a solution\" that secures jobs and enables future investment.\nVolkswagen has reached a deal with the IG Metall trade union which will avert plant closures in Germany and avoid immediate compulsory redundancies.\nVW was considering closing up to three factories in Germany and had been calling on its workforce to accept a 10% pay cut.\nWhile the deal will also see a reduction in production capacity across its plants, it was celebrated by union leaders.\n\"No site will be closed, no-one will be laid off for operational reasons and our company wage agreement will be secured for the long term,\" said IG Metall's works council chief Daniela Cavallo.",
    "keywords": [
      "german",
      "agreement",
      "union",
      "solution",
      "volkswagen",
      "avoid",
      "country",
      "closures",
      "plant",
      "wage",
      "agrees",
      "deal",
      "previously",
      "germany"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/7857/live/6573c790-befb-11ef-b59e-49d4e30dab91.jpg"
  },
  "https://www.bbc.com/news/articles/c7ve11lr247o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c7ve11lr247o",
    "date": "2024-12-22",
    "time": "00:00:00",
    "title": "Russia is executing more and more Ukrainian prisoners of war",
    "body": "Russia is executing more and more Ukrainian prisoners of war\n\n22 December 2024 Share Save Vitaliy Shevchenko BBC Monitoring Russia editor Share Save\n\nFacebook Oleksandr Matsievsky is now an iconic figure in Ukraine after his execution by Russian forces\n\nUkrainian sniper Oleksandr Matsievsky was captured by Russians in the first year of the full-scale invasion. Later, a video emerged showing him smoking his last cigarette in a forest, apparently next to a grave he had been forced to dig. \"Glory to Ukraine!\" he says to his captors. Moments later, shots ring out and he falls dead. His execution is one of many. In October this year, nine captured Ukrainian soldiers were reportedly shot dead by Russian forces in Kursk region. Ukrainian prosecutors are investigating the case including a photo showing half-naked bodies lying on the ground. This photo was enough for one of the victims, drone operator Ruslan Holubenko, to be identified by his parents. \"I recognised him by his underwear,\" his distraught mother told local broadcaster Suspilne Chernihiv. \"I bought it for him before a trip to the sea. I also knew that his shoulder had been shot through. You could see that in the picture.\" The list of executions goes on. Ukrainian prosecutors are investigating reports of beheadings and a sword being used to kill a Ukrainian soldier with his hands tied behind his back. In another instance, a video showed 16 Ukrainian soldiers apparently being lined up and then mowed down with automatic gunfire after emerging from a woods to surrender.\n\nGetty Images Russia and Ukraine have released some prisoners, including this Ukrainian pictured after his release in September 2024\n\nSome of the executions were filmed by Russian forces themselves, while others were observed by Ukrainian drones hovering above. The killings captured on such videos usually take place in woods or fields lacking distinctive features, which makes confirming their exact location difficult. BBC Verify, however, has been able to confirm in several cases - such as one beheading - that the victims wear Ukrainian uniforms and that the videos are recent.\n\nRising numbers\n\nThe Ukrainian prosecution service says that at least 147 Ukrainian prisoners of war have been executed by Russian forces since the start of the full-scale invasion, 127 of them this year. \"The upward trend is very clear, very obvious,\" says Yuri Belousov, the head of the War Department at the Ukrainian Prosecutor-General's Office. \"Executions became systemic from November last year and have continued throughout all of this year. Sadly, their number has been particularly on the rise this summer and autumn. This tells us that they are not isolated cases. They are happening across vast areas and they have clear signs of being part of a policy - there is evidence that instructions to this effect are being issued.\" International humanitarian law - particularly the Third Geneva Convention - offers protection to prisoners of war, and executing them is a war crime. Despite this, Ramzan Kadyrov, the strongman leader of Russia's Chechnya, briefly ordered his commanders involved in the Ukraine war \"to take no prisoners\".\n\nGetty Images Ukrainians regularly rally across the country in support of their troops in Russian captivity\n\nImpunity",
    "clean_body": "russia is executing more and more ukrainian prisoners of war 22 december 2024 share save vitaliy shevchenko bbc monitoring russia editor share save facebook oleksandr matsievsky is now an iconic figure in ukraine after his execution by russian forces ukrainian sniper oleksandr matsievsky was captured by russians in the first year of the fullscale invasion later a video emerged showing him smoking his last cigarette in a forest apparently next to a grave he had been forced to dig glory to ukraine he says to his captors moments later shots ring out and he falls dead his execution is one of many in october this year nine captured ukrainian soldiers were reportedly shot dead by russian forces in kursk region ukrainian prosecutors are investigating the case including a photo showing halfnaked bodies lying on the ground this photo was enough for one of the victims drone operator ruslan holubenko to be identified by his parents i recognised him by his underwear his distraught mother told local broadcaster suspilne chernihiv i bought it for him before a trip to the sea i also knew that his shoulder had been shot through you could see that in the picture the list of executions goes on ukrainian prosecutors are investigating reports of beheadings and a sword being used to kill a ukrainian soldier with his hands tied behind his back in another instance a video showed 16 ukrainian soldiers apparently being lined up and then mowed down with automatic gunfire after emerging from a woods to surrender getty images russia and ukraine have released some prisoners including this ukrainian pictured after his release in september 2024 some of the executions were filmed by russian forces themselves while others were observed by ukrainian drones hovering above the killings captured on such videos usually take place in woods or fields lacking distinctive features which makes confirming their exact location difficult bbc verify however has been able to confirm in several cases such as one beheading that the victims wear ukrainian uniforms and that the videos are recent rising numbers the ukrainian prosecution service says that at least 147 ukrainian prisoners of war have been executed by russian forces since the start of the fullscale invasion 127 of them this year the upward trend is very clear very obvious says yuri belousov the head of the war department at the ukrainian prosecutorgenerals office executions became systemic from november last year and have continued throughout all of this year sadly their number has been particularly on the rise this summer and autumn this tells us that they are not isolated cases they are happening across vast areas and they have clear signs of being part of a policy there is evidence that instructions to this effect are being issued international humanitarian law particularly the third geneva convention offers protection to prisoners of war and executing them is a war crime despite this ramzan kadyrov the strongman leader of russias chechnya briefly ordered his commanders involved in the ukraine war to take no prisoners getty images ukrainians regularly rally across the country in support of their troops in russian captivity impunity",
    "summary": "In October this year, nine captured Ukrainian soldiers were reportedly shot dead by Russian forces in Kursk region.\nGetty Images Russia and Ukraine have released some prisoners, including this Ukrainian pictured after his release in September 2024Some of the executions were filmed by Russian forces themselves, while others were observed by Ukrainian drones hovering above.\nRising numbersThe Ukrainian prosecution service says that at least 147 Ukrainian prisoners of war have been executed by Russian forces since the start of the full-scale invasion, 127 of them this year.\nInternational humanitarian law - particularly the Third Geneva Convention - offers protection to prisoners of war, and executing them is a war crime.\nDespite this, Ramzan Kadyrov, the strongman leader of Russia's Chechnya, briefly ordered his commanders involved in the Ukraine war \"to take no prisoners\".",
    "keywords": [
      "woods",
      "forces",
      "war",
      "russian",
      "prisoners",
      "executions",
      "captured",
      "ukrainian",
      "executing",
      "russia",
      "ukraine"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f03a/live/56846890-bdf5-11ef-8e9d-2d56144e0daf.jpg"
  },
  "https://www.bbc.com/news/articles/cy7k830zdejo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cy7k830zdejo",
    "date": "2024-12-06",
    "time": "00:00:00",
    "title": "Lauren Mayberry of Chvrches: 'I twisted myself into a pretzel to please people'",
    "body": "Lauren Mayberry of Chvrches: I was always trying to make everyone happy\n\n6 December 2024 Share Save Mark Savage Music correspondent Share Save\n\nBBC Lauren Mayberry: \"A song can have terrible production but a great story, and I'll listen to that all the live long day\"\n\nLauren Mayberry is a peacemaker. Since 2011, she's been frontwoman of the Glaswegian band Chvrches, topping festival bills and the album charts with a trademark barrage of distorted synths and razor-sharp melodies. Mayberry was the baby of the band - just 23 when she joined, and years younger than her bandmates, Iain Cook and Martin Doherty. But their chemistry was instant. Chvrches' debut single, The Mother We Share, was written and recorded in 48 hours, using the only three synths they owned - but it became a word of mouth hit, earning them airplay on BBC Radio 1 and support slots with Passion Pit and Depeche Mode. In the press, they carefully presented themselves as a band, with each member receiving equal billing. But Mayberry says she worried about being the junior partner. \"I was always conscious that I was younger than the other guys, and they had a lot more experience,\" she says. \"They’d been to music school, and I hadn't. So I always felt like I was on the back foot, in terms of where I sat in the hierarchy.\" That feeling was amplified during a 2019 tour of Australia. The itinerary gave the band a four-day break in Melbourne, and Mayberry was looking forward to spending the downtime with her bandmates and the crew - until she discovered they'd made separate plans and she was stranded in her hotel room. \"I remember being very upset and hurt by that because I was always worrying about everyone else and taking care of everybody, and it was a humbling moment,\" she says. \"In the end, I hired a little car and drove to an Australian spa town and had a wee cry listening to Taylor Swift’s Cruel Summer.\" Looking back, she thinks that being the only woman in the touring party left her carrying the \"emotional labour\" of keeping the show on the road. \"I feel like I twisted myself into a pretzel sometimes to make everyone happy. \"Then I’d look back and think, ‘And were you happy?' \"Not really, but I was keeping the peace.\"\n\nCharlotte Patmore The singer's debut album is titled Vicious Creature after a lyric she'd written years ago: \"Nostalgia is such a vicious creature / Another way to say that you fear the future\"\n\nShe considered leaving the band after that Australian incident. Then Covid struck, and Chvrches ended up making a fourth album, 2021's Screen Violence, remotely. She finally took the plunge a year later, but not before signing a new record deal with her bandmates, assuring the future of the project. \"I was conscious it would give people a sense of security, that I’d made a commitment,\" she says. \"I don’t know that that’s how it actually works, but that was my hope.\" She’s keen to stress there’s no bad blood: Doherty and Cook have given her their full support. Still, it’s natural for someone leaving a band to define themselves in opposition to that music - otherwise what’s the point? As Mayberry succinctly puts it: “I didn’t want to make a crap knock-off Chvrches record.” In recording sessions, she'd flinch when anyone pulled out a vintage synth. Instead, she pursued a more organic, lyrics-first approach. But after a decade in a trio, the instinct to compromise was hard-wired. “I'm very used to arguing my point, then trying to see other people's point of view,\" she says. \"So it was a real learning curve to be like, ‘No, this is my opinion, and if I don't think it's right, then it's not right, and that's the end of the conversation'.”\n\nCrying wolf\n\nThe result is Vicious Creature, an album that showcases new depths to Mayberry‘s voice, which fluctuates between vulnerability and venom, while paying homage to her pop heroines. She channels the spirit of All Saints on the album opener Something In The Air; and borrows the choppy, sampled strings of Annie Lennox's Walking On Broken Glass to power the single Crocodile Tears. The latter is a furious riposte to an emotionally manipulative man, where Mayberry snarls: “What a man will say just to get his way / Always crying wolf, so I’m sad to say / I don’t really wanna hear it from you, babe\". The singer says she's role-playing in that song, inspired by the dark, subversive femininity of Velma Kelly in the musical Chicago, or Cabaret's Sally Bowles. Listen to Lauren Mayberry on BBC Radio 4's Front Row It's one of several songs that survived the first incarnation of the album - tentatively titled Fiction - that would be \"dark, theatrical and character driven\". Slowly, over time, more personal songs started to creep into the mix. The syncopated pulse of Change Shapes is a condemnation of music industry sexism (\"I'm a doll inside a box, with a ball and a chain\"). Sorry, Etc tells a similar story over a chaotic hybrid of garage rock and drum & bass. \"There were definitely a few songs where it was at best expressing frustrations and at worst [feeling] kind of hurt,\" about her life in music, Mayberry says.\n\nChvrches playing at the BBC Maida Vale studios in 2013 (L-R): Martin Doherty, Lauren Mayberry and Iain Cook\n\nThe album's most intimate moment is a muted piano ballad called Oh, Mother. Over three verses, Mayberry documents the shifting relationship with her mother - from the unquestioning love of childhood to adolescent disgust and, finally, the realisation that their time together is limited. \"It kills me to know you won't be around,\" she sings gently. \"Oh mother, what will I do without you?\" The last song written for the record, the words poured out after Mayberry's friend and co-writer Dan McDougall sketched out the chords in the studio. Discussing the lyrics, which were inspired by a family illness, the singer becomes a little emotional. \"When you're living in the shadow of things like that, it's on your mind all the time,\" she says. \"I think about it all the time. When I go away on tour, I always think, ‘Oh, is this the tour where I'm gone and I miss it’. \"So that last afternoon in the studio was quite a weepy one... But then we went to Nando's. So it's all about balance.\"\n\nGetty Images The singer previewed her debut album on tour with Bleachers and London Grammar, along with smaller solo shows, earlier this year",
    "clean_body": "lauren mayberry of chvrches i was always trying to make everyone happy 6 december 2024 share save mark savage music correspondent share save bbc lauren mayberry a song can have terrible production but a great story and ill listen to that all the live long day lauren mayberry is a peacemaker since 2011 shes been frontwoman of the glaswegian band chvrches topping festival bills and the album charts with a trademark barrage of distorted synths and razorsharp melodies mayberry was the baby of the band just 23 when she joined and years younger than her bandmates iain cook and martin doherty but their chemistry was instant chvrches debut single the mother we share was written and recorded in 48 hours using the only three synths they owned but it became a word of mouth hit earning them airplay on bbc radio 1 and support slots with passion pit and depeche mode in the press they carefully presented themselves as a band with each member receiving equal billing but mayberry says she worried about being the junior partner i was always conscious that i was younger than the other guys and they had a lot more experience she says they’d been to music school and i hadnt so i always felt like i was on the back foot in terms of where i sat in the hierarchy that feeling was amplified during a 2019 tour of australia the itinerary gave the band a fourday break in melbourne and mayberry was looking forward to spending the downtime with her bandmates and the crew until she discovered theyd made separate plans and she was stranded in her hotel room i remember being very upset and hurt by that because i was always worrying about everyone else and taking care of everybody and it was a humbling moment she says in the end i hired a little car and drove to an australian spa town and had a wee cry listening to taylor swift’s cruel summer looking back she thinks that being the only woman in the touring party left her carrying the emotional labour of keeping the show on the road i feel like i twisted myself into a pretzel sometimes to make everyone happy then i’d look back and think ‘and were you happy not really but i was keeping the peace charlotte patmore the singers debut album is titled vicious creature after a lyric shed written years ago nostalgia is such a vicious creature another way to say that you fear the future she considered leaving the band after that australian incident then covid struck and chvrches ended up making a fourth album 2021s screen violence remotely she finally took the plunge a year later but not before signing a new record deal with her bandmates assuring the future of the project i was conscious it would give people a sense of security that i’d made a commitment she says i don’t know that that’s how it actually works but that was my hope she’s keen to stress there’s no bad blood doherty and cook have given her their full support still it’s natural for someone leaving a band to define themselves in opposition to that music otherwise what’s the point as mayberry succinctly puts it “i didn’t want to make a crap knockoff chvrches record” in recording sessions shed flinch when anyone pulled out a vintage synth instead she pursued a more organic lyricsfirst approach but after a decade in a trio the instinct to compromise was hardwired “im very used to arguing my point then trying to see other peoples point of view she says so it was a real learning curve to be like ‘no this is my opinion and if i dont think its right then its not right and thats the end of the conversation” crying wolf the result is vicious creature an album that showcases new depths to mayberry‘s voice which fluctuates between vulnerability and venom while paying homage to her pop heroines she channels the spirit of all saints on the album opener something in the air and borrows the choppy sampled strings of annie lennoxs walking on broken glass to power the single crocodile tears the latter is a furious riposte to an emotionally manipulative man where mayberry snarls “what a man will say just to get his way always crying wolf so i’m sad to say i don’t really wanna hear it from you babe the singer says shes roleplaying in that song inspired by the dark subversive femininity of velma kelly in the musical chicago or cabarets sally bowles listen to lauren mayberry on bbc radio 4s front row its one of several songs that survived the first incarnation of the album tentatively titled fiction that would be dark theatrical and character driven slowly over time more personal songs started to creep into the mix the syncopated pulse of change shapes is a condemnation of music industry sexism im a doll inside a box with a ball and a chain sorry etc tells a similar story over a chaotic hybrid of garage rock and drum bass there were definitely a few songs where it was at best expressing frustrations and at worst feeling kind of hurt about her life in music mayberry says chvrches playing at the bbc maida vale studios in 2013 lr martin doherty lauren mayberry and iain cook the albums most intimate moment is a muted piano ballad called oh mother over three verses mayberry documents the shifting relationship with her mother from the unquestioning love of childhood to adolescent disgust and finally the realisation that their time together is limited it kills me to know you wont be around she sings gently oh mother what will i do without you the last song written for the record the words poured out after mayberrys friend and cowriter dan mcdougall sketched out the chords in the studio discussing the lyrics which were inspired by a family illness the singer becomes a little emotional when youre living in the shadow of things like that its on your mind all the time she says i think about it all the time when i go away on tour i always think ‘oh is this the tour where im gone and i miss it’ so that last afternoon in the studio was quite a weepy one but then we went to nandos so its all about balance getty images the singer previewed her debut album on tour with bleachers and london grammar along with smaller solo shows earlier this year",
    "summary": "Lauren Mayberry of Chvrches: I was always trying to make everyone happy6 December 2024 Share Save Mark Savage Music correspondent Share SaveBBC Lauren Mayberry: \"A song can have terrible production but a great story, and I'll listen to that all the live long day\"Lauren Mayberry is a peacemaker.\nSince 2011, she's been frontwoman of the Glaswegian band Chvrches, topping festival bills and the album charts with a trademark barrage of distorted synths and razor-sharp melodies.\nListen to Lauren Mayberry on BBC Radio 4's Front Row It's one of several songs that survived the first incarnation of the album - tentatively titled Fiction - that would be \"dark, theatrical and character driven\".\n\"There were definitely a few songs where it was at best expressing frustrations and at worst [feeling] kind of hurt,\" about her life in music, Mayberry says.\nChvrches playing at the BBC Maida Vale studios in 2013 (L-R): Martin Doherty, Lauren Mayberry and Iain CookThe album's most intimate moment is a muted piano ballad called Oh, Mother.",
    "keywords": [
      "im",
      "chvrches",
      "music",
      "mother",
      "mayberry",
      "album",
      "tour",
      "think",
      "lauren",
      "band",
      "twisted",
      "pretzel"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/aa3c/live/49c3b400-b268-11ef-a2ca-e99d0c9a24e3.jpg"
  },
  "https://www.bbc.com/news/articles/cdjgyjr7n3vo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cdjgyjr7n3vo",
    "date": "2024-12-12",
    "time": "00:00:00",
    "title": "Snooker legends Dennis Taylor and Steve Davis to re-enact 1985 final",
    "body": "Famous black ball final re-enacted 40 years on\n\n12 December 2024 Share Save Lee Blakeman BBC Radio Stoke Richard Price BBC News, West Midlands Share Save\n\nBBC Dennis Taylor won his first and only world championship - wearing the iconic \"upside down\" glasses - watched by 19 million people on TV\n\n\"The greatest snooker match of all time\" will be relived in Stoke-on-Trent after Dennis Taylor gained icon status 40 years ago by beating arch rival Steve Davis to become world champion. Taylor played the \"Black Ball Final\" of 1985 in Sheffield, in a match seen by 19 million people on BBC 2 that lasted until gone midnight. The match remains the channel's highest-rated show, and saw Taylor go cue-to-cue with Davis, who had won the title three times. Inevitably, Davis was favourite to win again, and had taken a seven frames lead. But Taylor - famed for his \"upside down\" glasses - made a miraculous comeback and potted the final black to win the match.\n\nIt provided the sport with the iconic moment of Taylor, wearing those glasses and raising his cue above his head, in celebration. He will appear at the Victoria Hall in Hanley for a show as part of a tour alongside Steve Davis and host John Virgo. The pair will recreate the classic match and also chat with audience members on the night.\n\nSteve Davis and Dennis Taylor will re-create their classic match from 1985\n\n\"John usually gets a couple of people out to do a few trick shots, then Steve and me play a couple of frames, then of course we re-enact that black ball final with the last few colours,\" Taylor said. \"Steve's very amusing about it as well, and the amazing thing about it is we re-enact that black ball final and I get to win every night.\" Taylor said during the second half of the show, they each do their \"own little bit\" – adding that Davis is \"very funny\" despite his previous reputation for seriousness. \"He was very, very serious when he was playing, he was very focussed - but he's so much fun. I love working with him,\" Taylor continued. \"The three of us interact with the audience and have a lot of fun.\" He said people still come up to him to talk about that night in 1985, and to take photos with him – adding that sometimes people turn their own glasses upside down. \"It's something that they all remember, they remember where they were when Steve and me were battling it out,\" he said.\n\nMindhouse Productions Taylor says people come up to him and turn their glasses upside down for a photo with him\n\n\"To keep nearly 19 million people up past midnight, watching a fella with ginger hair playing another fella with a big pair of upside down glasses, it's amazing how it captured everybody's imagination. \"Steve says he'll remember that final more than the six that he won.\" Taylor says they were involved in a \"bit of snooker history\", although at the time they had no idea how many people who might have been tuning in. \"If we'd ever thought there was that many people watching I don't think we'd have been able to hold the cue,\" he said. \"The audience kept building, and the BBC were cancelling programmes to stay with it, and it just built and built. \"The pressure on both of us was unbelievable, but we weren't thinking, we were just concentrating on the game.\"\n\nFollow BBC Stoke & Staffordshire on BBC Sounds, Facebook, X and Instagram.",
    "clean_body": "famous black ball final reenacted 40 years on 12 december 2024 share save lee blakeman bbc radio stoke richard price bbc news west midlands share save bbc dennis taylor won his first and only world championship wearing the iconic upside down glasses watched by 19 million people on tv the greatest snooker match of all time will be relived in stokeontrent after dennis taylor gained icon status 40 years ago by beating arch rival steve davis to become world champion taylor played the black ball final of 1985 in sheffield in a match seen by 19 million people on bbc 2 that lasted until gone midnight the match remains the channels highestrated show and saw taylor go cuetocue with davis who had won the title three times inevitably davis was favourite to win again and had taken a seven frames lead but taylor famed for his upside down glasses made a miraculous comeback and potted the final black to win the match it provided the sport with the iconic moment of taylor wearing those glasses and raising his cue above his head in celebration he will appear at the victoria hall in hanley for a show as part of a tour alongside steve davis and host john virgo the pair will recreate the classic match and also chat with audience members on the night steve davis and dennis taylor will recreate their classic match from 1985 john usually gets a couple of people out to do a few trick shots then steve and me play a couple of frames then of course we reenact that black ball final with the last few colours taylor said steves very amusing about it as well and the amazing thing about it is we reenact that black ball final and i get to win every night taylor said during the second half of the show they each do their own little bit – adding that davis is very funny despite his previous reputation for seriousness he was very very serious when he was playing he was very focussed but hes so much fun i love working with him taylor continued the three of us interact with the audience and have a lot of fun he said people still come up to him to talk about that night in 1985 and to take photos with him – adding that sometimes people turn their own glasses upside down its something that they all remember they remember where they were when steve and me were battling it out he said mindhouse productions taylor says people come up to him and turn their glasses upside down for a photo with him to keep nearly 19 million people up past midnight watching a fella with ginger hair playing another fella with a big pair of upside down glasses its amazing how it captured everybodys imagination steve says hell remember that final more than the six that he won taylor says they were involved in a bit of snooker history although at the time they had no idea how many people who might have been tuning in if wed ever thought there was that many people watching i dont think wed have been able to hold the cue he said the audience kept building and the bbc were cancelling programmes to stay with it and it just built and built the pressure on both of us was unbelievable but we werent thinking we were just concentrating on the game follow bbc stoke staffordshire on bbc sounds facebook x and instagram",
    "summary": "Taylor played the \"Black Ball Final\" of 1985 in Sheffield, in a match seen by 19 million people on BBC 2 that lasted until gone midnight.\nThe match remains the channel's highest-rated show, and saw Taylor go cue-to-cue with Davis, who had won the title three times.\nBut Taylor - famed for his \"upside down\" glasses - made a miraculous comeback and potted the final black to win the match.\nHe will appear at the Victoria Hall in Hanley for a show as part of a tour alongside Steve Davis and host John Virgo.\n\"Steve's very amusing about it as well, and the amazing thing about it is we re-enact that black ball final and I get to win every night.\"",
    "keywords": [
      "snooker",
      "reenact",
      "dennis",
      "match",
      "glasses",
      "black",
      "ball",
      "final",
      "davis",
      "upside",
      "taylor",
      "steve",
      "bbc",
      "1985",
      "legends"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/eb3c/live/f0129810-b7ec-11ef-be56-e797859eaafe.jpg"
  },
  "https://www.bbc.com/news/articles/c5y867penn8o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c5y867penn8o",
    "date": "2024-12-09",
    "time": "00:00:00",
    "title": "Russian prison boss killed in car blast in occupied Ukraine",
    "body": "Prison boss killed in car blast in occupied Ukraine\n\nSergei Yevsyukov was killed in a car blast in central Donetsk on Monday\n\nRussia blamed Ukraine for that attack but Ukraine said Russia had targeted the prison to destroy evidence of torture and other war crimes committed there.\n\nYevsyukov was chief of the Olenivka Prison when dozens of Ukrainian prisoners of war died in a missile strike in July 2022 .\n\nUkrainian media say that Sergei Yevsyukov, 49, was killed in a blast from an explosive device planted under his car, with one outlet reporting that the bomb was equivalent to about 100g of TNT.\n\nThe former head of a notorious prison in Russian-occupied Ukraine has reportedly been killed in a car blast in Donetsk, in what is being seen as the latest in a series of attacks on pro-Kremlin figures in occupied land.\n\nOn Monday, Russian authorities said they had opened a criminal investigation into the incident which took place near the city's centre.\n\nThey did not confirm identities but said two local residents had been injured.\n\nUkrainian bloggers reported Yevsyukov's wife had also been injured in the attack, losing a leg, and was in hospital on a critical condition.\n\n\"[We] are conducting a detailed examination of the scene of the incident and a set of operational and investigative measures,\" the Russian Investigations Committee said.\n\nFootage of the scene shows the burnt-out white SUV parked on a main street in Donestsk.\n\nYevsyukov's killing is being seen as the latest in a string of targeted attacks by Ukraine on Russian officers, Russian-installed military officials and pro-Kremlin public figures in occupied Ukrainian territory and in Russia.\n\nIn November, a senior naval officer Valery Trankovsky who had been accused of war crimes by Ukraine was killed in Crimea. Crimea was illegally annexed by Russia in 2014.\n\nTrankovsky's assassination was orchestrated by Ukrainian intelligence, AFP news agency reported last month citing a source in Ukraine's security services.\n\nIn October, Ukraine claimed responsibility for a car bomb attack that killed an official at the Russian-occupied Zaporizhzhia nuclear power plant.\n\nAnd in April, a car bomb in Russian-controlled territory in Ukraine's eastern Luhansk region killed a Moscow-appointed government official.\n\nDonetsk city and parts of the wider region in eastern Ukraine were first seized by Russian-backed forces in 2014, and the area has been partially controlled by Moscow ever since.\n\nThe region has consistently seen some of the fiercest fighting of the war these past nearly three years.",
    "clean_body": "prison boss killed in car blast in occupied ukraine sergei yevsyukov was killed in a car blast in central donetsk on monday russia blamed ukraine for that attack but ukraine said russia had targeted the prison to destroy evidence of torture and other war crimes committed there yevsyukov was chief of the olenivka prison when dozens of ukrainian prisoners of war died in a missile strike in july 2022 ukrainian media say that sergei yevsyukov 49 was killed in a blast from an explosive device planted under his car with one outlet reporting that the bomb was equivalent to about 100g of tnt the former head of a notorious prison in russianoccupied ukraine has reportedly been killed in a car blast in donetsk in what is being seen as the latest in a series of attacks on prokremlin figures in occupied land on monday russian authorities said they had opened a criminal investigation into the incident which took place near the citys centre they did not confirm identities but said two local residents had been injured ukrainian bloggers reported yevsyukovs wife had also been injured in the attack losing a leg and was in hospital on a critical condition we are conducting a detailed examination of the scene of the incident and a set of operational and investigative measures the russian investigations committee said footage of the scene shows the burntout white suv parked on a main street in donestsk yevsyukovs killing is being seen as the latest in a string of targeted attacks by ukraine on russian officers russianinstalled military officials and prokremlin public figures in occupied ukrainian territory and in russia in november a senior naval officer valery trankovsky who had been accused of war crimes by ukraine was killed in crimea crimea was illegally annexed by russia in 2014 trankovskys assassination was orchestrated by ukrainian intelligence afp news agency reported last month citing a source in ukraines security services in october ukraine claimed responsibility for a car bomb attack that killed an official at the russianoccupied zaporizhzhia nuclear power plant and in april a car bomb in russiancontrolled territory in ukraines eastern luhansk region killed a moscowappointed government official donetsk city and parts of the wider region in eastern ukraine were first seized by russianbacked forces in 2014 and the area has been partially controlled by moscow ever since the region has consistently seen some of the fiercest fighting of the war these past nearly three years",
    "summary": "Prison boss killed in car blast in occupied UkraineSergei Yevsyukov was killed in a car blast in central Donetsk on MondayRussia blamed Ukraine for that attack but Ukraine said Russia had targeted the prison to destroy evidence of torture and other war crimes committed there.\nThe former head of a notorious prison in Russian-occupied Ukraine has reportedly been killed in a car blast in Donetsk, in what is being seen as the latest in a series of attacks on pro-Kremlin figures in occupied land.\nIn November, a senior naval officer Valery Trankovsky who had been accused of war crimes by Ukraine was killed in Crimea.\nIn October, Ukraine claimed responsibility for a car bomb attack that killed an official at the Russian-occupied Zaporizhzhia nuclear power plant.\nAnd in April, a car bomb in Russian-controlled territory in Ukraine's eastern Luhansk region killed a Moscow-appointed government official.",
    "keywords": [
      "boss",
      "war",
      "russian",
      "car",
      "occupied",
      "seen",
      "region",
      "ukrainian",
      "blast",
      "killed",
      "ukraine",
      "prison"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/8458/live/6c05ca30-b637-11ef-b33a-ab0a93f850a1.png"
  },
  "https://www.bbc.com/news/articles/cg7r21egd82o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cg7r21egd82o",
    "date": "2024-12-16",
    "time": "00:00:00",
    "title": "Robbie Williams explains why he's a monkey in his new movie",
    "body": "Robbie Williams on why he's played by a chimp in new film\n\n16 December 2024 Share Save Colin Paterson Entertainment correspondent Share Save\n\nEntertainment Robbie WIlliams is portrayed by a chimpanzee in the new biopic Better Man\n\nRobbie Williams is thoroughly enjoying his wander into the world of film, even if he is still learning the correct lingo. \"I was at this thing called the Governors' Ball the other night. That was amazing,\" the singer says. He is talking about the Governors' Awards, held in Los Angeles, where he joined other guests including Tom Hanks, Angelina Jolie and Daniel Craig. \"I'm super excited because it's all brand new to me. I feel like an artist that's just been signed. I'm full of hope, full of excitement, bewildered by it all.\" The project that currently has him walking red carpets with the biggest names in Hollywood is his biopic Better Man. \"Kevin Costner sought me out,\" he giggles, adding with growing incredulity: \"He wanted to come and tell me about the movie.\"\n\nTony Dolce/BBC\n\nBetter Man deals with Williams' life from childhood, through the Take That years, to about 2003, the year he broke records by playing three huge gigs at Knebworth (with the aim of annoying Oasis, who had only managed two). The twist in the tale, or tail, is that throughout the film, and with no explanation, he is portrayed on screen as a monkey. At least that is how everyone involved in the film refers to the animal. If Sir David Attenborough veered into film reviewing, he would be quick to point out, in hushed tones, that the creature singing Angels and Rock DJ is a chimpanzee, not a monkey - because it has no tail. To paraphrase the debut album of Williams' old boyband, Ape That and Party.\n\nEntertainment Better Man has been nominated for best song at the Golden Globes\n\nWilliams is speaking to me at London's Soho Hotel, a venue so popular with the movie industry that at the exact same time, Rupert Everett is presenting an award on one floor, while in the basement there is a screening of a documentary produced by Jennifer Lawrence. Williams is sitting next to Michael Gracey, the director of 2017 hit The Greatest Showman. Now, after a gap of seven years, Better Man is Gracey's next film, and it was his idea to turn the main man into a monkey.\n\nMike Marsland/WireImage Take Hat! Better Man's director Michael Gracey at the film's European premiere in London\n\nFor a year and half, Williams and Gracey had been sending messages back and forth, discussing a possible film musical based on his life. \"There have been a lot of musical biopics,\" says Gracey. \"I wanted to come at this with a different lens. \"Quite often Rob will say, 'I'm just like a performing monkey' or 'I'm up the back like a performing monkey'. \"It just sparked this idea of, we've got this chance to tell this story, not from the perspective of how we see Rob, but how he sees himself. \"And so I pitched the idea to Rob. I said, 'You know, if you were to be an animal, how would you see yourself?'\" Williams takes up the story: \"I was looking for some self-worth at the time and I was like, 'I am a lion'. And he just cocked his head and went, 'Mmmm.' \"I went, 'Monkey?' \"And he went, 'Yeah, so here's the idea.' And before the end of the sentence was out of his mouth, I'm like, 'Yes, that, that, that, please'.\"\n\nEntertainment Jonno Davies plays Robbie Williams and provides his speaking voice, although the real Robbie Williams does the singing and a voiceover\n\nThe monkey was created by Weta, the special effects company responsible for Gollum in Lord of the Rings and Caesar in Planet of the Apes. They used a combination of motion capture and CGI, with the role and the speaking voice taken on by English actor Jonno Davies, best known as Tobias in the Al Pacino TV series Hunters. But it turns out that the original plan was for Williams himself to play the monkey. \"I was going to, but it involved me leaving my family for loads and loads of months,\" he says. \"And the thought of that was just too much for me to bear. \"There are loads of things that I want to do that are just best being an idea. It was great at dinner parties, 'I'm playing me in a story about me.' \"And by the time it came round to it, I was bored of the idea. 'I've said it at dinner parties now. I've done it.'\"\n\nMe and My Monkey\n\nWilliams did perform the whole of My Way while wired up to help with the motion capture, at a specially arranged pair of concerts at the Royal Albert Hall in 2022. \"We also scanned his eyes,\" explains Gracey, \"So when you look at the monkey's eyes, it's actually one for one Rob's eyes.\" \"I kind of don't want to know which bit's me and which bit's not me,\" interrupts Williams. \"I want the magic of the film just to be the magic of the film. \"Also, Jonno, who plays me, has got a wonderful bottom and I want to believe that bit is me, that my bum will be memorialised as that epic.\"\n\nGetty Images Former All Saint Nicole Appleton attended the premiere of Better Man\n\nRobbie Williams sums up Better Man as \"the greatest hits of my trauma for the TikTok generation\". And the film doesn't shy away from dealing with his drug addictions and mental health problems, or when Nicole Appleton from All Saints was pregnant with their child and was pressured by people in the music industry, she said, into having an abortion. \"My part in her life I still have shame about. It's the most difficult part of the film for me to watch,\" Williams admits. \"She did me no harm and is a kind, lovely person. I was an idiot younger boyfriend.\"\n\nChimp off the old block\n\nAppleton is supportive of the film and was consulted throughout production - unlike Williams' father Peter Conway, a singer with whom he has performed many times over the years. In Better Man, he is played by Inside No 9's Steve Pemberton and portrayed as someone who let down his family. \"He hasn't seen it yet. And I don't know if I want him to,\" says Williams. \"I haven't spoken to him about it. I'm embarrassed. I love my dad. Best mate, charming, wonderful man. \"But as it is with everybody's childhood, like the Philip Larkin poem, 'They mess you up your mum and dad.' And I'm messing my kids up.\"\n\nEntertainment The chimp version of Williams pictured in the film singing alongside his dad, played by Steve Pemberton\n\nThe film also paints a pretty poisonous portrait of Williams' time in Take That. \"There's a pattern - boys join a boyband, boyband becomes huge, boys get sick. And I don't think anybody gets to escape that,\" is his summary. \"I don't know what it is completely about fame that warps. I just know that it does. I know that young fame, in particular, is corrosive and toxic. It should come with a health warning.\" The death earlier this year of One Direction's Liam Payne, who he mentored on The X Factor in 2010, has made him want to change the way boybands are looked after. \"It's going to take a bunch of creatives to sit around, and I want to head that. I want to do that,\" he says. \"It has to be creative people, not members of Parliament or record company bosses. I think this needs to be oversensitive people with complicated inner lives, who understand what it's like to have a complicated inner life and what help that would need.\" But these plans will have to wait.\n\nReuters In 2010 Robbie Williams mentored Liam Payne on The X Factor, when he was starting out in One Direction",
    "clean_body": "robbie williams on why hes played by a chimp in new film 16 december 2024 share save colin paterson entertainment correspondent share save entertainment robbie williams is portrayed by a chimpanzee in the new biopic better man robbie williams is thoroughly enjoying his wander into the world of film even if he is still learning the correct lingo i was at this thing called the governors ball the other night that was amazing the singer says he is talking about the governors awards held in los angeles where he joined other guests including tom hanks angelina jolie and daniel craig im super excited because its all brand new to me i feel like an artist thats just been signed im full of hope full of excitement bewildered by it all the project that currently has him walking red carpets with the biggest names in hollywood is his biopic better man kevin costner sought me out he giggles adding with growing incredulity he wanted to come and tell me about the movie tony dolcebbc better man deals with williams life from childhood through the take that years to about 2003 the year he broke records by playing three huge gigs at knebworth with the aim of annoying oasis who had only managed two the twist in the tale or tail is that throughout the film and with no explanation he is portrayed on screen as a monkey at least that is how everyone involved in the film refers to the animal if sir david attenborough veered into film reviewing he would be quick to point out in hushed tones that the creature singing angels and rock dj is a chimpanzee not a monkey because it has no tail to paraphrase the debut album of williams old boyband ape that and party entertainment better man has been nominated for best song at the golden globes williams is speaking to me at londons soho hotel a venue so popular with the movie industry that at the exact same time rupert everett is presenting an award on one floor while in the basement there is a screening of a documentary produced by jennifer lawrence williams is sitting next to michael gracey the director of 2017 hit the greatest showman now after a gap of seven years better man is graceys next film and it was his idea to turn the main man into a monkey mike marslandwireimage take hat better mans director michael gracey at the films european premiere in london for a year and half williams and gracey had been sending messages back and forth discussing a possible film musical based on his life there have been a lot of musical biopics says gracey i wanted to come at this with a different lens quite often rob will say im just like a performing monkey or im up the back like a performing monkey it just sparked this idea of weve got this chance to tell this story not from the perspective of how we see rob but how he sees himself and so i pitched the idea to rob i said you know if you were to be an animal how would you see yourself williams takes up the story i was looking for some selfworth at the time and i was like i am a lion and he just cocked his head and went mmmm i went monkey and he went yeah so heres the idea and before the end of the sentence was out of his mouth im like yes that that that please entertainment jonno davies plays robbie williams and provides his speaking voice although the real robbie williams does the singing and a voiceover the monkey was created by weta the special effects company responsible for gollum in lord of the rings and caesar in planet of the apes they used a combination of motion capture and cgi with the role and the speaking voice taken on by english actor jonno davies best known as tobias in the al pacino tv series hunters but it turns out that the original plan was for williams himself to play the monkey i was going to but it involved me leaving my family for loads and loads of months he says and the thought of that was just too much for me to bear there are loads of things that i want to do that are just best being an idea it was great at dinner parties im playing me in a story about me and by the time it came round to it i was bored of the idea ive said it at dinner parties now ive done it me and my monkey williams did perform the whole of my way while wired up to help with the motion capture at a specially arranged pair of concerts at the royal albert hall in 2022 we also scanned his eyes explains gracey so when you look at the monkeys eyes its actually one for one robs eyes i kind of dont want to know which bits me and which bits not me interrupts williams i want the magic of the film just to be the magic of the film also jonno who plays me has got a wonderful bottom and i want to believe that bit is me that my bum will be memorialised as that epic getty images former all saint nicole appleton attended the premiere of better man robbie williams sums up better man as the greatest hits of my trauma for the tiktok generation and the film doesnt shy away from dealing with his drug addictions and mental health problems or when nicole appleton from all saints was pregnant with their child and was pressured by people in the music industry she said into having an abortion my part in her life i still have shame about its the most difficult part of the film for me to watch williams admits she did me no harm and is a kind lovely person i was an idiot younger boyfriend chimp off the old block appleton is supportive of the film and was consulted throughout production unlike williams father peter conway a singer with whom he has performed many times over the years in better man he is played by inside no 9s steve pemberton and portrayed as someone who let down his family he hasnt seen it yet and i dont know if i want him to says williams i havent spoken to him about it im embarrassed i love my dad best mate charming wonderful man but as it is with everybodys childhood like the philip larkin poem they mess you up your mum and dad and im messing my kids up entertainment the chimp version of williams pictured in the film singing alongside his dad played by steve pemberton the film also paints a pretty poisonous portrait of williams time in take that theres a pattern boys join a boyband boyband becomes huge boys get sick and i dont think anybody gets to escape that is his summary i dont know what it is completely about fame that warps i just know that it does i know that young fame in particular is corrosive and toxic it should come with a health warning the death earlier this year of one directions liam payne who he mentored on the x factor in 2010 has made him want to change the way boybands are looked after its going to take a bunch of creatives to sit around and i want to head that i want to do that he says it has to be creative people not members of parliament or record company bosses i think this needs to be oversensitive people with complicated inner lives who understand what its like to have a complicated inner life and what help that would need but these plans will have to wait reuters in 2010 robbie williams mentored liam payne on the x factor when he was starting out in one direction",
    "summary": "The project that currently has him walking red carpets with the biggest names in Hollywood is his biopic Better Man.\n\"Quite often Rob will say, 'I'm just like a performing monkey' or 'I'm up the back like a performing monkey'.\nEntertainment Jonno Davies plays Robbie Williams and provides his speaking voice, although the real Robbie Williams does the singing and a voiceoverThe monkey was created by Weta, the special effects company responsible for Gollum in Lord of the Rings and Caesar in Planet of the Apes.\nIn Better Man, he is played by Inside No 9's Steve Pemberton and portrayed as someone who let down his family.\nReuters In 2010 Robbie Williams mentored Liam Payne on The X Factor, when he was starting out in One Direction",
    "keywords": [
      "explains",
      "monkey",
      "im",
      "movie",
      "better",
      "know",
      "robbie",
      "hes",
      "film",
      "man",
      "idea",
      "gracey",
      "williams"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/0b6a/live/c343c390-bb84-11ef-aff0-072ce821b6ab.jpg"
  },
  "https://www.bbc.com/news/articles/cx27wwyqqweo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cx27wwyqqweo",
    "date": "2024-12-12",
    "time": "00:00:00",
    "title": "Selena Gomez announces engagement to Benny Blanco",
    "body": "Selena Gomez announces engagement to Benny Blanco\n\n12 December 2024 Share Save André Rhoden-Paul BBC News Share Save\n\nGetty Images\n\nSelena Gomez has revealed she is engaged to songwriter Benny Blanco. The actress and singer posted a picture of a large engagement ring on Instagram, with the caption \"forever begins now\". It comes after the couple confirmed their relationship last year. Pop star Taylor Swift was among the famous figures to offer congratulations.\n\nTwo-time Grammy-nominated Gomez posted further pictures of her beaming, wearing the ring, and one of Blanco embracing her in what appears to be a closet. \"Hey wait... that's my wife,\" Blanco commented on the post. Swift replied: \"Yes I will be the flower girl.\" Rapper Cardi B, actresses Gwyneth Paltrow, Jennifer Aniston and Suki Waterhouse, and singer Lil Nas X also sent well wishes.\n\nAllow Instagram content? Meta’s cookie policy privacy policy ‘accept and continue’. This article contains content provided by Instagram . We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readandbefore accepting. To view this content choose Accept and continue\n\nIn an Instagram Story shared with her 423 million followers, the most-followed woman on the app also revealed a video showing her ring to loved ones on the phone. \"Yes to this,\" she can be heard saying, evoking screams on the other end of the video call.\n\nGomez and record producer Blanco had collaborated on songs I Can't Get Enough in 2019 and Single Soon in 2023, before announcing their relationship. Blanco, who has also worked with the likes of Rihanna, Calvin Harris and Justin Bieber, was effusive about his love on the Drew Barrymore Show back in May. \"She's just like the best, most genuine person,\" he said on the chat show. \"Everything is completely real. Everyday when I wake up, I, like, walk by the mirror as I'm, like, walking to her and I ask myself, 'How did I get here'... \"She's one of the sweetest, one of the most charming, one of the most humble people I've ever met.\" Come & Get It singer Gomez was previously in a high profile on-and-off relationship with fellow singer Justin Bieber. She also dated singer The Weeknd in 2017. The Texas-born star rose to fame as a child actress on Barney and Disney Channel, before forging a career as a singer and in acting. This year she joined the billionaire celebrity rich list, according to Bloomberg, amassing a $1.3bn (£1bn) fortune - mainly deriving from her Rare Beauty make-up company.",
    "clean_body": "selena gomez announces engagement to benny blanco 12 december 2024 share save andré rhodenpaul bbc news share save getty images selena gomez has revealed she is engaged to songwriter benny blanco the actress and singer posted a picture of a large engagement ring on instagram with the caption forever begins now it comes after the couple confirmed their relationship last year pop star taylor swift was among the famous figures to offer congratulations twotime grammynominated gomez posted further pictures of her beaming wearing the ring and one of blanco embracing her in what appears to be a closet hey wait thats my wife blanco commented on the post swift replied yes i will be the flower girl rapper cardi b actresses gwyneth paltrow jennifer aniston and suki waterhouse and singer lil nas x also sent well wishes allow instagram content meta’s cookie policy privacy policy ‘accept and continue’ this article contains content provided by instagram we ask for your permission before anything is loaded as they may be using cookies and other technologies you may want to readandbefore accepting to view this content choose accept and continue in an instagram story shared with her 423 million followers the mostfollowed woman on the app also revealed a video showing her ring to loved ones on the phone yes to this she can be heard saying evoking screams on the other end of the video call gomez and record producer blanco had collaborated on songs i cant get enough in 2019 and single soon in 2023 before announcing their relationship blanco who has also worked with the likes of rihanna calvin harris and justin bieber was effusive about his love on the drew barrymore show back in may shes just like the best most genuine person he said on the chat show everything is completely real everyday when i wake up i like walk by the mirror as im like walking to her and i ask myself how did i get here shes one of the sweetest one of the most charming one of the most humble people ive ever met come get it singer gomez was previously in a high profile onandoff relationship with fellow singer justin bieber she also dated singer the weeknd in 2017 the texasborn star rose to fame as a child actress on barney and disney channel before forging a career as a singer and in acting this year she joined the billionaire celebrity rich list according to bloomberg amassing a 13bn £1bn fortune mainly deriving from her rare beauty makeup company",
    "summary": "Selena Gomez announces engagement to Benny Blanco12 December 2024 Share Save André Rhoden-Paul BBC News Share SaveGetty ImagesSelena Gomez has revealed she is engaged to songwriter Benny Blanco.\nThe actress and singer posted a picture of a large engagement ring on Instagram, with the caption \"forever begins now\".\nTwo-time Grammy-nominated Gomez posted further pictures of her beaming, wearing the ring, and one of Blanco embracing her in what appears to be a closet.\nAllow Instagram content?\nCome & Get It singer Gomez was previously in a high profile on-and-off relationship with fellow singer Justin Bieber.",
    "keywords": [
      "blanco",
      "yes",
      "instagram",
      "benny",
      "gomez",
      "ring",
      "selena",
      "swift",
      "engagement",
      "singer",
      "relationship",
      "video",
      "announces",
      "content"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/859c/live/86190c00-b869-11ef-8980-570aec49f572.jpg"
  },
  "https://www.bbc.com/news/articles/ckg3dl757w6o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/ckg3dl757w6o",
    "date": "2024-12-12",
    "time": "00:00:00",
    "title": "Meet Karol G, Colombia's Taylor Swift",
    "body": "Meet Karol G, Colombia's Taylor Swift\n\n12 December 2024 Share Save Catherine Ellis Business reporter Reporting from Bogotá, Colombia Share Save\n\nGetty Images Karol G had four sold out shows at Madrid's Bernabéu Stadium this summer\n\nWe have all heard of Taylor Swift, but what about Colombian singer Karol G? While Swift has dominated the headlines and concert ticket sales over recent years, it is actually the 33-year-old Latin American pop star whose videos are the most watched online. That's according to Vevo, which is the main provider of official music videos to YouTube. Karol G's were the most streamed around the world for each of the past four years, 2021 to 2024. This year, Karol G's Vevo videos were watched 3.5 billion times, with fellow Colombian Shakira in second place on 1.96 billion, and Swift on 1.95 billion.\n\nSo who is Karol G, and what has fuelled the success that also saw her sell out Madrid's Bernabéu Stadium over four nights back in July, plus stadiums across the US last year? Born in the Colombian city of Medellín in 1991 her full name is Carolina Giraldo Navarro. She wanted to be a singer from an early age, and when she was 14 she appeared on the Colombian version of the talent show X Factor in 2005. Success did not immediately follow, and instead by 2014 she had moved to the US to live with her aunt in New York City to learn English and do menial work. She almost gave up pursuing a career in music at this time, but her father convinced her that she could make it. While in the US Karol G also attended a music business conference in Boston, which she says was very helpful in helping her understand how the industry worked. She got her breakthrough hit single in 2017, the song Ahora Me Llama, which was a collaboration with Puerto Rican male artist Bad Bunny. Her first album Unstoppable then followed. Since then the hits have just kept on coming, and her 2023 album, Mañana Será Bonito, was the first entirely Spanish-language release by a female artist to top the US album chart.\n\nSmirnoff Karol G has a number of endorsement deals\n\nKarol G's style of music is more often described as \"reggaeton\". This combines hip-hop with Latin American and Jamaican music, with the singing and rapping usually done in Spanish. While she is widely reported to be both hardworking and ambitious, Rocío Guerrero, head of Latin music at Amazon Music, says that the singer – and Latin music in general - have been greatly helped by the rise of streaming, both the music and the accompanying videos. \"Streaming democratised the landscape,\" says Ms Guerrero, explaining that it has allowed Latin music, which wasn't being played on mainstream radio stations to travel the world. \"Radio stations were local, but with streaming we brought together all of those audiences [around the globe]. It has given more opportunity to more Latin songs and artist to be exposed. Karol G is a perfect example of this evolution.\"\n\nToday on Amazon Music more than a third of Latin music is now consumed outside Latin America, and in the last three years alone the listenership for Karol G has grown by more than 250%. Meanwhile, in the US, Latin music is now the fastest-growing genre, hitting a record $1.4bn (£1.1bn) in venues last year, according to the Recording Industry Association of America (RIAA). Streaming accounted for 98% of this. And this year, Karol's G's Mañana Será Bonito album was the fourth most streamed globally on Spotify.\n\nThis helped to boost interest in her 2023-24 sell-out, global Mañana Será Bonito Tour. This grossed $307m in ticket sales. And while that figure is dwarfed by the $2bn achieved by Taylor Swift's Eras tour, Karol G's earnings were the highest for a female Latin artist. Carlos Balado, a professor at OBS Business School in Barcelona, analyses the economic impact of music concerts. He says that both Karol G and Taylor Swift have benefited from the increased popularity of going to such a big live event. \"There's a growing trend where the public considers that part of their normal spending has to go towards concerts,\" he adds. Leila Cobo, chief content officer for Latin/Español at US music magazine Billboard, which is also known for its music charts, says Karol G has helped to put Colombian music on the map. \"I think music is the biggest ambassador for Colombia. I really do,\" she says. \"And Karol G has tapped into this female Latin female fanbase who really didn't have someone like her. They wanted someone relatable, fun, sexy, had cool songs, but wasn't completely over the top. \"And reggaeton is super danceable, it's super consumable, it's super youth oriented,\" adds Ms Cobo, who is the author of a book on Latin music.\n\nDespite winning numerous awards and critical acclaim, Karol G has not been immune to criticism. Her lyrics have been slammed for being too raunchy, and critics have also taken aim at her for calling one of her songs \"Bichota\". This is a slang term meaning big shot or boss, and often associated with drugs and criminality. She argues that she repurposed the word to signify empowerment. As for her lyrics, her defenders say that rather than singing about and objectifying women, she sings on behalf of them. Karol G's estimated net worth had skyrocketed to $25m by 2023 according to Celebrity Net Worth - a figure that's likely increased substantially since her recent tour. Outside of music she earns money by collaborations with shoemaker Crocs, sportswear brand Kappa, Smirnoff vodka, and Spanish fashion label Loewe. Her name has also appeared on the front of FC Barcelona shirts as part of the football club's partnership with music streamer Spotify. Ms Cobo says: \"She's branching out. She's a very bright, inquisitive person and always looking to grow. And she's very aware that it's not just about music.\"\n\nGetty Images FC Barcelona had Karol G's name on the front of their shirts earlier this year",
    "clean_body": "meet karol g colombias taylor swift 12 december 2024 share save catherine ellis business reporter reporting from bogotá colombia share save getty images karol g had four sold out shows at madrids bernabéu stadium this summer we have all heard of taylor swift but what about colombian singer karol g while swift has dominated the headlines and concert ticket sales over recent years it is actually the 33yearold latin american pop star whose videos are the most watched online thats according to vevo which is the main provider of official music videos to youtube karol gs were the most streamed around the world for each of the past four years 2021 to 2024 this year karol gs vevo videos were watched 35 billion times with fellow colombian shakira in second place on 196 billion and swift on 195 billion so who is karol g and what has fuelled the success that also saw her sell out madrids bernabéu stadium over four nights back in july plus stadiums across the us last year born in the colombian city of medellín in 1991 her full name is carolina giraldo navarro she wanted to be a singer from an early age and when she was 14 she appeared on the colombian version of the talent show x factor in 2005 success did not immediately follow and instead by 2014 she had moved to the us to live with her aunt in new york city to learn english and do menial work she almost gave up pursuing a career in music at this time but her father convinced her that she could make it while in the us karol g also attended a music business conference in boston which she says was very helpful in helping her understand how the industry worked she got her breakthrough hit single in 2017 the song ahora me llama which was a collaboration with puerto rican male artist bad bunny her first album unstoppable then followed since then the hits have just kept on coming and her 2023 album mañana será bonito was the first entirely spanishlanguage release by a female artist to top the us album chart smirnoff karol g has a number of endorsement deals karol gs style of music is more often described as reggaeton this combines hiphop with latin american and jamaican music with the singing and rapping usually done in spanish while she is widely reported to be both hardworking and ambitious rocío guerrero head of latin music at amazon music says that the singer – and latin music in general have been greatly helped by the rise of streaming both the music and the accompanying videos streaming democratised the landscape says ms guerrero explaining that it has allowed latin music which wasnt being played on mainstream radio stations to travel the world radio stations were local but with streaming we brought together all of those audiences around the globe it has given more opportunity to more latin songs and artist to be exposed karol g is a perfect example of this evolution today on amazon music more than a third of latin music is now consumed outside latin america and in the last three years alone the listenership for karol g has grown by more than 250 meanwhile in the us latin music is now the fastestgrowing genre hitting a record 14bn £11bn in venues last year according to the recording industry association of america riaa streaming accounted for 98 of this and this year karols gs mañana será bonito album was the fourth most streamed globally on spotify this helped to boost interest in her 202324 sellout global mañana será bonito tour this grossed 307m in ticket sales and while that figure is dwarfed by the 2bn achieved by taylor swifts eras tour karol gs earnings were the highest for a female latin artist carlos balado a professor at obs business school in barcelona analyses the economic impact of music concerts he says that both karol g and taylor swift have benefited from the increased popularity of going to such a big live event theres a growing trend where the public considers that part of their normal spending has to go towards concerts he adds leila cobo chief content officer for latinespañol at us music magazine billboard which is also known for its music charts says karol g has helped to put colombian music on the map i think music is the biggest ambassador for colombia i really do she says and karol g has tapped into this female latin female fanbase who really didnt have someone like her they wanted someone relatable fun sexy had cool songs but wasnt completely over the top and reggaeton is super danceable its super consumable its super youth oriented adds ms cobo who is the author of a book on latin music despite winning numerous awards and critical acclaim karol g has not been immune to criticism her lyrics have been slammed for being too raunchy and critics have also taken aim at her for calling one of her songs bichota this is a slang term meaning big shot or boss and often associated with drugs and criminality she argues that she repurposed the word to signify empowerment as for her lyrics her defenders say that rather than singing about and objectifying women she sings on behalf of them karol gs estimated net worth had skyrocketed to 25m by 2023 according to celebrity net worth a figure thats likely increased substantially since her recent tour outside of music she earns money by collaborations with shoemaker crocs sportswear brand kappa smirnoff vodka and spanish fashion label loewe her name has also appeared on the front of fc barcelona shirts as part of the football clubs partnership with music streamer spotify ms cobo says shes branching out shes a very bright inquisitive person and always looking to grow and shes very aware that its not just about music getty images fc barcelona had karol gs name on the front of their shirts earlier this year",
    "summary": "Meet Karol G, Colombia's Taylor Swift12 December 2024 Share Save Catherine Ellis Business reporter Reporting from Bogotá, Colombia Share SaveGetty Images Karol G had four sold out shows at Madrid's Bernabéu Stadium this summerWe have all heard of Taylor Swift, but what about Colombian singer Karol G?\nKarol G's were the most streamed around the world for each of the past four years, 2021 to 2024.\nHe says that both Karol G and Taylor Swift have benefited from the increased popularity of going to such a big live event.\nDespite winning numerous awards and critical acclaim, Karol G has not been immune to criticism.\nGetty Images FC Barcelona had Karol G's name on the front of their shirts earlier this year",
    "keywords": [
      "meet",
      "streaming",
      "music",
      "latin",
      "karol",
      "swift",
      "gs",
      "colombian",
      "taylor",
      "colombias",
      "videos",
      "g"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/0ef3/live/13080530-b789-11ef-a2c8-251ed25f1a18.jpg"
  },
  "https://www.bbc.com/news/articles/clynzk8n717o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/clynzk8n717o",
    "date": "2024-12-24",
    "time": "00:00:00",
    "title": "Magdeburg attack offers AfD fertile ground despite suspect's backing for party",
    "body": "Magdeburg attack offers far right fertile ground despite suspect's backing for AfD\n\n24 December 2024 Share Save Bethany Bell BBC News in Magdeburg Share Save\n\nGetty Images Stallholders have been allowed back into the Christmas market after the attack\n\n\"I feel bad, I still do,\" said Eidwicht, as she stood in the Christmas market close to the spot where the car sped through on Friday, killing five people and injuring more than two hundred others. \"My granddaughter was here. I rang her because my daughter told me that something had happened here. And she didn't answer for two hours.\" There is deep sadness here - and anger directed at the government and migrants. \"It can't go on like this,\" said Eidwicht. A Saudi refugee aged 50 has been arrested for the attack but the motive is unknown. Officials say Taleb Al-Abdulmohsen, was an \"untypical\" attacker. Germany's Christmas markets and festivals have come under attack before, mainly from extreme Islamists. He has been described as critical of Islam and he also voiced support on social media for the far-right Alternative for Germany party, hailing the party for fighting the same enemy as him \"to protect Germany\".\n\nThe AfD has not commented on those posts. The party held a rally in Magdeburg later on Monday where co-leader Alice Weidel called for change \"so we can finally live once again in security\". The crowd responded with calls of \"deport them\" according to news agencies. Her party is currently riding high in the opinion polls ahead of federal elections on 23 February, especially in states like Saxony-Anhalt in the former East Germany. This attack has brought two big elections issues to the fore, security and immigration, and AfD figures have highlighted both since the attack. Despite the suspect's many statements expressing hostility to Islam, the head of the AfD in Sachsen-Anhalt, Martin Reichardt, said in a statement \"the attack in Magdeburg shows that Germany is being drawn into political and religious fanaticism that has its origins in another world\". In a post on X, Weidel said the government's discussion of new security laws following the attack \"must not distract from the fact that Magdeburg would not have been possible without uncontrolled immigration. The state must protect its citizens through a restrictive migration policy and consistent deportations!\"\n\nReuters AfD leader Alice Weidel said the attack would not have been possible without \"uncontrolled migration\"\n\nA counter-demonstration also took place, with anti-racism groups accusing the AfD of exploiting the attack. David Begrich from Miteinander e.V. said people in the city needed a chance to catch their breath. \"In the migrant communities, there is great concern about being made into a scapegoat,\" he said. \"We don't want that. We want to organise solidarity across society, but at the same time we are also sensitive to the voices of those who are now reacting with fear and uncertainty.\" German President Frank-Walter Steinmeier made a plea for national unity, saying \"a dark shadow hangs over this Christmas\". \"Hatred and violence must not have the final word. Let's not allow ourselves to be driven apart. Let's stand together!\" he said. Germans are asking how the attack could have happened, when security was already heightened at Christmas markets and when authorities had clearly investigated the suspect several times in recent years. The threat he posed was considered \"too unspecific\", according to one assessment, while one tip-off against him in September 2023 appears to have fallen through the cracks.",
    "clean_body": "magdeburg attack offers far right fertile ground despite suspects backing for afd 24 december 2024 share save bethany bell bbc news in magdeburg share save getty images stallholders have been allowed back into the christmas market after the attack i feel bad i still do said eidwicht as she stood in the christmas market close to the spot where the car sped through on friday killing five people and injuring more than two hundred others my granddaughter was here i rang her because my daughter told me that something had happened here and she didnt answer for two hours there is deep sadness here and anger directed at the government and migrants it cant go on like this said eidwicht a saudi refugee aged 50 has been arrested for the attack but the motive is unknown officials say taleb alabdulmohsen was an untypical attacker germanys christmas markets and festivals have come under attack before mainly from extreme islamists he has been described as critical of islam and he also voiced support on social media for the farright alternative for germany party hailing the party for fighting the same enemy as him to protect germany the afd has not commented on those posts the party held a rally in magdeburg later on monday where coleader alice weidel called for change so we can finally live once again in security the crowd responded with calls of deport them according to news agencies her party is currently riding high in the opinion polls ahead of federal elections on 23 february especially in states like saxonyanhalt in the former east germany this attack has brought two big elections issues to the fore security and immigration and afd figures have highlighted both since the attack despite the suspects many statements expressing hostility to islam the head of the afd in sachsenanhalt martin reichardt said in a statement the attack in magdeburg shows that germany is being drawn into political and religious fanaticism that has its origins in another world in a post on x weidel said the governments discussion of new security laws following the attack must not distract from the fact that magdeburg would not have been possible without uncontrolled immigration the state must protect its citizens through a restrictive migration policy and consistent deportations reuters afd leader alice weidel said the attack would not have been possible without uncontrolled migration a counterdemonstration also took place with antiracism groups accusing the afd of exploiting the attack david begrich from miteinander ev said people in the city needed a chance to catch their breath in the migrant communities there is great concern about being made into a scapegoat he said we dont want that we want to organise solidarity across society but at the same time we are also sensitive to the voices of those who are now reacting with fear and uncertainty german president frankwalter steinmeier made a plea for national unity saying a dark shadow hangs over this christmas hatred and violence must not have the final word lets not allow ourselves to be driven apart lets stand together he said germans are asking how the attack could have happened when security was already heightened at christmas markets and when authorities had clearly investigated the suspect several times in recent years the threat he posed was considered too unspecific according to one assessment while one tipoff against him in september 2023 appears to have fallen through the cracks",
    "summary": "A Saudi refugee aged 50 has been arrested for the attack but the motive is unknown.\nHe has been described as critical of Islam and he also voiced support on social media for the far-right Alternative for Germany party, hailing the party for fighting the same enemy as him \"to protect Germany\".\nThe party held a rally in Magdeburg later on Monday where co-leader Alice Weidel called for change \"so we can finally live once again in security\".\nThis attack has brought two big elections issues to the fore, security and immigration, and AfD figures have highlighted both since the attack.\nReuters AfD leader Alice Weidel said the attack would not have been possible without \"uncontrolled migration\"A counter-demonstration also took place, with anti-racism groups accusing the AfD of exploiting the attack.",
    "keywords": [
      "magdeburg",
      "fertile",
      "weidel",
      "ground",
      "attack",
      "offers",
      "party",
      "afd",
      "germany",
      "uncontrolled",
      "security",
      "christmas",
      "despite",
      "suspects",
      "backing"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/7aa0/live/b2e98600-c139-11ef-a8c2-37ad53d91ed7.jpg"
  },
  "https://www.bbc.com/news/articles/cy4pvgjklevo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cy4pvgjklevo",
    "date": "2024-12-12",
    "time": "00:00:00",
    "title": "Australia to force tech giants to keep paying for news",
    "body": "Australia to force tech giants to keep paying for news\n\nThe new rules will target platforms like Facebook, TikTok and Instagram\n\nThe new rules, announced on Thursday, will require firms that earn more than A$250m ($160m; £125m) in annual revenue to enter into commercial deals with media organisations, or risk being hit with higher taxes.\n\nEarlier this year Meta - which owns Facebook and Instagram - announced it would not renew payment deals it had in place with Australian news organisations, setting up a standoff with lawmakers.\n\nThe long-awaited decision sets out a successor to a world-first law that Australia passed in 2021, which was designed to make giants like Meta and Google pay for hosting news on their platforms.\n\nAustralia's government says it will create new rules to force big tech companies to pay local publishers for news.\n\nThe design of the scheme is yet to be finalised but it will apply to sites such as Facebook, Google and TikTok.\n\nIn a statement, Meta said it was concerned that the government was \"charging one industry to subsidise another\".\n\nUnlike the previous model, the new framework - called the News Bargaining Incentive - will require tech firms to pay even if they do not enter deals with publishers.\n\n\"Digital platforms receive huge financial benefits from Australia and they have a social and economic responsibility to contribute to Australians' access to quality journalism,\" Assistant Treasurer Stephen Jones said on Thursday.\n\nThe previous News Media Bargaining Code saw news organisations negotiate commercial deals with tech giants, while also committing firms like Facebook and Google to invest millions of dollars in local digital content.\n\nThat code aimed to address what the government called a power imbalance between publishers and tech companies, while offsetting some of the losses traditional media outlets have faced due to the rise of digital platforms.\n\nAs deals brokered under that arrangement neared expiry, Meta said that it would not be renewing them, leading to a roughly A$200m loss in revenue for Australian publishers.\n\nInstead, Meta said it would phase out its dedicated news tab - which spotlights articles - on Facebook in Australia, and reinvest the money elsewhere.\n\n\"We know that people don't come to Facebook for news and political content… news makes up less than 3% of what people around the world see in their Facebook feed,\" it said in a statement in February.\n\nThe announcement prompted a strong response from Prime Minister Anthony Albanese's government, which described the move as \"a fundamental dereliction\" of Meta's \"responsibility to its Australian users\".\n\n\"The risk is that misinformation will fill any vacuum created by news no longer being on the platform,\" Communications Minister Michelle Rowland said at the time.\n\nThe new taxation model begins in January 2025 and will be cemented into law once parliament returns in February.\n\nThe government says it will be designed to make tech companies fund Australian journalism in exchange for tax offsets, not to raise revenue.",
    "clean_body": "australia to force tech giants to keep paying for news the new rules will target platforms like facebook tiktok and instagram the new rules announced on thursday will require firms that earn more than a250m 160m £125m in annual revenue to enter into commercial deals with media organisations or risk being hit with higher taxes earlier this year meta which owns facebook and instagram announced it would not renew payment deals it had in place with australian news organisations setting up a standoff with lawmakers the longawaited decision sets out a successor to a worldfirst law that australia passed in 2021 which was designed to make giants like meta and google pay for hosting news on their platforms australias government says it will create new rules to force big tech companies to pay local publishers for news the design of the scheme is yet to be finalised but it will apply to sites such as facebook google and tiktok in a statement meta said it was concerned that the government was charging one industry to subsidise another unlike the previous model the new framework called the news bargaining incentive will require tech firms to pay even if they do not enter deals with publishers digital platforms receive huge financial benefits from australia and they have a social and economic responsibility to contribute to australians access to quality journalism assistant treasurer stephen jones said on thursday the previous news media bargaining code saw news organisations negotiate commercial deals with tech giants while also committing firms like facebook and google to invest millions of dollars in local digital content that code aimed to address what the government called a power imbalance between publishers and tech companies while offsetting some of the losses traditional media outlets have faced due to the rise of digital platforms as deals brokered under that arrangement neared expiry meta said that it would not be renewing them leading to a roughly a200m loss in revenue for australian publishers instead meta said it would phase out its dedicated news tab which spotlights articles on facebook in australia and reinvest the money elsewhere we know that people dont come to facebook for news and political content… news makes up less than 3 of what people around the world see in their facebook feed it said in a statement in february the announcement prompted a strong response from prime minister anthony albaneses government which described the move as a fundamental dereliction of metas responsibility to its australian users the risk is that misinformation will fill any vacuum created by news no longer being on the platform communications minister michelle rowland said at the time the new taxation model begins in january 2025 and will be cemented into law once parliament returns in february the government says it will be designed to make tech companies fund australian journalism in exchange for tax offsets not to raise revenue",
    "summary": "The long-awaited decision sets out a successor to a world-first law that Australia passed in 2021, which was designed to make giants like Meta and Google pay for hosting news on their platforms.\nAustralia's government says it will create new rules to force big tech companies to pay local publishers for news.\nThe previous News Media Bargaining Code saw news organisations negotiate commercial deals with tech giants, while also committing firms like Facebook and Google to invest millions of dollars in local digital content.\nInstead, Meta said it would phase out its dedicated news tab - which spotlights articles - on Facebook in Australia, and reinvest the money elsewhere.\nThe government says it will be designed to make tech companies fund Australian journalism in exchange for tax offsets, not to raise revenue.",
    "keywords": [
      "force",
      "pay",
      "giants",
      "revenue",
      "australia",
      "facebook",
      "organisations",
      "paying",
      "tech",
      "deals",
      "australian",
      "rules",
      "meta"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/1848/live/e0cc98a0-b81a-11ef-a101-b70acd036db9.jpg"
  },
  "https://www.bbc.com/news/articles/c62785697v0o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c62785697v0o",
    "date": "2024-12-19",
    "time": "00:00:00",
    "title": "What we know about the mysterious drones buzzing over New Jersey",
    "body": "What we know about mysterious drones over New Jersey and other states\n\n19 December 2024 Share Save Bernd Debusmann Jr BBC News, Washington Share Save\n\nGetty Images Dozens of people have reported seeing drones over New Jersey since 18 November\n\nUS aviation authorities have announced a temporary ban on the use of drones in nearly two dozen cities of New Jersey until mid January. But mystery continues to swirl after nearly a month of drone sightings over New Jersey and other US states, alarming some residents. Authorities have been unable to provide definitive answers about these sightings, saying only that the flying objects are not believed to pose a danger to the public or national security. On Sunday, Homeland Security Secretary Alejandro Mayorkas confirmed the sightings included drones, as well as manned aircraft commonly mistaken for drones. He added that he knows of \"no foreign involvement\" to do with the unmanned aerial vehicles. Some lawmakers have criticised the government's handling of the drone reports and the lack of public information. The drone reports have prompted a wide-range of baseless conspiracy theories, including that they are searching for nuclear weapons, radioactive \"dirty bombs\" or are form part of an impending invasion by aliens. Here's what we know.\n\nWhere have drones been spotted?\n\nDozens of drone sightings have been reported over New Jersey since 18 November, but others have been reported around the US north-east. Some of the flights were spotted near Picatinny Arsenal - a sensitive military research facility - as well as near President-elect Donald Trump's golf course in the town of Bedminster, New Jersey. The Federal Aviation Administration (FAA) has since issued temporary restrictions prohibiting drone flights over 22 cities including Bedminster and Picatinny until 17 January. Sightings have also been reported in several other states: In New York City , several drones were reported flying over the Bronx on 12 December\n\n, several drones were reported flying over the Bronx on 12 December Stewart Airfield in New York state had to shut down for about an hour on 13 December because of drone activity, Governor Kathy Hochul said\n\nstate had to shut down for about an hour on 13 December because of drone activity, Governor Kathy Hochul said In Connecticut , police confirmed \"suspicious drone activity\". A drone detection system is now in use near the towns of Groton and New London\n\n, police confirmed \"suspicious drone activity\". A drone detection system is now in use near the towns of Groton and New London In Maryland , former Republican Governor Larry Hogan said he saw what appeared to be \"dozens\" of drones over his home in Davidsonville\n\n, former Republican Governor Larry Hogan said he saw what appeared to be \"dozens\" of drones over his home in Davidsonville In Massachusetts , two men were arrested on 14 December after a \"hazardous drone operation\" near Logan International Airport's airspace in Boston, police said\n\n, two men were arrested on 14 December after a \"hazardous drone operation\" near Logan International Airport's airspace in Boston, police said Multiple sightings have been reported in eastern Pennsylvania, including over Philadelphia\n\nincluding over Philadelphia In October, the Wall Street Journal reported that mysterious drones were seen for 17 days near US military facilities in Virginia\n\nIn Ohio, a US Air Force base was briefly closed on 13 December after small drones were detected flying nearby. More drones were reported on 16 and 17 December, although the airbase's operations were not impacted In late November, drones were also spotted over three US airbases in the UK, with British defence sources telling the BBC suspicion had fallen on a \"state actor\". Drones were also reported near the Ramstein US military airbase in Germany in early December. Are mystery drones above US bases in England something sinister?\n\nWhat have investigators said about the drones?\n\nUS President Joe Biden has said that there is \"nothing nefarious\" about the drone sightings, and \"no sense of danger\". In an earlier call with reporters, officials from several US agencies said there was no evidence of any threat to public safety. \"I think there has been a slight overreaction,\" an official from the FBI said. The homeland security secretary told ABC News on Sunday he knows of \"no foreign involvement with respect to the sightings in the north-east\". \"And we are vigilant in investigating this matter,\" he said. Mayorkas added: \"If there is any reason for concern, if we identify any foreign involvement or criminal activity, we will communicate with the American public accordingly.\" Following a closed-door briefing on 17 December, Connecticut representative Jim Himes said that senior defence and law enforcement officials had told lawmakers that \"there is zero evidence of laws being broken\" by the drones. He added that the \"vast majority\" of sightings were normal aircraft or drones being operated lawfully. Himes said that \"millions\" of unregistered drones were operating across the US, in addition to 800,000 registered drones that weigh more than half a pound.\n\nWhat are these flying objects?\n\nFollowing a briefing with the Department of Homeland Security on 11 December, New Jersey assemblywoman Dawn Fantasia said the drones appeared to avoid detection by traditional methods such as helicopter and radio. Fantasia said the aircraft were up to 6ft (1.8m) in diameter, travelling with lights turned off and \"operate in a co-ordinated manner\". Secretary Mayorkas told ABC that an explanation for the uptick in drone sightings could be to do with a change in federal law last year that allowed drones to be flown at night. \"That may be one of the reasons why now people are seeing more drones than they did before, especially from dawn to dusk,\" he said. A joint statement released by the Department of Homeland Security, FBI, FAA and defence department on 16 December said the sightings are a \"combination of lawful commercial drones, hobbyist drones, and law enforcement drones, as well as manned fixed-wing aircraft, helicopters, and stars mistakenly reported as drones.\" \"We have not identified anything anomalous,\" the statement said, adding that the government still recognises \"the concern among many communities.\" President-elect Donald Trump, for his part, claimed that the \"government knows what is happening\". \"For some reason, they don't want to comment,\" he added. \"I think they'd be better off saying what it is our military knows and our president knows.\" While he declined to answer whether he had been briefed on the sightings, Trump said that he \"can't imagine it's the enemy.\"\n\nWhere are they coming from?\n\nIt is unclear who might be operating them. New Jersey Republican representative Jeff Van Drew said that the drones were coming from an Iranian \"mothership\" in the Atlantic, while Illinois Democrat Raja Krishnamoorthi said there was a \"non-trivial\" chance that China could be involved. The Pentagon, White House and homeland security department have all insisted that there is no foreign origin for the objects. A northern California man was charged on with flying a drone over and taking pictures of Vandenberg Space Force Base, located near Santa Barbara, on 30 November. The man, 39-year-old Chinese national Yinpiao Zhou was arrested just before he boarded a flight to China. But there has been no suggestion this incident has any connection with the spate of drone reports on the other side of the country.\n\nGetty Images The Pentagon says there is no foreign origin for the objects\n\nCan the drones be stopped?",
    "clean_body": "what we know about mysterious drones over new jersey and other states 19 december 2024 share save bernd debusmann jr bbc news washington share save getty images dozens of people have reported seeing drones over new jersey since 18 november us aviation authorities have announced a temporary ban on the use of drones in nearly two dozen cities of new jersey until mid january but mystery continues to swirl after nearly a month of drone sightings over new jersey and other us states alarming some residents authorities have been unable to provide definitive answers about these sightings saying only that the flying objects are not believed to pose a danger to the public or national security on sunday homeland security secretary alejandro mayorkas confirmed the sightings included drones as well as manned aircraft commonly mistaken for drones he added that he knows of no foreign involvement to do with the unmanned aerial vehicles some lawmakers have criticised the governments handling of the drone reports and the lack of public information the drone reports have prompted a widerange of baseless conspiracy theories including that they are searching for nuclear weapons radioactive dirty bombs or are form part of an impending invasion by aliens heres what we know where have drones been spotted dozens of drone sightings have been reported over new jersey since 18 november but others have been reported around the us northeast some of the flights were spotted near picatinny arsenal a sensitive military research facility as well as near presidentelect donald trumps golf course in the town of bedminster new jersey the federal aviation administration faa has since issued temporary restrictions prohibiting drone flights over 22 cities including bedminster and picatinny until 17 january sightings have also been reported in several other states in new york city several drones were reported flying over the bronx on 12 december several drones were reported flying over the bronx on 12 december stewart airfield in new york state had to shut down for about an hour on 13 december because of drone activity governor kathy hochul said state had to shut down for about an hour on 13 december because of drone activity governor kathy hochul said in connecticut police confirmed suspicious drone activity a drone detection system is now in use near the towns of groton and new london police confirmed suspicious drone activity a drone detection system is now in use near the towns of groton and new london in maryland former republican governor larry hogan said he saw what appeared to be dozens of drones over his home in davidsonville former republican governor larry hogan said he saw what appeared to be dozens of drones over his home in davidsonville in massachusetts two men were arrested on 14 december after a hazardous drone operation near logan international airports airspace in boston police said two men were arrested on 14 december after a hazardous drone operation near logan international airports airspace in boston police said multiple sightings have been reported in eastern pennsylvania including over philadelphia including over philadelphia in october the wall street journal reported that mysterious drones were seen for 17 days near us military facilities in virginia in ohio a us air force base was briefly closed on 13 december after small drones were detected flying nearby more drones were reported on 16 and 17 december although the airbases operations were not impacted in late november drones were also spotted over three us airbases in the uk with british defence sources telling the bbc suspicion had fallen on a state actor drones were also reported near the ramstein us military airbase in germany in early december are mystery drones above us bases in england something sinister what have investigators said about the drones us president joe biden has said that there is nothing nefarious about the drone sightings and no sense of danger in an earlier call with reporters officials from several us agencies said there was no evidence of any threat to public safety i think there has been a slight overreaction an official from the fbi said the homeland security secretary told abc news on sunday he knows of no foreign involvement with respect to the sightings in the northeast and we are vigilant in investigating this matter he said mayorkas added if there is any reason for concern if we identify any foreign involvement or criminal activity we will communicate with the american public accordingly following a closeddoor briefing on 17 december connecticut representative jim himes said that senior defence and law enforcement officials had told lawmakers that there is zero evidence of laws being broken by the drones he added that the vast majority of sightings were normal aircraft or drones being operated lawfully himes said that millions of unregistered drones were operating across the us in addition to 800000 registered drones that weigh more than half a pound what are these flying objects following a briefing with the department of homeland security on 11 december new jersey assemblywoman dawn fantasia said the drones appeared to avoid detection by traditional methods such as helicopter and radio fantasia said the aircraft were up to 6ft 18m in diameter travelling with lights turned off and operate in a coordinated manner secretary mayorkas told abc that an explanation for the uptick in drone sightings could be to do with a change in federal law last year that allowed drones to be flown at night that may be one of the reasons why now people are seeing more drones than they did before especially from dawn to dusk he said a joint statement released by the department of homeland security fbi faa and defence department on 16 december said the sightings are a combination of lawful commercial drones hobbyist drones and law enforcement drones as well as manned fixedwing aircraft helicopters and stars mistakenly reported as drones we have not identified anything anomalous the statement said adding that the government still recognises the concern among many communities presidentelect donald trump for his part claimed that the government knows what is happening for some reason they dont want to comment he added i think theyd be better off saying what it is our military knows and our president knows while he declined to answer whether he had been briefed on the sightings trump said that he cant imagine its the enemy where are they coming from it is unclear who might be operating them new jersey republican representative jeff van drew said that the drones were coming from an iranian mothership in the atlantic while illinois democrat raja krishnamoorthi said there was a nontrivial chance that china could be involved the pentagon white house and homeland security department have all insisted that there is no foreign origin for the objects a northern california man was charged on with flying a drone over and taking pictures of vandenberg space force base located near santa barbara on 30 november the man 39yearold chinese national yinpiao zhou was arrested just before he boarded a flight to china but there has been no suggestion this incident has any connection with the spate of drone reports on the other side of the country getty images the pentagon says there is no foreign origin for the objects can the drones be stopped",
    "summary": "But mystery continues to swirl after nearly a month of drone sightings over New Jersey and other US states, alarming some residents.\nOn Sunday, Homeland Security Secretary Alejandro Mayorkas confirmed the sightings included drones, as well as manned aircraft commonly mistaken for drones.\nDozens of drone sightings have been reported over New Jersey since 18 November, but others have been reported around the US north-east.\nUS President Joe Biden has said that there is \"nothing nefarious\" about the drone sightings, and \"no sense of danger\".\nThe Pentagon, White House and homeland security department have all insisted that there is no foreign origin for the objects.",
    "keywords": [
      "drones",
      "buzzing",
      "know",
      "homeland",
      "flying",
      "drone",
      "near",
      "jersey",
      "knows",
      "security",
      "reported",
      "sightings",
      "mysterious"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/cce7/live/b3947500-b983-11ef-a0f2-fd81ae5962f4.jpg"
  },
  "https://www.bbc.com/news/articles/c98l95d1773o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c98l95d1773o",
    "date": "2024-12-22",
    "time": "00:00:00",
    "title": "Saudis say warnings about market attack suspect were ignored",
    "body": "Saudi warnings about market attack suspect were ignored\n\nPeople have been leaving floral tributes for the victims of Friday's attack on the Christmas market in Magdeburg, Germany\n\nIt sent four so-called \"Notes Verbal\", three of them to Germany's intelligence agencies and one to the foreign ministry in Berlin. There was, the Saudis say, no response.\n\nInside the imposing sand coloured and fortress-like walls of the Saudi Ministry of Foreign Affairs in Riyadh there is a perhaps justifiable sense of pique.\n\nThe Saudi authorities, I am told, are currently working flat out to collate everything they have on the Magdeburg market suspect, Taleb al-Abdulmohsen, and to share it with Germany's ongoing investigation \"in every way possible\".\n\nPart of the explanation for this may lie in the fact that Taleb al-Abdulmohsen was granted asylum by Germany in 2016, one year after the former Chancellor Angela Merkel threw open her country's borders to let in more than a million migrants from the Middle East, and 10 years after al-Abdulmohsen had taken up residence in Germany.\n\nComing from a country where Islam is the only religion permitted to be practised in public, al-Abdulmohsen was a very unusual citizen.\n\nHe had turned his back on Islam, making himself a heretic in the eyes of many.\n\nBorn in the Saudi date palm oasis town of Hofuf in 1974, little is known about his early life before he decided to leave Saudi Arabia and move to Europe aged 32.\n\nActive on social media, on his Twitter (later X) account he labels himself as both a psychiatrist and founder of a Saudi rights movement, together with the tag @SaudiExMuslims.\n\nHe founded a website aimed at helping Saudi women flee their country to Europe.\n\nThe Saudis say he was a people trafficker and the Ministry of Interior's investigators, the Mabaatheth, are said to have an extensive file on him.\n\nThere have been reports in recent years of dissident Saudis coming under hostile surveillance from Saudi government agents, in Canada, the US and in Germany.\n\nThere is no question that the German authorities, both federal and state, have made some serious errors of omission in the case of al-Abdulmohsen.\n\nWhatever their reasons for not responding, as the Saudis claim, to the repeated warnings about his extremism, he was seemingly a danger to his adopted host country.\n\nThere is also, separately, the failure to close off, or at least guard, the emergency access route to Magdeburg Alter Markt that allowed him to allegedly drive his BMW into the crowds.\n\nGerman authorities have defended the market's layout and said an investigation into the suspect's past is ongoing.\n\nBut a complicating factor here is that Saudi Arabia, although considered a friend and ally of the West, has a poor human rights record.\n\nUntil June 2018 Saudi women were forbidden to drive and even those women who publicly called for that ban to be lifted before then have been persecuted and imprisoned.\n\nSaudi Arabia's Crown Prince Mohammed bin Salman, still only in his 30s, just, is immensely popular in his own country.",
    "clean_body": "saudi warnings about market attack suspect were ignored people have been leaving floral tributes for the victims of fridays attack on the christmas market in magdeburg germany it sent four socalled notes verbal three of them to germanys intelligence agencies and one to the foreign ministry in berlin there was the saudis say no response inside the imposing sand coloured and fortresslike walls of the saudi ministry of foreign affairs in riyadh there is a perhaps justifiable sense of pique the saudi authorities i am told are currently working flat out to collate everything they have on the magdeburg market suspect taleb alabdulmohsen and to share it with germanys ongoing investigation in every way possible part of the explanation for this may lie in the fact that taleb alabdulmohsen was granted asylum by germany in 2016 one year after the former chancellor angela merkel threw open her countrys borders to let in more than a million migrants from the middle east and 10 years after alabdulmohsen had taken up residence in germany coming from a country where islam is the only religion permitted to be practised in public alabdulmohsen was a very unusual citizen he had turned his back on islam making himself a heretic in the eyes of many born in the saudi date palm oasis town of hofuf in 1974 little is known about his early life before he decided to leave saudi arabia and move to europe aged 32 active on social media on his twitter later x account he labels himself as both a psychiatrist and founder of a saudi rights movement together with the tag saudiexmuslims he founded a website aimed at helping saudi women flee their country to europe the saudis say he was a people trafficker and the ministry of interiors investigators the mabaatheth are said to have an extensive file on him there have been reports in recent years of dissident saudis coming under hostile surveillance from saudi government agents in canada the us and in germany there is no question that the german authorities both federal and state have made some serious errors of omission in the case of alabdulmohsen whatever their reasons for not responding as the saudis claim to the repeated warnings about his extremism he was seemingly a danger to his adopted host country there is also separately the failure to close off or at least guard the emergency access route to magdeburg alter markt that allowed him to allegedly drive his bmw into the crowds german authorities have defended the markets layout and said an investigation into the suspects past is ongoing but a complicating factor here is that saudi arabia although considered a friend and ally of the west has a poor human rights record until june 2018 saudi women were forbidden to drive and even those women who publicly called for that ban to be lifted before then have been persecuted and imprisoned saudi arabias crown prince mohammed bin salman still only in his 30s just is immensely popular in his own country",
    "summary": "Saudi warnings about market attack suspect were ignoredPeople have been leaving floral tributes for the victims of Friday's attack on the Christmas market in Magdeburg, GermanyIt sent four so-called \"Notes Verbal\", three of them to Germany's intelligence agencies and one to the foreign ministry in Berlin.\nInside the imposing sand coloured and fortress-like walls of the Saudi Ministry of Foreign Affairs in Riyadh there is a perhaps justifiable sense of pique.\nThe Saudi authorities, I am told, are currently working flat out to collate everything they have on the Magdeburg market suspect, Taleb al-Abdulmohsen, and to share it with Germany's ongoing investigation \"in every way possible\".\nHe founded a website aimed at helping Saudi women flee their country to Europe.\nUntil June 2018 Saudi women were forbidden to drive and even those women who publicly called for that ban to be lifted before then have been persecuted and imprisoned.",
    "keywords": [
      "authorities",
      "magdeburg",
      "women",
      "ignored",
      "say",
      "alabdulmohsen",
      "ministry",
      "attack",
      "saudi",
      "country",
      "suspect",
      "saudis",
      "market",
      "warnings"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3f7b/live/4e526520-c064-11ef-aff0-072ce821b6ab.jpg"
  },
  "https://www.bbc.com/news/articles/cewxd54z98qo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cewxd54z98qo",
    "date": "2024-12-14",
    "time": "00:00:00",
    "title": "Paula Abdul settles lawsuit alleging sexual abuse by Nigel Lythgoe",
    "body": "Paula Abdul settles lawsuit alleging sexual abuse by Nigel Lythgoe\n\nNigel Lythgoe and Paula Abdul seen at the 2013 Emmys\n\nMr Lythgoe, 75, said in a statement that he was glad \"to put this behind me\". The British TV producer has previously denied the allegations, describing them as \"an appalling smear\".\n\nIn a statement to the BBC, Ms Abdul said she was relieved for the legal battle to be over.\n\nIn the legal action filed one year ago, Ms Abdul, 62, accused Mr Lythgoe of twice sexually assaulting her, the first time allegedly when they worked together on the talent show American Idol.\n\nPaula Abdul, the Grammy and Emmy award-winning singer and dancer, has settled her sexual assault lawsuit against British television producer Nigel Lythgoe.\n\nMs Abdul said on Friday: \"I am grateful that this chapter has successfully come to a close and is now something I can now put behind me.\n\n\"This has been a long and hard-fought personal battle.\n\n\"I hope my experience can serve to inspire other women, facing similar struggles, to overcome their own challenges with dignity and respect, so that they too can turn the page and begin a new chapter of their lives.\"\n\nHer attorney, Melissa Eubanks, did not disclose the terms of the settlement.\n\nIn his own statement, Mr Lythgoe said: \"We live in a troubling time where a person is now automatically assumed to be guilty until proven innocent, a process that can take years.\n\n\"That is why, like Paula, I am glad to be able to put this behind me. I know the truth and that gives me great comfort.\"\n\nIn her 16-page lawsuit, Ms Abdul claimed Mr Lythgoe had sexually assaulted her twice during their time working together.\n\nShe said the first alleged incident occurred during their tenure at long-running hit TV programme American Idol, which she starred on as a judge for the first eight seasons.\n\nMs Abdul alleged he forcibly kissed her in a hotel lift and grabbed her genitals.\n\nThe second alleged incident took place in 2015 when they were both on So You Think You Can Dance, she said.\n\nThis time, Mr Lythgoe assaulted her on the couch of his Los Angeles home after a work dinner, Ms Abdul claimed.\n\nShe again firmly rejected him and \"immediately left Mr Lythgoe's home\", her court filings said.\n\nIn October 2024, Abdul filed an amended complaint, alleging a third assault by Mr Lythgoe.\n\nIn his court filings rebutting her claims, Mr Lythgoe included text messages between him and Ms Abdul that his lawyers said were friendly and jovial, and therefore inconsistent with her accusation.\n\n\"It is unthinkable that Abdul would even tolerate Lythgoe's physical proximity, let alone send him adoring messages and sexually provocative jokes, if her allegations were true,\" Mr Lythgoe's filing stated.\n\nMs Abdul's legal team dismissed Mr Lythgoe's defence as \"classic victim shaming\".\n\nHer team argued that Mr Lythgoe's position of power as a producer over Ms Abdul played a significant role.\n\nAccording to court documents, they settled the case earlier this week and filed notice with LA County Superior Court.\n\nTheir next step will be filing to dismiss the matter, which had been scheduled to go to trial next year.",
    "clean_body": "paula abdul settles lawsuit alleging sexual abuse by nigel lythgoe nigel lythgoe and paula abdul seen at the 2013 emmys mr lythgoe 75 said in a statement that he was glad to put this behind me the british tv producer has previously denied the allegations describing them as an appalling smear in a statement to the bbc ms abdul said she was relieved for the legal battle to be over in the legal action filed one year ago ms abdul 62 accused mr lythgoe of twice sexually assaulting her the first time allegedly when they worked together on the talent show american idol paula abdul the grammy and emmy awardwinning singer and dancer has settled her sexual assault lawsuit against british television producer nigel lythgoe ms abdul said on friday i am grateful that this chapter has successfully come to a close and is now something i can now put behind me this has been a long and hardfought personal battle i hope my experience can serve to inspire other women facing similar struggles to overcome their own challenges with dignity and respect so that they too can turn the page and begin a new chapter of their lives her attorney melissa eubanks did not disclose the terms of the settlement in his own statement mr lythgoe said we live in a troubling time where a person is now automatically assumed to be guilty until proven innocent a process that can take years that is why like paula i am glad to be able to put this behind me i know the truth and that gives me great comfort in her 16page lawsuit ms abdul claimed mr lythgoe had sexually assaulted her twice during their time working together she said the first alleged incident occurred during their tenure at longrunning hit tv programme american idol which she starred on as a judge for the first eight seasons ms abdul alleged he forcibly kissed her in a hotel lift and grabbed her genitals the second alleged incident took place in 2015 when they were both on so you think you can dance she said this time mr lythgoe assaulted her on the couch of his los angeles home after a work dinner ms abdul claimed she again firmly rejected him and immediately left mr lythgoes home her court filings said in october 2024 abdul filed an amended complaint alleging a third assault by mr lythgoe in his court filings rebutting her claims mr lythgoe included text messages between him and ms abdul that his lawyers said were friendly and jovial and therefore inconsistent with her accusation it is unthinkable that abdul would even tolerate lythgoes physical proximity let alone send him adoring messages and sexually provocative jokes if her allegations were true mr lythgoes filing stated ms abduls legal team dismissed mr lythgoes defence as classic victim shaming her team argued that mr lythgoes position of power as a producer over ms abdul played a significant role according to court documents they settled the case earlier this week and filed notice with la county superior court their next step will be filing to dismiss the matter which had been scheduled to go to trial next year",
    "summary": "Paula Abdul settles lawsuit alleging sexual abuse by Nigel LythgoeNigel Lythgoe and Paula Abdul seen at the 2013 EmmysMr Lythgoe, 75, said in a statement that he was glad \"to put this behind me\".\nPaula Abdul, the Grammy and Emmy award-winning singer and dancer, has settled her sexual assault lawsuit against British television producer Nigel Lythgoe.\nIn her 16-page lawsuit, Ms Abdul claimed Mr Lythgoe had sexually assaulted her twice during their time working together.\nThis time, Mr Lythgoe assaulted her on the couch of his Los Angeles home after a work dinner, Ms Abdul claimed.\nHer team argued that Mr Lythgoe's position of power as a producer over Ms Abdul played a significant role.",
    "keywords": [
      "sexually",
      "alleging",
      "producer",
      "sexual",
      "settles",
      "legal",
      "nigel",
      "paula",
      "lawsuit",
      "abdul",
      "lythgoe",
      "abuse",
      "ms",
      "lythgoes",
      "statement",
      "mr"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/46a4/live/01ba0760-b991-11ef-b3bd-2bda52bad97d.jpg"
  },
  "https://www.bbc.com/news/articles/cvgmj87248no": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cvgmj87248no",
    "date": "2024-12-24",
    "time": "00:00:00",
    "title": "Hong Kong offers rewards for arrest of six activists abroad",
    "body": "Hong Kong offers rewards for arrest of six activists abroad\n\n24 December 2024 Share Save Vicky Wong BBC News Share Save\n\nGetty Images Tony Chung, who fled Hong Kong last year and is currently in the UK, is among those being sought by police\n\nHong Kong police have offered rewards of HK$1m (£103,000; $129,000) for information leading to the arrests of six pro-democracy activists living in the UK and Canada. Among them is Tony Chung, the former leader of a pro-independence group who fled to the UK last year. The group - which includes a former district councillor, an actor, and a YouTuber - have been lobbying for more democracy in the territory. All have been accused of violating the city's national security law. UK Foreign Secretary David Lammy criticised the move, calling on Hong Kong authorities to \"end their targeting of individuals in the UK and elsewhere who stand up for freedom and democracy\".\n\n\"We will not tolerate any attempts by foreign governments to coerce, intimidate, harass or harm their critics overseas, especially in the UK,\" he said, adding that the UK government was committed to supporting those from Hong Kong who have relocated to the UK. Also on the wanted list is former district councillor Carmen Lau and activist Chloe Cheung. Both are based in the UK and lobby on behalf of two NGOs calling for more democracy in Hong Kong. Arrest warrants were also issued for political commentator and pollster Chung Kim-wah, who left Hong Kong for the UK in 2022, as well as two people based in Canada: former actor Joseph Tay, who co-founded the NGO HongKonger Station, and Youtuber Victor Ho. Mr Ho has been charged with subversion while the other six have been accused inciting secession and collusion with a foreign country or external forces. According to Hong Kong's public broadcaster RTHK, the arrest warrants were announced by the city's top police chiefs on Tuesday, who accused some of the wanted activists of repeatedly requesting foreign countries to impose sanctions and other measures against China and Hong Kong. Mr Chung was first convicted in 2021 for calling for Hong Kong's secession and was released in June last year. He posted on Instagram on Tuesday that it was \"an honour to become the first Hongkonger to be charged twice under the National Security Law\". Mr Chung said the news came as no surprise to him as he breached a supervision order after his release from prison by fleeing to the UK last year. \"I knew this day would come. From the moment I decided to leave Hong Kong, I was fully aware that I would not be able to return for a long time,\" he wrote. Mr Chung confirmed to the BBC that he was still waiting for his asylum application to be approved by the UK government.\n\nGetty Images Carmen Lau is also based in the UK and has been calling for more democracy in Hong Kong",
    "clean_body": "hong kong offers rewards for arrest of six activists abroad 24 december 2024 share save vicky wong bbc news share save getty images tony chung who fled hong kong last year and is currently in the uk is among those being sought by police hong kong police have offered rewards of hk1m £103000 129000 for information leading to the arrests of six prodemocracy activists living in the uk and canada among them is tony chung the former leader of a proindependence group who fled to the uk last year the group which includes a former district councillor an actor and a youtuber have been lobbying for more democracy in the territory all have been accused of violating the citys national security law uk foreign secretary david lammy criticised the move calling on hong kong authorities to end their targeting of individuals in the uk and elsewhere who stand up for freedom and democracy we will not tolerate any attempts by foreign governments to coerce intimidate harass or harm their critics overseas especially in the uk he said adding that the uk government was committed to supporting those from hong kong who have relocated to the uk also on the wanted list is former district councillor carmen lau and activist chloe cheung both are based in the uk and lobby on behalf of two ngos calling for more democracy in hong kong arrest warrants were also issued for political commentator and pollster chung kimwah who left hong kong for the uk in 2022 as well as two people based in canada former actor joseph tay who cofounded the ngo hongkonger station and youtuber victor ho mr ho has been charged with subversion while the other six have been accused inciting secession and collusion with a foreign country or external forces according to hong kongs public broadcaster rthk the arrest warrants were announced by the citys top police chiefs on tuesday who accused some of the wanted activists of repeatedly requesting foreign countries to impose sanctions and other measures against china and hong kong mr chung was first convicted in 2021 for calling for hong kongs secession and was released in june last year he posted on instagram on tuesday that it was an honour to become the first hongkonger to be charged twice under the national security law mr chung said the news came as no surprise to him as he breached a supervision order after his release from prison by fleeing to the uk last year i knew this day would come from the moment i decided to leave hong kong i was fully aware that i would not be able to return for a long time he wrote mr chung confirmed to the bbc that he was still waiting for his asylum application to be approved by the uk government getty images carmen lau is also based in the uk and has been calling for more democracy in hong kong",
    "summary": "Hong Kong offers rewards for arrest of six activists abroad24 December 2024 Share Save Vicky Wong BBC News Share SaveGetty Images Tony Chung, who fled Hong Kong last year and is currently in the UK, is among those being sought by policeHong Kong police have offered rewards of HK$1m (£103,000; $129,000) for information leading to the arrests of six pro-democracy activists living in the UK and Canada.\nBoth are based in the UK and lobby on behalf of two NGOs calling for more democracy in Hong Kong.\nMr Chung was first convicted in 2021 for calling for Hong Kong's secession and was released in June last year.\nFrom the moment I decided to leave Hong Kong, I was fully aware that I would not be able to return for a long time,\" he wrote.\nGetty Images Carmen Lau is also based in the UK and has been calling for more democracy in Hong Kong",
    "keywords": [
      "uk",
      "foreign",
      "activists",
      "democracy",
      "abroad",
      "calling",
      "hong",
      "kong",
      "based",
      "offers",
      "chung",
      "arrest",
      "rewards",
      "mr"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/e181/live/25aae800-c1df-11ef-a0f2-fd81ae5962f4.jpg"
  },
  "https://www.bbc.com/news/articles/cdeky7dez00o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cdeky7dez00o",
    "date": "2024-12-01",
    "time": "00:00:00",
    "title": "Mafiathon 2: Kai Cenat reclaims Twitch subscriber record",
    "body": "Snoop Dogg helps Kai Cenat reclaim Twitch subscriber record\n\n1 December 2024 Share Save George Sandeman BBC News Share Save\n\nGetty Images Kai Cenat spent the last 30 days continuously streaming to reclaim the record he set last year\n\nKai Cenat has reclaimed the record for attracting the most Twitch subscribers in a single stream. The 22-year-old American had been streaming continuously on the platform for the last 30 days and hosted several guests including Snoop Dogg, Serena Williams and Bill Nye. The number of subscribers amassed in that period was 727,694 – although the final number is still to be confirmed by Twitch. The figure is more than double the previous record of 326,252 which was set by IronMouse in October – breaking Kai’s previous record from 2023.\n\nSnoop Dogg called Kai on the second day of the stream to talk about his next album and on the fourth day gave him a tour of his Los Angeles home. Viewers were shown the rapper’s recording booth as well as the property’s other luxuries – among them a basketball court, arcade room and casino.\n\nAllow Twitter content? Twitter’s cookie policy privacy policy ‘accept and continue’. This article contains content provided by Twitter . We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readandbefore accepting. To view this content choose Accept and continue",
    "clean_body": "snoop dogg helps kai cenat reclaim twitch subscriber record 1 december 2024 share save george sandeman bbc news share save getty images kai cenat spent the last 30 days continuously streaming to reclaim the record he set last year kai cenat has reclaimed the record for attracting the most twitch subscribers in a single stream the 22yearold american had been streaming continuously on the platform for the last 30 days and hosted several guests including snoop dogg serena williams and bill nye the number of subscribers amassed in that period was 727694 – although the final number is still to be confirmed by twitch the figure is more than double the previous record of 326252 which was set by ironmouse in october – breaking kai’s previous record from 2023 snoop dogg called kai on the second day of the stream to talk about his next album and on the fourth day gave him a tour of his los angeles home viewers were shown the rapper’s recording booth as well as the property’s other luxuries – among them a basketball court arcade room and casino allow twitter content twitter’s cookie policy privacy policy ‘accept and continue’ this article contains content provided by twitter we ask for your permission before anything is loaded as they may be using cookies and other technologies you may want to readandbefore accepting to view this content choose accept and continue",
    "summary": "Snoop Dogg helps Kai Cenat reclaim Twitch subscriber record1 December 2024 Share Save George Sandeman BBC News Share SaveGetty Images Kai Cenat spent the last 30 days continuously streaming to reclaim the record he set last yearKai Cenat has reclaimed the record for attracting the most Twitch subscribers in a single stream.\nThe 22-year-old American had been streaming continuously on the platform for the last 30 days and hosted several guests including Snoop Dogg, Serena Williams and Bill Nye.\nThe number of subscribers amassed in that period was 727,694 – although the final number is still to be confirmed by Twitch.\nThe figure is more than double the previous record of 326,252 which was set by IronMouse in October – breaking Kai’s previous record from 2023.\nAllow Twitter content?",
    "keywords": [
      "kai",
      "cenat",
      "subscribers",
      "streaming",
      "dogg",
      "stream",
      "mafiathon",
      "subscriber",
      "reclaims",
      "twitch",
      "twitter",
      "record",
      "content"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4155/live/fd33fdb0-b006-11ef-a88f-9db5c484bac5.jpg"
  },
  "https://www.bbc.com/news/articles/cqx8wgz3rgwo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cqx8wgz3rgwo",
    "date": "2024-12-05",
    "time": "00:00:00",
    "title": "Two men charged over stabbing of Iranian journalist in UK",
    "body": "Two men charged over stabbing of Iranian journalist in UK\n\nThe two men appeared in a Romanian court for the start of extradition proceedings to the UK, the CPS said.\n\nOn Wednesday, Nandito Badea, 19, and George Stana, 23, were arrested in Romania and charged with wounding and wounding with intent to cause grievous bodily harm, the Crown Prosecution Service (CPS) said.\n\nTwo Romanian nationals have been charged after an Iranian journalist was stabbed outside his London home earlier this year.\n\nA CPS spokesperson said on Thursday that \"following a review of the evidence provided by the Metropolitan Police Service's Counter Terrorism Command, we have authorised charges against two Romanian nationals.\"\n\n\"We continue to work closely with Romanian authorities, to ensure that our extradition request is progressed through the courts,\" the statement read. \"The Crown Prosecution Service reminds all concerned that criminal proceedings against the defendants are active and that they have the right to a fair trial.\"\n\nMr Zeraati described the incident to BBC's Radio 4 Today programme in April. He said that when he was going to his car to get to the studio, a man approached him pretending to ask for change.\n\nWhen he said he had none and moved to unlock the car door, a second man approached, and they grabbed him so that he could not move his hands, Mr Zeraati said.\n\nThe first person stabbed him in the leg, he said, then they ran away. None of Mr Zeraati's belongings were stolen in the attack, he said.\n\nPolice said at the time that the suspects travelled to Heathrow Airport shortly after with a third man and left the UK.\n\nMr Zeraati was taken to hospital, but returned to work a week after the attack. He told the BBC in April that while he was \"feeling much better\", he was still mentally recovering.",
    "clean_body": "two men charged over stabbing of iranian journalist in uk the two men appeared in a romanian court for the start of extradition proceedings to the uk the cps said on wednesday nandito badea 19 and george stana 23 were arrested in romania and charged with wounding and wounding with intent to cause grievous bodily harm the crown prosecution service cps said two romanian nationals have been charged after an iranian journalist was stabbed outside his london home earlier this year a cps spokesperson said on thursday that following a review of the evidence provided by the metropolitan police services counter terrorism command we have authorised charges against two romanian nationals we continue to work closely with romanian authorities to ensure that our extradition request is progressed through the courts the statement read the crown prosecution service reminds all concerned that criminal proceedings against the defendants are active and that they have the right to a fair trial mr zeraati described the incident to bbcs radio 4 today programme in april he said that when he was going to his car to get to the studio a man approached him pretending to ask for change when he said he had none and moved to unlock the car door a second man approached and they grabbed him so that he could not move his hands mr zeraati said the first person stabbed him in the leg he said then they ran away none of mr zeraatis belongings were stolen in the attack he said police said at the time that the suspects travelled to heathrow airport shortly after with a third man and left the uk mr zeraati was taken to hospital but returned to work a week after the attack he told the bbc in april that while he was feeling much better he was still mentally recovering",
    "summary": "Two men charged over stabbing of Iranian journalist in UKThe two men appeared in a Romanian court for the start of extradition proceedings to the UK, the CPS said.\nOn Wednesday, Nandito Badea, 19, and George Stana, 23, were arrested in Romania and charged with wounding and wounding with intent to cause grievous bodily harm, the Crown Prosecution Service (CPS) said.\nTwo Romanian nationals have been charged after an Iranian journalist was stabbed outside his London home earlier this year.\n\"The Crown Prosecution Service reminds all concerned that criminal proceedings against the defendants are active and that they have the right to a fair trial.\"\nPolice said at the time that the suspects travelled to Heathrow Airport shortly after with a third man and left the UK.",
    "keywords": [
      "iranian",
      "uk",
      "cps",
      "stabbed",
      "service",
      "zeraati",
      "men",
      "stabbing",
      "charged",
      "prosecution",
      "romanian",
      "man",
      "wounding",
      "journalist",
      "work"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/c178/live/0eedc190-b321-11ef-ae38-31c81b2d5bcb.jpg"
  },
  "https://www.bbc.com/news/articles/cp83rllzg1ko": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cp83rllzg1ko",
    "date": "2024-12-31",
    "time": "00:00:00",
    "title": "South Korea court issues warrant to arrest impeached President Yoon",
    "body": "Arrest warrant issued for impeached S Korea president Yoon\n\nSouth Korea has been in political crisis since the short-lived martial law declaration, with Yoon and a successor both impeached by the opposition-dominated parliament.\n\nYoon's legal team has called the warrant \"illegal and invalid\" and said they would challenge it in court.\n\nThe warrant comes after Yoon, who is being investigated for abusing his power and inciting an insurrection, ignored three summonses to appear for questioning over the past two weeks.\n\nA court in South Korea has issued an arrest warrant against suspended president Yoon Suk Yeol over his attempt to impose martial law on 3 December.\n\nYoon is South Korea's first sitting president to face arrest.\n\nInvestigators have until 6 January to execute the warrant that was approved by a court in the capital Seoul, and can request an extension.\n\nIt is unclear, however, if investigators will be able to execute the warrant as they may be thwarted by his security team and protesters.\n\nThe presidential security service had earlier blocked investigators from entering the presidential office grounds and Yoon's private residence to conduct court-approved searches.\n\nIn the past, South Korean authorities have given up arrest attempts against prominent politicians after their aides and supporters have physically blocked the police.\n\nOn Monday, Yoon's legal team said that investigators had no authority to arrest him, as declaring martial law was within the president's constitutional authority.\n\nYoon had earlier defended his decision to declare martial law and vowed to \"fight to the end\" - though he also said that he would not avoid his legal and political responsibilities.\n\nHis lawyer, Yun Gap-geun, said that Yoon's failure to comply with the earlier three summonses was due to \"legitimate concerns\".\n\nYoon's whereabouts are not publicly known, but he has been banned from leaving the country.\n\nWhile he has been suspended from presidential duties since 14 December after lawmakers voted to impeach him, he can only be removed from office if his impeachment is upheld by the country's constitutional court.\n\nThere are currently only six judges on the constitutional court's nine-member bench. This means a single rejection would save Yoon from being removed.\n\nOpposition lawmakers had hoped the nomination of three additional judges would improve the odds of Yoon getting impeached, but their proposal was vetoed by prime minister Han Duck-soo last week.\n\nThe opposition has since then voted to impeach Han, who had stepped in as acting leader after Yoon was suspended.\n\nNow, they are threatening to do the same to finance minister Choi Sang-mok, who currently serves as both acting president and acting prime minister.\n\nOn Tuesday Choi appointed two new judges but said a third would require consensus among opposition and governing parties.\n\nAdditional reporting by Kelly Ng",
    "clean_body": "arrest warrant issued for impeached s korea president yoon south korea has been in political crisis since the shortlived martial law declaration with yoon and a successor both impeached by the oppositiondominated parliament yoons legal team has called the warrant illegal and invalid and said they would challenge it in court the warrant comes after yoon who is being investigated for abusing his power and inciting an insurrection ignored three summonses to appear for questioning over the past two weeks a court in south korea has issued an arrest warrant against suspended president yoon suk yeol over his attempt to impose martial law on 3 december yoon is south koreas first sitting president to face arrest investigators have until 6 january to execute the warrant that was approved by a court in the capital seoul and can request an extension it is unclear however if investigators will be able to execute the warrant as they may be thwarted by his security team and protesters the presidential security service had earlier blocked investigators from entering the presidential office grounds and yoons private residence to conduct courtapproved searches in the past south korean authorities have given up arrest attempts against prominent politicians after their aides and supporters have physically blocked the police on monday yoons legal team said that investigators had no authority to arrest him as declaring martial law was within the presidents constitutional authority yoon had earlier defended his decision to declare martial law and vowed to fight to the end though he also said that he would not avoid his legal and political responsibilities his lawyer yun gapgeun said that yoons failure to comply with the earlier three summonses was due to legitimate concerns yoons whereabouts are not publicly known but he has been banned from leaving the country while he has been suspended from presidential duties since 14 december after lawmakers voted to impeach him he can only be removed from office if his impeachment is upheld by the countrys constitutional court there are currently only six judges on the constitutional courts ninemember bench this means a single rejection would save yoon from being removed opposition lawmakers had hoped the nomination of three additional judges would improve the odds of yoon getting impeached but their proposal was vetoed by prime minister han ducksoo last week the opposition has since then voted to impeach han who had stepped in as acting leader after yoon was suspended now they are threatening to do the same to finance minister choi sangmok who currently serves as both acting president and acting prime minister on tuesday choi appointed two new judges but said a third would require consensus among opposition and governing parties additional reporting by kelly ng",
    "summary": "Arrest warrant issued for impeached S Korea president YoonSouth Korea has been in political crisis since the short-lived martial law declaration, with Yoon and a successor both impeached by the opposition-dominated parliament.\nYoon's legal team has called the warrant \"illegal and invalid\" and said they would challenge it in court.\nA court in South Korea has issued an arrest warrant against suspended president Yoon Suk Yeol over his attempt to impose martial law on 3 December.\nYoon is South Korea's first sitting president to face arrest.\nOn Monday, Yoon's legal team said that investigators had no authority to arrest him, as declaring martial law was within the president's constitutional authority.",
    "keywords": [
      "impeached",
      "martial",
      "yoons",
      "arrest",
      "yoon",
      "president",
      "issues",
      "presidential",
      "law",
      "south",
      "korea",
      "court",
      "team",
      "warrant"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/d937/live/df70ce00-c714-11ef-bcd1-2524413684e9.jpg"
  },
  "https://www.bbc.com/news/articles/c785l1nrpd1o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c785l1nrpd1o",
    "date": "2024-12-01",
    "time": "00:00:00",
    "title": "Global plastic talks collapse as oil states rebel",
    "body": "Global plastic talks collapse as oil states rebel\n\n1 December 2024 Share Save Esme Stallard Climate and science reporter, BBC News Share Save\n\nGetty Images More than nine billion tonnes of plastic has been produced globally with less than 10% recycled\n\nCountries have failed to reach a landmark agreement on tackling plastic pollution after more than two years of negotiations. More than 200 nations met in South Korea for what was meant to be a final round of talks. But deep divisions remained between a group of nearly 100 \"high ambition\" countries calling for plastic to be phased out and oil-producing nations who warned this would affect the world's development. \"The objective of this treaty is to end plastic pollution not plastic itself, plastic has brought immense benefit to societies worldwide,\" said the Kuwait negotiators in the final hours.\n\nIn 2022, the world's nations agreed that a global treaty was needed to tackle the issue of plastic pollution particularly the impacts on the marine environment - and this should be completed within two years given the urgency of the issue. Since 1950, more than eight billion tonnes of plastic have been produced globally but less than 10% has been recycled, estimates the United Nations. This has led to millions of tonnes entering the world's oceans and seas, posing serious risks to wildlife and their environment. Birds, fish and whales can become injured or killed if they become entangled in plastic debris or mistakenly ingest it, leading to starvation. Plastic is also produced from fossil fuels, and is currently estimated to be responsible for 5% of global emissions - so efforts to restrict it could also help with efforts to tackle climate change. The meeting in Busan, South Korea, was meant to be the final fifth round of negotiations but after late night talks countries were unable to resolve their differences missing their key two-year deadline. \"A few critical issues prevent us from reaching a comprehensive agreement,\" said the talks' chair Luis Vayas Valdivieso on Sunday - the final day of talks. Although many issues are being discussed the key split is around Article 6 - whether there should be a commitment to cutting how much plastic is produced, or just try and reduce plastic waste by increasing efforts to recycle.\n\nA group of 95 countries have emerged, including the UK, European Union, African Group and many South American nations, who are calling for Article 6 to be a legally binding pledge to reduce production levels. \"We carry the weight of expectations of our citizens who are counting on us to protect them and the environment to protect it from the plastic pollution crisis,\" said Camila Zepeda, Mexico's chief negotiator, who spoke on behalf of this group at the final meeting. \"We must do everything in our power to meet this expectation.\" Her speech was meet with strong applause across the room, but a group of oil-producing nations including Saudi Arabia, Iran, Kuwait and Russia pushed back strongly. The demand for oil across most sectors is expected to fall from 2026 as countries move to cleaner technologies like electric vehicles - but plastic is seen as one of the remaining growth markets. This may explain why these countries are particularly concerned about any global target to cut production levels. \"Attempting to phase out plastic rather than addressing the issue of plastic production risks undermining global progress and exacerbating economic inequality,\" said Salman Alajmi, a Kuwait delegate.\n\nGetty Images The amount of plastic entering the world's rivers and seas is expected to triple by 2040 at current rates of production\n\nIndia also voiced its concerns with including any commitments to cut production of plastic on the basis it could impact its right to development. Environmental charities and scientists expressed their deep disappointment that the talks had collapsed and raised concerns about the influence of the fossil fuel industry. InfluenceMap, a think tank, found that the petrochemical industry intervened dozens of times on the treaty via company statements, social media and consultation responses, and 93% of those were unsupportive of efforts to cut production levels. But the report did highlight that these efforts were outweighed by positive support from key manufacturers of plastic products like Unilever, Mars and Nestlé who want consistent global regulation on the issue. Jodie Roussell, global public affairs lead for sustainability at Nestlé, said of the talks' collapse: \"Disappointingly, consensus among all nations remains elusive, which further delays critical action to end plastic pollution. \"It also fails to deliver the certainty that business needs to mobilise investment and scale solutions.\" It is now expected that countries will reconvene next year to try and get an agreement, but Eirik Lindebjerg, global plastics policy manager at conservation charity the World Wide Fund for Nature (WWF), told the BBC that the group of 95 should go ahead with their own treaty. \"I think the political reality is that most countries in the world want this – that is the positive thing we can take from this. \"Those countries shouldn’t accept anything less than what they are asking for, there are already so many that a treaty would have a massive impact on ending plastic pollution and that option should be on the table.\"",
    "clean_body": "global plastic talks collapse as oil states rebel 1 december 2024 share save esme stallard climate and science reporter bbc news share save getty images more than nine billion tonnes of plastic has been produced globally with less than 10 recycled countries have failed to reach a landmark agreement on tackling plastic pollution after more than two years of negotiations more than 200 nations met in south korea for what was meant to be a final round of talks but deep divisions remained between a group of nearly 100 high ambition countries calling for plastic to be phased out and oilproducing nations who warned this would affect the worlds development the objective of this treaty is to end plastic pollution not plastic itself plastic has brought immense benefit to societies worldwide said the kuwait negotiators in the final hours in 2022 the worlds nations agreed that a global treaty was needed to tackle the issue of plastic pollution particularly the impacts on the marine environment and this should be completed within two years given the urgency of the issue since 1950 more than eight billion tonnes of plastic have been produced globally but less than 10 has been recycled estimates the united nations this has led to millions of tonnes entering the worlds oceans and seas posing serious risks to wildlife and their environment birds fish and whales can become injured or killed if they become entangled in plastic debris or mistakenly ingest it leading to starvation plastic is also produced from fossil fuels and is currently estimated to be responsible for 5 of global emissions so efforts to restrict it could also help with efforts to tackle climate change the meeting in busan south korea was meant to be the final fifth round of negotiations but after late night talks countries were unable to resolve their differences missing their key twoyear deadline a few critical issues prevent us from reaching a comprehensive agreement said the talks chair luis vayas valdivieso on sunday the final day of talks although many issues are being discussed the key split is around article 6 whether there should be a commitment to cutting how much plastic is produced or just try and reduce plastic waste by increasing efforts to recycle a group of 95 countries have emerged including the uk european union african group and many south american nations who are calling for article 6 to be a legally binding pledge to reduce production levels we carry the weight of expectations of our citizens who are counting on us to protect them and the environment to protect it from the plastic pollution crisis said camila zepeda mexicos chief negotiator who spoke on behalf of this group at the final meeting we must do everything in our power to meet this expectation her speech was meet with strong applause across the room but a group of oilproducing nations including saudi arabia iran kuwait and russia pushed back strongly the demand for oil across most sectors is expected to fall from 2026 as countries move to cleaner technologies like electric vehicles but plastic is seen as one of the remaining growth markets this may explain why these countries are particularly concerned about any global target to cut production levels attempting to phase out plastic rather than addressing the issue of plastic production risks undermining global progress and exacerbating economic inequality said salman alajmi a kuwait delegate getty images the amount of plastic entering the worlds rivers and seas is expected to triple by 2040 at current rates of production india also voiced its concerns with including any commitments to cut production of plastic on the basis it could impact its right to development environmental charities and scientists expressed their deep disappointment that the talks had collapsed and raised concerns about the influence of the fossil fuel industry influencemap a think tank found that the petrochemical industry intervened dozens of times on the treaty via company statements social media and consultation responses and 93 of those were unsupportive of efforts to cut production levels but the report did highlight that these efforts were outweighed by positive support from key manufacturers of plastic products like unilever mars and nestlé who want consistent global regulation on the issue jodie roussell global public affairs lead for sustainability at nestlé said of the talks collapse disappointingly consensus among all nations remains elusive which further delays critical action to end plastic pollution it also fails to deliver the certainty that business needs to mobilise investment and scale solutions it is now expected that countries will reconvene next year to try and get an agreement but eirik lindebjerg global plastics policy manager at conservation charity the world wide fund for nature wwf told the bbc that the group of 95 should go ahead with their own treaty i think the political reality is that most countries in the world want this – that is the positive thing we can take from this those countries shouldn’t accept anything less than what they are asking for there are already so many that a treaty would have a massive impact on ending plastic pollution and that option should be on the table",
    "summary": "Global plastic talks collapse as oil states rebel1 December 2024 Share Save Esme Stallard Climate and science reporter, BBC News Share SaveGetty Images More than nine billion tonnes of plastic has been produced globally with less than 10% recycledCountries have failed to reach a landmark agreement on tackling plastic pollution after more than two years of negotiations.\nMore than 200 nations met in South Korea for what was meant to be a final round of talks.\n\"The objective of this treaty is to end plastic pollution not plastic itself, plastic has brought immense benefit to societies worldwide,\" said the Kuwait negotiators in the final hours.\n\"Attempting to phase out plastic rather than addressing the issue of plastic production risks undermining global progress and exacerbating economic inequality,\" said Salman Alajmi, a Kuwait delegate.\nJodie Roussell, global public affairs lead for sustainability at Nestlé, said of the talks' collapse: \"Disappointingly, consensus among all nations remains elusive, which further delays critical action to end plastic pollution.",
    "keywords": [
      "group",
      "production",
      "collapse",
      "nations",
      "final",
      "talks",
      "countries",
      "oil",
      "pollution",
      "plastic",
      "treaty",
      "rebel",
      "global",
      "states"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/0b4c/live/63898660-afea-11ef-93a6-9fd2d3586a96.jpg"
  },
  "https://www.bbc.com/news/articles/czend1y0xjko": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/czend1y0xjko",
    "date": "2024-12-10",
    "time": "00:00:00",
    "title": "MP calls for first-cousin marriage to be banned",
    "body": "MP calls for first-cousin marriage to be banned\n\n10 December 2024 Share Save Share Save\n\nReuters\n\nA Conservative former minister has called for first-cousin marriage to be banned in the UK. Introducing the proposals in Parliament, Richard Holden said the children of first cousins were at greater risk of birth defects and the practice should be prohibited to protect public health. However, independent MP Iqbal Mohamed argued a ban would be ineffective and said these issues would be better addressed through education programmes to raise awareness of the risks. Downing Street said the expert advice on the risks of first-cousin marriage was clear but indicated that the government had no plans to change the law.\n\n\"In terms of legislation, the government has set out its priorities,\" a No 10 spokesman said. Holden introduced his proposals using the 10-minute rule process, which allows a backbench MP to make the case for a new bill in a speech of up to 10 minutes in the Commons. However, such bills are unlikely to become law without government support because of the limited parliamentary time available for them. Under current legislation, marriages to a sibling, parent or child are prohibited but not between first cousins.\n\nHolden said that while the overall prevalence of first-cousin marriage was low in Western countries, certain diaspora communities, such as Irish travellers and British Pakistanis, had \"extremely high rates\" of 20-40%. The MP for Basildon and Billericay cited research suggesting the child of first cousins carries around double the risk of inheriting a serious disorder compared to the child or unrelated people. Holden also argued the practice threatened women's freedom. \"Women and girls living under a clan mentality often know the scientific risks of first-cousin marriage, but make considered social and cultural calculations,\" he told MPs. \"Strict honour codes, where expressions of individuality can be subject to social isolation, violence and even death in some cases, dominate thinking.\" He said first-cousin marriage was \"not really conducive to modern British society\", adding: \"It's about more than one marriage. It's about the values and foundations of our society and our democracy.\"",
    "clean_body": "mp calls for firstcousin marriage to be banned 10 december 2024 share save share save reuters a conservative former minister has called for firstcousin marriage to be banned in the uk introducing the proposals in parliament richard holden said the children of first cousins were at greater risk of birth defects and the practice should be prohibited to protect public health however independent mp iqbal mohamed argued a ban would be ineffective and said these issues would be better addressed through education programmes to raise awareness of the risks downing street said the expert advice on the risks of firstcousin marriage was clear but indicated that the government had no plans to change the law in terms of legislation the government has set out its priorities a no 10 spokesman said holden introduced his proposals using the 10minute rule process which allows a backbench mp to make the case for a new bill in a speech of up to 10 minutes in the commons however such bills are unlikely to become law without government support because of the limited parliamentary time available for them under current legislation marriages to a sibling parent or child are prohibited but not between first cousins holden said that while the overall prevalence of firstcousin marriage was low in western countries certain diaspora communities such as irish travellers and british pakistanis had extremely high rates of 2040 the mp for basildon and billericay cited research suggesting the child of first cousins carries around double the risk of inheriting a serious disorder compared to the child or unrelated people holden also argued the practice threatened womens freedom women and girls living under a clan mentality often know the scientific risks of firstcousin marriage but make considered social and cultural calculations he told mps strict honour codes where expressions of individuality can be subject to social isolation violence and even death in some cases dominate thinking he said firstcousin marriage was not really conducive to modern british society adding its about more than one marriage its about the values and foundations of our society and our democracy",
    "summary": "MP calls for first-cousin marriage to be banned10 December 2024 Share Save Share SaveReutersA Conservative former minister has called for first-cousin marriage to be banned in the UK.\nDowning Street said the expert advice on the risks of first-cousin marriage was clear but indicated that the government had no plans to change the law.\nHolden said that while the overall prevalence of first-cousin marriage was low in Western countries, certain diaspora communities, such as Irish travellers and British Pakistanis, had \"extremely high rates\" of 20-40%.\n\"Women and girls living under a clan mentality often know the scientific risks of first-cousin marriage, but make considered social and cultural calculations,\" he told MPs.\nHe said first-cousin marriage was \"not really conducive to modern British society\", adding: \"It's about more than one marriage.",
    "keywords": [
      "holden",
      "marriage",
      "mp",
      "society",
      "risk",
      "firstcousin",
      "child",
      "share",
      "risks",
      "calls",
      "social",
      "banned"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/ac97/live/94ee9d40-b705-11ef-8fc3-fd1de9f966e3.jpg"
  }
}