{
  "https://www.cnbc.com/2024/06/30/inside-out-2-tops-1-billion-at-global-box-office-first-since-barbie.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/06/30/inside-out-2-tops-1-billion-at-global-box-office-first-since-barbie.html",
    "date": "2024-06-30",
    "time": "15:46:24 UTC",
    "title": "'Inside Out 2' tops $1 billion at the global box office, first film to do so since 'Barbie'",
    "body": "Amy Poehler and Maya Hawke voice Joy and Anxiety, respectively, in Disney and Pixar's \"Inside Out 2.\"\n\nDisney and Pixar's \"Inside Out 2\" is the newest member of the billion-dollar club.\n\nThe animated feature has tallied $1.014 billion worldwide as of Sunday, making it the highest-grossing film of 2024 and the first film since Warner Bros.′ \"Barbie\" to top $1 billion at the global box office.\n\n\"On behalf of movie theatre owners across the country and around the world, we want to congratulate Disney's 'Inside Out 2' for grossing $1 billion faster than any animated movie in history,\" said Michael O'Leary, president and CEO of the National Association of Theatre Owners. \"The film's stunning global success once again illustrates that audiences the world over will respond to compelling, entertaining movies, and that they want to enjoy them on the big screen.\"\n\nThe billion-dollar benchmark is a much-needed win for Disney's Pixar animation hub. A once prolifically successful studio, Pixar has suffered at the box office in the wake of the pandemic. Much of its difficulties have come, in part, because Disney opted to debut a handful of animated features directly on streaming service Disney+ during theatrical closures and even once cinemas had reopened.\n\nAs a result, before \"Inside Out 2,\" no Disney animated feature from Pixar or its Walt Disney Animation studio had generated more than $480 million at the global box office since 2019.\n\n\"Inside Out 2\" has also showcased how vital the family audience is to the box office. This underserved crowd accounted for more than 70% of those in attendance during the film's domestic debut, according to data from EntTelligence.\n\nWhile this audience came out in droves for Universal's \"The Super Mario Bros. Movie,\" which generated more than $1.36 billion at the global box office, there was little for them to feast on until the recent releases of Sony's \"The Garfield Movie\" and Paramount's \"IF.\"\n\n\"Inside Out 2\" also drove the coveted teen demographic to cinemas, with 14% of foot traffic coming from those aged 13 to 17. This younger generation has been largely absent from the market in recent years.\n\nAs the future of moviegoing, this group is particularly important to the industry. Getting them back to the big screen has become a top priority for studios and movie theater operators.\n\nNext up for family and teens is Universal and Illumination's \"Despicable Me 4,\" due out in theaters during the July Fourth holiday weekend.\n\nDisclosure: Comcast is the parent company of NBCUniversal and CNBC.",
    "summary": "Amy Poehler and Maya Hawke voice Joy and Anxiety, respectively, in Disney and Pixar's \"Inside Out 2.\"\nThe animated feature has tallied $1.014 billion worldwide as of Sunday, making it the highest-grossing film of 2024 and the first film since Warner Bros.′ \"Barbie\" to top $1 billion at the global box office.\nA once prolifically successful studio, Pixar has suffered at the box office in the wake of the pandemic.\nAs a result, before \"Inside Out 2,\" no Disney animated feature from Pixar or its Walt Disney Animation studio had generated more than $480 million at the global box office since 2019.\n\"Inside Out 2\" has also showcased how vital the family audience is to the box office.",
    "keywords": [
      "tops",
      "disney",
      "inside",
      "movie",
      "office",
      "box",
      "global",
      "billion",
      "animated",
      "film",
      "pixar",
      "barbie",
      "world"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107430413-1718723988321-iso_Cropped.jpg?v=1718724085&w=1920&h=1080",
    "clean_body": "amy poehler maya hawke voice joy anxiety respectively disney pixars inside disney pixars inside newest member billiondollar club animated feature tallied billion worldwide sunday making highestgrossing film first film since warner bros ' barbie top billion global box office behalf movie theatre owner across country around world want congratulate disney inside grossing billion faster animated movie history said michael oleary president ceo national association theatre owner film stunning global success illustrates audience world respond compelling entertaining movie want enjoy big screen billiondollar benchmark muchneeded win disney pixar animation hub prolifically successful studio pixar suffered box office wake pandemic much difficulty come part disney opted debut handful animated feature directly streaming service disney theatrical closure even cinema reopened result inside disney animated feature pixar walt disney animation studio generated million global box office since inside also showcased vital family audience box office underserved crowd accounted attendance film domestic debut according data enttelligence audience came drove universal super mario bros movie generated billion global box office little feast recent release sonys garfield movie paramounts inside also drove coveted teen demographic cinema foot traffic coming aged younger generation largely absent market recent year future moviegoing group particularly important industry getting back big screen become top priority studio movie theater operator next family teen universal illumination despicable due theater july fourth holiday weekend disclosure comcast parent company nbcuniversal cnbc",
    "sentiment": 0.191312358276644,
    "sentiment_category": "positive",
    "t": 315
  },
  "https://www.cnbc.com/2024/06/30/pride-month-more-companies-stay-quiet-but-donations-keep-flowing.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/06/30/pride-month-more-companies-stay-quiet-but-donations-keep-flowing.html",
    "date": "2024-06-30",
    "time": "12:00:01 UTC",
    "title": "More companies are staying quiet during Pride, but money is still flowing to LGBTQ+ causes",
    "body": "Parade participants are seen marching during the 2024 Kentuckiana Pride Parade on June 15, 2024 in Louisville, Kentucky. Stephen J. Cohen | Getty Images\n\nPride month is winding down — and this year, the corporate world took a more cautious approach. June tends to bring a wave of rainbow-themed merchandise and affirming ads and social media posts from retailers and consumers brands, coinciding with parades and other events that celebrate the LGBTQ+ community. As the presidential election approaches, however, some companies have grown quieter about diversity, equity and inclusion efforts to avoid stepping into the culture wars or facing the blowback from conservative customers that Target and Bud Light did a year ago. The starkest example of that came late Thursday: Tractor Supply, a retailer that sells animal feed, cowboy boots and lawn supplies in rural parts of the country, said it is ending all spending tied to diversity and environmental causes. That includes no longer sponsoring Pride festivals, the statement said. The move, while an outlier in its magnitude, underscores how some companies that made inclusion commitments in recent years are treading cautiously. It is difficult to track how many companies shared supportive messages, donated to LGBTQ+ causes or sold rainbow-themed merchandise in June compared to previous years. According to Gravity Research, a Washington, D.C.-based reputational research firm, 45% of Fortune 100 companies had at least one social media post on LinkedIn or X explicitly related to Pride as of June 21 this year, compared with 51% last June. Gravity Research President Luke Hartig said the volatility of the presidential election and the two candidates' willingness to call out companies by name has also made companies less likely to go public about their stand. \"There's a little bit of like, 'keep our heads down while we go through this election,'\" he said. Tim Bennett, cofounder of Tribury Productions, a marketing company that specializes in reaching LGBTQ+ Americans, works with Fortune 500 companies, including recent projects with Procter & Gamble. He said more clients have taken \"a wait-and-see\" approach to marketing to LGBTQ+ consumers or decided to scatter efforts throughout the year instead of making a big splash in a single month. \"June this year has not been like the last five or six,\" Bennett said. That may not be a bad thing for LGBTQ+ initiatives and charities. Sarah Kate Ellis, CEO of nonprofit advocacy group GLAAD, said she's seeing more companies get involved with year-round philanthropy and activism in more meaningful ways. She also pointed to a survey by Gravity Research that found that 78% of companies did not plan to change their Pride strategy this year. Thirteen percent were unsure whether they'd make changes and 9% said they planned to revise their strategy. Gravity Research surveyed 45 corporate executives and Fortune 500 leaders across industries in April. \"The visibility of companies putting flags out and having product to celebrate our Pride and to mark a month that's really significant and important for our community is really important, and I don't want to ever devalue that,\" Ellis said. \"I do think, though, those companies must look inside and make sure that they have the policies and the HR practices that match their outward marketing.\" Major companies are still writing checks for LGBTQ+ causes, too. A GLAAD spokesperson said Friday that the group has not seen donations or corporate support decline this Pride month, though it does not yet have a total tally. On Friday, when the Stonewall National Monument Visitor Center officially opened its doors to commemorate the New York City bar that was a catalyst in the LGBTQ+ rights movement, the event had major backing from the business community. Supporters included Google, Amazon, JPMorgan Chase and Booking.com. President Joe Biden also made an appearance and remarks at the monument's opening.\n\nPride Month merchandise is displayed at a Target store on May 31, 2023 in San Francisco, California. Justin Sullivan | Getty Images\n\nThe Bud Light and Target effect\n\nConsumer staples brands were the most likely to say they planned to shift their Pride month strategy this year, according to Gravity Research's survey. That may stem from the conservative boycotts of Target and Bud Light last year. Target has carried a Pride collection for over a decade. Yet last year, the big-box retailer removed some items and moved displays after employees faced threats. Boycotters targeted items for transgender shoppers, such as \"tuck-friendly\" swimsuits, and also criticized separate Pride merchandise for kids. Instead of putting Pride merchandise in all stores this year, Target only carried it in the locations that accounted for 90% of total Pride sales in 2022 and 2023. It also stopped selling any Pride apparel for kids. On the company's website and in those select stores, shoppers can find a wide variety of Pride-themed items. The volume of negative feedback to the Pride collection externally and internally is \"significantly lower\" this year than in 2023, according to a Target spokesperson. In a statement, Target said it is \"committed to supporting the LGBTQIA+ community during Pride Month and year-round\" and would participate in Pride events across the country and support LGBTQ+ groups, in addition to offering Pride products.\n\nA sign disparaging Bud Light beer is seen along a country road on April 21, 2023 in Arco, Idaho. Anheuser-Busch, the brewer of Bud Light has faced backlash after the company sponsored two Instagram posts from a transgender woman. Natalie Behring | Getty Images\n\nAnheuser-Busch InBev and other large beer brands, on the other hand, have backed away from public support of the LGBTQ+ community. Conservatives like singer Kid Rock and Florida Gov. Ron DeSantis called for a boycott of the beer and its parent company, Anheuser-Busch InBev, after Bud Light sent personalized cans of its beer to transgender influencer Dylan Mulvaney. The marketing campaign coincided with the March Madness college basketball tournament. Bud Light sales tumbled around 25%, and the brand lost its spot as the best-selling beer in the U.S., ceding the position it held for more than two decades to Constellation Brands' Modelo. AB InBev distanced itself from Mulvaney and fired Bud Light's vice president of marketing. In October, AB InBev CEO Michel Doukeris said the brand would focus its marketing more on events like sports games and concerts. It also returned as the official sponsor of the UFC. In recent months, some consumers have returned to Bud Light, as RBC Europe analysts estimate that the brand's U.S. volume is down only about 10% these days. For its part, Bud Light hasn't posted in support of Pride month on its Instagram or X pages this year. The boycott was unusually sticky for a few reasons, according to Neil Reid, a geography professor at the University of Toledo who researches the beer industry. Studies have shown that consumers' loyalty to top-selling beers may be more tied to the brand than the taste, Reid said. Right-wing news outlets like Fox News also devoted plenty of airtime to the controversy, stretching its duration and potentially reaching new consumers who missed the initial reaction. Plus, once Bud Light sales fell, retailers gave more shelf space to its rivals. \"You can look at this issue from a moral, ethical perspective or you can also look at it from a pure business perspective. Those two often don't result in the same strategy,\" Reid said.\n\nThe New York Stock Exchange welcomes e.l.f. Beauty (NYSE: ELF), on March 18, 2024, to the podium to celebrate its 20th anniversary of founding. To honor the occasion, Tarang Amin, Chairman & CEO, joined by Tara Dziedzic, NYSE Head of Listings - U.S. Sectors, rings The Opening Bell®.\n\nDoubling down on diversity",
    "summary": "A GLAAD spokesperson said Friday that the group has not seen donations or corporate support decline this Pride month, though it does not yet have a total tally.\nPride Month merchandise is displayed at a Target store on May 31, 2023 in San Francisco, California.\nA sign disparaging Bud Light beer is seen along a country road on April 21, 2023 in Arco, Idaho.\nAnheuser-Busch, the brewer of Bud Light has faced backlash after the company sponsored two Instagram posts from a transgender woman.\nFor its part, Bud Light hasn't posted in support of Pride month on its Instagram or X pages this year.",
    "keywords": [
      "beer",
      "money",
      "lgbtq",
      "flowing",
      "light",
      "bud",
      "quiet",
      "companies",
      "month",
      "marketing",
      "research",
      "target",
      "pride",
      "staying",
      "causes"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107434979-1719591806515-gettyimages-2157747773-dsc_8557_8hjnav9u.jpeg?v=1719591878&w=1920&h=1080",
    "clean_body": "parade participant seen marching kentuckiana pride parade june louisville kentucky stephen j cohen getty image pride month winding -- year corporate world took cautious approach june tends bring wave rainbowthemed merchandise affirming ad social medium post retailer consumer brand coinciding parade event celebrate lgbtq community presidential election approach however company grown quieter diversity equity inclusion effort avoid stepping culture war facing blowback conservative customer target bud light year ago starkest example came late thursday tractor supply retailer sell animal feed cowboy boot lawn supply rural part country said ending spending tied diversity environmental cause includes longer sponsoring pride festival statement said move outlier magnitude underscore company made inclusion commitment recent year treading cautiously difficult track many company shared supportive message donated lgbtq cause sold rainbowthemed merchandise june compared previous year according gravity research washington dcbased reputational research firm fortune company least one social medium post linkedin x explicitly related pride june year compared last june gravity research president luke hartig said volatility presidential election two candidate willingness call company name also made company le likely go public stand there little bit like keep head go election said tim bennett cofounder tribury production marketing company specializes reaching lgbtq american work fortune company including recent project procter gamble said client taken waitandsee approach marketing lgbtq consumer decided scatter effort throughout year instead making big splash single month june year like last five six bennett said may bad thing lgbtq initiative charity sarah kate elli ceo nonprofit advocacy group glaad said shes seeing company get involved yearround philanthropy activism meaningful way also pointed survey gravity research found company plan change pride strategy year thirteen percent unsure whether theyd make change said planned revise strategy gravity research surveyed corporate executive fortune leader across industry april visibility company putting flag product celebrate pride mark month thats really significant important community really important dont want ever devalue elli said think though company must look inside make sure policy hr practice match outward marketing major company still writing check lgbtq cause glaad spokesperson said friday group seen donation corporate support decline pride month though yet total tally friday stonewall national monument visitor center officially opened door commemorate new york city bar catalyst lgbtq right movement event major backing business community supporter included google amazon jpmorgan chase bookingcom president joe biden also made appearance remark monument opening pride month merchandise displayed target store may san francisco california justin sullivan getty image bud light target effect consumer staple brand likely say planned shift pride month strategy year according gravity research survey may stem conservative boycott target bud light last year target carried pride collection decade yet last year bigbox retailer removed item moved display employee faced threat boycotters targeted item transgender shopper tuckfriendly swimsuit also criticized separate pride merchandise kid instead putting pride merchandise store year target carried location accounted total pride sale also stopped selling pride apparel kid company website select store shopper find wide variety pridethemed item volume negative feedback pride collection externally internally significantly lower year according target spokesperson statement target said committed supporting lgbtqia community pride month yearround would participate pride event across country support lgbtq group addition offering pride product sign disparaging bud light beer seen along country road april arco idaho anheuserbusch brewer bud light faced backlash company sponsored two instagram post transgender woman natalie behring getty image anheuserbusch inbev large beer brand hand backed away public support lgbtq community conservative like singer kid rock florida gov ron desantis called boycott beer parent company anheuserbusch inbev bud light sent personalized can beer transgender influencer dylan mulvaney marketing campaign coincided march madness college basketball tournament bud light sale tumbled around brand lost spot bestselling beer u ceding position held two decade constellation brand modelo ab inbev distanced mulvaney fired bud light vice president marketing october ab inbev ceo michel doukeris said brand would focus marketing event like sport game concert also returned official sponsor ufc recent month consumer returned bud light rbc europe analyst estimate brand u volume day part bud light hasnt posted support pride month instagram x page year boycott unusually sticky reason according neil reid geography professor university toledo research beer industry study shown consumer loyalty topselling beer may tied brand taste reid said rightwing news outlet like fox news also devoted plenty airtime controversy stretching duration potentially reaching new consumer missed initial reaction plus bud light sale fell retailer gave shelf space rival look issue moral ethical perspective also look pure business perspective two often dont result strategy reid said new york stock exchange welcome elf beauty nyse elf march podium celebrate th anniversary founding honor occasion tarang amin chairman ceo joined tara dziedzic nyse head listing u sector ring opening bell ( r ) doubling diversity",
    "sentiment": 0.10377605419272087,
    "sentiment_category": "positive",
    "t": 315
  },
  "https://www.cnbc.com/2024/06/30/fathom-joint-venture-of-amc-regal-cinemark-makes-major-gains.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/06/30/fathom-joint-venture-of-amc-regal-cinemark-makes-major-gains.html",
    "date": "2024-06-30",
    "time": "15:21:20 UTC",
    "title": "Fathom, the company behind classic films at your local theater, is making major gains in moviegoing",
    "body": "At a time when the box office is starved for content and audiences seem pickier than ever, Fathom Events is posting record revenue gains.\n\nFor 20 years, the joint venture between AMC , Regal and Cinemark has been best known for bringing alternative content to the big screen in the form of classic Hollywood titles, live telecasts of theater and opera productions, concerts and even television series.\n\nMost recently, it ventured into the specialty distribution space to deliver \"The Blind,\" \"The Chosen,\" \"Jesus Thirsts: The Miracle of the Eucharist\" and \"Waitress: the Musical\" to audiences. Still to come is \"Andrea Bocelli 30: The Celebration.\"\n\nIn 2023, Fathom generated $100 million at the box office, a 116% increase over 2019 levels and its highest-grossing year ever. And that momentum has continued into 2024, as the company tallied $43 million in the first quarter, up nearly 140% compared to the $18 million it tallied in the year-earlier period.\n\nFathom's relationships with Hollywood's biggest studios and its cinematic reach — as the partnership of the industry's three biggest theater chains — has made it a formidable force at the box office. Its value proposition is twofold: It breathes new life into older films, and into theaters.\n\n\"Falling mostly under the event film banner, anniversary titles have truly come into vogue seemingly more so now than in years past with a particular emphasis given to these beloved older films,\" said Paul Dergarabedian, senior media analyst at Comscore. \"These anniversary re-releases are a win-win, providing joy to movie fans and notably additional revenues to movie theaters often decades after initial theatrical run.\"\n\nIn post-pandemic times, Fathom has acted as a crutch for many smaller cinema operators, providing much-needed content for the big screen amid a drought caused by pandemic and strike-related production shutdowns.\n\nSeason 4 of \"The Chosen,\" a faith-based television show about the life of Jesus, generated $32 million at the box office for Fathom, around 75% of its first-quarter haul.\n\n\"'The Chosen' was through [Fathom], and it was huge for us,\" said Brock Bagby, president and chief content, programming and development officer at B&B Theatres. \"It gave us a lot of extra revenue in February and the beginning of March that we wouldn't have had.\"\n\nFathom has also benefited from its anniversary titles and classic cinema showings. Each year, the company brings films back to theaters to celebrate milestone years alongside fan-favorite titles.\n\n\"We've seen that there's a growing segment in the box office, people that are interested in seeing older films on the big screen,\" said Jordan Hohman, vice president of project development at Phoenix Theatres. \"These audiences are getting to enjoy classic films, either for the first time or for the first time, in a new way. I think that that's valuable.\"\n\nThis year, the company celebrated the 85th anniversaries of \"The Wizard of Oz\" and \"Gone with the Wind\" as well as the 35th anniversary of \"Steel Magnolias.\" Still on the calendar is the 50th anniversary of \"Blazing Saddles,\" the 70th anniversary of Alfred Hitchcock's \"Rear Window,\" the 40th anniversary of \"Neverending Story\" and the 20th anniversary of \"Mean Girls.\"\n\nIt also has a film series called Studio Ghibli Fest, which features 14 films from the studio in their original Japanese and English dubbed versions. This year, the lineup boasts the 20th anniversary of \"Howl's Moving Castle,\" the 35th anniversary of \"Kiki's Delivery Service\" and the 30th anniversary of \"Pom Poko.\"\n\nAnd these titles can generate big box-office hauls even decades after they were first released.\n\nFathom's three-weekend run of the original Lord of the Rings trilogy resulted in $8.2 million at the box office.\n\n\"Lord of the Rings was wildly successful nationwide, and for us,\" Bagby said. \"We just did 4DX Lord of the Rings this weekend in our new Dallas theater, and we sold out every single show.\"\n\n4DX is a screen format that utilizes motion seats, practical effects and sensory elements to immerse viewers in a movie experience.\n\nAudiences are already buying tickets for showings in August celebrating the 15th anniversary of \"Coraline,\" which will be shown widely in 3D for the first time since its original release.\n\nFathom re-released \"Coraline\" twice before with great success. In 2022, the film showed in 800 theaters for one day and tallied $1.2 million in ticket sales. Last year, the film extended its release to five days and snared $7.1 million, making it the highest-grossing classic film release in Fathom history.\n\nThat $7.1 million figure is about 10% of the initial domestic run for \"Coraline\" in 2009 and 42% of its opening weekend, according to data from Comscore.\n\nWhat's more, 53% of the audience who attended screenings of the film last year were 34 years old or younger.\n\n\"New audiences are seeing it for the first time although the film is 15 years old,\" said Ray Nutt, CEO of Fathom Events.\n\nFathom reports presales for this year's screenings of \"Coraline\" are selling seven times as many tickets per location as were sold during the same period last year, with two-thirds of those ticket sales for the 3D version of the film.\n\nBecause Fathom has a wide footprint through its parent companies and nationwide marketing, it does the heavy lifting for smaller theater chains.\n\n\"[Fathom has] built a lot of relationships,\" Phoenix Theatre's Hohman said. \"They worked out the licensing and they created the marketing behind re-releasing these classic films that, you know, we just can't do ourselves. It's a national campaign. So, I think that they just offer a lot of value.\"",
    "summary": "At a time when the box office is starved for content and audiences seem pickier than ever, Fathom Events is posting record revenue gains.\nIn 2023, Fathom generated $100 million at the box office, a 116% increase over 2019 levels and its highest-grossing year ever.\n\"These audiences are getting to enjoy classic films, either for the first time or for the first time, in a new way.\nLast year, the film extended its release to five days and snared $7.1 million, making it the highest-grossing classic film release in Fathom history.\n\"They worked out the licensing and they created the marketing behind re-releasing these classic films that, you know, we just can't do ourselves.",
    "keywords": [
      "theater",
      "classic",
      "titles",
      "moviegoing",
      "office",
      "making",
      "box",
      "local",
      "major",
      "anniversary",
      "company",
      "film",
      "gains",
      "million",
      "fathom",
      "films"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107434662-1719547273853-coraline_Cropped.jpg?v=1719547457&w=1920&h=1080",
    "clean_body": "time box office starved content audience seem pickier ever fathom event posting record revenue gain year joint venture amc regal cinemark best known bringing alternative content big screen form classic hollywood title live telecast theater opera production concert even television series recently ventured specialty distribution space deliver blind chosen jesus thirst miracle eucharist waitress musical audience still come andrea bocelli celebration fathom generated million box office increase level highestgrossing year ever momentum continued company tallied million first quarter nearly compared million tallied yearearlier period fathom relationship hollywood biggest studio cinematic reach -- partnership industry three biggest theater chain -- made formidable force box office value proposition twofold breathes new life older film theater falling mostly event film banner anniversary title truly come vogue seemingly year past particular emphasis given beloved older film said paul dergarabedian senior medium analyst comscore anniversary rereleases winwin providing joy movie fan notably additional revenue movie theater often decade initial theatrical run postpandemic time fathom acted crutch many smaller cinema operator providing muchneeded content big screen amid drought caused pandemic strikerelated production shutdown season chosen faithbased television show life jesus generated million box office fathom around firstquarter haul chosen fathom huge u said brock bagby president chief content programming development officer bb theatre gave u lot extra revenue february beginning march wouldnt fathom also benefited anniversary title classic cinema showing year company brings film back theater celebrate milestone year alongside fanfavorite title weve seen there growing segment box office people interested seeing older film big screen said jordan hohman vice president project development phoenix theatre audience getting enjoy classic film either first time first time new way think thats valuable year company celebrated th anniversary wizard oz gone wind well th anniversary steel magnolia still calendar th anniversary blazing saddle th anniversary alfred hitchcock rear window th anniversary neverending story th anniversary mean girl also film series called studio ghibli fest feature film studio original japanese english dubbed version year lineup boast th anniversary howl moving castle th anniversary kikis delivery service th anniversary pom poko title generate big boxoffice haul even decade first released fathom threeweekend run original lord ring trilogy resulted million box office lord ring wildly successful nationwide u bagby said dx lord ring weekend new dallas theater sold every single show dx screen format utilizes motion seat practical effect sensory element immerse viewer movie experience audience already buying ticket showing august celebrating th anniversary coraline shown widely first time since original release fathom rereleased coraline twice great success film showed theater one day tallied million ticket sale last year film extended release five day snared million making highestgrossing classic film release fathom history million figure initial domestic run coraline opening weekend according data comscore whats audience attended screening film last year year old younger new audience seeing first time although film year old said ray nutt ceo fathom event fathom report presales year screening coraline selling seven time many ticket per location sold period last year twothirds ticket sale version film fathom wide footprint parent company nationwide marketing heavy lifting smaller theater chain fathom built lot relationship phoenix theatre hohman said worked licensing created marketing behind rereleasing classic film know cant national campaign think offer lot value",
    "sentiment": 0.1656385281385282,
    "sentiment_category": "positive",
    "t": 315
  },
  "https://www.cnbc.com/2024/06/30/top-wall-street-analysts-favor-these-dividend-stocks-for-better-returns.html": {
    "source": "CNBC",
    "url": "https://www.cnbc.com/2024/06/30/top-wall-street-analysts-favor-these-dividend-stocks-for-better-returns.html",
    "date": "2024-06-30",
    "time": "10:55:21 UTC",
    "title": "Top Wall Street analysts favor these dividend stocks for better returns",
    "body": "A sign is posted in front of an Olive Garden restaurant on June 20, 2024 in Rohnert Park, California.\n\nDividend-paying stocks can help investors bolster their portfolios and boost returns.\n\nInvestors searching for these names will need to find companies that have a track record of making steady payments, backed by robust financials.\n\nHere are three attractive dividend stocks, according to Wall Street's top pros on TipRanks, a platform that ranks analysts based on their past performance.\n\nDarden Restaurants\n\nThe first dividend stock is Darden Restaurants (DRI), which operates several popular brands in full-service dining, including Olive Garden, LongHorn Steakhouse and Yard House. The company recently announced mixed results for the fourth quarter of fiscal 2024. While Darden exceeded analysts' earnings expectations, its sales slightly missed the Street's consensus amid increased discounting by rivals.\n\nDarden issued $628 million in dividends and committed $454 million to share repurchases in fiscal 2024. Moreover, the company announced a dividend hike of nearly 7%, bringing the quarterly dividend to $1.40 per share. The stock has a dividend yield of 3.5%.\n\nFollowing the results, BTIG analyst Peter Saleh reiterated a buy rating on DRI stock with a price target of $175. The analyst highlighted that at the mid-point, Darden's earnings per share outlook of $9.40 to $9.60 indicates double-digit total shareholder return, which is in line with the company's long-term targets.\n\nSaleh thinks that the company can achieve its targeted return metrics, supported by several factors, including a modest rise in pricing, advertising initiatives and easing inflation.\n\n\"We view Darden Restaurants as one of the strongest operators in the industry with historical sales and restaurant margin performance that has consistently exceeded peers,\" said Saleh.\n\nSaleh ranks No. 360 among more than 8,900 analysts tracked by TipRanks. His ratings have been successful 61% of the time, with each delivering an average return of 11.7%. (See Darden's Financial Statements on TipRanks)\n\nInternational Seaways\n\nNext up is International Seaways (INSW), a tanker company that offers energy transportation services for crude oil and petroleum products. On June 26, the company paid a combined dividend of $1.75 per share. The company's combined dividend represented 60% of its first-quarter adjusted net income.\n\nIn its first-quarter results, INSW highlighted that its combined dividend payments of $5.74 per share over the last twelve months reflected a dividend yield of more than 13%.\n\nFollowing meetings with INSW's management, Stifel analyst Benjamin Nolan reaffirmed a buy rating on the stock and increased the price target to $68 from $66. The analyst noted that the tanker market remains cyclically strong due to a continued increase in global oil consumption, the limited supply of new ships and the longer average voyage lengths caused by the ongoing geopolitical troubles.\n\nAccordingly, Nolan increased his rate assumptions for 2024 and 2025. The analyst expects International Seaways to continue to deliver higher cash flows, fueled by a favorable backdrop for the tanker market.\n\nNolan expects INSW to sustain high supplemental dividends, given the estimated $200 million to $300 million of excess cash flow after capital expenditure (assuming there is no new debt associated with tanker acquisitions). \"We are modeling $5.51/share in 2024 dividends, although there is room to be a little higher,\" said the analyst.\n\nNolan ranks No. 68 among more than 8,900 analysts tracked by TipRanks. His ratings have been successful 67% of the time, with each delivering an average return of 19.5%. (See International Seaways' Stock Charts on TipRanks)\n\nCitigroup\n\nFinally, let's discuss this week's third dividend stock, banking giant Citigroup (C). At a quarterly dividend of 53 cents per share, Citigroup offers a yield of 3.3%.\n\nThe bank held its Services Investor Day on June 18. Management expressed confidence about achieving the 2024 guidance, driven by revenue growth across all the core businesses despite macro uncertainty and the possibility of lower interest rates.\n\nFollowing the event, Goldman Sachs analyst Richard Ramsden reiterated a buy rating on Citigroup stock and slightly raised his price target to $72 from $71. The higher price target reflects an increase in the analyst's EPS estimates for 2024, 2025 and 2026 based on management's commentary, which indicated that the bank's strategic transformation plan is gaining momentum.\n\nRamsden noted that Citi is highly focused on its transformation efforts, with the bank making steady progress on risk control and data quality. Coming to the Services business, the analyst noted that management established strategic priorities for this vital component of the company's financial targets. The analyst estimates that the Services business will account for 25% of the group revenue growth through 2026.\n\n\"The Services business is well positioned to maintain their market leading positions with potential to continue share gains across businesses,\" said Ramsden. The analyst's optimism is based on Citi's extensive global network in 95 countries, well-established long-term client relationships, and market share gains that are expected to be driven by investments in technology and innovative offerings.\n\nRamsden ranks No. 969 among more than 8,900 analysts tracked by TipRanks. His ratings have been successful 65% of the time, with each delivering an average return of 11.9%. (See Citigroup Technical Analysis on TipRanks)",
    "summary": "Here are three attractive dividend stocks, according to Wall Street's top pros on TipRanks, a platform that ranks analysts based on their past performance.\nDarden RestaurantsThe first dividend stock is Darden Restaurants (DRI), which operates several popular brands in full-service dining, including Olive Garden, LongHorn Steakhouse and Yard House.\nWhile Darden exceeded analysts' earnings expectations, its sales slightly missed the Street's consensus amid increased discounting by rivals.\nMoreover, the company announced a dividend hike of nearly 7%, bringing the quarterly dividend to $1.40 per share.\n(See International Seaways' Stock Charts on TipRanks)CitigroupFinally, let's discuss this week's third dividend stock, banking giant Citigroup (C).",
    "keywords": [
      "favor",
      "street",
      "analysts",
      "returns",
      "services",
      "stock",
      "dividend",
      "wall",
      "share",
      "return",
      "tipranks",
      "company",
      "better",
      "analyst",
      "2024",
      "stocks"
    ],
    "image_url": "https://image.cnbcfm.com/api/v1/image/107431668-1718974346996-gettyimages-2158482624-js2_2833_vbysfvys.jpeg?v=1718974397&w=1920&h=1080",
    "clean_body": "sign posted front olive garden restaurant june rohnert park california dividendpaying stock help investor bolster portfolio boost return investor searching name need find company track record making steady payment backed robust financials three attractive dividend stock according wall street top pro tipranks platform rank analyst based past performance darden restaurant first dividend stock darden restaurant dri operates several popular brand fullservice dining including olive garden longhorn steakhouse yard house company recently announced mixed result fourth quarter fiscal darden exceeded analyst earnings expectation sale slightly missed street consensus amid increased discounting rival darden issued million dividend committed million share repurchase fiscal moreover company announced dividend hike nearly bringing quarterly dividend per share stock dividend yield following result btig analyst peter saleh reiterated buy rating dri stock price target analyst highlighted midpoint dardens earnings per share outlook indicates doubledigit total shareholder return line company longterm target saleh think company achieve targeted return metric supported several factor including modest rise pricing advertising initiative easing inflation view darden restaurant one strongest operator industry historical sale restaurant margin performance consistently exceeded peer said saleh saleh rank among analyst tracked tipranks rating successful time delivering average return see dardens financial statement tipranks international seaway next international seaway insw tanker company offer energy transportation service crude oil petroleum product june company paid combined dividend per share company combined dividend represented firstquarter adjusted net income firstquarter result insw highlighted combined dividend payment per share last twelve month reflected dividend yield following meeting insws management stifel analyst benjamin nolan reaffirmed buy rating stock increased price target analyst noted tanker market remains cyclically strong due continued increase global oil consumption limited supply new ship longer average voyage length caused ongoing geopolitical trouble accordingly nolan increased rate assumption analyst expects international seaway continue deliver higher cash flow fueled favorable backdrop tanker market nolan expects insw sustain high supplemental dividend given estimated million million excess cash flow capital expenditure assuming new debt associated tanker acquisition modeling share dividend although room little higher said analyst nolan rank among analyst tracked tipranks rating successful time delivering average return see international seaway stock chart tipranks citigroup finally let discus week third dividend stock banking giant citigroup c quarterly dividend cent per share citigroup offer yield bank held service investor day june management expressed confidence achieving guidance driven revenue growth across core business despite macro uncertainty possibility lower interest rate following event goldman sachs analyst richard ramsden reiterated buy rating citigroup stock slightly raised price target higher price target reflects increase analyst eps estimate based management commentary indicated bank strategic transformation plan gaining momentum ramsden noted citi highly focused transformation effort bank making steady progress risk control data quality coming service business analyst noted management established strategic priority vital component company financial target analyst estimate service business account group revenue growth service business well positioned maintain market leading position potential continue share gain across business said ramsden analyst optimism based citis extensive global network country wellestablished longterm client relationship market share gain expected driven investment technology innovative offering ramsden rank among analyst tracked tipranks rating successful time delivering average return see citigroup technical analysis tipranks",
    "sentiment": 0.10727741164308327,
    "sentiment_category": "positive",
    "t": 315
  },
  "https://www.theguardian.com/world/article/2024/jun/30/soaring-government-debt-could-roil-global-financial-markets-warns-bis-director": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/article/2024/jun/30/soaring-government-debt-could-roil-global-financial-markets-warns-bis-director",
    "date": "2024-06-30",
    "time": "18:57:59 UTC",
    "title": "Soaring government debt could roil global financial markets, warns BIS head",
    "body": "Rising government debt levels could disturb global financial markets, the head of the body that advises central banks said on Sunday before France’s high-stakes parliamentary elections.\n\nAgustín Carstens, the general manager of the Bank for International Settlements (BIS), said the world economy was on course for a “smooth landing” from the inflation crisis, but he warned that policymakers, especially politicians, needed to be careful.\n\nGlobal government debt is already at record levels and elections ranging from the US presidential vote in November, to recent polls in Mexico and South Africa, and votes in France and Britain in the coming week, all carry risks.\n\nEmmanuel Macron’s decision to call a snap election in France has sent the country’s bank stocks crashing and alarmed the bond markets, exacerbating fiscal sustainability concerns in the eurozone’s second-largest economy.\n\nPolls released before the first round of voting on Sunday suggested the far right could win the largest share of the vote, amid record turnout.\n\nCarstens said the BIS was not calling out any “one or two” governments but that the message was clear.\n\n“They [governments] must cut short the rise in public debt and accept that interest rates may not return to the pre-pandemic ultra-low levels,” he said. “We need a solid foundation to build upon.”\n\nWith interest rates not about to go back to ultra-low levels, and cost pressures from ageing populations, climate breakdown and rebuilding defence capabilities, economic stimulus plans and a general rise in protectionism could unsettle sensitive markets, BIS warned as it published its annual report.\n\n“They can surprise you with not much notice,” Carstens told reporters, pointing to the turbulence in Britain’s markets after then prime minister Liz Truss’s budget plans, which put some pension funds at risk of collapse. “You really want to avoid that.”\n\nFrance’s main parties have all promised new spending. Macron’s government had promised to cut the budget deficit from 5.5% of gross domestic product last year to a European Union ceiling of 3% by 2027 – an objective that may be unattainable after the vote, which concludes with a second round on 7 July.\n\nIf it forms a government, Marine Le Pen’s National Rally (RN) wants to cut value-added tax (VAT) on energy, which it says would cost €7bn (£5.9bn) for the rest of this year and €12bn in a full year. The RN would also scrap a 2023 increase in the retirement age to 64 from 62, and says its spending plans would be paid for by cutting contributions to the EU budget.\n\nThe left-wing New Popular Front alliance, now polling second, says its first moves would include a 10% civil servant pay hike, providing free school lunches, supplies and transport while raising housing subsidies by 10%.\n\nThe turmoil has sent the cost to the French government of servicing its debt on the international markets rocketing, with the risk premium, or spread, demanded by holders of French debt over Germany’s rising to its highest level since 2012.\n\nskip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nFrance’s blue-chip CAC 40 index is down 6% since Macron dissolved parliament, with French banks having been among the biggest losers. The big three – Société Générale, BNP Paribas and Crédit Agricole – are down 10%-14% since Macron’s announcement.\n\nFrench banks have a large amount of debt and are expected to suffer if credit costs increase sharply.\n\nThe positive for Carstens was that central banks have successfully reined in inflation, which had hit decades-long highs after the Covid-19 pandemic, and then Russia’s 2022 invasion of Ukraine, which riled commodity markets.\n\n“Compared to last year, I have to say we are in a much better place,” the former Mexican central bank governor said.\n\nAlthough Carstens said central banks deserved praise for navigating a difficult path that could have resulted in a wave of recessions, he added that they needed to persevere, likening the inflation fight to a course of antibiotics to tackle an illness.\n\nHe described an “extreme” scenario where inflation raced up again and central banks needed to raise rates further. But that is not what the BIS expects.",
    "summary": "Rising government debt levels could disturb global financial markets, the head of the body that advises central banks said on Sunday before France’s high-stakes parliamentary elections.\nCarstens said the BIS was not calling out any “one or two” governments but that the message was clear.\n“They [governments] must cut short the rise in public debt and accept that interest rates may not return to the pre-pandemic ultra-low levels,” he said.\nFrench banks have a large amount of debt and are expected to suffer if credit costs increase sharply.\nHe described an “extreme” scenario where inflation raced up again and central banks needed to raise rates further.",
    "keywords": [
      "central",
      "financial",
      "banks",
      "levels",
      "warns",
      "carstens",
      "soaring",
      "bis",
      "global",
      "debt",
      "head",
      "roil",
      "inflation",
      "rates",
      "markets",
      "vote"
    ],
    "image_url": "https://i.guim.co.uk/img/media/67c1e67a02d79639fe37f63ce57c9e75e9664116/229_151_3268_1961/master/3268.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3bc3e00d389efa456d00f4be79b16e75",
    "clean_body": "rising government debt level could disturb global financial market head body advises central bank said sunday france 's highstakes parliamentary election agustin carstens general manager bank international settlement bi said world economy course `` smooth landing '' inflation crisis warned policymakers especially politician needed careful global government debt already record level election ranging u presidential vote november recent poll mexico south africa vote france britain coming week carry risk emmanuel macron 's decision call snap election france sent country 's bank stock crashing alarmed bond market exacerbating fiscal sustainability concern eurozone 's secondlargest economy poll released first round voting sunday suggested far right could win largest share vote amid record turnout carstens said bi calling `` one two '' government message clear '' government must cut short rise public debt accept interest rate may return prepandemic ultralow level '' said `` need solid foundation build upon '' interest rate go back ultralow level cost pressure ageing population climate breakdown rebuilding defence capability economic stimulus plan general rise protectionism could unsettle sensitive market bi warned published annual report '' surprise much notice '' carstens told reporter pointing turbulence britain 's market prime minister liz truss 's budget plan put pension fund risk collapse `` really want avoid '' france 's main party promised new spending macron 's government promised cut budget deficit gross domestic product last year european union ceiling - objective may unattainable vote concludes second round july form government marine le pen 's national rally rn want cut valueadded tax vat energy say would cost EURbn PSbn rest year EURbn full year rn would also scrap increase retirement age say spending plan would paid cutting contribution eu budget leftwing new popular front alliance polling second say first move would include civil servant pay hike providing free school lunch supply transport raising housing subsidy turmoil sent cost french government servicing debt international market rocketing risk premium spread demanded holder french debt germany 's rising highest level since skip past newsletter promotion sign business today free daily newsletter get set working day - well point business news analysis need every morning enter email address sign privacy notice newsletter may contain info charity online ad content funded outside party information see newsletter may contain info charity online ad content funded outside party information see privacy policy use google recaptcha protect website google privacy policy term service apply newsletter promotion france 's bluechip cac index since macron dissolved parliament french bank among biggest loser big three - societe generale bnp paribas credit agricole - since macron 's announcement french bank large amount debt expected suffer credit cost increase sharply positive carstens central bank successfully reined inflation hit decadeslong high covid pandemic russia 's invasion ukraine riled commodity market '' compared last year say much better place '' former mexican central bank governor said although carstens said central bank deserved praise navigating difficult path could resulted wave recession added needed persevere likening inflation fight course antibiotic tackle illness described `` extreme '' scenario inflation raced central bank needed raise rate bi expects",
    "sentiment": 0.06831831831831832,
    "sentiment_category": "positive",
    "t": 315
  }
}