{
  "https://www.bbc.com/news/articles/cdx2lv0kgndo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cdx2lv0kgndo",
    "date": "2025-02-18",
    "time": "00:00:00",
    "title": "Central Cee makes history at Mobo Awards after seventh win",
    "body": "Central Cee makes history at Mobo Awards\n\n18 February 2025 Share Save Riyah Collins BBC Newsbeat Share Save\n\nGetty Images Central Cee is the first artist to win best male act at the Mobos three times\n\nCentral Cee has made history at the Mobo Awards, becoming the first artist to be named best male act three times. It was his seventh trophy, matching Stormzy's record as the most decorated rapper in the awards' history. He did not attend the ceremony in person, with his prize instead collected by host Eddie Kadi who joked they \"share everything... except royalties\". The event in Newcastle also saw Bashy claim best album and best hip-hop act after a 15-year break from music and Darkoo beat off competition from Raye and Jorja Smith to be recognised as best female act.\n\nAccepting her award, Darkoo said she \"tried Chat GPT\" to write her speech \"but I didn't know how to make it work\", so instead freestyled and thanked her family for supporting her. \"It's been a rollercoaster but they believed in me for the past year and I've been shutting it down.\"\n\nPA Media Darkoo also performed at the event, treating the audience to the song of the year - Favourite Girl\n\nCentral Cee, also known as Cench, was previously named best male act in 2024 and released his debut album last month after eight top 10 singles. Reacting to his win on Instagram, he posted a screenshot of the awards' coverage with the comment \"that's nice\". He missed out on his other two nominations including best drill act, which went to Pozer, and song of the year which was won by Darkoo alongside her trophy for best female act. Despite not making breaking into the UK singles charts, the British-Nigerian artist won for Favourite Girl, a collab with Dess Dior, ahead of Stormzy's number one track with Chase & Status, Backbone, as well as Central Cee's collab with Lil Baby, Band4Band, which peaked at number three.\n\nGetty Images Ayra Starr made history as the first African woman to win best international act\n\nAyra Starr also scooped two awards, making history as the first African woman to win best international act and becoming the first woman to win best African music act in 16 years. Jamaican dancehall artist Vybz Kartel was also recognised with the Mobo impact award. He was released from jail last year after his murder conviction was overturned and at the weekend was confirmed to be performing at this summer's Wireless festival. \"Think about this, got locked up, did 13 years in prison,\" he said while accepting his accolade. \"Meanwhile I'm diagnosed with Graves' disease so I'm fighting to be free, I'm fighting my illness, I'm fighting to keep my family together, I'm fighting to keep the fans pleased. \"And now I'm here, I walked the red carpet at the Mobo's. That taught me to believe in three things now more than ever: fate, change and forgiveness.\"\n\nGetty Images Vybz Kartel attended the awards where he was honoured with the Mobo impact award\n\nThe ceremony saw performances from Nova Twins, Spice, Krept And Konan and award winners Odeal, Darkoo and Bashy. Bashy, who returned to music after a 15-year break to focus on his acting career, won best hip-hop act as well as album of the year for Being Poor Is Expensive - an award he said he \"wanted and deserved\". \"This has been a 20-year plus journey, it's been hard work, tenacity, a lot of ups and downs. \"I stood in my truth, stood in my community's truth and now I'm here,\" he said on stage, making a point to thank the Windrush generation. \"I'm just a regular guy from the ends. I was a bus driver, I was a postman, I worked in retail. So if you're out there and you're working a job to fund your passion, don't be ashamed of your job. \"This is an amazing honour, I'm humbled.\"\n\nGetty Images Bashy, real name Ashley Thomas, won two awards on his comeback to music after a 15-year break\n\nIt was the first awards since Mobos founder Kanya King revealed she'd been diagnosed with stage four bowel cancer. Labour MP Dawn Butler became emotional as she announced Kanya would receive a surprise award, paving the way, which was also won by athlete and broadcaster Denise Lewis. Kanya came on stage to a standing ovation from the crowd, saying she felt an overwhelming sense of gratitude \"because there was a time I thought I wouldn't make it\". \"Next year marks our 30th anniversary and I very much intend to be there.\"\n\nPA Media Kanya said her diagnosis was \"a chance to inspire resilience and raise awareness\"\n\nThe winners in full: Best male act - Central Cee\n\nBest female act - Darkoo\n\nBest newcomer - Odeal\n\nAlbum of the year - Bashy, Being Poor Is Expensive\n\nSong of the year - Darkoo feat. Dess Dior, Favourite Girl\n\nVideo of the year - Mnelia, My Man\n\nBest hip-hop act - Bashy\n\nBest grime act - Scorcher\n\nBest drill act - Pozer\n\nBest R&B/Soul act - Odeal\n\nBest media personality - 90s baby show\n\nBest African music act - Ayra Starr\n\nBest performance in a TV show/ film - Jacob Anderson as Louis in Interview With The Vampire\n\nBest electronic/ dance music act - TSHA\n\nBest gospel act - Annatoria\n\nBest jazz act - Ezra Collective\n\nBest producer - Juls\n\nBest Caribbean music act - Shenseea\n\nBest alternative music act - ALT BLK ERA\n\nBest international act - Ayra Starr\n\nMOBO paving the way award - Denise Lewis MBE\n\nMOBO impact award - Vybz Kartel",
    "clean_body": "central cee makes history at mobo awards 18 february 2025 share save riyah collins bbc newsbeat share save getty images central cee is the first artist to win best male act at the mobos three times central cee has made history at the mobo awards becoming the first artist to be named best male act three times it was his seventh trophy matching stormzys record as the most decorated rapper in the awards history he did not attend the ceremony in person with his prize instead collected by host eddie kadi who joked they share everything except royalties the event in newcastle also saw bashy claim best album and best hiphop act after a 15year break from music and darkoo beat off competition from raye and jorja smith to be recognised as best female act accepting her award darkoo said she tried chat gpt to write her speech but i didnt know how to make it work so instead freestyled and thanked her family for supporting her its been a rollercoaster but they believed in me for the past year and ive been shutting it down pa media darkoo also performed at the event treating the audience to the song of the year favourite girl central cee also known as cench was previously named best male act in 2024 and released his debut album last month after eight top 10 singles reacting to his win on instagram he posted a screenshot of the awards coverage with the comment thats nice he missed out on his other two nominations including best drill act which went to pozer and song of the year which was won by darkoo alongside her trophy for best female act despite not making breaking into the uk singles charts the britishnigerian artist won for favourite girl a collab with dess dior ahead of stormzys number one track with chase status backbone as well as central cees collab with lil baby band4band which peaked at number three getty images ayra starr made history as the first african woman to win best international act ayra starr also scooped two awards making history as the first african woman to win best international act and becoming the first woman to win best african music act in 16 years jamaican dancehall artist vybz kartel was also recognised with the mobo impact award he was released from jail last year after his murder conviction was overturned and at the weekend was confirmed to be performing at this summers wireless festival think about this got locked up did 13 years in prison he said while accepting his accolade meanwhile im diagnosed with graves disease so im fighting to be free im fighting my illness im fighting to keep my family together im fighting to keep the fans pleased and now im here i walked the red carpet at the mobos that taught me to believe in three things now more than ever fate change and forgiveness getty images vybz kartel attended the awards where he was honoured with the mobo impact award the ceremony saw performances from nova twins spice krept and konan and award winners odeal darkoo and bashy bashy who returned to music after a 15year break to focus on his acting career won best hiphop act as well as album of the year for being poor is expensive an award he said he wanted and deserved this has been a 20year plus journey its been hard work tenacity a lot of ups and downs i stood in my truth stood in my communitys truth and now im here he said on stage making a point to thank the windrush generation im just a regular guy from the ends i was a bus driver i was a postman i worked in retail so if youre out there and youre working a job to fund your passion dont be ashamed of your job this is an amazing honour im humbled getty images bashy real name ashley thomas won two awards on his comeback to music after a 15year break it was the first awards since mobos founder kanya king revealed shed been diagnosed with stage four bowel cancer labour mp dawn butler became emotional as she announced kanya would receive a surprise award paving the way which was also won by athlete and broadcaster denise lewis kanya came on stage to a standing ovation from the crowd saying she felt an overwhelming sense of gratitude because there was a time i thought i wouldnt make it next year marks our 30th anniversary and i very much intend to be there pa media kanya said her diagnosis was a chance to inspire resilience and raise awareness the winners in full best male act central cee best female act darkoo best newcomer odeal album of the year bashy being poor is expensive song of the year darkoo feat dess dior favourite girl video of the year mnelia my man best hiphop act bashy best grime act scorcher best drill act pozer best rbsoul act odeal best media personality 90s baby show best african music act ayra starr best performance in a tv show film jacob anderson as louis in interview with the vampire best electronic dance music act tsha best gospel act annatoria best jazz act ezra collective best producer juls best caribbean music act shenseea best alternative music act alt blk era best international act ayra starr mobo paving the way award denise lewis mbe mobo impact award vybz kartel",
    "summary": "Central Cee makes history at Mobo Awards18 February 2025 Share Save Riyah Collins BBC Newsbeat Share SaveGetty Images Central Cee is the first artist to win best male act at the Mobos three timesCentral Cee has made history at the Mobo Awards, becoming the first artist to be named best male act three times.\nIt was his seventh trophy, matching Stormzy's record as the most decorated rapper in the awards' history.\nAccepting her award, Darkoo said she \"tried Chat GPT\" to write her speech \"but I didn't know how to make it work\", so instead freestyled and thanked her family for supporting her.\nReacting to his win on Instagram, he posted a screenshot of the awards' coverage with the comment \"that's nice\".\nGetty Images Ayra Starr made history as the first African woman to win best international actAyra Starr also scooped two awards, making history as the first African woman to win best international act and becoming the first woman to win best African music act in 16 years.",
    "keywords": [
      "makes",
      "win",
      "mobo",
      "won",
      "act",
      "darkoo",
      "award",
      "awards",
      "cee",
      "best",
      "history",
      "music",
      "central",
      "im",
      "seventh"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/80a7/live/b7fa00a0-ee4a-11ef-bc86-ad466770a69d.jpg"
  },
  "https://www.bbc.com/news/articles/czxke052gdxo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/czxke052gdxo",
    "date": "2025-02-10",
    "time": "00:00:00",
    "title": "Dorset: Earl of Sandwich John Montagu dies aged 81",
    "body": "John Montagu, Earl of Sandwich, dies aged 81\n\n10 February 2025 Share Save Daisy Stephens Share Save\n\nMapperton Estate John Montagu \"died peacefully in his sleep\" on 1 February, Mapperton House said\n\nThe 11th Earl of Sandwich has died at the age of 81. John Montagu \"died peacefully in his sleep\" on 1 February, his estate announced in a statement. It said Lord Sandwich, who was born in 1943, had a career in overseas aid, human rights and development, but was also \"devoted\" to Mapperton Estate, near Beaminster in Dorset. His son, Luke Montagu, became the 12th Earl of Sandwich upon his death.\n\nLord Sandwich worked in publishing in the 1960s, and then started a career in international development and joined Christian Aid in 1980 - a charity he would later go on to be director of.\n\nMapperton Estate Lord Sandwich was vocal on a number of humanitarian issues\n\nHe joined the House of Lords in 1995 and was elected as a hereditary peer in 1999, where \"he spoke on poverty, refugees and other humanitarian causes\" for almost three decades, the statement said. He was also a member of the Sudan & South Sudan All Party Parliamentary Group (APPG), and co-founded the APPG for Prescribed Drug Dependence. He met Caroline Hayman at Cambridge University and they married in 1968. \"[The couple] took over the management of Mapperton Estate in the mid 1980s, and together restored properties, woodlands, farmland and the gardens,\" the statement said. \"He was an expert in his family history, and enjoyed giving tours of the house and collection to visitors over the years. \"He also helped develop a successful sandwich venture in the United States.\" The fourth Earl of Sandwich is said to have come up with the idea of putting meat between two slices of bread while playing cards. Lord Sandwich is survived by his three children and 10 grandchildren.\n\nYou can follow BBC Dorset on Facebook, X, or Instagram.",
    "clean_body": "john montagu earl of sandwich dies aged 81 10 february 2025 share save daisy stephens share save mapperton estate john montagu died peacefully in his sleep on 1 february mapperton house said the 11th earl of sandwich has died at the age of 81 john montagu died peacefully in his sleep on 1 february his estate announced in a statement it said lord sandwich who was born in 1943 had a career in overseas aid human rights and development but was also devoted to mapperton estate near beaminster in dorset his son luke montagu became the 12th earl of sandwich upon his death lord sandwich worked in publishing in the 1960s and then started a career in international development and joined christian aid in 1980 a charity he would later go on to be director of mapperton estate lord sandwich was vocal on a number of humanitarian issues he joined the house of lords in 1995 and was elected as a hereditary peer in 1999 where he spoke on poverty refugees and other humanitarian causes for almost three decades the statement said he was also a member of the sudan south sudan all party parliamentary group appg and cofounded the appg for prescribed drug dependence he met caroline hayman at cambridge university and they married in 1968 the couple took over the management of mapperton estate in the mid 1980s and together restored properties woodlands farmland and the gardens the statement said he was an expert in his family history and enjoyed giving tours of the house and collection to visitors over the years he also helped develop a successful sandwich venture in the united states the fourth earl of sandwich is said to have come up with the idea of putting meat between two slices of bread while playing cards lord sandwich is survived by his three children and 10 grandchildren you can follow bbc dorset on facebook x or instagram",
    "summary": "John Montagu, Earl of Sandwich, dies aged 8110 February 2025 Share Save Daisy Stephens Share SaveMapperton Estate John Montagu \"died peacefully in his sleep\" on 1 February, Mapperton House saidThe 11th Earl of Sandwich has died at the age of 81.\nJohn Montagu \"died peacefully in his sleep\" on 1 February, his estate announced in a statement.\nIt said Lord Sandwich, who was born in 1943, had a career in overseas aid, human rights and development, but was also \"devoted\" to Mapperton Estate, near Beaminster in Dorset.\nHis son, Luke Montagu, became the 12th Earl of Sandwich upon his death.\nLord Sandwich is survived by his three children and 10 grandchildren.",
    "keywords": [
      "montagu",
      "estate",
      "lord",
      "mapperton",
      "john",
      "statement",
      "died",
      "earl",
      "dies",
      "house",
      "sandwich",
      "aged",
      "dorset",
      "81"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/af9c/live/1c69c460-e7c2-11ef-878b-b5877a8a77b9.jpg"
  },
  "https://www.bbc.com/news/articles/cm2d8mrlp8vo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cm2d8mrlp8vo",
    "date": "2025-02-22",
    "time": "00:00:00",
    "title": "Nature inFocus Photography Awards 2024: Leopards, sharks and spiders",
    "body": "Nature inFocus Photography Awards 2024: Leopards, sharks and spiders\n\n22 February 2025 Share Save Share Save\n\nRoman Willi Special Mention, Animal Portraits\n\nThe Nature inFocus Photography competition celebrates photographers who capture powerful moments in natural history and highlight critical conservation issues. Each year, the contest showcases a stunning array of imaginative and artistic images, while raising awareness of the environment. Winners are selected according to a series of categories: Animal Behaviour, Animal Portraits, Conservation Focus, Creative Nature Photography, Wildscape & Animals in Their Habitat and Photographer of the Year - Portfolio. Below is a selection of the winning entries.\n\nAnimal Behaviour\n\nAngela Albi/August Paula Winner, Animal Behaviour\n\nA school of hardyhead silverside fish moves with remarkable precision, twisting and turning in unison as they attempt to evade a group of blacktip reef sharks in Athuruga, Maldives.\n\nTibor Litauszki Runner-up, Animal Behaviour\n\nAs night falls over the water, Alpine newts begin their silent hunt. They glide between clusters of frog eggs, each one carefully positioning itself for a meal before the darkness deepens.\n\nAnirudh Laxmipathy Special Mention, Animal Behaviour\n\nKuwani, a renowned tigress of Kolsa, remains a dominant force, even at the age of 14. A wild boar unknowingly ventures too close to the tigress, unaware of the imminent danger. In a flash, she springs into action, her muscles tensed and claws unsheathed. Kolsa is a region within the Tadoba-Andhari Tiger Reserve, located in the state of Maharashtra, India.\n\nAnimal Portraits\n\nPruthvi B Winner, Animal Portraits\n\nA leopard climbs a tree, her cub observing from below before instinctively following her lead. Captured by a camera trap near Mysore in India, this intimate moment highlights the strong bond between mother and cub, while also offering a glimpse into the natural instincts of the leopard.\n\nPrashanthan Yogendranathan Runner-up, Animal Portraits\n\nIn the waters of Wilpattu National Park in Sri Lanka, a water buffalo emerges from a swim, its head adorned with a garland of floating weeds.\n\nConservation Photography Award\n\nSomenath Mukhopadhyay Special Mention, Ramki Sreenivasan Conservation Photography Award\n\nA devotee stands in the Yamuna River, New Delhi, offering prayers to the sun. Once revered as sacred, the river now ranks among the world's most polluted, overwhelmed by industrial waste, sewage, and agricultural run-off.\n\nCreative Nature Photography\n\nKai Kolodziej Winner, Creative Nature Photography\n\nIn Austria, a group of snails rests lightly on blades of grass, their delicate forms illuminated against a glowing backdrop, creating a striking sense of fragility.\n\nWildscape and animals in their habitat\n\nJacquie Matechuk Winner, Wildscape and animals in their habitat\n\nHigh in the Andean mountains of Ecuador, Tony, a large, male spectacled bear, shelters from the midday heat beneath the shade of a century-old fig tree draped in Spanish moss.\n\nHira Punjabi Special Mention,Wildscape and animals in their habitat\n\nAt sunrise in Hokkaido, Japan, red-crowned cranes move through a veil of mist, their graceful forms resembling brushstrokes on a canvas.\n\nPhotographer of the Year - Portfolio\n\nSupun Dilshan\n\nThis year, the coveted Photographer of the Year Portfolio award went to Supun Dilshan for Trapped Between Worlds, a striking visual story that draws attention to the struggles of Sri Lankan elephants. The images show the increasingly dire situation faced by these majestic animals, as they try to survive in environments that are being rapidly altered by human activities.\n\nSupun Dilshan\n\nSupun Dilshan\n\nYoung Photographer\n\nSalahuddin Ahmed Winner, Young Photographer\n\nA damselfly gazes through a hole in a vibrant green leaf, offering a rare glimpse into its delicate world in Sundarganj, Bangladesh. The contrast between the insect's slender form and the leaf's textured surface underscores the intricate beauty of nature's hidden wonders.",
    "clean_body": "nature infocus photography awards 2024 leopards sharks and spiders 22 february 2025 share save share save roman willi special mention animal portraits the nature infocus photography competition celebrates photographers who capture powerful moments in natural history and highlight critical conservation issues each year the contest showcases a stunning array of imaginative and artistic images while raising awareness of the environment winners are selected according to a series of categories animal behaviour animal portraits conservation focus creative nature photography wildscape animals in their habitat and photographer of the year portfolio below is a selection of the winning entries animal behaviour angela albiaugust paula winner animal behaviour a school of hardyhead silverside fish moves with remarkable precision twisting and turning in unison as they attempt to evade a group of blacktip reef sharks in athuruga maldives tibor litauszki runnerup animal behaviour as night falls over the water alpine newts begin their silent hunt they glide between clusters of frog eggs each one carefully positioning itself for a meal before the darkness deepens anirudh laxmipathy special mention animal behaviour kuwani a renowned tigress of kolsa remains a dominant force even at the age of 14 a wild boar unknowingly ventures too close to the tigress unaware of the imminent danger in a flash she springs into action her muscles tensed and claws unsheathed kolsa is a region within the tadobaandhari tiger reserve located in the state of maharashtra india animal portraits pruthvi b winner animal portraits a leopard climbs a tree her cub observing from below before instinctively following her lead captured by a camera trap near mysore in india this intimate moment highlights the strong bond between mother and cub while also offering a glimpse into the natural instincts of the leopard prashanthan yogendranathan runnerup animal portraits in the waters of wilpattu national park in sri lanka a water buffalo emerges from a swim its head adorned with a garland of floating weeds conservation photography award somenath mukhopadhyay special mention ramki sreenivasan conservation photography award a devotee stands in the yamuna river new delhi offering prayers to the sun once revered as sacred the river now ranks among the worlds most polluted overwhelmed by industrial waste sewage and agricultural runoff creative nature photography kai kolodziej winner creative nature photography in austria a group of snails rests lightly on blades of grass their delicate forms illuminated against a glowing backdrop creating a striking sense of fragility wildscape and animals in their habitat jacquie matechuk winner wildscape and animals in their habitat high in the andean mountains of ecuador tony a large male spectacled bear shelters from the midday heat beneath the shade of a centuryold fig tree draped in spanish moss hira punjabi special mentionwildscape and animals in their habitat at sunrise in hokkaido japan redcrowned cranes move through a veil of mist their graceful forms resembling brushstrokes on a canvas photographer of the year portfolio supun dilshan this year the coveted photographer of the year portfolio award went to supun dilshan for trapped between worlds a striking visual story that draws attention to the struggles of sri lankan elephants the images show the increasingly dire situation faced by these majestic animals as they try to survive in environments that are being rapidly altered by human activities supun dilshan supun dilshan young photographer salahuddin ahmed winner young photographer a damselfly gazes through a hole in a vibrant green leaf offering a rare glimpse into its delicate world in sundarganj bangladesh the contrast between the insects slender form and the leafs textured surface underscores the intricate beauty of natures hidden wonders",
    "summary": "Nature inFocus Photography Awards 2024: Leopards, sharks and spiders22 February 2025 Share Save Share SaveRoman Willi Special Mention, Animal PortraitsThe Nature inFocus Photography competition celebrates photographers who capture powerful moments in natural history and highlight critical conservation issues.\nWinners are selected according to a series of categories: Animal Behaviour, Animal Portraits, Conservation Focus, Creative Nature Photography, Wildscape & Animals in Their Habitat and Photographer of the Year - Portfolio.\nAnirudh Laxmipathy Special Mention, Animal BehaviourKuwani, a renowned tigress of Kolsa, remains a dominant force, even at the age of 14.\nAnimal PortraitsPruthvi B Winner, Animal PortraitsA leopard climbs a tree, her cub observing from below before instinctively following her lead.\nConservation Photography AwardSomenath Mukhopadhyay Special Mention, Ramki Sreenivasan Conservation Photography AwardA devotee stands in the Yamuna River, New Delhi, offering prayers to the sun.",
    "keywords": [
      "sharks",
      "photography",
      "2024",
      "special",
      "nature",
      "leopards",
      "animals",
      "animal",
      "spiders",
      "awards",
      "offering",
      "mention",
      "infocus",
      "conservation",
      "worlds",
      "winner"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/7fa0/live/3e9c7860-f10f-11ef-8c03-7dfdbeeb2526.jpg"
  },
  "https://www.bbc.com/news/articles/c78xp7e47l5o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c78xp7e47l5o",
    "date": "2025-02-14",
    "time": "00:00:00",
    "title": "Harris cat reunited with owners five years after going missing",
    "body": "Cat reunited with owners years after going missing\n\n14 February 2025 Share Save Etta May Olley BBC Naidheachdan Share Save\n\nBBC Flora vanished in March 2020\n\nAn island couple have been reunited with their cat after it went missing for five years. Kathleen and Asa Harrison adopted Flora, the offspring of a feral cat, when she was a kitten. She quickly settled into life in Strond, Harris, with the Harrisons' dogs Cooper and Mist. Flora vanished in March 2020 and Kathleen feared she was gone for good until she turned up last month - 11 miles away in Miabhag nam Bàgh.\n\nAsa and Kathleen Harrison hope to find out where Flora has been for the last five years\n\nFlora shares her home with two dogs and two new cats\n\nAfter her travels, the wandering moggy now has the nickname Flora the Explorer, which plays on the name of children's TV cartoon character Dora the Explorer. When she disappeared, the Harrisons initially thought she had jumped into the van of contractors who had been working on their house at the time. But checks of the vehicle and Scaladale, North Harris, where the workers made a stop before returning to Stornoway in Lewis found no sign of her. The couple spent days searching their local area and, over the years, Kathleen has received multiple messages about possible sightings but none turned out to be Flora. On 13 January she was contacted by a cousin about a social media post with an image attached of a cat found in Miabhag nam Bàgh. Kathleen said: \"I looked at the post and it was the first time in all those years that I thought it could be Flora.\"\n\nArriving at the house of the person who found the cat, Kathleen called out Flora's name and the cat ran up to her. A scan of the cat's microchip confirmed it was her. Kathleen said: \"We just couldn't believe it was her. It took a while to sink in. \"She was well looked after by the family that found her.\" Kathleen added: \"The dogs went crazy, in a positive way. \"Mist almost climbed into the cat carrier with her. We think they absolutely recognised her straight away. \"From that moment, it was obvious to us that she's just so happy to be home. \"She's made it.\"\n\nFlora is settling back into life in Strond",
    "clean_body": "cat reunited with owners years after going missing 14 february 2025 share save etta may olley bbc naidheachdan share save bbc flora vanished in march 2020 an island couple have been reunited with their cat after it went missing for five years kathleen and asa harrison adopted flora the offspring of a feral cat when she was a kitten she quickly settled into life in strond harris with the harrisons dogs cooper and mist flora vanished in march 2020 and kathleen feared she was gone for good until she turned up last month 11 miles away in miabhag nam bàgh asa and kathleen harrison hope to find out where flora has been for the last five years flora shares her home with two dogs and two new cats after her travels the wandering moggy now has the nickname flora the explorer which plays on the name of childrens tv cartoon character dora the explorer when she disappeared the harrisons initially thought she had jumped into the van of contractors who had been working on their house at the time but checks of the vehicle and scaladale north harris where the workers made a stop before returning to stornoway in lewis found no sign of her the couple spent days searching their local area and over the years kathleen has received multiple messages about possible sightings but none turned out to be flora on 13 january she was contacted by a cousin about a social media post with an image attached of a cat found in miabhag nam bàgh kathleen said i looked at the post and it was the first time in all those years that i thought it could be flora arriving at the house of the person who found the cat kathleen called out floras name and the cat ran up to her a scan of the cats microchip confirmed it was her kathleen said we just couldnt believe it was her it took a while to sink in she was well looked after by the family that found her kathleen added the dogs went crazy in a positive way mist almost climbed into the cat carrier with her we think they absolutely recognised her straight away from that moment it was obvious to us that shes just so happy to be home shes made it flora is settling back into life in strond",
    "summary": "Cat reunited with owners years after going missing14 February 2025 Share Save Etta May Olley BBC Naidheachdan Share SaveBBC Flora vanished in March 2020An island couple have been reunited with their cat after it went missing for five years.\nKathleen and Asa Harrison adopted Flora, the offspring of a feral cat, when she was a kitten.\nFlora vanished in March 2020 and Kathleen feared she was gone for good until she turned up last month - 11 miles away in Miabhag nam Bàgh.\nArriving at the house of the person who found the cat, Kathleen called out Flora's name and the cat ran up to her.\nKathleen added: \"The dogs went crazy, in a positive way.",
    "keywords": [
      "turned",
      "vanished",
      "went",
      "missing",
      "thought",
      "reunited",
      "flora",
      "dogs",
      "strond",
      "shes",
      "harris",
      "owners",
      "cat",
      "kathleen",
      "going"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3409/live/2e2b3a20-eac0-11ef-869d-59d5dc42f7c7.jpg"
  },
  "https://www.bbc.com/news/articles/cz7ed71g0xwo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cz7ed71g0xwo",
    "date": "2025-02-11",
    "time": "00:00:00",
    "title": "Nigeria phone prices: Data cost hike sparks anger",
    "body": "Huge data price hike sparks anger in Nigeria\n\nNigerians have been living through a long cost-of-living crisis with inflation rates not seen for three decades. Any increase in prices adds to the struggle for many to make ends meet.\n\nA price jump was expected as the telecoms regulatory body had approved an increase, but in an announcement three weeks ago it said it had capped it at 50%. The phone companies wanted to boost their revenue in order to cover rising costs.\n\nMTN - Nigeria's largest operator - trebled the cost of one of its most popular weekly offers. Airtel has also increased its tariffs.\n\nNigerians are expressing outrage over a big jump in the price of mobile data charged by some of the country's major phone networks.\n\nIn response to customer complaints, MTN said on X that the price adjustment was necessary to serve subscribers better.\n\n\"We apologize for any inconvenience caused,” the company added. Airtel is yet to comment.\n\nSubscribers only realised what had happened when they went to buy data over the past few hours.\n\nThe BBC has contacted Airtel for more information on the changes.\n\nMany comments on social media called out the increase saying that it could cut off a lot of people at a time when the economy is in turmoil.\n\nOne target for criticism has been the rise in MTN's 15GB weekly bundle from 2,000 naira ($1.33; £1.08) to 6,000 naira ($3.99).\n\n\"What sort of outrageous increase is that?... Just making sure the masses suffer more,\" one commenter on X said.\n\n\"Triple the amount? The end time is near,\" another wrote.\n\nSubscribers are also complaining that MTN's 1GB bundle has more than doubled in price and Airtel has trebled the cost of a similar offer.\n\nPeople who use Globacom - the third largest network - say they have not been affected by increases.\n\nThe Nigeria Communications Commission, which regulates the telecom companies, is yet to react to the price rises which in some cases appear to exceed the cap that it had recommended.\n\nDigital content creator Mubarak Uniquepikin told the BBC that the tariff hike could have a major impact for businesses that depend on being online.\n\n\"The economy is already comatose and for this to come in now when a lot of people can't rent shops and have taken their business online is bad,\" he said.\n\n\"Many young people already find it difficult to buy data and this would definitely make it worse for them.\"\n\nNigeria is experiencing its worst economic crisis in a generation. A rise in inflation caused by the war in Ukraine was exacerbated when in 2023 President Bola Tinubu's government dropped the fuel subsidy.\n\nThe authorities also followed a policy of currency devaluation.\n\nBoth measures were intended to restore long-term stability, but in the meantime many people have suffered.",
    "clean_body": "huge data price hike sparks anger in nigeria nigerians have been living through a long costofliving crisis with inflation rates not seen for three decades any increase in prices adds to the struggle for many to make ends meet a price jump was expected as the telecoms regulatory body had approved an increase but in an announcement three weeks ago it said it had capped it at 50 the phone companies wanted to boost their revenue in order to cover rising costs mtn nigerias largest operator trebled the cost of one of its most popular weekly offers airtel has also increased its tariffs nigerians are expressing outrage over a big jump in the price of mobile data charged by some of the countrys major phone networks in response to customer complaints mtn said on x that the price adjustment was necessary to serve subscribers better we apologize for any inconvenience caused” the company added airtel is yet to comment subscribers only realised what had happened when they went to buy data over the past few hours the bbc has contacted airtel for more information on the changes many comments on social media called out the increase saying that it could cut off a lot of people at a time when the economy is in turmoil one target for criticism has been the rise in mtns 15gb weekly bundle from 2000 naira 133 £108 to 6000 naira 399 what sort of outrageous increase is that just making sure the masses suffer more one commenter on x said triple the amount the end time is near another wrote subscribers are also complaining that mtns 1gb bundle has more than doubled in price and airtel has trebled the cost of a similar offer people who use globacom the third largest network say they have not been affected by increases the nigeria communications commission which regulates the telecom companies is yet to react to the price rises which in some cases appear to exceed the cap that it had recommended digital content creator mubarak uniquepikin told the bbc that the tariff hike could have a major impact for businesses that depend on being online the economy is already comatose and for this to come in now when a lot of people cant rent shops and have taken their business online is bad he said many young people already find it difficult to buy data and this would definitely make it worse for them nigeria is experiencing its worst economic crisis in a generation a rise in inflation caused by the war in ukraine was exacerbated when in 2023 president bola tinubus government dropped the fuel subsidy the authorities also followed a policy of currency devaluation both measures were intended to restore longterm stability but in the meantime many people have suffered",
    "summary": "Huge data price hike sparks anger in NigeriaNigerians have been living through a long cost-of-living crisis with inflation rates not seen for three decades.\nMTN - Nigeria's largest operator - trebled the cost of one of its most popular weekly offers.\nNigerians are expressing outrage over a big jump in the price of mobile data charged by some of the country's major phone networks.\nIn response to customer complaints, MTN said on X that the price adjustment was necessary to serve subscribers better.\nSubscribers are also complaining that MTN's 1GB bundle has more than doubled in price and Airtel has trebled the cost of a similar offer.",
    "keywords": [
      "nigeria",
      "sparks",
      "increase",
      "weekly",
      "trebled",
      "x",
      "naira",
      "rise",
      "cost",
      "hike",
      "phone",
      "anger",
      "airtel",
      "data",
      "price",
      "prices"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f2db/live/9743e990-e876-11ef-ac6b-8d9a2f70d287.jpg"
  },
  "https://www.bbc.com/news/articles/cglyl6el10xo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cglyl6el10xo",
    "date": "2025-02-17",
    "time": "00:00:00",
    "title": "South Africa Imam Muhsin Hendricks' killing: Police 'hot on heels' of suspects",
    "body": "South Africa police 'hot on heels' of suspects in gay imam killing\n\nMuhsin Hendricks, who came out as gay in 1996, once said that his need to be authentic \"was greater than the fear to die\"\n\nThe imam was well known for his work in creating a safe haven for gay and other marginalised Muslims and his killing shocked the LGBTQ+ community and beyond.\n\nCCTV footage of the incident shows a hooded figure running out of a pick-up truck that was blocking Hendricks' vehicle and then firing shots through the window.\n\nThe 57-year-old was in a car when he was shot dead in broad daylight in the coastal city of Gqeberha on Saturday.\n\nPolice in South Africa are \"hot on the heels\" of the suspects behind the killing of Muhsin Hendricks, dubbed the world's first openly gay imam, Deputy Justice Minister Andries Nel has said.\n\nAn investigation is under way but Nel told the Newzroom Afrika TV channel that it was too early to say whether it was a hate crime.\n\nWithout giving further details, Nel said he was told by Deputy Police Minister Polly Boshielo that officers were tracking down the suspected killers.\n\nPaying tribute to Hendricks, Nel said that he \"was a South African that we can all be proud of, a South African that we can all aspire to be\".\n\nHendricks' work challenged traditional interpretations of Islam, which oppose same-sex relations.\n\nWhile being clear that it did not agree with Hendricks, South Africa's Muslim Judicial Council (MJC), one of the country's main religious bodies, condemned the killing.\n\n\"As members of a democratic, pluralistic society, the MJC remains steadfast in advocating for peaceful coexistence and mutual respect, even amidst divergent views,\" it said.\n\nAnother leading Muslim body - the United Ulama Council of South Africa -condemned \"extrajudicial killings\" and urged people not to jump to conclusions about the motive.\n\nSouth Africa's constitution, adopted after the end of white-minority rule in 1994, was the first in the world to protect people from discrimination because of their sexual orientation and in 2006, became the first country in Africa to legalise same-sex marriage.\n\nBut despite a thriving LGBTQ+ community, gay people still face discrimination and violence. The country also has one of the highest murder rates in the world.\n\nHendricks came out as gay in 1996, which shocked the wider Muslim community in his home city of Cape Town and elsewhere.\n\nThat same year, he founded The Inner Circle, an organisation providing support and a safe space for queer Muslims seeking to reconcile their faith and sexuality before going on to establish the inclusive Masjidul Ghurbaah mosque.\n\nHe was the subject of a documentary in 2022 called The Radical, in which he said about the threats he faced: \"The need to be authentic was greater than the fear to die.\"\n\nHendricks often spoke about the importance of interfaith dialogue and the need to address the mental health issues and trauma faced by LGBTQ+ individuals within religious communities.\n\nHe told the International Lesbian, Gay, Bisexual, Trans and Intersex Association World Conference in Cape Town last year: \"It is important that we stop to look at religion as the enemy.\"\n\nAdditional reporting by Todah Opeyemi.",
    "clean_body": "south africa police hot on heels of suspects in gay imam killing muhsin hendricks who came out as gay in 1996 once said that his need to be authentic was greater than the fear to die the imam was well known for his work in creating a safe haven for gay and other marginalised muslims and his killing shocked the lgbtq community and beyond cctv footage of the incident shows a hooded figure running out of a pickup truck that was blocking hendricks vehicle and then firing shots through the window the 57yearold was in a car when he was shot dead in broad daylight in the coastal city of gqeberha on saturday police in south africa are hot on the heels of the suspects behind the killing of muhsin hendricks dubbed the worlds first openly gay imam deputy justice minister andries nel has said an investigation is under way but nel told the newzroom afrika tv channel that it was too early to say whether it was a hate crime without giving further details nel said he was told by deputy police minister polly boshielo that officers were tracking down the suspected killers paying tribute to hendricks nel said that he was a south african that we can all be proud of a south african that we can all aspire to be hendricks work challenged traditional interpretations of islam which oppose samesex relations while being clear that it did not agree with hendricks south africas muslim judicial council mjc one of the countrys main religious bodies condemned the killing as members of a democratic pluralistic society the mjc remains steadfast in advocating for peaceful coexistence and mutual respect even amidst divergent views it said another leading muslim body the united ulama council of south africa condemned extrajudicial killings and urged people not to jump to conclusions about the motive south africas constitution adopted after the end of whiteminority rule in 1994 was the first in the world to protect people from discrimination because of their sexual orientation and in 2006 became the first country in africa to legalise samesex marriage but despite a thriving lgbtq community gay people still face discrimination and violence the country also has one of the highest murder rates in the world hendricks came out as gay in 1996 which shocked the wider muslim community in his home city of cape town and elsewhere that same year he founded the inner circle an organisation providing support and a safe space for queer muslims seeking to reconcile their faith and sexuality before going on to establish the inclusive masjidul ghurbaah mosque he was the subject of a documentary in 2022 called the radical in which he said about the threats he faced the need to be authentic was greater than the fear to die hendricks often spoke about the importance of interfaith dialogue and the need to address the mental health issues and trauma faced by lgbtq individuals within religious communities he told the international lesbian gay bisexual trans and intersex association world conference in cape town last year it is important that we stop to look at religion as the enemy additional reporting by todah opeyemi",
    "summary": "Police in South Africa are \"hot on the heels\" of the suspects behind the killing of Muhsin Hendricks, dubbed the world's first openly gay imam, Deputy Justice Minister Andries Nel has said.\nAn investigation is under way but Nel told the Newzroom Afrika TV channel that it was too early to say whether it was a hate crime.\nPaying tribute to Hendricks, Nel said that he \"was a South African that we can all be proud of, a South African that we can all aspire to be\".\nWhile being clear that it did not agree with Hendricks, South Africa's Muslim Judicial Council (MJC), one of the country's main religious bodies, condemned the killing.\nAnother leading Muslim body - the United Ulama Council of South Africa -condemned \"extrajudicial killings\" and urged people not to jump to conclusions about the motive.",
    "keywords": [
      "killing",
      "suspects",
      "heels",
      "need",
      "muslim",
      "south",
      "imam",
      "hendricks",
      "told",
      "gay",
      "muhsin",
      "lgbtq",
      "nel",
      "africa",
      "hot"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f530/live/9d977790-ed2f-11ef-a319-fb4e7360c4ec.jpg"
  },
  "https://www.bbc.com/news/articles/cgkjvr7x5x6o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cgkjvr7x5x6o",
    "date": "2025-02-16",
    "time": "00:00:00",
    "title": "Audiologists raise concern over headphone use in young people",
    "body": "Are noise-cancelling headphones to blame for young people's hearing problems?\n\n16 February 2025 Share Save Hannah Karpel BBC News, health reporter Share Save\n\nBBC Sophie says her anxiety peaks if she is in a loud environment and not wearing her headphones to limit the noise\n\nWhether it's the echo of beeping tills in a supermarket or the hissing of a coffee machine in your local café, the brain is constantly working to decode hundreds of noises each day. But, for some, those background noises can become so overwhelming that they distract them from recognising voices or alerts. This is the reality for Sophie, a 25-year-old administration assistant from London, who is used to being told she doesn't listen, zones out, or is \"a bit ditsy\". \"Even though I can hear that there are noises going on, I can't listen to where the noise is coming from. I know it's the person's voice, I just can't really compute it quick enough,\" she said. After a hearing test came back normal, Sophie met a private audiologist for further testing. She was eventually diagnosed with auditory processing disorder (APD), a neurological condition where the brain finds it difficult to understand sounds and spoken words. Her audiologist and others in England are now calling for more research into whether the condition is linked to overuse of noise-cancelling headphones.\n\n'Words sound like gibberish'\n\nHaving grown up on a peaceful farm in the countryside, it wasn't until a few years ago when Sophie started university in London that she noticed a change in her hearing - specifically trouble identifying where a sound was coming from. She rarely attended her university lectures in person, instead opting to watch them online and with subtitles. \"All the words sounded like gibberish when I was in the actual lecture, and I was trying to hear,\" she said. It affected her social life too and Sophie would leave bars and restaurants early because of the \"overwhelming noise\".\n\nGetty Images Classrooms can echo sound and be full of noises like clicking pens, typing and whispering which make listening to a teacher difficult for people with auditory processing disorder\n\nThe cause of Sophie's APD diagnosis is unknown, but her audiologist believes the overuse of noise-cancelling headphones, which Sophie wears for up to five hours a day, could have a part to play. Other audiologists agree, saying more research is needed into the potential effects of their prolonged use. Five NHS audiology departments have told the BBC that there has been an increase in the number of young people referred to them from GPs with hearing issues - only to find their hearing is normal when tested and it is their ability to process sound that is struggling. APD is more common in neurodivergent people, those who have suffered from a brain injury or had a middle-ear infection as a child. However, more patients with APD are presenting outside of those categories, leaving audiologists to question if external factors, such as noise-cancelling headphones, are contributing.\n\nHearing vs listening\n\nRenee Almeida, an adult audiology clinical lead at Imperial College Healthcare NHS Trust, says it is important to hear a diversity of sounds so the brain can decide what is important to focus on. Her team has seen an increase in the amount of young people referred for hearing services in the last year. She said: \"There is a difference between hearing and listening. We can see that listening skills are suffering.\" Noise-cancelling headphones do have their benefits, particularly for long-term ear health where their soundproofing feature can prevent high frequency and loud noise from reaching and damaging the ear - even while listening to music. Lisa Barber, technology editor at Which?, said the devices had \"exploded in popularity\" in recent years. But the level of transparency can vary from model to model. \"Some simply offer passive noise cancelling, where the acoustic seal between the headphones and your ears reduces nearby noise,\" she said. Others have a transparency mode that allows you to hear partial background noise.\n\nA false reality?\n\nBut Claire Benton, vice-president of the British Academy of Audiology, suggests that by blocking everyday sounds such as cars beeping, there is a possibility the brain can \"forget\" to filter out the noise. \"You have almost created this false environment by wearing those headphones of only listening to what you want to listen to. You are not having to work at it,\" she said. \"Those more complex, high-level listening skills in your brain only really finish developing towards your late teens. So, if you have only been wearing noise-cancelling headphones and been in this false world for your late teens then you are slightly delaying your ability to process speech and noise,\" Benton suggests. For those experiencing difficulties with sound processing in England, APD care in the NHS is limited. A UK-wide survey from 2024, distributed by the BAA and ENT UK, the professional body representing ear, nose and throat surgery, found that only 4% of audiologists consider themselves to be well-informed on APD. And, for those who are 16 years and over, the Royal National ENT and Eastman Hospital is the only NHS provider in England offering a full APD assessment and the waiting list is nine months long. Prof Doris-Eva Bamiou, who carries out the assessments there, says this is partially down to the time it takes to diagnose APD. \"It is a costly service because it is not just an audiogram, the test can take up to two hours and it requires additional assessments. In adults I also refer them for a cognitive assessment and in children I may also need to speak to an educational psychologist.\" Particularly after the pandemic, behaviours and engagement with visuals and audio has changed. This comes in part due to new products and technology, as well as increased anxiety in noisy environments after the lockdown.\n\nGetty Images Great Ormond Street Hospital for Children have seen an increase in demand for assessments of children struggling to hear certain words in noisy environments\n\nIt is now common to see people walking outside wearing their noise-cancelling headphones and watching videos online with subtitles, despite perfectly hearing the sound. One YouGov survey showed that 61% of 18-24 year olds prefer to watch TV with the subtitles on. Dr Angela Alexander, audiologist and owner of APD Support, a private organisation, is among the audiologists calling for more research into the impact of noise-cancelling headphones on auditory processing, particularly in children. \"What does the future look like if we don't investigate this link? There are a lot of well-meaning parents and teachers who think the answer to children having problems with noise is to wear ear plugs or having noise-cancelling headphones on.\" Dr Amjad Mahmood, the head of audiology at Great Ormond Street Hospital supported the call for more research. He said there had been a \"significant increase in demand\" for assessments at the hospital's large APD clinic for under-16s. \"especially with difficulties noticed at school\".\n\nTreatment for APD can make a significant positive difference, with some patients able to make a full recovery. So-called \"word in noise\" training exercises on mobile apps have become a popular way of practising pulling speech from background noise. But training can vary and includes practice with auditory discrimination too, such as how to distinguish separate sounds in words like seventy and seventeen, and free and three. Microphones and low-gain hearing aids can also be provided to help the patient in certain situations, such as a meeting or classroom work, but adults outside the education system are not entitled to these products on the NHS. \"Right now I can hear there is a fan above my head but my brain is telling me that is not something I need to worry about,\" says Dr Alexander, describing what is called auditory scene analysis. \"It's the way we identify threats in our environment, so it makes sense to me that there would be an increase in anxiety if a person's brain no longer has those inputs helping tell them what is a concern and what is not.\" To improve this, Dr Alexander suggests reducing headphone use time and using the transparency mode which can amplify the background noise as well as wearing headphones that don't completely occlude or block the ears.\n\nLimited research",
    "clean_body": "are noisecancelling headphones to blame for young peoples hearing problems 16 february 2025 share save hannah karpel bbc news health reporter share save bbc sophie says her anxiety peaks if she is in a loud environment and not wearing her headphones to limit the noise whether its the echo of beeping tills in a supermarket or the hissing of a coffee machine in your local café the brain is constantly working to decode hundreds of noises each day but for some those background noises can become so overwhelming that they distract them from recognising voices or alerts this is the reality for sophie a 25yearold administration assistant from london who is used to being told she doesnt listen zones out or is a bit ditsy even though i can hear that there are noises going on i cant listen to where the noise is coming from i know its the persons voice i just cant really compute it quick enough she said after a hearing test came back normal sophie met a private audiologist for further testing she was eventually diagnosed with auditory processing disorder apd a neurological condition where the brain finds it difficult to understand sounds and spoken words her audiologist and others in england are now calling for more research into whether the condition is linked to overuse of noisecancelling headphones words sound like gibberish having grown up on a peaceful farm in the countryside it wasnt until a few years ago when sophie started university in london that she noticed a change in her hearing specifically trouble identifying where a sound was coming from she rarely attended her university lectures in person instead opting to watch them online and with subtitles all the words sounded like gibberish when i was in the actual lecture and i was trying to hear she said it affected her social life too and sophie would leave bars and restaurants early because of the overwhelming noise getty images classrooms can echo sound and be full of noises like clicking pens typing and whispering which make listening to a teacher difficult for people with auditory processing disorder the cause of sophies apd diagnosis is unknown but her audiologist believes the overuse of noisecancelling headphones which sophie wears for up to five hours a day could have a part to play other audiologists agree saying more research is needed into the potential effects of their prolonged use five nhs audiology departments have told the bbc that there has been an increase in the number of young people referred to them from gps with hearing issues only to find their hearing is normal when tested and it is their ability to process sound that is struggling apd is more common in neurodivergent people those who have suffered from a brain injury or had a middleear infection as a child however more patients with apd are presenting outside of those categories leaving audiologists to question if external factors such as noisecancelling headphones are contributing hearing vs listening renee almeida an adult audiology clinical lead at imperial college healthcare nhs trust says it is important to hear a diversity of sounds so the brain can decide what is important to focus on her team has seen an increase in the amount of young people referred for hearing services in the last year she said there is a difference between hearing and listening we can see that listening skills are suffering noisecancelling headphones do have their benefits particularly for longterm ear health where their soundproofing feature can prevent high frequency and loud noise from reaching and damaging the ear even while listening to music lisa barber technology editor at which said the devices had exploded in popularity in recent years but the level of transparency can vary from model to model some simply offer passive noise cancelling where the acoustic seal between the headphones and your ears reduces nearby noise she said others have a transparency mode that allows you to hear partial background noise a false reality but claire benton vicepresident of the british academy of audiology suggests that by blocking everyday sounds such as cars beeping there is a possibility the brain can forget to filter out the noise you have almost created this false environment by wearing those headphones of only listening to what you want to listen to you are not having to work at it she said those more complex highlevel listening skills in your brain only really finish developing towards your late teens so if you have only been wearing noisecancelling headphones and been in this false world for your late teens then you are slightly delaying your ability to process speech and noise benton suggests for those experiencing difficulties with sound processing in england apd care in the nhs is limited a ukwide survey from 2024 distributed by the baa and ent uk the professional body representing ear nose and throat surgery found that only 4 of audiologists consider themselves to be wellinformed on apd and for those who are 16 years and over the royal national ent and eastman hospital is the only nhs provider in england offering a full apd assessment and the waiting list is nine months long prof doriseva bamiou who carries out the assessments there says this is partially down to the time it takes to diagnose apd it is a costly service because it is not just an audiogram the test can take up to two hours and it requires additional assessments in adults i also refer them for a cognitive assessment and in children i may also need to speak to an educational psychologist particularly after the pandemic behaviours and engagement with visuals and audio has changed this comes in part due to new products and technology as well as increased anxiety in noisy environments after the lockdown getty images great ormond street hospital for children have seen an increase in demand for assessments of children struggling to hear certain words in noisy environments it is now common to see people walking outside wearing their noisecancelling headphones and watching videos online with subtitles despite perfectly hearing the sound one yougov survey showed that 61 of 1824 year olds prefer to watch tv with the subtitles on dr angela alexander audiologist and owner of apd support a private organisation is among the audiologists calling for more research into the impact of noisecancelling headphones on auditory processing particularly in children what does the future look like if we dont investigate this link there are a lot of wellmeaning parents and teachers who think the answer to children having problems with noise is to wear ear plugs or having noisecancelling headphones on dr amjad mahmood the head of audiology at great ormond street hospital supported the call for more research he said there had been a significant increase in demand for assessments at the hospitals large apd clinic for under16s especially with difficulties noticed at school treatment for apd can make a significant positive difference with some patients able to make a full recovery socalled word in noise training exercises on mobile apps have become a popular way of practising pulling speech from background noise but training can vary and includes practice with auditory discrimination too such as how to distinguish separate sounds in words like seventy and seventeen and free and three microphones and lowgain hearing aids can also be provided to help the patient in certain situations such as a meeting or classroom work but adults outside the education system are not entitled to these products on the nhs right now i can hear there is a fan above my head but my brain is telling me that is not something i need to worry about says dr alexander describing what is called auditory scene analysis its the way we identify threats in our environment so it makes sense to me that there would be an increase in anxiety if a persons brain no longer has those inputs helping tell them what is a concern and what is not to improve this dr alexander suggests reducing headphone use time and using the transparency mode which can amplify the background noise as well as wearing headphones that dont completely occlude or block the ears limited research",
    "summary": "Are noise-cancelling headphones to blame for young people's hearing problems?\nHer audiologist and others in England are now calling for more research into whether the condition is linked to overuse of noise-cancelling headphones.\nHowever, more patients with APD are presenting outside of those categories, leaving audiologists to question if external factors, such as noise-cancelling headphones, are contributing.\nHer team has seen an increase in the amount of young people referred for hearing services in the last year.\nDr Angela Alexander, audiologist and owner of APD Support, a private organisation, is among the audiologists calling for more research into the impact of noise-cancelling headphones on auditory processing, particularly in children.",
    "keywords": [
      "listening",
      "headphone",
      "concern",
      "raise",
      "sophie",
      "apd",
      "hearing",
      "sound",
      "audiologists",
      "noise",
      "noisecancelling",
      "young",
      "hear",
      "brain",
      "headphones"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/1092/live/aa5c7ed0-ea4b-11ef-bc49-67f493a63bc5.jpg"
  },
  "https://www.bbc.com/news/articles/cly5x0vpen8o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cly5x0vpen8o",
    "date": "2025-02-11",
    "time": "00:00:00",
    "title": "Cryptocurrency: Central African Republic leader launches meme-coin 'experiment'",
    "body": "CAR leader launches meme-coin 'experiment'\n\nIn 2022, CAR became the world's second country after El Salvador to adopt the cryptocurrency Bitcoin as legal tender.\n\nTouadéra announced the launch, known as $CAR, on his X account over the weekend and on Monday said it had been a \"success\". But the value of the coin had a significant price drop of up to 90%, according to specialist websites.\n\nMeme-coins are used to build popularity for a viral internet trend or movement and fans are inspired to collect and give them value, but they are extremely volatile investments.\n\nCentral African Republic President Faustin-Archange Touadéra has launched a meme-coin in a bid to raise the profile of the country, which is one of the world's poorest.\n\nThat initiative - launched under the name Sango - does not appear to have been as successful as planned, and its website no longer works.\n\nIt was seen as an easier way to attract investors to the country's mining and other industries using Bitcoin. The country has rich mineral deposits, including gold and diamonds.\n\nForeign investors could also obtain citizenship for $60,000 worth of crypto, although the plan was later ruled unconstitutional by the country's top court.\n\nTouadéra described this week's launch of the meme-coin as an \"experiment\" of something that \"can unite people, support national development, and put the [country] on the world stage in a unique way\".\n\nBut some expressed fears that it could have been a scam.\n\nOn Monday, Touadéra thanked those who believed in his vision.\n\nHe shared a video of a high school which he said had been deteriorating rapidly, saying the meme-coin would help support its \"rebuilding and furnishing\" and give \"students a chance for a better future\".\n\nDespite its potential, CAR remains one of the poorest countries - a situation complicated by a civil war which has devastated much of the country.\n\nMeme-coins have often been criticised for their speculative nature, where users create or buy them in the hope that their value will rise and make money quickly - but many end up losing money on them.\n\nJust before his inauguration last month, US President Donald Trump launched his own meme-coin whose value quickly soared, and which reportedly raised billions of dollars for him. The New York Times has reported that it is now worth a quarter of its highest value.",
    "clean_body": "car leader launches memecoin experiment in 2022 car became the worlds second country after el salvador to adopt the cryptocurrency bitcoin as legal tender touadéra announced the launch known as car on his x account over the weekend and on monday said it had been a success but the value of the coin had a significant price drop of up to 90 according to specialist websites memecoins are used to build popularity for a viral internet trend or movement and fans are inspired to collect and give them value but they are extremely volatile investments central african republic president faustinarchange touadéra has launched a memecoin in a bid to raise the profile of the country which is one of the worlds poorest that initiative launched under the name sango does not appear to have been as successful as planned and its website no longer works it was seen as an easier way to attract investors to the countrys mining and other industries using bitcoin the country has rich mineral deposits including gold and diamonds foreign investors could also obtain citizenship for 60000 worth of crypto although the plan was later ruled unconstitutional by the countrys top court touadéra described this weeks launch of the memecoin as an experiment of something that can unite people support national development and put the country on the world stage in a unique way but some expressed fears that it could have been a scam on monday touadéra thanked those who believed in his vision he shared a video of a high school which he said had been deteriorating rapidly saying the memecoin would help support its rebuilding and furnishing and give students a chance for a better future despite its potential car remains one of the poorest countries a situation complicated by a civil war which has devastated much of the country memecoins have often been criticised for their speculative nature where users create or buy them in the hope that their value will rise and make money quickly but many end up losing money on them just before his inauguration last month us president donald trump launched his own memecoin whose value quickly soared and which reportedly raised billions of dollars for him the new york times has reported that it is now worth a quarter of its highest value",
    "summary": "CAR leader launches meme-coin 'experiment'In 2022, CAR became the world's second country after El Salvador to adopt the cryptocurrency Bitcoin as legal tender.\nTouadéra announced the launch, known as $CAR, on his X account over the weekend and on Monday said it had been a \"success\".\nBut the value of the coin had a significant price drop of up to 90%, according to specialist websites.\nCentral African Republic President Faustin-Archange Touadéra has launched a meme-coin in a bid to raise the profile of the country, which is one of the world's poorest.\nJust before his inauguration last month, US President Donald Trump launched his own meme-coin whose value quickly soared, and which reportedly raised billions of dollars for him.",
    "keywords": [
      "republic",
      "leader",
      "launched",
      "value",
      "worlds",
      "quickly",
      "worth",
      "touadéra",
      "support",
      "african",
      "country",
      "car",
      "cryptocurrency",
      "launches",
      "memecoin",
      "central",
      "experiment"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/238c/live/b22abb20-e84f-11ef-b829-9960cdd7a1e8.jpg"
  },
  "https://www.bbc.com/news/live/crr0gngkjrvt": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/crr0gngkjrvt",
    "date": "2025-02-17",
    "time": "00:00:00",
    "title": "Starmer says ‘there must be a US backstop’ for any Ukraine peace deal",
    "body": "Starmer's advisers say he's well placed to be bridge between US and EU\n\nJoe Pike\n\nPolitical correspondent\n\nToday’s meeting in Paris overran by 90 minutes. We have not been told why.\n\nPresident Macron decided the summit should be ‘leaders only’ throughout - no diplomats or advisers were allowed in the room.\n\nI’m told Sir Keir Starmer offered to host a follow up meeting of European leaders. This is expected after he travels to Washington next week to meet US President Trump.\n\nThe UK prime minister is keen to play a leadership role in Europe’s response to Ukraine.\n\nHis advisers say he is perfectly placed to act as a bridge between the US and EU. It is unclear what Donald Trump thinks of that proposal.",
    "clean_body": "starmers advisers say hes well placed to be bridge between us and eu joe pike political correspondent today’s meeting in paris overran by 90 minutes we have not been told why president macron decided the summit should be ‘leaders only’ throughout no diplomats or advisers were allowed in the room i’m told sir keir starmer offered to host a follow up meeting of european leaders this is expected after he travels to washington next week to meet us president trump the uk prime minister is keen to play a leadership role in europe’s response to ukraine his advisers say he is perfectly placed to act as a bridge between the us and eu it is unclear what donald trump thinks of that proposal",
    "summary": "Starmer's advisers say he's well placed to be bridge between US and EUJoe PikePolitical correspondentToday’s meeting in Paris overran by 90 minutes.\nPresident Macron decided the summit should be ‘leaders only’ throughout - no diplomats or advisers were allowed in the room.\nI’m told Sir Keir Starmer offered to host a follow up meeting of European leaders.\nThis is expected after he travels to Washington next week to meet US President Trump.\nHis advisers say he is perfectly placed to act as a bridge between the US and EU.",
    "keywords": [
      "placed",
      "bridge",
      "week",
      "peace",
      "whypresident",
      "meeting",
      "told",
      "washington",
      "backstop",
      "starmer",
      "leaders",
      "say",
      "deal",
      "ukraine",
      "advisers"
    ],
    "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png"
  }
}