{
  "https://www.bbc.com/news/articles/crmjk9mjnwmo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/crmjk9mjnwmo",
    "date": "2025-03-03",
    "time": "00:00:00",
    "title": "Pope Francis 'alert' after respiratory failure, Vatican says",
    "body": "Pope Francis 'alert' after respiratory failure\n\n3 March 2025 Share Save Sarah Rainsford BBC News Reporting from Rome Jacqueline Howard BBC News Reporting from London Share Save\n\nReuters\n\nPope Francis is alert after suffering two episodes of \"acute respiratory failure\" on Monday afternoon, the Vatican has said. Doctors were forced to intervene to clear mucus from the Pope's lungs, an update from the Holy See said, though it said he was alert throughout. The 88-year-old pontiff has resumed the use of an oxygen mask and ventilator to assist his breathing, but remains \"alert, focused and cooperative\", the Vatican said. This is now the third serious downturn since the 88-year-old pontiff was admitted to hospital 18 days ago with pneumonia.\n\nOn Friday, Pope Francis suffered an \"isolated\" breathing crisis involving vomiting, the Vatican said. Updates from the Holy See reported that he responded well to oxygen therapy, with Vatican officials saying on Sunday the Pope no longer required \"non-invasive mechanical ventilation, only high-flow oxygen therapy\". Following Monday's episodes, Pope Francis has resumed that mechanical ventilation. His illness has meant that Pope Francis has been unable to deliver his traditional Angelus prayer in person for three weeks in a row, with the Vatican publishing his written comments instead. Officials said the text, sent from his hospital room in Rome, had been written \"in the past few days\". In it, the Pope thanked people for their prayers and thanked his medical team for their care. He will also miss the procession and mass this Wednesday that mark the first day of Lent, the six-week period leading to Easter. Hundreds of Catholics gathered outside in St Peter's Square on Monday for an eighth evening to pray for the Pope's health, many carrying rosary beads as they headed across the cobbles towards the Basilica.\n\nThe crowd, a mixture of priests and nuns based in Rome and Catholic pilgrims here for a Jubilee year, were led by an American cardinal. \"I come every night to pray, but this night I am pretty worried,\" Javier, a Romanian priest, voiced the feelings of many on the square. \"We still have hope, but it doesn't look good.\" \"It looks bad, and that's a shame because we really like Francis,\" Patricia, a Spanish catholic from Toledo, told the BBC. She was following the prayers with her husband and young daughter. \"He's really opened the doors of the church to many, like LGBT people. I think they will look for a more conservative pope next, to stop the change.\" Catholics have also been visiting the Gemelli hospital in Rome to pray for him - hoping he might come to the window, as has happened in the past. But although the Vatican recently described the Pope's condition as stable, he remains too sick even to greet the crowd below.\n\nReuters",
    "clean_body": "pope francis alert after respiratory failure 3 march 2025 share save sarah rainsford bbc news reporting from rome jacqueline howard bbc news reporting from london share save reuters pope francis is alert after suffering two episodes of acute respiratory failure on monday afternoon the vatican has said doctors were forced to intervene to clear mucus from the popes lungs an update from the holy see said though it said he was alert throughout the 88yearold pontiff has resumed the use of an oxygen mask and ventilator to assist his breathing but remains alert focused and cooperative the vatican said this is now the third serious downturn since the 88yearold pontiff was admitted to hospital 18 days ago with pneumonia on friday pope francis suffered an isolated breathing crisis involving vomiting the vatican said updates from the holy see reported that he responded well to oxygen therapy with vatican officials saying on sunday the pope no longer required noninvasive mechanical ventilation only highflow oxygen therapy following mondays episodes pope francis has resumed that mechanical ventilation his illness has meant that pope francis has been unable to deliver his traditional angelus prayer in person for three weeks in a row with the vatican publishing his written comments instead officials said the text sent from his hospital room in rome had been written in the past few days in it the pope thanked people for their prayers and thanked his medical team for their care he will also miss the procession and mass this wednesday that mark the first day of lent the sixweek period leading to easter hundreds of catholics gathered outside in st peters square on monday for an eighth evening to pray for the popes health many carrying rosary beads as they headed across the cobbles towards the basilica the crowd a mixture of priests and nuns based in rome and catholic pilgrims here for a jubilee year were led by an american cardinal i come every night to pray but this night i am pretty worried javier a romanian priest voiced the feelings of many on the square we still have hope but it doesnt look good it looks bad and thats a shame because we really like francis patricia a spanish catholic from toledo told the bbc she was following the prayers with her husband and young daughter hes really opened the doors of the church to many like lgbt people i think they will look for a more conservative pope next to stop the change catholics have also been visiting the gemelli hospital in rome to pray for him hoping he might come to the window as has happened in the past but although the vatican recently described the popes condition as stable he remains too sick even to greet the crowd below reuters",
    "summary": "Pope Francis 'alert' after respiratory failure3 March 2025 Share Save Sarah Rainsford BBC News Reporting from Rome Jacqueline Howard BBC News Reporting from London Share SaveReutersPope Francis is alert after suffering two episodes of \"acute respiratory failure\" on Monday afternoon, the Vatican has said.\nThe 88-year-old pontiff has resumed the use of an oxygen mask and ventilator to assist his breathing, but remains \"alert, focused and cooperative\", the Vatican said.\nOn Friday, Pope Francis suffered an \"isolated\" breathing crisis involving vomiting, the Vatican said.\nFollowing Monday's episodes, Pope Francis has resumed that mechanical ventilation.\nHis illness has meant that Pope Francis has been unable to deliver his traditional Angelus prayer in person for three weeks in a row, with the Vatican publishing his written comments instead.",
    "keywords": [
      "rome",
      "popes",
      "vatican",
      "oxygen",
      "hospital",
      "bbc",
      "failure",
      "pray",
      "alert",
      "pope",
      "respiratory",
      "francis"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/e638/live/9979a1e0-f867-11ef-8c03-7dfdbeeb2526.jpg"
  },
  "https://www.bbc.com/news/articles/c4gmggp2y99o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c4gmggp2y99o",
    "date": "2025-03-29",
    "time": "00:00:00",
    "title": "Utah becomes first US state to ban fluoride in its water",
    "body": "Utah becomes first US state to ban fluoride in its water\n\nUtah's move to remove the mineral has been criticised by experts, who worry it will have consequences for oral health, especially for children.\n\nFluoride has been added to US drinking water since 1945 to prevent cavities.\n\nGovernor Spencer Cox signed the ban into law this week, which will go into effect on 7 May. Other states, including Florida and Ohio, are weighing similar legislation.\n\nUtah has become the first US state to ban the use of fluoride in its public water, following concerns raised by health secretary Robert F Kennedy that the mineral poses potential health risks.\n\nThe bill, signed by Cox on Thursday, prohibits communities from adding fluoride to their public water supplies.\n\nThe law does not mention any public health concerns related to the mineral, but Republican state lawmaker Stephanie Gricius - who introduced the bill in the state legislature - has argued that there is research suggesting fluoride could have possible cognitive effects in children.\n\nGricius has said that her bill would give citizens a choice whether they want to consume fluoride or not.\n\nThis concern over fluoride was previously raised by Kennedy, the US health secretary, who said in November that \"the Trump White House will advise all US water systems to remove fluoride from public water\".\n\nHe alleged the chemical found in toothpaste and regularly used by dentists \"is an industrial waste associated with arthritis, bone fractures, bone cancer, IQ loss, neurodevelopmental disorders, and thyroid disease\".\n\nMost public health experts have rejected these claims and alleged that Kennedy had cited data from studies conducted in countries with far higher levels of fluoride in their water systems than the US has.\n\nThe American Dental Association sharply criticised Utah for its decision, saying that it shows \"wanton disregard for the oral health and well-being of their constituents\".\n\n\"It is disheartening to see that a proven, public health policy, which exists for the greater good of an entire community's oral health, has been dismantled based on distorted pseudoscience,\" the association's president, Denver dentist Brett Kessler, said in a statement.\n\nMany public health groups, including the American Academy of Pediatrics and the Centers for Disease Control and Prevention, have long supported adding small amounts of fluoride to drinking water.\n\nThe US Public Health Service reduced the amount of fluoride it recommended adding to water in 2015, but the federal government has encouraged states since the 1960s to add small amounts of the chemical to water to help prevent cavities and aid oral health.\n\nRecent court rulings have led to the reduction of fluoride in US water, and some experts have questioned the continued need for it in water systems given its wide availability in toothpaste and other dental products.\n\nMost of western Europe does not add fluoride to its water. In England, about one in 10 people has fluoridated drinking water, though a programme has since been introduced to fluoridate water for 1.6 million people in north-east England.\n\nBy contrast, around 63% of the US population have fluoridated water.\n\nExperts who support putting fluoride in water says studies show that community water fluoridation prevents at least 25% of tooth decay in children and adults.\n\n\"The scientific weight of sound evidence around the benefit of community water fluoridation is clear and compelling,\" the American Dental Association said in October of last year.\n\nProf Avijit Banerjee, chair of cariology and operative dentistry at King's College London, previously told the BBC that \"the potential harmful effects of fluoride cited have not been associated with the very low levels of fluoride used in water fluoridation programmes\".",
    "clean_body": "utah becomes first us state to ban fluoride in its water utahs move to remove the mineral has been criticised by experts who worry it will have consequences for oral health especially for children fluoride has been added to us drinking water since 1945 to prevent cavities governor spencer cox signed the ban into law this week which will go into effect on 7 may other states including florida and ohio are weighing similar legislation utah has become the first us state to ban the use of fluoride in its public water following concerns raised by health secretary robert f kennedy that the mineral poses potential health risks the bill signed by cox on thursday prohibits communities from adding fluoride to their public water supplies the law does not mention any public health concerns related to the mineral but republican state lawmaker stephanie gricius who introduced the bill in the state legislature has argued that there is research suggesting fluoride could have possible cognitive effects in children gricius has said that her bill would give citizens a choice whether they want to consume fluoride or not this concern over fluoride was previously raised by kennedy the us health secretary who said in november that the trump white house will advise all us water systems to remove fluoride from public water he alleged the chemical found in toothpaste and regularly used by dentists is an industrial waste associated with arthritis bone fractures bone cancer iq loss neurodevelopmental disorders and thyroid disease most public health experts have rejected these claims and alleged that kennedy had cited data from studies conducted in countries with far higher levels of fluoride in their water systems than the us has the american dental association sharply criticised utah for its decision saying that it shows wanton disregard for the oral health and wellbeing of their constituents it is disheartening to see that a proven public health policy which exists for the greater good of an entire communitys oral health has been dismantled based on distorted pseudoscience the associations president denver dentist brett kessler said in a statement many public health groups including the american academy of pediatrics and the centers for disease control and prevention have long supported adding small amounts of fluoride to drinking water the us public health service reduced the amount of fluoride it recommended adding to water in 2015 but the federal government has encouraged states since the 1960s to add small amounts of the chemical to water to help prevent cavities and aid oral health recent court rulings have led to the reduction of fluoride in us water and some experts have questioned the continued need for it in water systems given its wide availability in toothpaste and other dental products most of western europe does not add fluoride to its water in england about one in 10 people has fluoridated drinking water though a programme has since been introduced to fluoridate water for 16 million people in northeast england by contrast around 63 of the us population have fluoridated water experts who support putting fluoride in water says studies show that community water fluoridation prevents at least 25 of tooth decay in children and adults the scientific weight of sound evidence around the benefit of community water fluoridation is clear and compelling the american dental association said in october of last year prof avijit banerjee chair of cariology and operative dentistry at kings college london previously told the bbc that the potential harmful effects of fluoride cited have not been associated with the very low levels of fluoride used in water fluoridation programmes",
    "summary": "Utah becomes first US state to ban fluoride in its waterUtah's move to remove the mineral has been criticised by experts, who worry it will have consequences for oral health, especially for children.\nUtah has become the first US state to ban the use of fluoride in its public water, following concerns raised by health secretary Robert F Kennedy that the mineral poses potential health risks.\nThe bill, signed by Cox on Thursday, prohibits communities from adding fluoride to their public water supplies.\nThis concern over fluoride was previously raised by Kennedy, the US health secretary, who said in November that \"the Trump White House will advise all US water systems to remove fluoride from public water\".\nExperts who support putting fluoride in water says studies show that community water fluoridation prevents at least 25% of tooth decay in children and adults.",
    "keywords": [
      "health",
      "kennedy",
      "state",
      "mineral",
      "ban",
      "systems",
      "public",
      "fluoridation",
      "fluoride",
      "oral",
      "water",
      "utah"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/1822/live/f5b44300-0cb9-11f0-bffd-fb98b4c4f9e8.jpg"
  },
  "https://www.bbc.com/news/articles/cp3y3vdvdggo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cp3y3vdvdggo",
    "date": "2025-03-29",
    "time": "00:00:00",
    "title": "Greenland: JD Vance takes ominous message to Danish territory",
    "body": "JD Vance's ominous pitch to Greenland\n\n29 March 2025 Share Save Andrew Harding Reporting from Nuuk, Greenland Share Save\n\nReuters A cultural tour of Greenland by JD Vance's wife Usha has been cancelled\n\nA green shimmer, like a curtain of light being drawn across the night sky, formed beside the impossibly bright stars above Nuuk late on Friday evening. The appearance of the spectacular northern lights – a common wonder in these parts – seemed to mark the end of a hugely significant day in the arctic, one that brought icebound Greenland's hopes and challenges into the sharpest relief. It was a day in which an acquisitive foreign power had sent an uninvited delegation to the world's largest island with an uncomfortable message. On a brief visit to a remote US military base in the far north of Greenland, US Vice-President JD Vance may have tried at times to soften his boss's stated aim of simply annexing the autonomous Danish territory. \"We do not think that military force is ever going to be necessary,\" Vance said, perhaps attempting to sound reassuring. But the vice-president's overarching message remained stark and intimidating: the world, the climate, and the Arctic region are changing fast, and Greenland needs to wake up to threats posed by an expansionist China; long-standing Western security partnerships have run their course; the only way the island can protect itself, its values and its mineral wealth is by abandoning weak and miserly Danish overlords and turning instead to the muscular and protective embrace of the US.\n\n\"We need to wake up from a failed, 40-year consensus that said that we could ignore the encroachment of powerful countries as they expand their ambitions,\" Vance told US troops at America's Pituffik military base. \"We can't just bury our head in the sand - or, in Greenland, bury our head in the snow - and pretend that the Chinese are not interested in this very large landmass.\" If you look at a map of the world that has the north pole at its centre, rather than the equator, it is easy to see how Greenland suddenly switches from being an easily overlooked smudge of uninhabited territory and into a key strategic landmass. It is at the heart of what many analysts now accept as an emerging power struggle between China, the US, and Russia, for control of the arctic, its minerals and its shipping lanes. But the speed and contempt with which the Trump White House has rejected its traditional reliance on Western allies – Nato in particular – has left its partners bewildered. \"Not justifiable,\" was the bristling response of Danish Prime Minister Mette Frederiksen after hearing Vance attack her government as he stood on its sovereign territory.\n\nGetty Images\n\n'Like a threat'\n\nBut 1,500km (930 miles) south of the Pituffik base, in Greenland's capital, Nuuk, the American story vied for attention with a very different local event on Friday. \"We will prevail,\" a smiling crowd sang, at a ceremony to celebrate the formation of a new coalition government for Greenland. The mood felt mostly joyful and communal, with people locking arms and swaying gently as a band played inside the town's house of culture. It was a powerful reminder of the shared values that bind Greenland's tiny, and overwhelmingly native Inuit population together - the need for consensus and co-operation in an often hostile natural climate, the desire to protect and celebrate Inuit culture and the wish to be respected by outsiders, be they from familiar but distant Denmark or marginally closer America. \"There are many ways to say things. But I think the way [Trump] is saying it is not the way. It's like a threat,\" said Lisbeth Karline Poulsen, 43, a local artist attending the ceremony. Her reaction appeared to capture the broader mood here - a recent poll showed just 6% of the population support the idea of being part of the US.\n\nThe journey to independence\n\nUnder its new government, and with overwhelming public support, Greenland is beginning a slow, very cautious move towards full independence from Denmark. It's a process that will likely take many years, and which will involve lengthy dialogue with both Copenhagen and Washington. After all, Greenlanders well understand that their economy needs to be far more developed if their bid for independence is to stand any realistic chance of success. But they need to balance that development against realistic fears of exploitation by powerful outside commercial forces. Which brings us to the fundamental confusion, in Greenland and beyond, about the Trump administration's approach towards their territory.\n\nWhat does America want?",
    "clean_body": "jd vances ominous pitch to greenland 29 march 2025 share save andrew harding reporting from nuuk greenland share save reuters a cultural tour of greenland by jd vances wife usha has been cancelled a green shimmer like a curtain of light being drawn across the night sky formed beside the impossibly bright stars above nuuk late on friday evening the appearance of the spectacular northern lights – a common wonder in these parts – seemed to mark the end of a hugely significant day in the arctic one that brought icebound greenlands hopes and challenges into the sharpest relief it was a day in which an acquisitive foreign power had sent an uninvited delegation to the worlds largest island with an uncomfortable message on a brief visit to a remote us military base in the far north of greenland us vicepresident jd vance may have tried at times to soften his bosss stated aim of simply annexing the autonomous danish territory we do not think that military force is ever going to be necessary vance said perhaps attempting to sound reassuring but the vicepresidents overarching message remained stark and intimidating the world the climate and the arctic region are changing fast and greenland needs to wake up to threats posed by an expansionist china longstanding western security partnerships have run their course the only way the island can protect itself its values and its mineral wealth is by abandoning weak and miserly danish overlords and turning instead to the muscular and protective embrace of the us we need to wake up from a failed 40year consensus that said that we could ignore the encroachment of powerful countries as they expand their ambitions vance told us troops at americas pituffik military base we cant just bury our head in the sand or in greenland bury our head in the snow and pretend that the chinese are not interested in this very large landmass if you look at a map of the world that has the north pole at its centre rather than the equator it is easy to see how greenland suddenly switches from being an easily overlooked smudge of uninhabited territory and into a key strategic landmass it is at the heart of what many analysts now accept as an emerging power struggle between china the us and russia for control of the arctic its minerals and its shipping lanes but the speed and contempt with which the trump white house has rejected its traditional reliance on western allies – nato in particular – has left its partners bewildered not justifiable was the bristling response of danish prime minister mette frederiksen after hearing vance attack her government as he stood on its sovereign territory getty images like a threat but 1500km 930 miles south of the pituffik base in greenlands capital nuuk the american story vied for attention with a very different local event on friday we will prevail a smiling crowd sang at a ceremony to celebrate the formation of a new coalition government for greenland the mood felt mostly joyful and communal with people locking arms and swaying gently as a band played inside the towns house of culture it was a powerful reminder of the shared values that bind greenlands tiny and overwhelmingly native inuit population together the need for consensus and cooperation in an often hostile natural climate the desire to protect and celebrate inuit culture and the wish to be respected by outsiders be they from familiar but distant denmark or marginally closer america there are many ways to say things but i think the way trump is saying it is not the way its like a threat said lisbeth karline poulsen 43 a local artist attending the ceremony her reaction appeared to capture the broader mood here a recent poll showed just 6 of the population support the idea of being part of the us the journey to independence under its new government and with overwhelming public support greenland is beginning a slow very cautious move towards full independence from denmark its a process that will likely take many years and which will involve lengthy dialogue with both copenhagen and washington after all greenlanders well understand that their economy needs to be far more developed if their bid for independence is to stand any realistic chance of success but they need to balance that development against realistic fears of exploitation by powerful outside commercial forces which brings us to the fundamental confusion in greenland and beyond about the trump administrations approach towards their territory what does america want",
    "summary": "On a brief visit to a remote US military base in the far north of Greenland, US Vice-President JD Vance may have tried at times to soften his boss's stated aim of simply annexing the autonomous Danish territory.\n\"We do not think that military force is ever going to be necessary,\" Vance said, perhaps attempting to sound reassuring.\n\"Not justifiable,\" was the bristling response of Danish Prime Minister Mette Frederiksen after hearing Vance attack her government as he stood on its sovereign territory.\nBut I think the way [Trump] is saying it is not the way.\nWhich brings us to the fundamental confusion, in Greenland and beyond, about the Trump administration's approach towards their territory.",
    "keywords": [
      "takes",
      "way",
      "trump",
      "greenlands",
      "powerful",
      "danish",
      "need",
      "vance",
      "greenland",
      "territory",
      "jd",
      "message",
      "nuuk",
      "ominous",
      "military"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4c97/live/bb5936e0-0cb7-11f0-b234-07dc7691c360.jpg"
  },
  "https://www.bbc.com/news/live/c0jqjl9vg47t": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/c0jqjl9vg47t",
    "date": "2025-03-17",
    "time": "00:00:00",
    "title": "Kendall unveils crackdown on benefits aimed at saving £5bn a year by 2030",
    "body": "Pip an area where attention is clearly needed\n\nDharshini David\n\nChief economics correspondent\n\nToday's statement will be worrying for the three million working-age people who receive Personal Independence Payment (Pip).\n\nBut with the number of recipients set to rise to over four million by 2030, adding an extra £12bn to welfare spending, the government's clear on the need to curb ballooning costs.\n\nAnd with only 3% of people who are classed as long-term sick returning to employment, this is an area where attention is clearly needed.\n\nBut it is unclear how successful these measures will be in either aim.\n\nWe won't know exactly how much the government hopes each of these measures will save - or the assessment of the independent official forecasters, the OBR, of those estimates until the chancellor's Spring Statement next week. And any estimates are just that - highly uncertain.\n\nPrior attempts to trim welfare bills have proved tricky for many reasons.\n\nAnd that includes the state of the labour market. To get people into work, there have to be jobs.\n\nAs it stands, a recent survey by official statisticians found that one in four medium and large employers were planning to cut jobs - many cited the impact government policies such as the rise in employers NICS and increase in employee rights.\n\nSome, including the Bank of England, are predicting unemployment to rise and its likely to be lower paid posts that are hardest hit. You may want a job - but finding it may be getting harder",
    "clean_body": "pip an area where attention is clearly needed dharshini david chief economics correspondent todays statement will be worrying for the three million workingage people who receive personal independence payment pip but with the number of recipients set to rise to over four million by 2030 adding an extra £12bn to welfare spending the governments clear on the need to curb ballooning costs and with only 3 of people who are classed as longterm sick returning to employment this is an area where attention is clearly needed but it is unclear how successful these measures will be in either aim we wont know exactly how much the government hopes each of these measures will save or the assessment of the independent official forecasters the obr of those estimates until the chancellors spring statement next week and any estimates are just that highly uncertain prior attempts to trim welfare bills have proved tricky for many reasons and that includes the state of the labour market to get people into work there have to be jobs as it stands a recent survey by official statisticians found that one in four medium and large employers were planning to cut jobs many cited the impact government policies such as the rise in employers nics and increase in employee rights some including the bank of england are predicting unemployment to rise and its likely to be lower paid posts that are hardest hit you may want a job but finding it may be getting harder",
    "summary": "Pip an area where attention is clearly neededDharshini DavidChief economics correspondentToday's statement will be worrying for the three million working-age people who receive Personal Independence Payment (Pip).\nBut with the number of recipients set to rise to over four million by 2030, adding an extra £12bn to welfare spending, the government's clear on the need to curb ballooning costs.\nAnd with only 3% of people who are classed as long-term sick returning to employment, this is an area where attention is clearly needed.\nBut it is unclear how successful these measures will be in either aim.\nSome, including the Bank of England, are predicting unemployment to rise and its likely to be lower paid posts that are hardest hit.",
    "keywords": [
      "2030",
      "clearly",
      "crackdown",
      "5bn",
      "measures",
      "attention",
      "unveils",
      "aimed",
      "saving",
      "rise",
      "benefits",
      "kendall",
      "statement",
      "employers",
      "welfare",
      "estimates",
      "million",
      "official"
    ],
    "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png"
  },
  "https://www.bbc.com/news/articles/cm2nk82j2g7o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cm2nk82j2g7o",
    "date": "2025-03-03",
    "time": "00:00:00",
    "title": "Swedish police investigate suspected water pump sabotage",
    "body": "Swedish police investigate suspected water pump sabotage\n\nA Gotland port, not the area where the suspected sabotage is reported to have occurred, is pictured in 2022\n\nSwedish police are investigating a suspected sabotage incident on a water pump on the island of Gotland in the Baltic Sea.\n\nPolice told the BBC that the local government's water unit received an alarm for a water pump on Sunday at 17:30 local time (16:30 GMT).\n\n\"Technicians found that someone has opened an electrical cabinet, pulled out a cable and thereby cut off the power to the pump,\" police said. The technician put the cable back and reset the alarm at 21:30 local time, and the pump is now working.\n\nPolice have not said who they suspect could be responsible. The incident comes after the suspected sabotage of an undersea telecoms cable connecting Germany and Finland last month.",
    "clean_body": "swedish police investigate suspected water pump sabotage a gotland port not the area where the suspected sabotage is reported to have occurred is pictured in 2022 swedish police are investigating a suspected sabotage incident on a water pump on the island of gotland in the baltic sea police told the bbc that the local governments water unit received an alarm for a water pump on sunday at 1730 local time 1630 gmt technicians found that someone has opened an electrical cabinet pulled out a cable and thereby cut off the power to the pump police said the technician put the cable back and reset the alarm at 2130 local time and the pump is now working police have not said who they suspect could be responsible the incident comes after the suspected sabotage of an undersea telecoms cable connecting germany and finland last month",
    "summary": "Swedish police investigate suspected water pump sabotageA Gotland port, not the area where the suspected sabotage is reported to have occurred, is pictured in 2022Swedish police are investigating a suspected sabotage incident on a water pump on the island of Gotland in the Baltic Sea.\nPolice told the BBC that the local government's water unit received an alarm for a water pump on Sunday at 17:30 local time (16:30 GMT).\n\"Technicians found that someone has opened an electrical cabinet, pulled out a cable and thereby cut off the power to the pump,\" police said.\nThe technician put the cable back and reset the alarm at 21:30 local time, and the pump is now working.\nThe incident comes after the suspected sabotage of an undersea telecoms cable connecting Germany and Finland last month.",
    "keywords": [
      "workingpolice",
      "incident",
      "alarm",
      "investigate",
      "cable",
      "suspected",
      "sabotage",
      "swedish",
      "gotland",
      "water",
      "pump",
      "local"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4746/live/a20db030-f821-11ef-8e9e-47bc43726032.jpg"
  },
  "https://www.bbc.com/news/articles/c5ym22preydo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c5ym22preydo",
    "date": "2025-03-13",
    "time": "00:00:00",
    "title": "Versace: Donatella steps down as creative director, Dario Vitale to take over",
    "body": "Donatella steps down as Versace creative director\n\n13 March 2025 Share Save Annabel Rackham Culture reporter Share Save\n\nGetty Images Donatella Versace pictured last week at the Vanity Fair Oscars party\n\nDonatella Versace is to step down from her creative director role at fashion house Versace, after nearly 30 years. She has held the position since 1997 and took over after the murder of her brother Gianni. Versace has overseen hundreds of fashion campaigns for the Italian brand, also designing hotels and cars. The 69-year-old will be replaced by Dario Vitale, who is a former design director for Miu Miu, and take on a new brand ambassador role.\n\nIt comes amid speculation that the Prada Group is interested in buying Versace from the Capri Holdings group, who paid €2bn (£1.67bn) for the fashion house in 2018.\n\nGetty Images Donatella Versace on the runway at her first show as the fashion house's creative director in 1998\n\nIn a statement issued on Thursday, Capri Holdings said Versace would now \"dedicate herself to the support of Versace's philanthropic and charitable endeavours and will remain an advocate for the brand globally\". It added that the announcements were part of \"a thoughtful succession plan\" and credited Vitale as a \"strong design leader\" whose \"talent and vision will be instrumental in Versace's growth\". The company statement also thanked Versace for everything she had done for the brand and for playing \"an integral role in the company's global success\". Versace also posted her own statement on Instagram to her 12 million followers, saying it was \"the greatest honour of my life to carry on my brother Gianni's legacy\". \"Versace is in my DNA and always in my heart,\" she said. \"Championing the next generation of designers has always been important to me. I am thrilled that Dario Vitale will be joining us, and excited to see Versace through new eyes.\"\n\nAllow Instagram content? Meta’s cookie policy privacy policy ‘accept and continue’. This article contains content provided by Instagram . We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to readandbefore accepting. To view this content choose Accept and continue",
    "clean_body": "donatella steps down as versace creative director 13 march 2025 share save annabel rackham culture reporter share save getty images donatella versace pictured last week at the vanity fair oscars party donatella versace is to step down from her creative director role at fashion house versace after nearly 30 years she has held the position since 1997 and took over after the murder of her brother gianni versace has overseen hundreds of fashion campaigns for the italian brand also designing hotels and cars the 69yearold will be replaced by dario vitale who is a former design director for miu miu and take on a new brand ambassador role it comes amid speculation that the prada group is interested in buying versace from the capri holdings group who paid €2bn £167bn for the fashion house in 2018 getty images donatella versace on the runway at her first show as the fashion houses creative director in 1998 in a statement issued on thursday capri holdings said versace would now dedicate herself to the support of versaces philanthropic and charitable endeavours and will remain an advocate for the brand globally it added that the announcements were part of a thoughtful succession plan and credited vitale as a strong design leader whose talent and vision will be instrumental in versaces growth the company statement also thanked versace for everything she had done for the brand and for playing an integral role in the companys global success versace also posted her own statement on instagram to her 12 million followers saying it was the greatest honour of my life to carry on my brother giannis legacy versace is in my dna and always in my heart she said championing the next generation of designers has always been important to me i am thrilled that dario vitale will be joining us and excited to see versace through new eyes allow instagram content meta’s cookie policy privacy policy ‘accept and continue’ this article contains content provided by instagram we ask for your permission before anything is loaded as they may be using cookies and other technologies you may want to readandbefore accepting to view this content choose accept and continue",
    "summary": "Donatella steps down as Versace creative director13 March 2025 Share Save Annabel Rackham Culture reporter Share SaveGetty Images Donatella Versace pictured last week at the Vanity Fair Oscars partyDonatella Versace is to step down from her creative director role at fashion house Versace, after nearly 30 years.\nVersace has overseen hundreds of fashion campaigns for the Italian brand, also designing hotels and cars.\nThe 69-year-old will be replaced by Dario Vitale, who is a former design director for Miu Miu, and take on a new brand ambassador role.\nI am thrilled that Dario Vitale will be joining us, and excited to see Versace through new eyes.\"\nAllow Instagram content?",
    "keywords": [
      "instagram",
      "steps",
      "dario",
      "creative",
      "versace",
      "donatella",
      "fashion",
      "brand",
      "statement",
      "vitale",
      "director",
      "content"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/55ee/live/e1ab3950-001a-11f0-a8b1-950887ddc6e5.jpg"
  },
  "https://www.bbc.com/news/live/c4g9nzg9nppt": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/c4g9nzg9nppt",
    "date": "2025-03-27",
    "time": "00:00:00",
    "title": "Huge South Korea wildfires kill 27 and threaten to destroy ancient temples",
    "body": "Firefighting continues as South Korea begins to reflect on its loss\n\nImage source, Reuters\n\nAt least 27 people have died in what have grown into the largest wildfires in South Korea's history. Most of those who have lost their lives were in their 60s and 70s - in other words, those who struggled to escape the fast-moving infernos.\n\nThe figure includes three care home residents who died when their car was engulfed by the flames as they tried to escape, local media reported.\n\nTens of thousands have been displaced and efforts are continuing to protect ancient historical sites which lie in the path of the five fires which are continuing to rage.\n\nBBC Weather forecasters have analysed the data to see if any relief is on the horizon. There is some good news: temperatures will fall and some rain will arrive - but it is feared it will not be enough to stop the fires in their tracks.\n\nWe're pausing our live coverage for the time being but you can read more analysis on the cause and fallout of the unprecedented natural disaster elsewhere on the BBC News website.",
    "clean_body": "firefighting continues as south korea begins to reflect on its loss image source reuters at least 27 people have died in what have grown into the largest wildfires in south koreas history most of those who have lost their lives were in their 60s and 70s in other words those who struggled to escape the fastmoving infernos the figure includes three care home residents who died when their car was engulfed by the flames as they tried to escape local media reported tens of thousands have been displaced and efforts are continuing to protect ancient historical sites which lie in the path of the five fires which are continuing to rage bbc weather forecasters have analysed the data to see if any relief is on the horizon there is some good news temperatures will fall and some rain will arrive but it is feared it will not be enough to stop the fires in their tracks were pausing our live coverage for the time being but you can read more analysis on the cause and fallout of the unprecedented natural disaster elsewhere on the bbc news website",
    "summary": "Firefighting continues as South Korea begins to reflect on its lossImage source, ReutersAt least 27 people have died in what have grown into the largest wildfires in South Korea's history.\nMost of those who have lost their lives were in their 60s and 70s - in other words, those who struggled to escape the fast-moving infernos.\nThe figure includes three care home residents who died when their car was engulfed by the flames as they tried to escape, local media reported.\nTens of thousands have been displaced and efforts are continuing to protect ancient historical sites which lie in the path of the five fires which are continuing to rage.\nBBC Weather forecasters have analysed the data to see if any relief is on the horizon.",
    "keywords": [
      "ancient",
      "27",
      "unprecedented",
      "threaten",
      "website",
      "fires",
      "south",
      "korea",
      "wildfires",
      "escape",
      "destroy",
      "temples",
      "huge",
      "continuing",
      "weather",
      "words",
      "died",
      "kill"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/41fd/live/e6032a70-0ade-11f0-88b7-5556e7b55c5e.jpg"
  },
  "https://www.bbc.com/news/articles/c5yr1r485zlo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c5yr1r485zlo",
    "date": "2025-03-26",
    "time": "00:00:00",
    "title": "Canadian murder victim known only as Buffalo Woman identified",
    "body": "Canadian murder victim known as Buffalo Woman finally identified\n\nManitoba Premier Wab Kinew pledged to conduct a search of the facility, in an effort to find her body at her family's request.\n\nPolice officials also shared new details about Ms Shingoose's death, including naming the local landfill where they believe her remains are located.\n\nAshlee Shingoose, 30, was the first of four people killed by Jeremy Skibicki in Manitoba. She had been known only as Mashkode Bizhiki'ikwe (Buffalo Woman) until her identity was discovered by investigators and revealed on Wednesday.\n\nCanadian investigators have formally identified a missing indigenous woman who was murdered by a serial killer in 2022.\n\nMorgan Harris, 39, Marcedes Myran, 26, and Rebecca Contois, 24 were also killed by Jeremy Skibicki. He has been convicted of all four deaths and is serving a life sentence.\n\nHarris and Myran were identified earlier this month after being found in the Prairie Green Landfill, north of Winnipeg. The search there is still ongoing, and remains continue to be found, according to the Manitoba premier.\n\nWinnipeg Police Deputy Chief Cam Mackid said during a news conference that the Shingoose family had been given confirmation of her death on Tuesday.\n\nChief Raymond Flett of the St Theresa Point Anisininew Nation, told reporters that the news is \"heartbreaking\" but is \"welcome\".\n\nThe chief also read a letter from Shingoose's mother, who wrote: \"Please start the search as soon as possible.\"\n\n\"It's been a long time waiting. I need to bring her home. I need closure. Enough. Search the landfill as soon as possible.\"\n\nHe added that many other indigenous Canadians have \"been murdered without proper investigation accountability\". A national inquiry found that indigenous women in Canada were 12 times more likely to be missing or murdered than non-indigenous Canadians.\n\nA news release issued by the Winnipeg Police Service said police received \"new information\" in December 2024, which \"led investigators to make a preliminary identification\".\n\nThe positive identification was made after specific evidence seized during the investigation was sent for DNA analysis.\n\nThe statement added that Shingoose's body was placed in a garbage bin behind a commercial business after she was killed. It said that \"based on the timing of her death, and the new information about where she had been placed\" police believe she was taken to the Brady Landfill.\n\nCindy Woodhouse Nepinak, the national chief of the Assembly of First Nations, told the Canadian Press that she had spoken to Shingoose's relatives, and that she wants the police to be investigated for their handling of the deaths.\n\n\"Why didn't the police service help these families right off the bat, and why didn't the previous provincial government want to help these families right off the bat,\" she said.\n\nThe provincial government initially declined to search the Prairie Green Landfill for the remains of the women, due to steep costs and concerns about hazardous waste.\n\nTheir murders went undetected for months until a man looking for scrap metal in a bin outside Skibicki's apartment found partial human remains, identified as belonging to Contois.",
    "clean_body": "canadian murder victim known as buffalo woman finally identified manitoba premier wab kinew pledged to conduct a search of the facility in an effort to find her body at her familys request police officials also shared new details about ms shingooses death including naming the local landfill where they believe her remains are located ashlee shingoose 30 was the first of four people killed by jeremy skibicki in manitoba she had been known only as mashkode bizhikiikwe buffalo woman until her identity was discovered by investigators and revealed on wednesday canadian investigators have formally identified a missing indigenous woman who was murdered by a serial killer in 2022 morgan harris 39 marcedes myran 26 and rebecca contois 24 were also killed by jeremy skibicki he has been convicted of all four deaths and is serving a life sentence harris and myran were identified earlier this month after being found in the prairie green landfill north of winnipeg the search there is still ongoing and remains continue to be found according to the manitoba premier winnipeg police deputy chief cam mackid said during a news conference that the shingoose family had been given confirmation of her death on tuesday chief raymond flett of the st theresa point anisininew nation told reporters that the news is heartbreaking but is welcome the chief also read a letter from shingooses mother who wrote please start the search as soon as possible its been a long time waiting i need to bring her home i need closure enough search the landfill as soon as possible he added that many other indigenous canadians have been murdered without proper investigation accountability a national inquiry found that indigenous women in canada were 12 times more likely to be missing or murdered than nonindigenous canadians a news release issued by the winnipeg police service said police received new information in december 2024 which led investigators to make a preliminary identification the positive identification was made after specific evidence seized during the investigation was sent for dna analysis the statement added that shingooses body was placed in a garbage bin behind a commercial business after she was killed it said that based on the timing of her death and the new information about where she had been placed police believe she was taken to the brady landfill cindy woodhouse nepinak the national chief of the assembly of first nations told the canadian press that she had spoken to shingooses relatives and that she wants the police to be investigated for their handling of the deaths why didnt the police service help these families right off the bat and why didnt the previous provincial government want to help these families right off the bat she said the provincial government initially declined to search the prairie green landfill for the remains of the women due to steep costs and concerns about hazardous waste their murders went undetected for months until a man looking for scrap metal in a bin outside skibickis apartment found partial human remains identified as belonging to contois",
    "summary": "Canadian murder victim known as Buffalo Woman finally identifiedManitoba Premier Wab Kinew pledged to conduct a search of the facility, in an effort to find her body at her family's request.\nShe had been known only as Mashkode Bizhiki'ikwe (Buffalo Woman) until her identity was discovered by investigators and revealed on Wednesday.\nCanadian investigators have formally identified a missing indigenous woman who was murdered by a serial killer in 2022.\nHarris and Myran were identified earlier this month after being found in the Prairie Green Landfill, north of Winnipeg.\nTheir murders went undetected for months until a man looking for scrap metal in a bin outside Skibicki's apartment found partial human remains, identified as belonging to Contois.",
    "keywords": [
      "search",
      "buffalo",
      "woman",
      "landfill",
      "investigators",
      "identified",
      "canadian",
      "shingooses",
      "victim",
      "killed",
      "remains",
      "murder",
      "known",
      "indigenous",
      "murdered"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/6da2/live/949561a0-0a73-11f0-9549-59d68655a623.jpg"
  },
  "https://www.bbc.com/news/articles/cwyd2p7dz3vo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cwyd2p7dz3vo",
    "date": "2025-03-18",
    "time": "00:00:00",
    "title": "At-a-glance: Key changes to benefits in welfare shake-up",
    "body": "At-a-glance: Key changes to benefits in welfare shake-up\n\n18 March 2025 Share Save Brian Wheeler Political reporter Share Save\n\nPA Media\n\nThe government has announced plans for major changes to the benefits system aimed at cutting the growing amount the UK spends on welfare.\n\nStricter tests for personal independence payments (Pips)\n\nPip is paid to people in England and Wales who have difficulty completing everyday tasks or getting around as a result of a long-term physical or mental health condition. It is not means tested and is available to people who are working. The payments will go up in line with inflation this year. But the eligibility criteria will be tightened up from November 2026, potentially resulting in reduced payments for many. It will become harder to qualify for the daily living component of Pip, which starts at £72.65 a week. There will be no change to the mobility component. There will also be a review of the Pip assessment process.\n\nBut those with most severe conditions will not face reassessments\n\nThe government wants more frequent reassessments for many people claiming Pip, with more face-to-face assessments. But those with the most severe, long-term conditions will no longer face any reassessments, under the proposed reforms.\n\nWork capability assessment to be scrapped\n\nThe work capability assessment that determines who is eligible for incapacity benefits will be scrapped in 2028, under the proposals. Instead, people applying for health-related financial support and disability benefits will only face one assessment, based on the current Pip system.\n\nIncapacity benefits under universal credit to be halved for new claimants\n\nIncapacity benefits under universal credit will be frozen in cash terms for existing claimants at £97 per week from April next year - this means they will not be increased in line with inflation until 2029/30. The amount will be reduced to £50 per week in 2026/2027 for new claimants. But those receiving the new reduced universal credit health element after April 2026, who have the most severe, life-long health conditions, who have no prospect of improvement and will never be able to work, will see their incomes protected through an additional premium. It also means those in that group will not be reassessed in the future. There will also be an above inflation increase in the standard rate of universal credit for all those seeking work, adding up to £775 a year extra by 2029/30. The government says this will help tackle the \"perverse incentives\" in the system that keep people on benefits.\n\nReduced incapacity benefits for under 22s\n\nThose aged under 22 will no longer be able to claim the incapacity benefit top-up to universal credit under these proposals. The government says any savings generated from the delay would be reinvested into work support and training opportunities for this age group. Ministers are also consulting on raising the age at which young people move from Disability Living Allowance for children to Pip from 16 to 18. The idea is that young people will have work and training \"rather than a pathway to economic inactivity\", the DWP says.\n\nMore incentives to work\n\nThe government says it wants to ease people's fears about losing benefits if they take a job and it doesn't work out. Ministers say they will introduce legislation \"as soon as possible\" to guarantee that trying work will not lead to an automatic Pip or work capability reassessment. It's hoped a newly-designed \"support conversation\" will give people who have a health condition or disability help to access work. Consultations will start on the Access to Work scheme, looking at improvements to help people stay in the workplace, with adjustments like aids or assistive tech. Overall, Work and Pensions Secretary Liz Kendall announced a £1bn package of support to help disabled people and those with long-term conditions into work.\n\nDifferences in Scotland and Northern Ireland\n\nMost of the measures apply to the whole of Great Britain. Pip applies to England and Wales only. If there is a cut in the budget for Pip, a proportionate figure will be cut from the amount the Treasury gives to the Scottish government. So Scottish ministers would have the choice of applying a similar scale of cuts, or of finding funds from other spending, or tax, to fill that gap. The benefits system is devolved in Northern Ireland but in practice the Stormont administration mostly copies what is happening in England and Wales. If NI ministers choose not to apply the cuts they would have to fund that by making savings on other parts of their budget or raising more revenue.",
    "clean_body": "ataglance key changes to benefits in welfare shakeup 18 march 2025 share save brian wheeler political reporter share save pa media the government has announced plans for major changes to the benefits system aimed at cutting the growing amount the uk spends on welfare stricter tests for personal independence payments pips pip is paid to people in england and wales who have difficulty completing everyday tasks or getting around as a result of a longterm physical or mental health condition it is not means tested and is available to people who are working the payments will go up in line with inflation this year but the eligibility criteria will be tightened up from november 2026 potentially resulting in reduced payments for many it will become harder to qualify for the daily living component of pip which starts at £7265 a week there will be no change to the mobility component there will also be a review of the pip assessment process but those with most severe conditions will not face reassessments the government wants more frequent reassessments for many people claiming pip with more facetoface assessments but those with the most severe longterm conditions will no longer face any reassessments under the proposed reforms work capability assessment to be scrapped the work capability assessment that determines who is eligible for incapacity benefits will be scrapped in 2028 under the proposals instead people applying for healthrelated financial support and disability benefits will only face one assessment based on the current pip system incapacity benefits under universal credit to be halved for new claimants incapacity benefits under universal credit will be frozen in cash terms for existing claimants at £97 per week from april next year this means they will not be increased in line with inflation until 202930 the amount will be reduced to £50 per week in 20262027 for new claimants but those receiving the new reduced universal credit health element after april 2026 who have the most severe lifelong health conditions who have no prospect of improvement and will never be able to work will see their incomes protected through an additional premium it also means those in that group will not be reassessed in the future there will also be an above inflation increase in the standard rate of universal credit for all those seeking work adding up to £775 a year extra by 202930 the government says this will help tackle the perverse incentives in the system that keep people on benefits reduced incapacity benefits for under 22s those aged under 22 will no longer be able to claim the incapacity benefit topup to universal credit under these proposals the government says any savings generated from the delay would be reinvested into work support and training opportunities for this age group ministers are also consulting on raising the age at which young people move from disability living allowance for children to pip from 16 to 18 the idea is that young people will have work and training rather than a pathway to economic inactivity the dwp says more incentives to work the government says it wants to ease peoples fears about losing benefits if they take a job and it doesnt work out ministers say they will introduce legislation as soon as possible to guarantee that trying work will not lead to an automatic pip or work capability reassessment its hoped a newlydesigned support conversation will give people who have a health condition or disability help to access work consultations will start on the access to work scheme looking at improvements to help people stay in the workplace with adjustments like aids or assistive tech overall work and pensions secretary liz kendall announced a £1bn package of support to help disabled people and those with longterm conditions into work differences in scotland and northern ireland most of the measures apply to the whole of great britain pip applies to england and wales only if there is a cut in the budget for pip a proportionate figure will be cut from the amount the treasury gives to the scottish government so scottish ministers would have the choice of applying a similar scale of cuts or of finding funds from other spending or tax to fill that gap the benefits system is devolved in northern ireland but in practice the stormont administration mostly copies what is happening in england and wales if ni ministers choose not to apply the cuts they would have to fund that by making savings on other parts of their budget or raising more revenue",
    "summary": "At-a-glance: Key changes to benefits in welfare shake-up18 March 2025 Share Save Brian Wheeler Political reporter Share SavePA MediaThe government has announced plans for major changes to the benefits system aimed at cutting the growing amount the UK spends on welfare.\nInstead, people applying for health-related financial support and disability benefits will only face one assessment, based on the current Pip system.\nIncapacity benefits under universal credit to be halved for new claimantsIncapacity benefits under universal credit will be frozen in cash terms for existing claimants at £97 per week from April next year - this means they will not be increased in line with inflation until 2029/30.\nReduced incapacity benefits for under 22sThose aged under 22 will no longer be able to claim the incapacity benefit top-up to universal credit under these proposals.\nThe government says any savings generated from the delay would be reinvested into work support and training opportunities for this age group.",
    "keywords": [
      "ministers",
      "health",
      "universal",
      "shakeup",
      "pip",
      "benefits",
      "credit",
      "key",
      "support",
      "welfare",
      "work",
      "help",
      "conditions",
      "ataglance",
      "changes"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f87d/live/fc4e1200-03ee-11f0-b646-47f4457af9f7.jpg"
  },
  "https://www.bbc.com/news/live/cn7vd4l5d75t": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/cn7vd4l5d75t",
    "date": "2025-03-05",
    "time": "00:00:00",
    "title": "Will tariffs make the US money? And could Canada join the EU?",
    "body": "Will companies leave China to side-step tariffs when selling to the US?\n\nLaura Bicker\n\nChina correspondent, in Beijing\n\nImage source, Getty Images Image caption, Employees at a Chinese-funded textile and garment factory in Kampong Chhnang Province, Cambodia (picture taken November last year)\n\nGrant in Miami asks: With some companies already pulling out of China and moving to countries such as Vietnam, is Trump just stubborn, or ignorant to the fact that tariffs can not force economic growth within the US?\n\nA number of both foreign and Chinese firms have been moving production outside the country in the last decade – even before Donald Trump became the president in 2016 and started imposing tariffs.\n\nShoe manufacturers, for instance, wanted to avoid higher labour costs in China and moved to Vietnam. But the drift to south-east Asia and beyond accelerated after the Trump administration started imposing tariffs on Chinese goods in 2018.\n\nIn Cambodia, around 90% of clothing factories are now Chinese-run or Chinese-owned, according to a report by insight and analysis group Research and Markets.\n\nI saw this for myself in Phnom Penh. The garment firms still source most of their materials in China – so you are right, Grant: Trump’s tariffs have not stopped Chinese firms from setting up shop elsewhere.\n\nRemember - Trump is angry because China sells four times more than it buys from the US.\n\nBack in 2020, after a two-year bitter tit-for-tat trade war, the two sides agreed to a \"Phase One\" trade deal where China pledged to buy an extra $200 billion dollars of US goods. His administration argued that this deal would put money back into the US economy.\n\nUnfortunately, not long after that it was agreed, the pandemic struck, relations between Washington and Beijing soured and the deal fell apart.\n\nBut this is the kind of deal Trump likely hopes to do once again. Will his tactics work?\n\nChina has pledged to fight to the bitter end of any trade war. It will also feel in a better position that during Trump’s first term.\n\nBeijing has spent the last five years making new economic partners – especially throughout the Global South. China is now the lead trade partner for more than 120 countries. This means it is less reliant on trade with the United States, but it's also facing its own economic challenges - and may not want to drag this fight out.",
    "clean_body": "will companies leave china to sidestep tariffs when selling to the us laura bicker china correspondent in beijing image source getty images image caption employees at a chinesefunded textile and garment factory in kampong chhnang province cambodia picture taken november last year grant in miami asks with some companies already pulling out of china and moving to countries such as vietnam is trump just stubborn or ignorant to the fact that tariffs can not force economic growth within the us a number of both foreign and chinese firms have been moving production outside the country in the last decade – even before donald trump became the president in 2016 and started imposing tariffs shoe manufacturers for instance wanted to avoid higher labour costs in china and moved to vietnam but the drift to southeast asia and beyond accelerated after the trump administration started imposing tariffs on chinese goods in 2018 in cambodia around 90 of clothing factories are now chineserun or chineseowned according to a report by insight and analysis group research and markets i saw this for myself in phnom penh the garment firms still source most of their materials in china – so you are right grant trump’s tariffs have not stopped chinese firms from setting up shop elsewhere remember trump is angry because china sells four times more than it buys from the us back in 2020 after a twoyear bitter titfortat trade war the two sides agreed to a phase one trade deal where china pledged to buy an extra 200 billion dollars of us goods his administration argued that this deal would put money back into the us economy unfortunately not long after that it was agreed the pandemic struck relations between washington and beijing soured and the deal fell apart but this is the kind of deal trump likely hopes to do once again will his tactics work china has pledged to fight to the bitter end of any trade war it will also feel in a better position that during trump’s first term beijing has spent the last five years making new economic partners – especially throughout the global south china is now the lead trade partner for more than 120 countries this means it is less reliant on trade with the united states but its also facing its own economic challenges and may not want to drag this fight out",
    "summary": "A number of both foreign and Chinese firms have been moving production outside the country in the last decade – even before Donald Trump became the president in 2016 and started imposing tariffs.\nBut the drift to south-east Asia and beyond accelerated after the Trump administration started imposing tariffs on Chinese goods in 2018.\nThe garment firms still source most of their materials in China – so you are right, Grant: Trump’s tariffs have not stopped Chinese firms from setting up shop elsewhere.\nBut this is the kind of deal Trump likely hopes to do once again.\nChina has pledged to fight to the bitter end of any trade war.",
    "keywords": [
      "trump",
      "trade",
      "china",
      "chinese",
      "eu",
      "money",
      "vietnam",
      "economic",
      "canada",
      "join",
      "firms",
      "tariffs",
      "war",
      "deal"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c83c/live/7be57200-f9eb-11ef-896e-d7e7fb1719a4.jpg"
  },
  "https://www.bbc.com/news/articles/ce8m71rgpp4o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/ce8m71rgpp4o",
    "date": "2025-03-09",
    "time": "00:00:00",
    "title": "'We don't need a Gail's' - the coffee shop boom dividing locals",
    "body": "'We don't need a Gail's' - the coffee shop boom dividing locals\n\n9 March 2025 Share Save Lucy Hooker BBC Business reporter Reporting from Macclesfield Share Save\n\nBBC Jane Kent says Macclesfield doesn't need any more places to buy pastries\n\nThere is a cheerful red awning and a newly painted cream wooden shopfront on the market square in Macclesfield. A new bakery cafe has just opened, offering ciabatta and sourdough loaves as well as hot cross buns, syrupy cakes, vegetable quiches and of course coffee. Like towns around the UK, Macclesfield has struggled with retailers closing, leaving empty stores, so there is a buzz around the new arrival. But Gail's, a brand that started in London more than 20 years ago, is controversial. It draws crowds and inspires social media memes, but attracts fierce criticism too. A recent spate of national media coverage has even asked why some people \"hate\" Gail's so much, focusing on everything from who owns it to what it does with unsold pastries. Its arrival isn't universally popular here either. \"We don't need another coffee shop,\" says Linda Willdig. She is out shopping with her friend Nicola Tomlinson, who agrees. \"There are too many,\" says Nicola.\n\nNicola Tomlinson and Linda Willdig do not think Macclesfield needs another coffee shop\n\nIn fact, from a table outside the new Gail's you could easily throw a cinnamon bun and hit both a Caffe Nero and a Costa. Greggs is just around the corner too. So something different might have been better, says Jane Kent, a community nurse. \"People will be larding out on all the bakery stuff,\" she says. \"We don't need more pastries.\" At heart, though, the objections to Gail's are not about what it sells, but that it doesn't really belong, that it will push up prices and put independent cafes out of business. But Stephanie Lamb, a teacher on maternity leave, is more welcoming. \"I don't know Gail's, so it's not necessarily a chain to me,\" she says. \"I'm just happy to have something extra in town.\" She likes a latte and a croissant and somewhere she can read a book for an hour. At Gail's prices that would set her back £6.50. Yes, it's pricey, she says, but she is still planning to \"give it a whirl\".\n\nStephanie Lamb says she is happy to have something new in town\n\nGail's - a name that suggests a traditional, single-owner, cafe - favours attractive old buildings, often ones vacated as bank branches close, especially if it is a corner site that means it's more visible to passers by. It has 170 outlets mostly clustered in London and the south east. But this year it plans to open around 40 more, including Ely, Cambridgeshire later this month, Bath in April, and Buxton, Derbyshire in May. At Friday's opening in Macclesfield there was a flurry of interest in the new place on the square.\n\nKaterina Antos-Lewis Gail's opened in Macclesfield on Friday on a corner site location\n\nEven in the wake of the cost of living crisis, we are increasingly choosing a coffee out as a treat. Nearly two-thirds of people said they went to a coffee shop more than once a week, according to World Coffee Portal, spending more than £6 per visit on average. So coffee shops are weathering the tough economic climate better than most businesses. There are now 11,450 branded chain outlets across the UK, up from 9,800 five years ago. Speciality chains like Black Sheep Coffee, Coffee#1 and Blank Street are springing up in city centres, while the giants like Costa and Starbucks are opening drive-throughs and outlets in retail parks. Caffe Nero has bought up several smaller chains, in different parts of the country, and is retaining their independent branding so it can make the most of local loyalties.\n\nMacclesfield has independent butchers, one of the things Gail's looks out for when it is picking a new location\n\nWith enthusiasm for coffee so strong it's something of a mystery to Gail's chief executive Tom Molnar why people object to his chain. He feels misunderstood. Mr Molnar - a joint owner with private equity backing - has been working on expanding the brand since he joined in 2003, but says it's not just about coffee. Its role as a neighbourhood bakery - baking fresh in-store and in regional bakery hubs every day - is key. He's hoping to roll Gail's out to many more neighbourhoods, including less affluent ones. \"It's not supposed to be posh,\" he insists. But for now they pick very carefully where to open, using an algorithm to help select the most promising postcodes. It flags up things like whether there is a local butcher, bookshops, a park, schools, churches or a farmers' market. \"I prefer a place that's evolving and growing rather than some place that's too established,\" he says. If the algorithm homes in on a particular High Street it is a vote of confidence in that town's future.\n\nFirefighter and local councillor Anthony Harrison says Gail's is just a \"posh Greggs\"\n\nBut retail experts warn that the very nature of the places that Gail's is picking means there are likely to be accusations of gentrification, increasing prices and rents for existing businesses and residents. \"Gail's is moving into areas with strong local identities. And when that happens, there will always be a reaction,\" says Kate Hardcastle, founder of Insight with Passion. \"It's not just about a bakery opening, I think it's also about what it represents. \"Some will see it as a sign of investment and revitalisation, while others worry it's another step back to our High Streets looking like carbon copies of each other,\" she says.\n\nKaren Pearson wants the town to \"stay like it is\"\n\nIn Flour, Water, Salt - a direct rival to Gail's selling sourdough bread, bagels, coffee-iced buns and sausage rolls - that is just yards from the new shop, some loyal customers are adamantly opposed to the newcomer. \"Gail's isn't welcome here,\" says Karen Pearson, a businesswoman who lives just outside Macclesfield. She and her friends are worried that the arrival of Gail's means the town is \"on the up\", when in fact they would rather it \"stayed like it is\". They're not keen on big corporations coming into the town, concerned they might squeeze out independents. But firefighter and local councillor Anthony Harrison, reckons Gail's is no match for a place like Flour, Water, Salt. \"It's just a posh Greggs,\" he says.\n\nLocal independents like Flour, Water, Salt say they aren't worried\n\nIndependents may not be as under threat as people fear, says Graham Soult, a retail consultant from the north of England. Local owners can offer a more personal touch, respond to local tastes and demands, he says, while it can be hard for chains to deviate from their given formula.",
    "clean_body": "we dont need a gails the coffee shop boom dividing locals 9 march 2025 share save lucy hooker bbc business reporter reporting from macclesfield share save bbc jane kent says macclesfield doesnt need any more places to buy pastries there is a cheerful red awning and a newly painted cream wooden shopfront on the market square in macclesfield a new bakery cafe has just opened offering ciabatta and sourdough loaves as well as hot cross buns syrupy cakes vegetable quiches and of course coffee like towns around the uk macclesfield has struggled with retailers closing leaving empty stores so there is a buzz around the new arrival but gails a brand that started in london more than 20 years ago is controversial it draws crowds and inspires social media memes but attracts fierce criticism too a recent spate of national media coverage has even asked why some people hate gails so much focusing on everything from who owns it to what it does with unsold pastries its arrival isnt universally popular here either we dont need another coffee shop says linda willdig she is out shopping with her friend nicola tomlinson who agrees there are too many says nicola nicola tomlinson and linda willdig do not think macclesfield needs another coffee shop in fact from a table outside the new gails you could easily throw a cinnamon bun and hit both a caffe nero and a costa greggs is just around the corner too so something different might have been better says jane kent a community nurse people will be larding out on all the bakery stuff she says we dont need more pastries at heart though the objections to gails are not about what it sells but that it doesnt really belong that it will push up prices and put independent cafes out of business but stephanie lamb a teacher on maternity leave is more welcoming i dont know gails so its not necessarily a chain to me she says im just happy to have something extra in town she likes a latte and a croissant and somewhere she can read a book for an hour at gails prices that would set her back £650 yes its pricey she says but she is still planning to give it a whirl stephanie lamb says she is happy to have something new in town gails a name that suggests a traditional singleowner cafe favours attractive old buildings often ones vacated as bank branches close especially if it is a corner site that means its more visible to passers by it has 170 outlets mostly clustered in london and the south east but this year it plans to open around 40 more including ely cambridgeshire later this month bath in april and buxton derbyshire in may at fridays opening in macclesfield there was a flurry of interest in the new place on the square katerina antoslewis gails opened in macclesfield on friday on a corner site location even in the wake of the cost of living crisis we are increasingly choosing a coffee out as a treat nearly twothirds of people said they went to a coffee shop more than once a week according to world coffee portal spending more than £6 per visit on average so coffee shops are weathering the tough economic climate better than most businesses there are now 11450 branded chain outlets across the uk up from 9800 five years ago speciality chains like black sheep coffee coffee1 and blank street are springing up in city centres while the giants like costa and starbucks are opening drivethroughs and outlets in retail parks caffe nero has bought up several smaller chains in different parts of the country and is retaining their independent branding so it can make the most of local loyalties macclesfield has independent butchers one of the things gails looks out for when it is picking a new location with enthusiasm for coffee so strong its something of a mystery to gails chief executive tom molnar why people object to his chain he feels misunderstood mr molnar a joint owner with private equity backing has been working on expanding the brand since he joined in 2003 but says its not just about coffee its role as a neighbourhood bakery baking fresh instore and in regional bakery hubs every day is key hes hoping to roll gails out to many more neighbourhoods including less affluent ones its not supposed to be posh he insists but for now they pick very carefully where to open using an algorithm to help select the most promising postcodes it flags up things like whether there is a local butcher bookshops a park schools churches or a farmers market i prefer a place thats evolving and growing rather than some place thats too established he says if the algorithm homes in on a particular high street it is a vote of confidence in that towns future firefighter and local councillor anthony harrison says gails is just a posh greggs but retail experts warn that the very nature of the places that gails is picking means there are likely to be accusations of gentrification increasing prices and rents for existing businesses and residents gails is moving into areas with strong local identities and when that happens there will always be a reaction says kate hardcastle founder of insight with passion its not just about a bakery opening i think its also about what it represents some will see it as a sign of investment and revitalisation while others worry its another step back to our high streets looking like carbon copies of each other she says karen pearson wants the town to stay like it is in flour water salt a direct rival to gails selling sourdough bread bagels coffeeiced buns and sausage rolls that is just yards from the new shop some loyal customers are adamantly opposed to the newcomer gails isnt welcome here says karen pearson a businesswoman who lives just outside macclesfield she and her friends are worried that the arrival of gails means the town is on the up when in fact they would rather it stayed like it is theyre not keen on big corporations coming into the town concerned they might squeeze out independents but firefighter and local councillor anthony harrison reckons gails is no match for a place like flour water salt its just a posh greggs he says local independents like flour water salt say they arent worried independents may not be as under threat as people fear says graham soult a retail consultant from the north of england local owners can offer a more personal touch respond to local tastes and demands he says while it can be hard for chains to deviate from their given formula",
    "summary": "'We don't need a Gail's' - the coffee shop boom dividing locals9 March 2025 Share Save Lucy Hooker BBC Business reporter Reporting from Macclesfield Share SaveBBC Jane Kent says Macclesfield doesn't need any more places to buy pastriesThere is a cheerful red awning and a newly painted cream wooden shopfront on the market square in Macclesfield.\n\"We don't need another coffee shop,\" says Linda Willdig.\n\"We don't need more pastries.\"\n\"I don't know Gail's, so it's not necessarily a chain to me,\" she says.\nNearly two-thirds of people said they went to a coffee shop more than once a week, according to World Coffee Portal, spending more than £6 per visit on average.",
    "keywords": [
      "locals",
      "macclesfield",
      "need",
      "dont",
      "coffee",
      "shop",
      "dividing",
      "boom",
      "town",
      "gails",
      "bakery",
      "place",
      "local"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/8035/live/c284fb50-fa99-11ef-a24f-f97f794e18ea.jpg"
  },
  "https://www.bbc.com/news/articles/cqx0g1py5v0o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cqx0g1py5v0o",
    "date": "2025-03-07",
    "time": "00:00:00",
    "title": "Bitcoin reserve: Why has Trump set up a US crypto stockpile?",
    "body": "'A pig in lipstick': Trump's strategic Bitcoin reserve criticised\n\nPresident Donald Trump's decision to establish official government cryptocurrency reserves in the US has drawn criticism from industry watchers.\n\nHe has signed an executive order creating what he calls a Strategic Bitcoin Reserve as well as a Digital Asset Stockpile, which will consist of other forms of digital currency.\n\nThe funds will be stocked with coins forfeited to the federal government as part of criminal or civil proceedings.\n\nWhite House AI and crypto tsar David Sacks likened them to a \"a digital Fort Knox for the cryptocurrency\", drawing comparison to the Kentucky military base that stores a significant portion of US gold assets.\n\nHowever, some crypto enthusiasts have criticised the government for not being bolder, while others have raised question marks about the lack of transparency over the process.\n\nSacks has ordered a full accounting of the federal government's existing crypto reserves, which he estimated at 200,000 Bitcoin alone. That's worth $17.5bn (£13.6bn) at today's prices.\n\nSpeaking to reporters at the White House ahead of a special crypto summit on Friday, Sacks said that it was a \"real shame that we did not maximise value for the American taxpayer.\"\n\n\"What we want to do is make sure that with the remaining Bitcoin that we have,\" he added.\n\nNonetheless, Charles Edwards of the Capriole Fund, a Bitcoin and digital assets hedge fund, called Thursday's announcement \"a pig in lipstick\" in response to Sacks' post on X.\n\n\"No active buying means this is just a fancy title for Bitcoin holdings that already existed with the government,\" he said.\n\nTrump's executive order says that the Treasury and Commerce secretary will come up with strategies for acquiring more government Bitcoin, provided these are \"budget neutral and do not impose incremental costs on United States taxpayers\".\n\nThat meant, Sacks told reporters, they are only \"allowed to buy more if it doesn't add to the deficit or the debt.\"\n\nJason Yanowitz, Co-Founder of crypto firm Blockworks, agrees with the idea of a Bitcoin reserve but says the inclusion of other coins sets a \"horrible precedent\" and \"makes no sense.\"\n\n\"Without a clear framework, we risk arbitrary asset selections, which would distort the markets and drive a loss of public trust,\" he suggested.\n\nOther analysts though have been more positive.\n\n\"This approach makes much more sense than buying the assets,\" said Russ Mould, investment director at AJ Bell.\n\n\"It would surely be bizarre for the US to sell dollars to buy crypto, when the dollar is the globe's reserve currency and therefore a source of enormous influence.\"",
    "clean_body": "a pig in lipstick trumps strategic bitcoin reserve criticised president donald trumps decision to establish official government cryptocurrency reserves in the us has drawn criticism from industry watchers he has signed an executive order creating what he calls a strategic bitcoin reserve as well as a digital asset stockpile which will consist of other forms of digital currency the funds will be stocked with coins forfeited to the federal government as part of criminal or civil proceedings white house ai and crypto tsar david sacks likened them to a a digital fort knox for the cryptocurrency drawing comparison to the kentucky military base that stores a significant portion of us gold assets however some crypto enthusiasts have criticised the government for not being bolder while others have raised question marks about the lack of transparency over the process sacks has ordered a full accounting of the federal governments existing crypto reserves which he estimated at 200000 bitcoin alone thats worth 175bn £136bn at todays prices speaking to reporters at the white house ahead of a special crypto summit on friday sacks said that it was a real shame that we did not maximise value for the american taxpayer what we want to do is make sure that with the remaining bitcoin that we have he added nonetheless charles edwards of the capriole fund a bitcoin and digital assets hedge fund called thursdays announcement a pig in lipstick in response to sacks post on x no active buying means this is just a fancy title for bitcoin holdings that already existed with the government he said trumps executive order says that the treasury and commerce secretary will come up with strategies for acquiring more government bitcoin provided these are budget neutral and do not impose incremental costs on united states taxpayers that meant sacks told reporters they are only allowed to buy more if it doesnt add to the deficit or the debt jason yanowitz cofounder of crypto firm blockworks agrees with the idea of a bitcoin reserve but says the inclusion of other coins sets a horrible precedent and makes no sense without a clear framework we risk arbitrary asset selections which would distort the markets and drive a loss of public trust he suggested other analysts though have been more positive this approach makes much more sense than buying the assets said russ mould investment director at aj bell it would surely be bizarre for the us to sell dollars to buy crypto when the dollar is the globes reserve currency and therefore a source of enormous influence",
    "summary": "'A pig in lipstick': Trump's strategic Bitcoin reserve criticisedPresident Donald Trump's decision to establish official government cryptocurrency reserves in the US has drawn criticism from industry watchers.\nHe has signed an executive order creating what he calls a Strategic Bitcoin Reserve as well as a Digital Asset Stockpile, which will consist of other forms of digital currency.\nSacks has ordered a full accounting of the federal government's existing crypto reserves, which he estimated at 200,000 Bitcoin alone.\n\"No active buying means this is just a fancy title for Bitcoin holdings that already existed with the government,\" he said.\nJason Yanowitz, Co-Founder of crypto firm Blockworks, agrees with the idea of a Bitcoin reserve but says the inclusion of other coins sets a \"horrible precedent\" and \"makes no sense.\"",
    "keywords": [
      "bitcoin",
      "trump",
      "trumps",
      "reserves",
      "reporters",
      "sacks",
      "reserve",
      "pig",
      "strategic",
      "stockpile",
      "digital",
      "crypto",
      "set"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/2535/live/1e2afc60-fb4a-11ef-b291-618bc0bdbe5f.jpg"
  },
  "https://www.bbc.com/news/articles/cge1gxxn07qo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cge1gxxn07qo",
    "date": "2025-03-17",
    "time": "00:00:00",
    "title": "Pakistan moves closer to Bangladesh as India watches warily",
    "body": "India watches warily as Bangladesh-Pakistan ties thaw\n\n17 March 2025 Share Save Anbarasan Ethirajan South Asia Regional Editor Share Save\n\nGetty Images Bangladesh imported 50,000 tonnes of rice from Pakistan in February\n\nThe dramatic political developments in Bangladesh that led to prime minister Sheikh Hasina being ousted last year have thrown up many surprises - including Dhaka's growing closeness with one-time foe Pakistan. Last month, after decades of troubled relations, the two countries began directly trading for the first time, with Dhaka importing 50,000 tonnes of rice from Pakistan. Direct flights and military contacts have also been revived, visa procedures have been simplified, and there are reports of co-operation on security matters. The countries - separated by the landmass of India - have deep, painful historical ties. The animosity between them goes back to 1971, when Bangladesh - then known as East Pakistan - launched a struggle to gain independence from Islamabad. India supported the Bengali rebels during the nine-month war which led to the formation of Bangladesh. While the scars from that period run deep, Dhaka had cordial relations with Islamabad between 2001 and 2006, when a coalition of the Bangladesh Nationalist Party (BNP) and the Jamaat-e-Islami governed the country. This changed during Hasina's 15-year rule from 2009 - when she was strongly backed by Delhi and maintained a distance from Pakistan. But after she fled to India following mass protests against her government, ties seem to be thawing. \"For the past 15 years, the Pakistan-Bangladesh relationship was on a slightly difficult trajectory,\" says Humayun Kabir, a former senior Bangladeshi diplomat, adding that the relationship seems to now be returning to that of \"two normal neighbours\". The developments are being watched closely, particularly in India, which has a long history of hostile relations with Pakistan.\n\nX/Shehbaz Sharif The leaders of Pakistan and Bangladesh have expressed a desire to boost ties\n\nRelations between Dhaka and Delhi have been frosty since Hasina's exit. India has not reacted to Bangladesh's demands to extradite her to face charges of crimes against humanity, money laundering and corruption. Hasina denies the accusations against her. Some experts think the reviving of relations between Dhaka and Islamabad is a strategic move. \"Pakistan and Bangladesh have a tactical relationship at the moment. Together, they want to represent a pushback against the dominance of India,\" says Ayesha Siddiqa, a Pakistani academic who is a senior fellow at King's College in London. There have been other developments apart from starting direct trade. Muhammad Yunus, head of the interim Bangladesh government, met Pakistan's Prime Minister Shehbaz Sharif at multilateral forums several times in recent months. And then there is a growing military relationship. A high-level Bangladeshi military delegation made a rare visit to Pakistan in January and held talks with influential army chief General Asim Munir. The Bangladeshi navy also participated in a multinational maritime exercise organised by Pakistan off the Karachi coast in February. . Veena Sikri, who was India's high commissioner to Bangladesh between 2003 and 2006, describes the growing closeness between Dhaka and Islamabad as a \"déjà vu\" moment. During her tenure in Dhaka, she said, India repeatedly raised the issue of \"Indian insurgents getting trained inside Bangladesh with the support of the ISI [Pakistan's intelligence agency] and a section of the Bangladeshi military\". \"We even provided evidence to Bangladeshi authorities,\" she said. Authorities in Pakistan and Bangladesh denied these allegations at the time. The long, porous border between India and Bangladesh makes it relatively easy for armed insurgent groups from India's north-eastern states to cross over from Bangladesh. But, after Hasina's Awami League came to power in 2009, it cracked down on these groups and dismantled their bases. So the revival of military ties between Bangladesh and Pakistan is \"a major security concern for India\", says Ms Sikri. \"It's not just the military relationship. The Pakistani establishment is also reviving ties with Bangladeshi Islamist parties like the Jamaat-e-Islami, which supported Islamabad during Bangladesh's independence war,\" she adds. The Yunus administration's press office has flatly rejected Indian media reports that senior ISI officials have visited Dhaka. It has also described reports that claim Pakistani operatives were working to reopen a camp of an Indian insurgent group in Bangladesh as \"baseless\". Pakistan's military did not respond to BBC questions on India's concerns over the future role of the ISI in Bangladesh. Analysts say Bangladeshi politicians are aware that, given the close economic and linguistic ties, Dhaka cannot afford to take an anti-India stance. And despite apprehensions in Delhi, Bangladeshi diplomats argue that ties with Pakistan cannot be normalised unless issues related to the 1971 war are resolved.\n\nGetty Images Bangladesh, backed by the Indian army, gained independence from Pakistan in 1971 after months of war\n\nDuring the war, hundreds of thousands of Bengalis were killed and tens of thousands of women were raped. The war ended with more than 90,000 Pakistani security and civilian personnel surrendering to the joint command of Indian and Bangladeshi forces in what is seen as a humiliating chapter in Islamabad. Bangladesh has demanded a formal apology from Pakistan for the atrocities committed during the war but Islamabad has shown no inclination to do so. \"Pakistan needs to own the crimes that had taken place during the independence war,\" said Mr Kabir, the former Bangladeshi diplomat. \"We had also raised the issue of the division of pre-1971 assets between the two nations in several bilateral meetings with Pakistan.\" Even former Pakistani military officers like Ikram Sehgal accept that \"the main stumbling block in bilateral ties is the requirement of the Bangladeshis that Pakistanis should apologise for what happened in 1971\". However, the retired Pakistan army major insists that Bangladesh should also address the issue of attacks by Bengalis on Urdu speakers during the struggle for independence. \"I was a witness to the atrocities that took place against the Urdu-speaking Bihari people [in East Pakistan],\" Mr Sehgal, who now lives in Karachi, told the BBC.\n\nGetty Images Last year, hundreds were killed in the worst violence Bangladesh has seen since its war of independence in 1971\n\nWhile history casts a shadow over ties between Dhaka and Islamabad, economists point out the two countries can first focus on improving bilateral trade, which currently stands at less than $700m (£540m), mostly in favour of Pakistan. \"Pakistan's more than 250 million population is a solid market for Bangladesh in the medium to long term,\" says Sabrin Beg, an associate professor of economics at the University of Delaware. Currently, there are constraints including high tariffs on both sides and businesses and exporters face visa and travel obstacles, she points out. However, Ms Beg says \"improved bilateral political and trade relations will ease these constraints\". Some of these issues may be discussed during Pakistani foreign minister Ishaq Dar's visit to Dhaka in April. By the end of the year Bangladesh is expected to hold general elections and a new government may have a different set of foreign policy priorities. But, whatever happens, the stakes are high for Delhi, which strongly feels that a stable and friendly Bangladesh is necessary to maintain peace and stability in its north-eastern states.",
    "clean_body": "india watches warily as bangladeshpakistan ties thaw 17 march 2025 share save anbarasan ethirajan south asia regional editor share save getty images bangladesh imported 50000 tonnes of rice from pakistan in february the dramatic political developments in bangladesh that led to prime minister sheikh hasina being ousted last year have thrown up many surprises including dhakas growing closeness with onetime foe pakistan last month after decades of troubled relations the two countries began directly trading for the first time with dhaka importing 50000 tonnes of rice from pakistan direct flights and military contacts have also been revived visa procedures have been simplified and there are reports of cooperation on security matters the countries separated by the landmass of india have deep painful historical ties the animosity between them goes back to 1971 when bangladesh then known as east pakistan launched a struggle to gain independence from islamabad india supported the bengali rebels during the ninemonth war which led to the formation of bangladesh while the scars from that period run deep dhaka had cordial relations with islamabad between 2001 and 2006 when a coalition of the bangladesh nationalist party bnp and the jamaateislami governed the country this changed during hasinas 15year rule from 2009 when she was strongly backed by delhi and maintained a distance from pakistan but after she fled to india following mass protests against her government ties seem to be thawing for the past 15 years the pakistanbangladesh relationship was on a slightly difficult trajectory says humayun kabir a former senior bangladeshi diplomat adding that the relationship seems to now be returning to that of two normal neighbours the developments are being watched closely particularly in india which has a long history of hostile relations with pakistan xshehbaz sharif the leaders of pakistan and bangladesh have expressed a desire to boost ties relations between dhaka and delhi have been frosty since hasinas exit india has not reacted to bangladeshs demands to extradite her to face charges of crimes against humanity money laundering and corruption hasina denies the accusations against her some experts think the reviving of relations between dhaka and islamabad is a strategic move pakistan and bangladesh have a tactical relationship at the moment together they want to represent a pushback against the dominance of india says ayesha siddiqa a pakistani academic who is a senior fellow at kings college in london there have been other developments apart from starting direct trade muhammad yunus head of the interim bangladesh government met pakistans prime minister shehbaz sharif at multilateral forums several times in recent months and then there is a growing military relationship a highlevel bangladeshi military delegation made a rare visit to pakistan in january and held talks with influential army chief general asim munir the bangladeshi navy also participated in a multinational maritime exercise organised by pakistan off the karachi coast in february veena sikri who was indias high commissioner to bangladesh between 2003 and 2006 describes the growing closeness between dhaka and islamabad as a déjà vu moment during her tenure in dhaka she said india repeatedly raised the issue of indian insurgents getting trained inside bangladesh with the support of the isi pakistans intelligence agency and a section of the bangladeshi military we even provided evidence to bangladeshi authorities she said authorities in pakistan and bangladesh denied these allegations at the time the long porous border between india and bangladesh makes it relatively easy for armed insurgent groups from indias northeastern states to cross over from bangladesh but after hasinas awami league came to power in 2009 it cracked down on these groups and dismantled their bases so the revival of military ties between bangladesh and pakistan is a major security concern for india says ms sikri its not just the military relationship the pakistani establishment is also reviving ties with bangladeshi islamist parties like the jamaateislami which supported islamabad during bangladeshs independence war she adds the yunus administrations press office has flatly rejected indian media reports that senior isi officials have visited dhaka it has also described reports that claim pakistani operatives were working to reopen a camp of an indian insurgent group in bangladesh as baseless pakistans military did not respond to bbc questions on indias concerns over the future role of the isi in bangladesh analysts say bangladeshi politicians are aware that given the close economic and linguistic ties dhaka cannot afford to take an antiindia stance and despite apprehensions in delhi bangladeshi diplomats argue that ties with pakistan cannot be normalised unless issues related to the 1971 war are resolved getty images bangladesh backed by the indian army gained independence from pakistan in 1971 after months of war during the war hundreds of thousands of bengalis were killed and tens of thousands of women were raped the war ended with more than 90000 pakistani security and civilian personnel surrendering to the joint command of indian and bangladeshi forces in what is seen as a humiliating chapter in islamabad bangladesh has demanded a formal apology from pakistan for the atrocities committed during the war but islamabad has shown no inclination to do so pakistan needs to own the crimes that had taken place during the independence war said mr kabir the former bangladeshi diplomat we had also raised the issue of the division of pre1971 assets between the two nations in several bilateral meetings with pakistan even former pakistani military officers like ikram sehgal accept that the main stumbling block in bilateral ties is the requirement of the bangladeshis that pakistanis should apologise for what happened in 1971 however the retired pakistan army major insists that bangladesh should also address the issue of attacks by bengalis on urdu speakers during the struggle for independence i was a witness to the atrocities that took place against the urduspeaking bihari people in east pakistan mr sehgal who now lives in karachi told the bbc getty images last year hundreds were killed in the worst violence bangladesh has seen since its war of independence in 1971 while history casts a shadow over ties between dhaka and islamabad economists point out the two countries can first focus on improving bilateral trade which currently stands at less than 700m £540m mostly in favour of pakistan pakistans more than 250 million population is a solid market for bangladesh in the medium to long term says sabrin beg an associate professor of economics at the university of delaware currently there are constraints including high tariffs on both sides and businesses and exporters face visa and travel obstacles she points out however ms beg says improved bilateral political and trade relations will ease these constraints some of these issues may be discussed during pakistani foreign minister ishaq dars visit to dhaka in april by the end of the year bangladesh is expected to hold general elections and a new government may have a different set of foreign policy priorities but whatever happens the stakes are high for delhi which strongly feels that a stable and friendly bangladesh is necessary to maintain peace and stability in its northeastern states",
    "summary": "India supported the Bengali rebels during the nine-month war which led to the formation of Bangladesh.\nThe developments are being watched closely, particularly in India, which has a long history of hostile relations with Pakistan.\nA high-level Bangladeshi military delegation made a rare visit to Pakistan in January and held talks with influential army chief General Asim Munir.\nThe long, porous border between India and Bangladesh makes it relatively easy for armed insurgent groups from India's north-eastern states to cross over from Bangladesh.\nSo the revival of military ties between Bangladesh and Pakistan is \"a major security concern for India\", says Ms Sikri.",
    "keywords": [
      "ties",
      "watches",
      "pakistani",
      "moves",
      "bangladeshi",
      "warily",
      "closer",
      "bangladesh",
      "war",
      "military",
      "islamabad",
      "dhaka",
      "india",
      "pakistan"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/6033/live/2c461f50-001d-11f0-b50e-9d086302645f.jpg"
  },
  "https://www.bbc.com/news/articles/c62xxz141plo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c62xxz141plo",
    "date": "2025-03-03",
    "time": "00:00:00",
    "title": "TikTok investigated by UK watchdog over use of children's data",
    "body": "TikTok investigated over use of children's data\n\n3 March 2025 Share Save Tom Gerken Technology reporter Share Save\n\nPA Media\n\nThe UK data watchdog has launched what it calls a \"major investigation\" into TikTok's use of children's personal information. The Information Commissioner's Office (ICO) will inspect the way in which the social media platform uses the data of 13 to 17-year-olds to recommend further content to them. John Edwards, the Information Commissioner, said it would look at whether TikTok's data collection practices could lead to children experiencing harms, such as data being leaked or spending \"more time than is healthy\" on the platform. TikTok told the BBC its recommender systems operated under \"strict and comprehensive measures that protect the privacy and safety of teens\".\n\nIt added that the platform also has \"robust restrictions on the content allowed in teens' feeds\". Mr Edwards said TikTok's algorithm \"feeds\" on personal data gleaned from user profiles, preferences, links clicked and how long they spend watching a particular video - making it subject to UK rules. In addition to the probe into TikTok, the ICO is also checking the age verification processes of Reddit and Imgur, an image-sharing platform. The investigation will look into whether the companies are complying with both the UK's data protection laws, and the children's code. The code is set to design principles for online platforms aimed at protecting children in the UK. Platforms which collect UK children's user data must minimise the amount they gather and take extra care when processing it.\n\nReddit and Imgur probes\n\nThe ICO's investigations into Reddit and Imgur will focus on how the platforms check the ages of their users and their enforcement of age checks. Ofcom said in October Reddit had overtaken X as the UK's fifth most popular platform. Imgur, meanwhile, says on its website that it reaches more than 250 million people a month. However, it does not state in which countries their users are based, so there is no figure for the number of people using it in the UK. \"I don't want to pre-judge how we might look at the Imgur and Reddit matters, but if there are age limits for accessing services, then the platforms have to enforce those in some ways,\" the Information Commissioner told the BBC. \"There are a number of different technologies and techniques that are available, I would say, and the degree of rigor, I think, depends in part upon the kinds of risks, the likelihood that children will be accessing those sites. \"I guess a baseline would be: self-declaration is probably not going to cut it if there is content on the site or services on the site that are unsuitable for children under the age of 13.\" A Reddit spokesperson told the BBC that 95% of their users are adults but that they \"have plans to roll out changes this year that address updates to UK regulations around age assurance\". Imgur has not responded to the BBC's request for a comment.\n\nNext steps",
    "clean_body": "tiktok investigated over use of childrens data 3 march 2025 share save tom gerken technology reporter share save pa media the uk data watchdog has launched what it calls a major investigation into tiktoks use of childrens personal information the information commissioners office ico will inspect the way in which the social media platform uses the data of 13 to 17yearolds to recommend further content to them john edwards the information commissioner said it would look at whether tiktoks data collection practices could lead to children experiencing harms such as data being leaked or spending more time than is healthy on the platform tiktok told the bbc its recommender systems operated under strict and comprehensive measures that protect the privacy and safety of teens it added that the platform also has robust restrictions on the content allowed in teens feeds mr edwards said tiktoks algorithm feeds on personal data gleaned from user profiles preferences links clicked and how long they spend watching a particular video making it subject to uk rules in addition to the probe into tiktok the ico is also checking the age verification processes of reddit and imgur an imagesharing platform the investigation will look into whether the companies are complying with both the uks data protection laws and the childrens code the code is set to design principles for online platforms aimed at protecting children in the uk platforms which collect uk childrens user data must minimise the amount they gather and take extra care when processing it reddit and imgur probes the icos investigations into reddit and imgur will focus on how the platforms check the ages of their users and their enforcement of age checks ofcom said in october reddit had overtaken x as the uks fifth most popular platform imgur meanwhile says on its website that it reaches more than 250 million people a month however it does not state in which countries their users are based so there is no figure for the number of people using it in the uk i dont want to prejudge how we might look at the imgur and reddit matters but if there are age limits for accessing services then the platforms have to enforce those in some ways the information commissioner told the bbc there are a number of different technologies and techniques that are available i would say and the degree of rigor i think depends in part upon the kinds of risks the likelihood that children will be accessing those sites i guess a baseline would be selfdeclaration is probably not going to cut it if there is content on the site or services on the site that are unsuitable for children under the age of 13 a reddit spokesperson told the bbc that 95 of their users are adults but that they have plans to roll out changes this year that address updates to uk regulations around age assurance imgur has not responded to the bbcs request for a comment next steps",
    "summary": "TikTok investigated over use of children's data3 March 2025 Share Save Tom Gerken Technology reporter Share SavePA MediaThe UK data watchdog has launched what it calls a \"major investigation\" into TikTok's use of children's personal information.\nIn addition to the probe into TikTok, the ICO is also checking the age verification processes of Reddit and Imgur, an image-sharing platform.\nThe investigation will look into whether the companies are complying with both the UK's data protection laws, and the children's code.\nThe code is set to design principles for online platforms aimed at protecting children in the UK.\nPlatforms which collect UK children's user data must minimise the amount they gather and take extra care when processing it.",
    "keywords": [
      "information",
      "reddit",
      "tiktok",
      "platform",
      "uk",
      "age",
      "platforms",
      "investigated",
      "children",
      "imgur",
      "watchdog",
      "data",
      "childrens"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/9098/live/81615920-f75b-11ef-a766-bffe669032d0.jpg"
  }
}