{
  "https://www.bbc.com/news/articles/c2307p4jjz4o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c2307p4jjz4o",
    "date": "2025-04-28",
    "time": "00:00:00",
    "title": "Graduates turned down by supermarkets as vacancies hit four-year low",
    "body": "Graduates turned down by supermarkets as vacancies drop\n\n28 April 2025 Share Save Kirsty Grant & Jennifer Meierhans BBC News reporters Share Save\n\nFaisa Ali Tarabi Faisa has been looking for work for 15 months\n\nYoung people have told the BBC they are finding it harder than ever to get a job, with some graduates frustrated at being turned down for roles at supermarkets. The government says getting more young people into work is a priority but UK job vacancies are at their lowest level in nearly four years. The British Retail Consortium (BRC), which represents supermarkets, told the BBC young people would be hit hardest as firms cut back on hiring because of rising employer costs and forthcoming changes to workers' rights. Faisa Ali Tarabi, 24, from Bolton said she had gone through Aldi's recruitment process only to be told there was no suitable vacancy.\n\nShe has a degree in accounting and finance from the University of Salford and a masters in management from Manchester Metropolitan University Looking for work since she finished her masters in January 2024, she estimates she has applied for around 2,000 roles. \"I've been without work for 15 months now, and to be honest, I'm not just looking for work with my degrees now. I'm trying to get whatever I can for the time being.\" Faisa says she applied for a job at an Aldi warehouse in March 2024 but she showed the BBC an email from the store's recruitment team saying: \"You've done really well so far, however we do not currently have a vacancy that fully meets your requirements.\" It said \"all is not lost though\" and said recruiters would be back in touch if a potential vacancy came up in the next 12 months. She says she has not heard anything since. The BBC has asked Aldi for a comment.\n\nIn February we reported that more 16-24 year-olds were not in work, education or training at the end of 2024 than at any point in the past 11 years. That is 13.4%, or almost one out of every seven people in that age range, according to the Office for National Statistics (ONS). Faisa was one of hundreds of people who commented on this report on BBC News TikTok saying their unemployment was not for want of trying. \"I check every day, there are no jobs,\" one user said. Another said: \"Finished my uni degree and can't find one job within the field I studied for.\" A third user posted: \"Young people aren't fussy we literally can't even get hired cleaning toilets.\"\n\nThe number of jobs on offer in the UK fell to 781,000 in the first three months of the year, according to the latest data from the Office for National Statistics (ONS). Some experts believe the rising cost of employing people is making businesses hold back on hiring new staff. In April the rate of employer National Insurance contributions (NICs) went up and so did minimum wages across different age groups. Business groups have also called for urgent changes to the forthcoming Employment Rights Bill over concerns it could hit hiring. Under the new law being scrutinised in the House of Lords on Tuesday, company bosses will be required to offer a zero-hours worker a guaranteed-hours contract based on the hours they clock up during a 12-week period. The biggest concern among retail HR directors is that this risks making it much harder to offer people part-time jobs, according to a BRC survey. It surveyed HR directors at 30 businesses, together employing 585,000 retail workers. Just over half said the law change would result in a reduction in staff numbers in their business, while 61% said the new law would reduce flexibility in job offerings.\n\nBRC chief executive Helen Dickinson said: \"Almost 250,000 jobs have been lost in retail over the last five years and many major retailers have already announced further job cuts on the back of increased costs of employment which kicked in in April.\" She said part-time roles were down by 200,000 since 2017. \"These roles, which provide vital entry points into work for students, carers and returners, are set to be hardest hit,\" she said. \"In its current form the Employment Rights Bill could backfire, putting the brakes on hiring, or worse still, putting retail job numbers further into reverse.\"\n\nAmy Wilkes Amy says not hearing back about job applications can feel \"impossible\" but says you must not give up\n\nIn November we spoke to Amy Wilkes, 23, from Coventry who was struggling to find a job after getting a degree in criminology, policing and investigation. She says she applied for supermarket roles but did not get a response. \"It was feeling impossible,\" she says. \"What really hurt me was the not hearing back because you don't get any feedback to tell you where you're going wrong.\" After seven months Amy secured a job as a support worker, which she will start in July. \"It was a surreal moment when I found out. I was in absolute shock, quite emotional but very thrilled,\" she says. Her biggest piece of advice to others looking for work is \"don't give up\". \"I know it's really hard but there is a job out there for you,\" she says. \"Think about what you can offer - that helped my confidence to think about myself and knowing my value and what I could bring to a company.\"\n\nA government spokesperson said its new \"youth guarantee\" was \"providing every 18-21-year-old in England with access to an apprenticeship, quality training and education opportunities or help to find a job\". It said its decisions, including to raise employer NICs, were necessary to \"stabilise the public finances\" to fund services like the NHS. They added that business could claim employer NICs relief for some eligible staff including those aged under 21 and for apprentices under the age of 25.\n\nSix expert tips for finding work",
    "clean_body": "graduates turned down by supermarkets as vacancies drop 28 april 2025 share save kirsty grant jennifer meierhans bbc news reporters share save faisa ali tarabi faisa has been looking for work for 15 months young people have told the bbc they are finding it harder than ever to get a job with some graduates frustrated at being turned down for roles at supermarkets the government says getting more young people into work is a priority but uk job vacancies are at their lowest level in nearly four years the british retail consortium brc which represents supermarkets told the bbc young people would be hit hardest as firms cut back on hiring because of rising employer costs and forthcoming changes to workers rights faisa ali tarabi 24 from bolton said she had gone through aldis recruitment process only to be told there was no suitable vacancy she has a degree in accounting and finance from the university of salford and a masters in management from manchester metropolitan university looking for work since she finished her masters in january 2024 she estimates she has applied for around 2000 roles ive been without work for 15 months now and to be honest im not just looking for work with my degrees now im trying to get whatever i can for the time being faisa says she applied for a job at an aldi warehouse in march 2024 but she showed the bbc an email from the stores recruitment team saying youve done really well so far however we do not currently have a vacancy that fully meets your requirements it said all is not lost though and said recruiters would be back in touch if a potential vacancy came up in the next 12 months she says she has not heard anything since the bbc has asked aldi for a comment in february we reported that more 1624 yearolds were not in work education or training at the end of 2024 than at any point in the past 11 years that is 134 or almost one out of every seven people in that age range according to the office for national statistics ons faisa was one of hundreds of people who commented on this report on bbc news tiktok saying their unemployment was not for want of trying i check every day there are no jobs one user said another said finished my uni degree and cant find one job within the field i studied for a third user posted young people arent fussy we literally cant even get hired cleaning toilets the number of jobs on offer in the uk fell to 781000 in the first three months of the year according to the latest data from the office for national statistics ons some experts believe the rising cost of employing people is making businesses hold back on hiring new staff in april the rate of employer national insurance contributions nics went up and so did minimum wages across different age groups business groups have also called for urgent changes to the forthcoming employment rights bill over concerns it could hit hiring under the new law being scrutinised in the house of lords on tuesday company bosses will be required to offer a zerohours worker a guaranteedhours contract based on the hours they clock up during a 12week period the biggest concern among retail hr directors is that this risks making it much harder to offer people parttime jobs according to a brc survey it surveyed hr directors at 30 businesses together employing 585000 retail workers just over half said the law change would result in a reduction in staff numbers in their business while 61 said the new law would reduce flexibility in job offerings brc chief executive helen dickinson said almost 250000 jobs have been lost in retail over the last five years and many major retailers have already announced further job cuts on the back of increased costs of employment which kicked in in april she said parttime roles were down by 200000 since 2017 these roles which provide vital entry points into work for students carers and returners are set to be hardest hit she said in its current form the employment rights bill could backfire putting the brakes on hiring or worse still putting retail job numbers further into reverse amy wilkes amy says not hearing back about job applications can feel impossible but says you must not give up in november we spoke to amy wilkes 23 from coventry who was struggling to find a job after getting a degree in criminology policing and investigation she says she applied for supermarket roles but did not get a response it was feeling impossible she says what really hurt me was the not hearing back because you dont get any feedback to tell you where youre going wrong after seven months amy secured a job as a support worker which she will start in july it was a surreal moment when i found out i was in absolute shock quite emotional but very thrilled she says her biggest piece of advice to others looking for work is dont give up i know its really hard but there is a job out there for you she says think about what you can offer that helped my confidence to think about myself and knowing my value and what i could bring to a company a government spokesperson said its new youth guarantee was providing every 1821yearold in england with access to an apprenticeship quality training and education opportunities or help to find a job it said its decisions including to raise employer nics were necessary to stabilise the public finances to fund services like the nhs they added that business could claim employer nics relief for some eligible staff including those aged under 21 and for apprentices under the age of 25 six expert tips for finding work",
    "summary": "The government says getting more young people into work is a priority but UK job vacancies are at their lowest level in nearly four years.\n\"I've been without work for 15 months now, and to be honest, I'm not just looking for work with my degrees now.\nBusiness groups have also called for urgent changes to the forthcoming Employment Rights Bill over concerns it could hit hiring.\n\"These roles, which provide vital entry points into work for students, carers and returners, are set to be hardest hit,\" she said.\n\"In its current form the Employment Rights Bill could backfire, putting the brakes on hiring, or worse still, putting retail job numbers further into reverse.\"",
    "keywords": [
      "job",
      "work",
      "turned",
      "bbc",
      "retail",
      "supermarkets",
      "hiring",
      "offer",
      "months",
      "looking",
      "vacancies",
      "roles",
      "graduates",
      "hit",
      "jobs",
      "low",
      "fouryear"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/c54c/live/ddb51a50-1b81-11f0-b42d-2f4e5a4ba8ce.jpg"
  },
  "https://www.bbc.com/news/articles/cd6j33g604go": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cd6j33g604go",
    "date": "2025-04-16",
    "time": "00:00:00",
    "title": "Five children arrested in Hartlepool over suspected arson",
    "body": "Five children arrested on suspicion of arson\n\nFive boys aged between 11 and 14 have been arrested in connection with the fire\n\nFive children have been arrested for allegedly setting fire to a derelict building.\n\nThe property on Victoria Road in Hartlepool went up in flames on Monday, shortly before 17:30 BST.\n\nOn Tuesday, three children were arrested in connection with the blaze and have now been bailed by Cleveland Police.\n\nThe force said two 13 year olds have also been arrested on suspicion of arson.",
    "clean_body": "five children arrested on suspicion of arson five boys aged between 11 and 14 have been arrested in connection with the fire five children have been arrested for allegedly setting fire to a derelict building the property on victoria road in hartlepool went up in flames on monday shortly before 1730 bst on tuesday three children were arrested in connection with the blaze and have now been bailed by cleveland police the force said two 13 year olds have also been arrested on suspicion of arson",
    "summary": "Five children arrested on suspicion of arsonFive boys aged between 11 and 14 have been arrested in connection with the fireFive children have been arrested for allegedly setting fire to a derelict building.\nThe property on Victoria Road in Hartlepool went up in flames on Monday, shortly before 17:30 BST.\nOn Tuesday, three children were arrested in connection with the blaze and have now been bailed by Cleveland Police.\nThe force said two 13 year olds have also been arrested on suspicion of arson.",
    "keywords": [
      "arson",
      "hartlepool",
      "went",
      "shortly",
      "children",
      "setting",
      "suspicion",
      "road",
      "suspected",
      "arrested",
      "victoria",
      "connection",
      "property"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/48fb/live/fea58090-1ad9-11f0-9ee6-231426df6da2.jpg"
  },
  "https://www.bbc.com/news/articles/c9dj0d6z6l0o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c9dj0d6z6l0o",
    "date": "2025-04-15",
    "time": "00:00:00",
    "title": "Carrigallen: Teenager killed in crash involving a tractor",
    "body": "Teen passenger killed in crash involving a tractor\n\nA teenager has died after a single-vehicle crash involving a tractor in Carrigallen in County Leitrim.\n\nThe incident on the R204 occurred at about 15:10 local time on Tuesday, according to Gardaí (Irish police).\n\nThe male passenger of the tractor was later pronounced dead at the scene.\n\nThe driver of the tractor, also a male aged in his late teens, was taken to Cavan General Hospital for treatment of injuries that are not thought to be life-threatening.",
    "clean_body": "teen passenger killed in crash involving a tractor a teenager has died after a singlevehicle crash involving a tractor in carrigallen in county leitrim the incident on the r204 occurred at about 1510 local time on tuesday according to gardaí irish police the male passenger of the tractor was later pronounced dead at the scene the driver of the tractor also a male aged in his late teens was taken to cavan general hospital for treatment of injuries that are not thought to be lifethreatening",
    "summary": "Teen passenger killed in crash involving a tractorA teenager has died after a single-vehicle crash involving a tractor in Carrigallen in County Leitrim.\nThe incident on the R204 occurred at about 15:10 local time on Tuesday, according to Gardaí (Irish police).\nThe male passenger of the tractor was later pronounced dead at the scene.\nThe driver of the tractor, also a male aged in his late teens, was taken to Cavan General Hospital for treatment of injuries that are not thought to be life-threatening.",
    "keywords": [
      "teenager",
      "crash",
      "treatment",
      "passenger",
      "killed",
      "thought",
      "carrigallen",
      "tractora",
      "teens",
      "involving",
      "tractor",
      "male"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/dc50/live/1b272160-1a3a-11f0-a020-db6d78ff6ddb.jpg"
  },
  "https://www.bbc.com/news/articles/cn8v2y86gd7o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cn8v2y86gd7o",
    "date": "2025-04-21",
    "time": "00:00:00",
    "title": "King Charles and Queen Camilla have 'heavy hearts' after Pope's death",
    "body": "King and Queen have 'heavy hearts' after Pope's death\n\n21 April 2025 Share Save Adam Durbin BBC News Share Save\n\nGetty Images\n\nKing Charles has said he and Queen Camilla have \"heavy hearts\" after Pope Francis's death, as they paid tribute to his \"compassion\" and \"tireless commitment\" to people of faith. In a statement, the King said that though \"deeply saddened\", their sorrow had been \"somewhat eased\" by the Pope being able to share an Easter greeting with the world on Sunday, before he died aged 88. The King and Camilla met the pontiff on a state visit to Italy earlier this month, which the couple said they remembered with \"particular affection\". Cardinal Vincent Nichols, the leader of Catholics in England and Wales, echoed the King's comments, saying the Pope's death \"brings great sadness to so many\".\n\nThe King and Queen's state visit to the Vatican in early April had been cancelled because of the Pope's poor health, but they managed to visit him privately during their trip to Italy. The meeting was arranged at the last minute and took place on 9 April - the King and Queen's 20th wedding anniversary - with the pontiff wishing them a happy anniversary. In his tribute, the King said: \"His Holiness will be remembered for his compassion, his concern for the unity of the Church and for his tireless commitment to the common causes of all people of faith, and to those of goodwill who work for the benefit of others. \"His belief that care for Creation is an existential expression of faith in God resounded with so many across the world. \"Through his work and care for both people and planet, he profoundly touched the lives of so many.\" He said he and the Queen \"remember with particular affection\" their meetings with the Pope over the years and \"were greatly moved to have been able to visit him earlier in the month\".\n\n'Faith and hope'\n\nCardinal Vincent Nichols described the Pope as \"a voice proclaiming the innate dignity of every human being, especially those who are poor or marginalised\". At a mass at Westminster Cathedral on Monday evening, he said while there was a \"sadness of loss\", there remained a \"confidence of faith and hope\". \"His voice so often called us not to optimism, but to renewed effort to protect those who were without hope, who could see no way forward,\" he said. \"He was sharply critical of all who ignored the wellbeing of so many and held them to be of no significance in their calculations and actions.\" Archbishop of York Stephen Cottrell, currently the most senior Church of England priest, described the Pope as a \"holy man of God\" who was \"also very human\". \"Francis's whole life and ministry was centred on Jesus who comes among us not to be served, but to serve,\" he added.\n\nGetty Images The King said he remembered meeting Pope Francis on several occasions - including the first in 2017 - with \"particular affection\"",
    "clean_body": "king and queen have heavy hearts after popes death 21 april 2025 share save adam durbin bbc news share save getty images king charles has said he and queen camilla have heavy hearts after pope franciss death as they paid tribute to his compassion and tireless commitment to people of faith in a statement the king said that though deeply saddened their sorrow had been somewhat eased by the pope being able to share an easter greeting with the world on sunday before he died aged 88 the king and camilla met the pontiff on a state visit to italy earlier this month which the couple said they remembered with particular affection cardinal vincent nichols the leader of catholics in england and wales echoed the kings comments saying the popes death brings great sadness to so many the king and queens state visit to the vatican in early april had been cancelled because of the popes poor health but they managed to visit him privately during their trip to italy the meeting was arranged at the last minute and took place on 9 april the king and queens 20th wedding anniversary with the pontiff wishing them a happy anniversary in his tribute the king said his holiness will be remembered for his compassion his concern for the unity of the church and for his tireless commitment to the common causes of all people of faith and to those of goodwill who work for the benefit of others his belief that care for creation is an existential expression of faith in god resounded with so many across the world through his work and care for both people and planet he profoundly touched the lives of so many he said he and the queen remember with particular affection their meetings with the pope over the years and were greatly moved to have been able to visit him earlier in the month faith and hope cardinal vincent nichols described the pope as a voice proclaiming the innate dignity of every human being especially those who are poor or marginalised at a mass at westminster cathedral on monday evening he said while there was a sadness of loss there remained a confidence of faith and hope his voice so often called us not to optimism but to renewed effort to protect those who were without hope who could see no way forward he said he was sharply critical of all who ignored the wellbeing of so many and held them to be of no significance in their calculations and actions archbishop of york stephen cottrell currently the most senior church of england priest described the pope as a holy man of god who was also very human franciss whole life and ministry was centred on jesus who comes among us not to be served but to serve he added getty images the king said he remembered meeting pope francis on several occasions including the first in 2017 with particular affection",
    "summary": "King and Queen have 'heavy hearts' after Pope's death21 April 2025 Share Save Adam Durbin BBC News Share SaveGetty ImagesKing Charles has said he and Queen Camilla have \"heavy hearts\" after Pope Francis's death, as they paid tribute to his \"compassion\" and \"tireless commitment\" to people of faith.\nThe King and Camilla met the pontiff on a state visit to Italy earlier this month, which the couple said they remembered with \"particular affection\".\nCardinal Vincent Nichols, the leader of Catholics in England and Wales, echoed the King's comments, saying the Pope's death \"brings great sadness to so many\".\n\"Francis's whole life and ministry was centred on Jesus who comes among us not to be served, but to serve,\" he added.\nGetty Images The King said he remembered meeting Pope Francis on several occasions - including the first in 2017 - with \"particular affection\"",
    "keywords": [
      "queen",
      "heavy",
      "charles",
      "pope",
      "faith",
      "hearts",
      "affection",
      "king",
      "popes",
      "visit",
      "particular",
      "remembered",
      "camilla",
      "share",
      "death"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/b2da/live/7936a180-1e91-11f0-b1b3-7358f8d35a35.jpg"
  },
  "https://www.bbc.com/news/articles/cx2wgpwjxyro": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cx2wgpwjxyro",
    "date": "2025-04-23",
    "time": "00:00:00",
    "title": "End to Birmingham bin strike in touching distance, says union",
    "body": "Bin strike end in touching distance, says union\n\n23 April 2025 Share Save Phil Mackie BBC News Midlands correspondent. Rob Mayor Political Reporter, Birmingham Share Save\n\nPA Media Uncollected rubbish has piled up in Birmingham during the dispute\n\nThe Unite union has agreed to attend mediation talks with conciliation service Acas next week to try to settle the ongoing bin strike in Birmingham. A deal could now be \"in touching distance\", the union said, but it accused the city council of \"saying one thing in public and another in the negotiations\". The all-out strike by Unite members over plans to downgrade some refuse workers, who could lose thousands of pounds a year each, started on 11 March. Talks with the council broke up after 45 minutes on Wednesday, the union said, while a spokesperson for the local authority stated negotiations were ongoing and \"positive\".\n\nAfter accusing the council of saying different things in public and talks, Unite general secretary Sharon Graham said this \"flip flopping needs to be sorted prior to the Acas negotiations next week\". The dispute initially centred on the council's decision to remove Waste Recycling and Collection Officer (WRCO) roles however Unite has increasingly also urged the council to guarantee the long-term pay for bin lorry drivers. While union bosses said a resolution could be in sight on the WRCO role row, they said an agreement seemed further off around drivers' pay. Unite accused the authority of failing \"to confirm whether it intends to cut the pay of hundreds of bin drivers by up to £8,000\" and Ms Graham said \"threats of savage pay cuts\" had to stop. \"Unite has put forward workable proposals,\" she said. \"The ball is now in the council's court.\"\n\nPA Media A major incident was declared last month amid public health concerns\n\nA Birmingham City Council spokesperson said on Wednesday there had been an agreement to hold further discussions at the end of next week \"under the auspices of Acas\". The talks have been scheduled for 1 and 2 May. The strike, now in its seventh week, led to a major incident being declared last month amid concerns for public health and the environment. Waste has been piling up in the city since hundreds of bin workers started all-out strike action as a result the dispute over pay and jobs. On Tuesday, Jim McMahon, housing, communities and local government minister, said at least 26,000 tonnes of rubbish had been removed from Birmingham's streets and \"regular bin collections have resumed\" amid the disruption. However recycling and garden waste collections, which were suspended at the beginning of the year, remain affected.\n\nMembers of Unite began staging one-day walkouts in January after being told some workers would be downgraded and have their pay cut. The action escalated on 11 March, when more than 300 workers began an all-out strike, but several hundred continued working. Wagons were stopped from carrying out their rounds and only about 10% of Birmingham's regular daily bin collections were being completed.\n\nFollow BBC Birmingham on BBC Sounds, Facebook, X and Instagram.",
    "clean_body": "bin strike end in touching distance says union 23 april 2025 share save phil mackie bbc news midlands correspondent rob mayor political reporter birmingham share save pa media uncollected rubbish has piled up in birmingham during the dispute the unite union has agreed to attend mediation talks with conciliation service acas next week to try to settle the ongoing bin strike in birmingham a deal could now be in touching distance the union said but it accused the city council of saying one thing in public and another in the negotiations the allout strike by unite members over plans to downgrade some refuse workers who could lose thousands of pounds a year each started on 11 march talks with the council broke up after 45 minutes on wednesday the union said while a spokesperson for the local authority stated negotiations were ongoing and positive after accusing the council of saying different things in public and talks unite general secretary sharon graham said this flip flopping needs to be sorted prior to the acas negotiations next week the dispute initially centred on the councils decision to remove waste recycling and collection officer wrco roles however unite has increasingly also urged the council to guarantee the longterm pay for bin lorry drivers while union bosses said a resolution could be in sight on the wrco role row they said an agreement seemed further off around drivers pay unite accused the authority of failing to confirm whether it intends to cut the pay of hundreds of bin drivers by up to £8000 and ms graham said threats of savage pay cuts had to stop unite has put forward workable proposals she said the ball is now in the councils court pa media a major incident was declared last month amid public health concerns a birmingham city council spokesperson said on wednesday there had been an agreement to hold further discussions at the end of next week under the auspices of acas the talks have been scheduled for 1 and 2 may the strike now in its seventh week led to a major incident being declared last month amid concerns for public health and the environment waste has been piling up in the city since hundreds of bin workers started allout strike action as a result the dispute over pay and jobs on tuesday jim mcmahon housing communities and local government minister said at least 26000 tonnes of rubbish had been removed from birminghams streets and regular bin collections have resumed amid the disruption however recycling and garden waste collections which were suspended at the beginning of the year remain affected members of unite began staging oneday walkouts in january after being told some workers would be downgraded and have their pay cut the action escalated on 11 march when more than 300 workers began an allout strike but several hundred continued working wagons were stopped from carrying out their rounds and only about 10 of birminghams regular daily bin collections were being completed follow bbc birmingham on bbc sounds facebook x and instagram",
    "summary": "Bin strike end in touching distance, says union23 April 2025 Share Save Phil Mackie BBC News Midlands correspondent.\nRob Mayor Political Reporter, Birmingham Share SavePA Media Uncollected rubbish has piled up in Birmingham during the disputeThe Unite union has agreed to attend mediation talks with conciliation service Acas next week to try to settle the ongoing bin strike in Birmingham.\nA deal could now be \"in touching distance\", the union said, but it accused the city council of \"saying one thing in public and another in the negotiations\".\nWaste has been piling up in the city since hundreds of bin workers started all-out strike action as a result the dispute over pay and jobs.\nThe action escalated on 11 March, when more than 300 workers began an all-out strike, but several hundred continued working.",
    "keywords": [
      "distance",
      "strike",
      "unite",
      "workers",
      "pay",
      "birmingham",
      "council",
      "end",
      "union",
      "talks",
      "bin",
      "week",
      "touching"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/896d/live/46c16c50-204c-11f0-9411-15ea0745f511.jpg"
  },
  "https://www.bbc.com/news/articles/cewgnee12n0o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cewgnee12n0o",
    "date": "2025-04-17",
    "time": "00:00:00",
    "title": "Robert Jenrick adds hundreds of contacts to WhatsApp group in mix-up",
    "body": "Jenrick adds hundreds to WhatsApp group in mix-up\n\n17 April 2025 Share Save Joshua Nevett Political reporter Share Save\n\nPA Media\n\nHundreds of Westminster insiders were added to - and then swiftly deleted from - a WhatsApp group set up by shadow justice secretary Robert Jenrick to promote his London Marathon run. The mishap was laughed off by Conservative leader Kemi Badenoch, who revealed that she too had briefly been a member of the chat along with senior journalists, former cabinet members and other Tory MPs. The BBC has been told Jenrick is not referring himself to the Information Commissioner's Office (ICO), which investigates data breaches. A source said the ICO did not need to be involved because the contacts had been added to the group for \"personal purposes\" and the risk of malicious use was low.\n\nThe ICO told BBC News that data protection law did not apply to the use of personal information for \"domestic and household\" purposes. But it said if \"non-corporate communication channels\" - such as WhatsApp groups - were being used for \"professional purposes\", data protection law would apply. A source said Jenrick had announced he was running in the London Marathon and \"in a technical mix-up, a message designed for broadcast turned into a group chat\". All of the contacts - which are believed to include former cabinet ministers Michael Gove and Therese Coffey among others - have been removed from the group and the chat has been deleted. When asked if she had been added to the group chat, Badenoch laughed before replying: \"Yes and then no, I think is the correct answer to that.\" \"I think he's running a marathon,\" Badenoch added. \"I don't really understand yet what happened with the WhatsApp group.\" The BBC understands Jenrick's intention was to send messages about his marathon run individually to friends and colleagues in Westminster, in an attempt to raise money for charity. In a post on X, Reform UK chairman Zia Yusuf said Jenrick had appeared to add \"his entire contact book\" to the group chat. \"He's now spending his morning deleting hundreds of them,\" Yusuf posted. In reply to that post, Jenrick wrote: \"Feeling left out again, Zia?\" Jenrick said he was running the London Marathon for SSAFA, the Armed Forces charity, adding he was \"rallying support for the cause\".\n\nThe Conservatives said they had consulted their data protection officer Andy Steadman, who had said this was not a party issue. \"This is nothing to do with the party, its a personal thing for Robert running a marathon,\" a Conservative spokesperson said. The BBC has seen screenshots of some of the messages in the group chat. In one message, a member posted \"RJ for PM\". Badenoch was asked if Jenrick, who previously ran against her for the Conservative Party leadership, now poses a fresh threat to her. She said: \"I have a great team and I'm leading a team that is uniting the Conservative Party. \"And what we're really focused on now is ensuring that people understand that voting Conservative at the local elections is the only credible option\".",
    "clean_body": "jenrick adds hundreds to whatsapp group in mixup 17 april 2025 share save joshua nevett political reporter share save pa media hundreds of westminster insiders were added to and then swiftly deleted from a whatsapp group set up by shadow justice secretary robert jenrick to promote his london marathon run the mishap was laughed off by conservative leader kemi badenoch who revealed that she too had briefly been a member of the chat along with senior journalists former cabinet members and other tory mps the bbc has been told jenrick is not referring himself to the information commissioners office ico which investigates data breaches a source said the ico did not need to be involved because the contacts had been added to the group for personal purposes and the risk of malicious use was low the ico told bbc news that data protection law did not apply to the use of personal information for domestic and household purposes but it said if noncorporate communication channels such as whatsapp groups were being used for professional purposes data protection law would apply a source said jenrick had announced he was running in the london marathon and in a technical mixup a message designed for broadcast turned into a group chat all of the contacts which are believed to include former cabinet ministers michael gove and therese coffey among others have been removed from the group and the chat has been deleted when asked if she had been added to the group chat badenoch laughed before replying yes and then no i think is the correct answer to that i think hes running a marathon badenoch added i dont really understand yet what happened with the whatsapp group the bbc understands jenricks intention was to send messages about his marathon run individually to friends and colleagues in westminster in an attempt to raise money for charity in a post on x reform uk chairman zia yusuf said jenrick had appeared to add his entire contact book to the group chat hes now spending his morning deleting hundreds of them yusuf posted in reply to that post jenrick wrote feeling left out again zia jenrick said he was running the london marathon for ssafa the armed forces charity adding he was rallying support for the cause the conservatives said they had consulted their data protection officer andy steadman who had said this was not a party issue this is nothing to do with the party its a personal thing for robert running a marathon a conservative spokesperson said the bbc has seen screenshots of some of the messages in the group chat in one message a member posted rj for pm badenoch was asked if jenrick who previously ran against her for the conservative party leadership now poses a fresh threat to her she said i have a great team and im leading a team that is uniting the conservative party and what were really focused on now is ensuring that people understand that voting conservative at the local elections is the only credible option",
    "summary": "Jenrick adds hundreds to WhatsApp group in mix-up17 April 2025 Share Save Joshua Nevett Political reporter Share SavePA MediaHundreds of Westminster insiders were added to - and then swiftly deleted from - a WhatsApp group set up by shadow justice secretary Robert Jenrick to promote his London Marathon run.\n\"I don't really understand yet what happened with the WhatsApp group.\"\nIn a post on X, Reform UK chairman Zia Yusuf said Jenrick had appeared to add \"his entire contact book\" to the group chat.\nBadenoch was asked if Jenrick, who previously ran against her for the Conservative Party leadership, now poses a fresh threat to her.\nShe said: \"I have a great team and I'm leading a team that is uniting the Conservative Party.",
    "keywords": [
      "adds",
      "contacts",
      "running",
      "data",
      "bbc",
      "marathon",
      "mixup",
      "robert",
      "chat",
      "conservative",
      "group",
      "party",
      "hundreds",
      "whatsapp",
      "jenrick"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4e52/live/eb79e310-1b76-11f0-ae04-a7ed40059b9f.jpg"
  },
  "https://www.bbc.com/news/articles/cq5w156y3jeo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cq5w156y3jeo",
    "date": "2025-04-30",
    "time": "00:00:00",
    "title": "Sir Richard Branson criticises Donald Trump's tariffs",
    "body": "Richard Branson criticises Donald Trump's tariffs\n\n30 April 2025 Share Save Harry Low BBC News Meghan Owen BBC London work and money correspondent Share Save\n\nPA Media Sir Richard Branson says Donald Trump's tariffs \"have done a lot of damage\"\n\nThe UK remains a \"fantastic\" place to start a business despite the \"setback\" of Brexit and the impact of Donald Trump's tariffs, Sir Richard Branson says. Speaking at the launch of his Virgin Group's hotel in Shoreditch, east London, the entrepreneur said that the world of business would \"have to deal with... the complete uncertainty\" of the impact of the US president's tariffs. The 74-year-old also told the BBC that he wanted to \"make London prosperous for everybody\" following the UK's decision to leave the EU. Sir Richard said: \"I still think it's a good time to start in the UK and... if we businesspeople can generate enough income for the UK, then taxes will start going down for people.\"\n\nSir Richard told BBC London he thought Trump \"got a nasty shock\"\n\nHe told the BBC that, more than 50 years after launching Virgin Records in London, the UK remained \"really special\" and was \"one of the few countries in the world that is stable\". Sir Richard said: \"I think that he [Trump] got a nasty shock when the whole world looked like it was going to melt down. \"When he thought he could get away with ridiculous tariffs, he had to backtrack and hopefully he's learned his lesson and there will be a more sensible regime put in place - but with him you never know what's going to happen. \"It's that unpredictability that has done a lot of damage in the world in the last couple of months.\"\n\nJames Bermingham, chief executive of Virgin Hotels, said: \"Londoners will weather any storm, and we've seen that decade after decade and crisis after crisis. \"The way people bounce back in the city truly sets a standard for the world to follow.\" On the possible introduction of a tourist tax in the capital, Mr Bermingham said he would support a \"small, reasonable fee\", that \"doesn't restrict demand, is industry-led and focused on... improving the tourist experience and improving tourism\".",
    "clean_body": "richard branson criticises donald trumps tariffs 30 april 2025 share save harry low bbc news meghan owen bbc london work and money correspondent share save pa media sir richard branson says donald trumps tariffs have done a lot of damage the uk remains a fantastic place to start a business despite the setback of brexit and the impact of donald trumps tariffs sir richard branson says speaking at the launch of his virgin groups hotel in shoreditch east london the entrepreneur said that the world of business would have to deal with the complete uncertainty of the impact of the us presidents tariffs the 74yearold also told the bbc that he wanted to make london prosperous for everybody following the uks decision to leave the eu sir richard said i still think its a good time to start in the uk and if we businesspeople can generate enough income for the uk then taxes will start going down for people sir richard told bbc london he thought trump got a nasty shock he told the bbc that more than 50 years after launching virgin records in london the uk remained really special and was one of the few countries in the world that is stable sir richard said i think that he trump got a nasty shock when the whole world looked like it was going to melt down when he thought he could get away with ridiculous tariffs he had to backtrack and hopefully hes learned his lesson and there will be a more sensible regime put in place but with him you never know whats going to happen its that unpredictability that has done a lot of damage in the world in the last couple of months james bermingham chief executive of virgin hotels said londoners will weather any storm and weve seen that decade after decade and crisis after crisis the way people bounce back in the city truly sets a standard for the world to follow on the possible introduction of a tourist tax in the capital mr bermingham said he would support a small reasonable fee that doesnt restrict demand is industryled and focused on improving the tourist experience and improving tourism",
    "summary": "Richard Branson criticises Donald Trump's tariffs30 April 2025 Share Save Harry Low BBC News Meghan Owen BBC London work and money correspondent Share SavePA Media Sir Richard Branson says Donald Trump's tariffs \"have done a lot of damage\"The UK remains a \"fantastic\" place to start a business despite the \"setback\" of Brexit and the impact of Donald Trump's tariffs, Sir Richard Branson says.\nThe 74-year-old also told the BBC that he wanted to \"make London prosperous for everybody\" following the UK's decision to leave the EU.\nSir Richard said: \"I still think it's a good time to start in the UK and... if we businesspeople can generate enough income for the UK, then taxes will start going down for people.\"\nSir Richard told BBC London he thought Trump \"got a nasty shock\"He told the BBC that, more than 50 years after launching Virgin Records in London, the UK remained \"really special\" and was \"one of the few countries in the world that is stable\".\nSir Richard said: \"I think that he [Trump] got a nasty shock when the whole world looked like it was going to melt down.",
    "keywords": [
      "donald",
      "london",
      "bbc",
      "told",
      "virgin",
      "criticises",
      "sir",
      "trumps",
      "richard",
      "branson",
      "world",
      "uk",
      "tariffs"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/c8e9/live/025ea470-2500-11f0-b324-e10b0a7b708d.jpg"
  },
  "https://www.bbc.com/news/articles/cd9ljx8qdqdo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cd9ljx8qdqdo",
    "date": "2025-04-14",
    "time": "00:00:00",
    "title": "Birmingham bin strike to continue as deal rejected",
    "body": "Birmingham bin strike to continue as deal rejected\n\n14 April 2025 Share Save Aida Fofana BBC News, West Midlands Rob Mayor BBC Political Reporter, Birmingham Share Save\n\nEPA The council declared a major incident at the end of last month (file photo from 3 April)\n\nA strike by bin workers in Birmingham is set to continue after the latest pay offer by the city council was \"overwhelmingly\" rejected. It follows a month-long stand-off between members of the Unite union and the Labour-run authority as bin bags and fly-tipped rubbish have piled high on streets. Unite said the city council's \"partial\" offer was \"totally inadequate\" and did not address the potential pay cuts for 200 drivers. The council has previously said the offer on the table was a fair one.\n\nUnite's national lead officer Onay Kasab said 97% of those who voted rejected the council's deal, on a 60% turnout. \"They could see through what this so-called proposal meant, it simply failed to deal with all of the issues and it also nailed the lie,\" he said. The union's general secretary Sharon Graham said the rejection was \"no surprise as these workers simply cannot afford to take pay cuts of this magnitude to pay the price for bad decision after bad decision\".\n\nUnite's national lead officer Onay Kasab the latest deal had been rejected by 97% of those who voted\n\nThe dispute centres around the council's decision to remove Waste Recycling and Collection Officer (WRCO) roles. The union argued that it was an important health and safety role and about 170 affected workers faced losing up to £8,000 annually due to the decision, with hundreds more losing out on the prospect of pay progression. A spokesperson for Birmingham City Council said the vote was \"incredibly disappointing\" but the authority's \"door remains open\". They claimed Unite's proposals focused on retaining a role that did not exist at other councils and could open up the council to more equal pay claims as refuse collection is a job overwhelmingly performed by men. The statement said a \"fair and reasonable offer\" was made while suggesting \"every employee affected by the removal of the WRCO role could take an equivalent graded role in the council, LGV Driver training or voluntary redundancy packages.\"\n\nSpeaking last week, councillors said with those deals in place no worker \"need lose a penny\". However, on Monday, Mr Kasab said the result of the ballot was proof that the dispute was more than \"simply about 17 workers\" - a number previously quoted by the council. He said: \"This is about huge pay cuts and hundreds of people, it's time now for us all to sit down, no more negative briefing, and let's reach a negotiated resolution and solution.\" One refuse collector told the BBC on Monday that the mood among their colleagues was \"powerful\", while another said their sentiments remained unchanged. \"As much as we want a resolution, none of us are willing to lose money,\" they added.\n\nSadia Khan, from the Friends of Spark Green Park, said there was a \"limit to how long this can go on\"\n\nLocal government minister Jim McMahon said the \"deeply disappointing\" result of the ballot would further add to the weeks of disruption. \"The huge effort to clear the backlog has already seen over 11,000 tonnes of waste collected, and will now continue at pace to protect public health while the dispute remains ongoing,\" he said. At the end of March, the council declared a major incident, saying that some 17,000 tonnes of rubbish was lining the city's streets. Some residents have also reported an increase in rats and other vermin. Adam Yasin said his Mercedes had been \"completely written off\" just weeks ago because rats had chewed through electrical wires. The 33-year-old, from Balsall Heath, said: \"Because of that certain wiring, the car wouldn't start. \"They said they need to rewire the whole car but the insurance company said it was too expensive. \"It has been really bad, especially where I live, there are a lot of restaurants there.\"\n\nReuters Other councils, including those in Lichfield and Telford, have offered assistance to clean up the streets\n\nIn recent days, military planners have been called in to help deal with the situation. Deputy Prime Minister Angela Rayner said that was not about \"boots on the ground\" but it would help get waste cleared. Other neighbouring authorities have also stepped in to help clear rubbish. \"We've got over two-thirds of the rubbish cleared off the streets now, this week we'll start to see cleaning up the pavements and streets as well as the clearance of all of that rubbish, I'm very pleased about that,\" Rayner said. \"The kids are off school - obviously it's Easter holidays, we want that rubbish cleared.\"\n\nPublic health\n\nSadia Khan, the chairperson of Friends of Spark Green Park, said while she sympathised with those on strike, \"rejecting another offer is just going to make the whole population a lot sicker\". She said dead cats had been found in parks and that she suspected it was due to them eating rat poison left out to reduce the growing problem of vermin. \"I know it's a financial crisis people are struggling to manage, and everyone deserves a better wage, but there's a limit to how long this can go on,\" she said. \"How much can you can risk the health of a population? Over a million people will be very, very impacted by things if it carries on.\" Last week, Health Secretary Wes Streeting said he was very concerned by the public health situation in Birmingham.\n\nThe council has come under fire for sending out leaflets about changes to recycling in the middle of the strike\n\nThe local authority is facing criticism, meanwhile, for pressing ahead with plans to switch from weekly to fortnightly collections while the strike remains unresolved. Leaflets about the change have appeared in residents' letter boxes, but Martin Mullaney, a former councillor for the city's Moseley and Kings Heath ward, said the timing was \"politically insensitive\". The leaflets state residents will have a new green recycling bin to be collected fortnightly, a food bin to be collected weekly, and a black bin to be collected fortnightly on alternate weeks to recycling collections. Although an all-out strike began on 11 March, there have been a series of on-off walkouts since January and some residents have told the BBC they have not had recycling collected in 2025.",
    "clean_body": "birmingham bin strike to continue as deal rejected 14 april 2025 share save aida fofana bbc news west midlands rob mayor bbc political reporter birmingham share save epa the council declared a major incident at the end of last month file photo from 3 april a strike by bin workers in birmingham is set to continue after the latest pay offer by the city council was overwhelmingly rejected it follows a monthlong standoff between members of the unite union and the labourrun authority as bin bags and flytipped rubbish have piled high on streets unite said the city councils partial offer was totally inadequate and did not address the potential pay cuts for 200 drivers the council has previously said the offer on the table was a fair one unites national lead officer onay kasab said 97 of those who voted rejected the councils deal on a 60 turnout they could see through what this socalled proposal meant it simply failed to deal with all of the issues and it also nailed the lie he said the unions general secretary sharon graham said the rejection was no surprise as these workers simply cannot afford to take pay cuts of this magnitude to pay the price for bad decision after bad decision unites national lead officer onay kasab the latest deal had been rejected by 97 of those who voted the dispute centres around the councils decision to remove waste recycling and collection officer wrco roles the union argued that it was an important health and safety role and about 170 affected workers faced losing up to £8000 annually due to the decision with hundreds more losing out on the prospect of pay progression a spokesperson for birmingham city council said the vote was incredibly disappointing but the authoritys door remains open they claimed unites proposals focused on retaining a role that did not exist at other councils and could open up the council to more equal pay claims as refuse collection is a job overwhelmingly performed by men the statement said a fair and reasonable offer was made while suggesting every employee affected by the removal of the wrco role could take an equivalent graded role in the council lgv driver training or voluntary redundancy packages speaking last week councillors said with those deals in place no worker need lose a penny however on monday mr kasab said the result of the ballot was proof that the dispute was more than simply about 17 workers a number previously quoted by the council he said this is about huge pay cuts and hundreds of people its time now for us all to sit down no more negative briefing and lets reach a negotiated resolution and solution one refuse collector told the bbc on monday that the mood among their colleagues was powerful while another said their sentiments remained unchanged as much as we want a resolution none of us are willing to lose money they added sadia khan from the friends of spark green park said there was a limit to how long this can go on local government minister jim mcmahon said the deeply disappointing result of the ballot would further add to the weeks of disruption the huge effort to clear the backlog has already seen over 11000 tonnes of waste collected and will now continue at pace to protect public health while the dispute remains ongoing he said at the end of march the council declared a major incident saying that some 17000 tonnes of rubbish was lining the citys streets some residents have also reported an increase in rats and other vermin adam yasin said his mercedes had been completely written off just weeks ago because rats had chewed through electrical wires the 33yearold from balsall heath said because of that certain wiring the car wouldnt start they said they need to rewire the whole car but the insurance company said it was too expensive it has been really bad especially where i live there are a lot of restaurants there reuters other councils including those in lichfield and telford have offered assistance to clean up the streets in recent days military planners have been called in to help deal with the situation deputy prime minister angela rayner said that was not about boots on the ground but it would help get waste cleared other neighbouring authorities have also stepped in to help clear rubbish weve got over twothirds of the rubbish cleared off the streets now this week well start to see cleaning up the pavements and streets as well as the clearance of all of that rubbish im very pleased about that rayner said the kids are off school obviously its easter holidays we want that rubbish cleared public health sadia khan the chairperson of friends of spark green park said while she sympathised with those on strike rejecting another offer is just going to make the whole population a lot sicker she said dead cats had been found in parks and that she suspected it was due to them eating rat poison left out to reduce the growing problem of vermin i know its a financial crisis people are struggling to manage and everyone deserves a better wage but theres a limit to how long this can go on she said how much can you can risk the health of a population over a million people will be very very impacted by things if it carries on last week health secretary wes streeting said he was very concerned by the public health situation in birmingham the council has come under fire for sending out leaflets about changes to recycling in the middle of the strike the local authority is facing criticism meanwhile for pressing ahead with plans to switch from weekly to fortnightly collections while the strike remains unresolved leaflets about the change have appeared in residents letter boxes but martin mullaney a former councillor for the citys moseley and kings heath ward said the timing was politically insensitive the leaflets state residents will have a new green recycling bin to be collected fortnightly a food bin to be collected weekly and a black bin to be collected fortnightly on alternate weeks to recycling collections although an allout strike began on 11 march there have been a series of onoff walkouts since january and some residents have told the bbc they have not had recycling collected in 2025",
    "summary": "Birmingham bin strike to continue as deal rejected14 April 2025 Share Save Aida Fofana BBC News, West Midlands Rob Mayor BBC Political Reporter, Birmingham Share SaveEPA The council declared a major incident at the end of last month (file photo from 3 April)A strike by bin workers in Birmingham is set to continue after the latest pay offer by the city council was \"overwhelmingly\" rejected.\nUnite said the city council's \"partial\" offer was \"totally inadequate\" and did not address the potential pay cuts for 200 drivers.\nUnite's national lead officer Onay Kasab said 97% of those who voted rejected the council's deal, on a 60% turnout.\nA spokesperson for Birmingham City Council said the vote was \"incredibly disappointing\" but the authority's \"door remains open\".\nThe leaflets state residents will have a new green recycling bin to be collected fortnightly, a food bin to be collected weekly, and a black bin to be collected fortnightly on alternate weeks to recycling collections.",
    "keywords": [
      "strike",
      "recycling",
      "councils",
      "rubbish",
      "pay",
      "continue",
      "rejected",
      "deal",
      "birmingham",
      "council",
      "health",
      "bin",
      "offer"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/08f7/live/9d0d45e0-1956-11f0-a455-cf1d5f751d2f.jpg"
  },
  "https://www.bbc.com/news/articles/cjr75wypg0vo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cjr75wypg0vo",
    "date": "2025-04-17",
    "time": "00:00:00",
    "title": "Discord's face scanning age checks 'start of a bigger shift'",
    "body": "Discord's face scanning age checks 'start of a bigger shift'\n\n17 April 2025 Share Save Imran Rahman-Jones & Chris Vallance Technology reporters Share Save\n\nGetty Images\n\nDiscord is testing face scanning to verify some users' ages in the UK and Australia. The social platform, which says it has over 200 million monthly users around the world, was initially used by gamers but now has communities on a wide range of topics including pornography. The UK's online safety laws mean platforms with adult content will need to have \"robust\" age verification in place by July. And social media expert Matt Navarra told the BBC \"this isn't a one-off - it's the start of a bigger shift\". \"Regulators want real proof, and facial recognition might be the fastest route there,\" he said.\n\nBut campaigners have said these types of checks are ineffective and could lead to privacy issues. \"Age assurance is becoming the new seatbelt for the internet,\" said Mr Navarra. \"Will it become the norm in the UK? Honestly, yes, probably.\" He said he believed the incoming changes in online safety laws mean online platforms would beef up their age verification processes. \"The era of 'click here to confirm you're 13' is dead,\" he said. \"Get age verification wrong now, and you don't just lose users - you could lose a courtroom battle or incur fines.\" Firms which do not comply with the Online Safety Act could be fined up to 10% of their global turnover. Instagram previously brought in age checks using facial analysis in 2022 for users who want to change their profile settings to be over 18. The social media company requires users to take a selfie video on their phone and uses AI to estimate the person's age. Like Discord, they can alternatively upload a picture of their photo ID.\n\nThe US-based platform says the verification - which it describes as \"an experiment\" - will be a one-time check. It will apply the first time a user comes across content which it has flagged as sensitive, or if they change their settings on viewing sensitive media. Users can either use the face scanner or upload a photo of their ID to confirm their age. It says information used for age checks will not be stored by Discord or the verification company. Face scans will stay on the device and not be collected, and ID uploads will be deleted after the verification is complete, according to the company. Content which is flagged as sensitive is already automatically blocked or blurred for teenagers.\n\n'No silver bullet'",
    "clean_body": "discords face scanning age checks start of a bigger shift 17 april 2025 share save imran rahmanjones chris vallance technology reporters share save getty images discord is testing face scanning to verify some users ages in the uk and australia the social platform which says it has over 200 million monthly users around the world was initially used by gamers but now has communities on a wide range of topics including pornography the uks online safety laws mean platforms with adult content will need to have robust age verification in place by july and social media expert matt navarra told the bbc this isnt a oneoff its the start of a bigger shift regulators want real proof and facial recognition might be the fastest route there he said but campaigners have said these types of checks are ineffective and could lead to privacy issues age assurance is becoming the new seatbelt for the internet said mr navarra will it become the norm in the uk honestly yes probably he said he believed the incoming changes in online safety laws mean online platforms would beef up their age verification processes the era of click here to confirm youre 13 is dead he said get age verification wrong now and you dont just lose users you could lose a courtroom battle or incur fines firms which do not comply with the online safety act could be fined up to 10 of their global turnover instagram previously brought in age checks using facial analysis in 2022 for users who want to change their profile settings to be over 18 the social media company requires users to take a selfie video on their phone and uses ai to estimate the persons age like discord they can alternatively upload a picture of their photo id the usbased platform says the verification which it describes as an experiment will be a onetime check it will apply the first time a user comes across content which it has flagged as sensitive or if they change their settings on viewing sensitive media users can either use the face scanner or upload a photo of their id to confirm their age it says information used for age checks will not be stored by discord or the verification company face scans will stay on the device and not be collected and id uploads will be deleted after the verification is complete according to the company content which is flagged as sensitive is already automatically blocked or blurred for teenagers no silver bullet",
    "summary": "Discord's face scanning age checks 'start of a bigger shift'17 April 2025 Share Save Imran Rahman-Jones & Chris Vallance Technology reporters Share SaveGetty ImagesDiscord is testing face scanning to verify some users' ages in the UK and Australia.\nThe UK's online safety laws mean platforms with adult content will need to have \"robust\" age verification in place by July.\nAnd social media expert Matt Navarra told the BBC \"this isn't a one-off - it's the start of a bigger shift\".\nHe said he believed the incoming changes in online safety laws mean online platforms would beef up their age verification processes.\nFirms which do not comply with the Online Safety Act could be fined up to 10% of their global turnover.",
    "keywords": [
      "safety",
      "users",
      "face",
      "sensitive",
      "scanning",
      "verification",
      "shift",
      "checks",
      "age",
      "bigger",
      "social",
      "start",
      "online",
      "media",
      "discords"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/efe0/live/38684c70-1b6d-11f0-b405-a9063c038ff6.jpg"
  },
  "https://www.bbc.com/news/articles/czd3jg60q4no": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/czd3jg60q4no",
    "date": "2025-04-17",
    "time": "00:00:00",
    "title": "Newspaper headlines: 'Victory for women' and 'equity policies in chaos'",
    "body": "'Victory for women' and 'equality policies in chaos'\n\n17 April 2025 Share Save Share Save\n\nPA Media Many front pages carry a photo of the two co-directors of For Women Scotland - who brought the case - smiling broadly, with their hands in the air\n\nThe Supreme Court's ruling that women are defined by their biological sex dominates the front pages. \"Trans women are not women\" is the Daily Telegraph's headline as it says access to single-sex NHS wards is likely to change. The Daily Mail hails the ruling as a \"victory...for common sense\". The Times says equality policies are now \"in chaos\", reporting that every organisation in England, Scotland and Wales - from hospitals to prisons and businesses - will have to review their policies. For the Daily Express author JK Rowling praises the \"extraordinary women\" that won the legal battle in the Supreme Court.\n\nThe Guardian notes that trans women still have equal pay rights as women, and could have the right to be treated as women in some situations. It says campaigners are urging trans people to remain calm. But it also quotes Victoria McCloud who was Britain's first trans-gender judge as saying the ruling would mark the start of a \"more intense fight for rights\". The discovery from scientists at the University of Cambridge that there are signs of life on a distant planet makes the front page of the Sun. The paper quotes a professor who is part of the team who detected traces of a molecule which is produced by plankton on Earth as saying that, \"there is no mechanism that can explain what we are seeing, without life\". The lead in the Daily Mirror is what the paper describes as the \"extraordinary gesture\" by the mother of Jean Charles de Menezes - who says that she has forgiven the police who shot her innocent son 20 years ago after what it said was a \"botched terror operation\" at Stockwell underground station. In an interview with the paper Maria de Menezes - who is now 80 - told the Mirror she did not want her final years to be \"destroyed by hatred\". The Metropolitan police said the shooting was a \"matter of deep regret\". Finally, the Daily Star says that sunburnt cavemen saved themselves by using \"prehistoric sunscreen\" more than 40,000 years ago.",
    "clean_body": "victory for women and equality policies in chaos 17 april 2025 share save share save pa media many front pages carry a photo of the two codirectors of for women scotland who brought the case smiling broadly with their hands in the air the supreme courts ruling that women are defined by their biological sex dominates the front pages trans women are not women is the daily telegraphs headline as it says access to singlesex nhs wards is likely to change the daily mail hails the ruling as a victoryfor common sense the times says equality policies are now in chaos reporting that every organisation in england scotland and wales from hospitals to prisons and businesses will have to review their policies for the daily express author jk rowling praises the extraordinary women that won the legal battle in the supreme court the guardian notes that trans women still have equal pay rights as women and could have the right to be treated as women in some situations it says campaigners are urging trans people to remain calm but it also quotes victoria mccloud who was britains first transgender judge as saying the ruling would mark the start of a more intense fight for rights the discovery from scientists at the university of cambridge that there are signs of life on a distant planet makes the front page of the sun the paper quotes a professor who is part of the team who detected traces of a molecule which is produced by plankton on earth as saying that there is no mechanism that can explain what we are seeing without life the lead in the daily mirror is what the paper describes as the extraordinary gesture by the mother of jean charles de menezes who says that she has forgiven the police who shot her innocent son 20 years ago after what it said was a botched terror operation at stockwell underground station in an interview with the paper maria de menezes who is now 80 told the mirror she did not want her final years to be destroyed by hatred the metropolitan police said the shooting was a matter of deep regret finally the daily star says that sunburnt cavemen saved themselves by using prehistoric sunscreen more than 40000 years ago",
    "summary": "\"Trans women are not women\" is the Daily Telegraph's headline as it says access to single-sex NHS wards is likely to change.\nThe Times says equality policies are now \"in chaos\", reporting that every organisation in England, Scotland and Wales - from hospitals to prisons and businesses - will have to review their policies.\nFor the Daily Express author JK Rowling praises the \"extraordinary women\" that won the legal battle in the Supreme Court.\nThe Guardian notes that trans women still have equal pay rights as women, and could have the right to be treated as women in some situations.\nFinally, the Daily Star says that sunburnt cavemen saved themselves by using \"prehistoric sunscreen\" more than 40,000 years ago.",
    "keywords": [
      "trans",
      "policies",
      "daily",
      "saying",
      "women",
      "chaos",
      "scotland",
      "victory",
      "newspaper",
      "paper",
      "ruling",
      "share",
      "headlines",
      "supreme",
      "equity"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/601c/live/0a017c80-1b18-11f0-a455-cf1d5f751d2f.png"
  },
  "https://www.bbc.com/news/articles/c78j1514974o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c78j1514974o",
    "date": "2025-04-17",
    "time": "00:00:00",
    "title": "Madeleine McCann investigation given further £108k funding",
    "body": "Madeleine McCann investigation given more cash\n\n17 April 2025 Share Save Share Save\n\nPA Media Madeleine McCann was three when she disappeared in May 2007\n\nMinisters have approved more than £100,000 in additional funding for Scotland Yard detectives investigating the disappearance of Madeleine McCann. Home Office sources said a request to provide up to £108,000 was approved for the probe, known as Operation Grange, for 2025-26. It is understood one detective chief inspector, one detective constable and one member of police staff are working on the investigation. Funding given to Operation Grange has totalled more than £13.2m since 2011.\n\nPA Media The three-year-old disappeared during a holiday in Portugal 18 years ago\n\nMadeleine, from Rothley in Leicestershire, was three when she vanished while on holiday with her parents in Praia da Luz, Portugal, in 2007. Christian Brückner, the main suspect in her disappearance, was recently cleared of unrelated sex offences in Germany that were alleged to have been committed in Portugal between 2000 and 2017. The 48-year-old spent many years in Portugal, including in Praia da Luz around the time of Madeleine's disappearance, and is currently serving a seven-year prison sentence in Germany for the rape of an elderly woman at her home in the resort town in 2005. He has denied all the charges against him and any involvement in Madeleine's disappearance. The Metropolitan Police is understood to be continuing its support for authorities in Germany and Portugal. Det Ch Insp Mark Cranwell, who is overseeing the British investigation into the disappearance, said: \"We continue to support Madeleine's family to understand what happened on the evening of 3 May 2007 in Praia da Luz. \"Our thoughts remain with the family.\"\n\nFollow BBC Leicester on Facebook, on X, or on Instagram. Send your story ideas to eastmidsnews@bbc.co.uk or via WhatsApp on 0808 100 2210.",
    "clean_body": "madeleine mccann investigation given more cash 17 april 2025 share save share save pa media madeleine mccann was three when she disappeared in may 2007 ministers have approved more than £100000 in additional funding for scotland yard detectives investigating the disappearance of madeleine mccann home office sources said a request to provide up to £108000 was approved for the probe known as operation grange for 202526 it is understood one detective chief inspector one detective constable and one member of police staff are working on the investigation funding given to operation grange has totalled more than £132m since 2011 pa media the threeyearold disappeared during a holiday in portugal 18 years ago madeleine from rothley in leicestershire was three when she vanished while on holiday with her parents in praia da luz portugal in 2007 christian brückner the main suspect in her disappearance was recently cleared of unrelated sex offences in germany that were alleged to have been committed in portugal between 2000 and 2017 the 48yearold spent many years in portugal including in praia da luz around the time of madeleines disappearance and is currently serving a sevenyear prison sentence in germany for the rape of an elderly woman at her home in the resort town in 2005 he has denied all the charges against him and any involvement in madeleines disappearance the metropolitan police is understood to be continuing its support for authorities in germany and portugal det ch insp mark cranwell who is overseeing the british investigation into the disappearance said we continue to support madeleines family to understand what happened on the evening of 3 may 2007 in praia da luz our thoughts remain with the family follow bbc leicester on facebook on x or on instagram send your story ideas to eastmidsnewsbbccouk or via whatsapp on 0808 100 2210",
    "summary": "Madeleine McCann investigation given more cash17 April 2025 Share Save Share SavePA Media Madeleine McCann was three when she disappeared in May 2007Ministers have approved more than £100,000 in additional funding for Scotland Yard detectives investigating the disappearance of Madeleine McCann.\nIt is understood one detective chief inspector, one detective constable and one member of police staff are working on the investigation.\nPA Media The three-year-old disappeared during a holiday in Portugal 18 years agoMadeleine, from Rothley in Leicestershire, was three when she vanished while on holiday with her parents in Praia da Luz, Portugal, in 2007.\nHe has denied all the charges against him and any involvement in Madeleine's disappearance.\nThe Metropolitan Police is understood to be continuing its support for authorities in Germany and Portugal.",
    "keywords": [
      "given",
      "disappearance",
      "funding",
      "germany",
      "investigation",
      "madeleines",
      "da",
      "mccann",
      "portugal",
      "madeleine",
      "praia",
      "luz",
      "108k"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/cce1/live/fc229ba0-1b9c-11f0-bade-39895cf97c9c.jpg"
  },
  "https://www.bbc.com/news/live/c4g2l654dket": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/c4g2l654dket",
    "date": "2025-04-22",
    "time": "00:00:00",
    "title": "US growth forecast to be hit hardest from Trump tariffs, IMF says",
    "body": "Global growth forecast slashed by IMF over tariff impact\n\nImogen James\n\nReporting from Washington DC\n\nThe impact of US President Donald Trump's tariffs is coming to light after the global growth forecast was downgraded.\n\nThe International Monetary Fund's (IMF) new report shows the United States faces the biggest downgrade among advanced economies.\n\nThe report states that an increase of tariffs and uncertainty will cause a \"significant slowdown,\" predicting the US economy will grow 1.8% this year, down from its previous estimate of 2.7%.\n\nThe IMF also said there is a 40% chance of a recession in the US.\n\nIt isn't the only country affected. The IMF slashed growth expectations for Canada, Japan, the UK, Germany, France and Italy.\n\nThe White House did not address the IMF's report today.\n\nInstead, press secretary Karoline Leavitt said there were 18 proposals for trade deals on the table, and plenty more discussions being had.\n\nAmericans remain divided. A farmer told us whilst tariffs will raise some costs, the long-term outcome is positive. But a comic store owner is already paying more, and says he will have to pass additional costs onto customers.\n\nYou can read more here about how the IMF slashed global growth forecasts.\n\nOur live coverage is now ending, thanks for joining us.",
    "clean_body": "global growth forecast slashed by imf over tariff impact imogen james reporting from washington dc the impact of us president donald trumps tariffs is coming to light after the global growth forecast was downgraded the international monetary funds imf new report shows the united states faces the biggest downgrade among advanced economies the report states that an increase of tariffs and uncertainty will cause a significant slowdown predicting the us economy will grow 18 this year down from its previous estimate of 27 the imf also said there is a 40 chance of a recession in the us it isnt the only country affected the imf slashed growth expectations for canada japan the uk germany france and italy the white house did not address the imfs report today instead press secretary karoline leavitt said there were 18 proposals for trade deals on the table and plenty more discussions being had americans remain divided a farmer told us whilst tariffs will raise some costs the longterm outcome is positive but a comic store owner is already paying more and says he will have to pass additional costs onto customers you can read more here about how the imf slashed global growth forecasts our live coverage is now ending thanks for joining us",
    "summary": "Global growth forecast slashed by IMF over tariff impactImogen JamesReporting from Washington DCThe impact of US President Donald Trump's tariffs is coming to light after the global growth forecast was downgraded.\nThe International Monetary Fund's (IMF) new report shows the United States faces the biggest downgrade among advanced economies.\nThe report states that an increase of tariffs and uncertainty will cause a \"significant slowdown,\" predicting the US economy will grow 1.8% this year, down from its previous estimate of 2.7%.\nThe IMF slashed growth expectations for Canada, Japan, the UK, Germany, France and Italy.\nYou can read more here about how the IMF slashed global growth forecasts.",
    "keywords": [
      "hardest",
      "trump",
      "slashed",
      "imf",
      "states",
      "growth",
      "forecast",
      "hit",
      "costs",
      "report",
      "18",
      "tariffs",
      "global"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c9f1/live/5ad5a4a0-1f79-11f0-b265-abe347419ae3.jpg"
  },
  "https://www.bbc.com/news/articles/c9de28n71ldo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c9de28n71ldo",
    "date": "2025-04-19",
    "time": "00:00:00",
    "title": "Inside the rural Texas town where Elon Musk is basing his business empire",
    "body": "Inside the rural Texas town where Elon Musk is basing his business empire\n\n19 April 2025 Share Save Mike Wendling • @mwendling BBC News Reporting from Bastrop, Texas Share Save\n\nGetty Images The site pictured in 2023, with SpaceX facilities at the top, The Boring Company located to the left and the building housing local businesses in the centre. Since then, the development has expanded further.\n\nAfter fleeing Silicon Valley for political and business reasons, Elon Musk is building a corporate campus in rural Texas – but his new neighbours have mixed views. Half an hour east of Austin, past the airport, the clogged-up traffic starts to melt away and the plains of Central Texas open up, leaving the booming city behind. Somewhere along the main two-lane highway, a left turn takes drivers down Farm-to-Market Road 1209. It seems like an unlikely address for a high-tech hub, but that's exactly what Elon Musk, the world's richest man and one of President Donald Trump's closest allies, hopes it will become. Court filings indicate that a large metal building finished in the last few months will be the new headquarters of X, his social media platform. A short distance away, a large logo of the Boring Company, Musk's infrastructure company, is plastered on the side of another headquarters. And across FM 1209 is a rapidly growing SpaceX facility which manufactures Starlink satellite internet equipment. Like most technology tycoons, Musk had long made Silicon Valley his home and headquarters. Once a supporter of the Democrats, his move to Texas is part of a larger tech world trend and also appears to reflect his own transformed ideological views. Here the land is (relatively) cheap, skilled tech workers from nearby Austin are plentiful, and local laws are favourable to development. Of course, there are also specific political angles to the move. In July 2024, Musk said he was quitting California after the state passed a law prohibiting teachers from enforcing rules about notifying families when students' gender identity changes. Musk has an estranged transgender daughter and has spoken out against what he calls \"woke mind virus\" - which he describes in interviews as divisive identity politics - along with anti-meritocratic and anti-free speech ideas. And so Musk upped sticks and headed to Texas, a Republican stronghold and the fastest-growing state in the US.\n\nBBC/Mike Wendling The entrance to a small cluster of shops and facilities near the corporate headquarters\n\nIn addition to the cluster of buildings near Bastrop in central Texas, he has built a SpaceX facility in Cameron County, on the southern tip of Texas near the border with Mexico. SpaceX employees there have filed a petition to create a new town called Starbase. The measure will go to a vote in May. Locals in Bastrop have mixed feelings about the development. \"It's almost like we have a split personality,\" says Sylvia Carrillo, city manager of Bastrop, which has a growing population of more than 12,000. \"Residents are happy that their children and grandchildren will have jobs in the area. \"On the other hand it can feel like we are being overwhelmed by a third party and that the development will quickly urbanise our area,\" she says. Although the Musk development is technically outside of the city's limits, it's close enough that Texas laws give Bastrop's government sway over development. And, Ms Carrillo stresses, the Musk buildings are just one example of many developments springing up in a booming area. \"He's faced a backlash that is not entirely of his own creating,\" she says. \"But now that he's here and things are changing quickly, it's a matter of managing\" issues like house and land prices and the environment, she says. The Musk compound is still fairly bare-bones. The grandly named Hyperloop Plaza sits in the middle of the corporate buildings, and is home to the company-owned Boring Bodega, a bar, coffee shop, hairdresser and gift shop. On a recent windy Sunday afternoon, a video game console sat unplayed in front of a couch near a display of company T-shirts, while a few children scurried back and forth to a playground outside. The developments in Bastrop fit right into the quickening pace of activity across central Texas, where cranes perpetually loom above the Austin skyline and the housing market is a perpetual topic of conversation. The area has gone through various industry booms and busts over the years, including lumber and coal mining, says Judy Enis, a volunteer guide at the Bastrop Museum and Visitor Center. During World War Two, tens of thousands of soldiers - and around 10,000 German prisoners of war - poured in to Camp Swift, a US Army facility north of the town. \"That probably had more of an impact than Elon Musk,\" Ms Enis notes.\n\nBBC/Mike Wendling Local officials and residents hope to keep the charm of Bastrop's bustling and old-fashioned downtown\n\nViews of the tycoon are mixed, to say the least, and inseparable not only from his politics but also opinions on economic development, in what still is a predominately rural area. Judah Ross, a local real estate agent, says the development has supercharged population growth that started as a result of the Austin boom and accelerated during the Covid pandemic. \"I'm always going to be biased because I want the growth,\" Mr Ross says. \"But I love it here and I want to be part of it. \"If nothing else, what's good is the amount of jobs that this is bringing in,\" he says. \"In the past year, I've sold to people working at Boring and SpaceX.\" Alfonso Lopez, a Texan who returned to the state after working in tech in Seattle, says he initially picked Bastrop figuring he would make a quick buck on a house purchase and move on. Instead, he quickly became enamoured with the town, its mix of local businesses and friendly people, and wants to stay.\n\nBBC/Mike Wendling Alfonso Lopez, like many Bastrop residents, has a balanced view of Musk, his companies and their impact on the local area\n\nMr Lopez is no big fan of Musk and is critical of some of his management practices and politics, but admires the technology his companies have built and is happy to live nearby as long as the companies are good neighbours. \"As long as they don't ruin my water or dig a tunnel beneath my house and create a sinkhole, this isn't bad,\" he says, gesturing around the metal shed housing the bodega, coffee shop and bar. \"I'll come here and watch a game.\" His concerns about water are more than theoretical. Last year The Boring Company was fined $11,876 (£8,950) by the Texas Commission on Environmental Quality after being cited for water pollution violations. The Boring Company initially planned to dump wastewater in the nearby Colorado River but, after local pressure, signed a deal to send the sludge to a Bastrop wastewater treatment plant. The water issues appear to have delayed housebuilding, which reportedly could include more than 100 homes for Musk employees. The planned development of homes has so far failed to materialise, however. For now, the extent of living quarters is a handful of temporary trailers behind the bodega building, surrounded by a wall, acres of Texas plain and a few horses munching grass. Ms Carrillo, the city manager, says any large-scale home building is at least a year off.\n\nGetty Images\n\nIn November, SpaceX applied for a free trade zone designation, which would allow it to move materials and finished products in and out of the Bastrop factory without being subject to tariffs - one of Donald Trump's signature policies. It's a common practice for manufacturers, and there are hundreds of similar zones across the country. Local officials in Texas have endorsed the proposal, saying it will boost the local economy, despite costing the county an estimated $45,000 (£34,800) in revenue this year. The company is also getting an injection of $17.3m (£13.4m) from the Texas government to develop the site, a grant that officials say is expected to create more than 400 jobs and $280m in capital investment in Bastrop. Few local residents wanted to directly criticise Musk when standing face-to-face with a visiting reporter. But it's a different story online, where sharper feelings shine through. \"They will ruin everything nearby,\" one resident posted on a local online forum. \"Nothing good comes with him.\"\n\nBBC/Mike Wendling Bastrop recently passed laws to protect green spaces and prevent dense housing developments. The Boring Company recently paid a fine because of wastewater discharge into the Colorado River, shown on the left",
    "clean_body": "inside the rural texas town where elon musk is basing his business empire 19 april 2025 share save mike wendling • mwendling bbc news reporting from bastrop texas share save getty images the site pictured in 2023 with spacex facilities at the top the boring company located to the left and the building housing local businesses in the centre since then the development has expanded further after fleeing silicon valley for political and business reasons elon musk is building a corporate campus in rural texas – but his new neighbours have mixed views half an hour east of austin past the airport the cloggedup traffic starts to melt away and the plains of central texas open up leaving the booming city behind somewhere along the main twolane highway a left turn takes drivers down farmtomarket road 1209 it seems like an unlikely address for a hightech hub but thats exactly what elon musk the worlds richest man and one of president donald trumps closest allies hopes it will become court filings indicate that a large metal building finished in the last few months will be the new headquarters of x his social media platform a short distance away a large logo of the boring company musks infrastructure company is plastered on the side of another headquarters and across fm 1209 is a rapidly growing spacex facility which manufactures starlink satellite internet equipment like most technology tycoons musk had long made silicon valley his home and headquarters once a supporter of the democrats his move to texas is part of a larger tech world trend and also appears to reflect his own transformed ideological views here the land is relatively cheap skilled tech workers from nearby austin are plentiful and local laws are favourable to development of course there are also specific political angles to the move in july 2024 musk said he was quitting california after the state passed a law prohibiting teachers from enforcing rules about notifying families when students gender identity changes musk has an estranged transgender daughter and has spoken out against what he calls woke mind virus which he describes in interviews as divisive identity politics along with antimeritocratic and antifree speech ideas and so musk upped sticks and headed to texas a republican stronghold and the fastestgrowing state in the us bbcmike wendling the entrance to a small cluster of shops and facilities near the corporate headquarters in addition to the cluster of buildings near bastrop in central texas he has built a spacex facility in cameron county on the southern tip of texas near the border with mexico spacex employees there have filed a petition to create a new town called starbase the measure will go to a vote in may locals in bastrop have mixed feelings about the development its almost like we have a split personality says sylvia carrillo city manager of bastrop which has a growing population of more than 12000 residents are happy that their children and grandchildren will have jobs in the area on the other hand it can feel like we are being overwhelmed by a third party and that the development will quickly urbanise our area she says although the musk development is technically outside of the citys limits its close enough that texas laws give bastrops government sway over development and ms carrillo stresses the musk buildings are just one example of many developments springing up in a booming area hes faced a backlash that is not entirely of his own creating she says but now that hes here and things are changing quickly its a matter of managing issues like house and land prices and the environment she says the musk compound is still fairly barebones the grandly named hyperloop plaza sits in the middle of the corporate buildings and is home to the companyowned boring bodega a bar coffee shop hairdresser and gift shop on a recent windy sunday afternoon a video game console sat unplayed in front of a couch near a display of company tshirts while a few children scurried back and forth to a playground outside the developments in bastrop fit right into the quickening pace of activity across central texas where cranes perpetually loom above the austin skyline and the housing market is a perpetual topic of conversation the area has gone through various industry booms and busts over the years including lumber and coal mining says judy enis a volunteer guide at the bastrop museum and visitor center during world war two tens of thousands of soldiers and around 10000 german prisoners of war poured in to camp swift a us army facility north of the town that probably had more of an impact than elon musk ms enis notes bbcmike wendling local officials and residents hope to keep the charm of bastrops bustling and oldfashioned downtown views of the tycoon are mixed to say the least and inseparable not only from his politics but also opinions on economic development in what still is a predominately rural area judah ross a local real estate agent says the development has supercharged population growth that started as a result of the austin boom and accelerated during the covid pandemic im always going to be biased because i want the growth mr ross says but i love it here and i want to be part of it if nothing else whats good is the amount of jobs that this is bringing in he says in the past year ive sold to people working at boring and spacex alfonso lopez a texan who returned to the state after working in tech in seattle says he initially picked bastrop figuring he would make a quick buck on a house purchase and move on instead he quickly became enamoured with the town its mix of local businesses and friendly people and wants to stay bbcmike wendling alfonso lopez like many bastrop residents has a balanced view of musk his companies and their impact on the local area mr lopez is no big fan of musk and is critical of some of his management practices and politics but admires the technology his companies have built and is happy to live nearby as long as the companies are good neighbours as long as they dont ruin my water or dig a tunnel beneath my house and create a sinkhole this isnt bad he says gesturing around the metal shed housing the bodega coffee shop and bar ill come here and watch a game his concerns about water are more than theoretical last year the boring company was fined 11876 £8950 by the texas commission on environmental quality after being cited for water pollution violations the boring company initially planned to dump wastewater in the nearby colorado river but after local pressure signed a deal to send the sludge to a bastrop wastewater treatment plant the water issues appear to have delayed housebuilding which reportedly could include more than 100 homes for musk employees the planned development of homes has so far failed to materialise however for now the extent of living quarters is a handful of temporary trailers behind the bodega building surrounded by a wall acres of texas plain and a few horses munching grass ms carrillo the city manager says any largescale home building is at least a year off getty images in november spacex applied for a free trade zone designation which would allow it to move materials and finished products in and out of the bastrop factory without being subject to tariffs one of donald trumps signature policies its a common practice for manufacturers and there are hundreds of similar zones across the country local officials in texas have endorsed the proposal saying it will boost the local economy despite costing the county an estimated 45000 £34800 in revenue this year the company is also getting an injection of 173m £134m from the texas government to develop the site a grant that officials say is expected to create more than 400 jobs and 280m in capital investment in bastrop few local residents wanted to directly criticise musk when standing facetoface with a visiting reporter but its a different story online where sharper feelings shine through they will ruin everything nearby one resident posted on a local online forum nothing good comes with him bbcmike wendling bastrop recently passed laws to protect green spaces and prevent dense housing developments the boring company recently paid a fine because of wastewater discharge into the colorado river shown on the left",
    "summary": "After fleeing Silicon Valley for political and business reasons, Elon Musk is building a corporate campus in rural Texas – but his new neighbours have mixed views.\nA short distance away, a large logo of the Boring Company, Musk's infrastructure company, is plastered on the side of another headquarters.\nAlthough the Musk development is technically outside of the city's limits, it's close enough that Texas laws give Bastrop's government sway over development.\nBBC/Mike Wendling Bastrop recently passed laws to protect green spaces and prevent dense housing developments.\nThe Boring Company recently paid a fine because of wastewater discharge into the Colorado River, shown on the left",
    "keywords": [
      "town",
      "basing",
      "spacex",
      "texas",
      "rural",
      "building",
      "business",
      "local",
      "wendling",
      "musk",
      "elon",
      "development",
      "bastrop",
      "company",
      "empire",
      "boring",
      "inside"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/1004/live/99e47f20-1daa-11f0-9644-3ba2ec84c20a.jpg"
  },
  "https://www.bbc.com/news/live/cdde3p81nglt": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/cdde3p81nglt",
    "date": "2025-04-16",
    "time": "00:00:00",
    "title": "Falling petrol prices drive drop in UK inflation rate to 2.6% - live updates",
    "body": "UK inflation slows as petrol prices come down\n\nImage source, Getty Images\n\nA drop in fuel prices helped drive down UK inflation by more than expected in the year to March.\n\nPrices increased by 2.6% in the year to March, falling for the second month in a row. Culture and recreation activities were another contributing factor for the drop with toys, games, and hobbies falling particularly sharply, according to the Office for National Statistics (ONS).\n\n\"The only significant offset came from the price of clothes which rose strongly this month,\" Grant Fitzner, chief economist at the ONS, says.\n\nFor petrol, the average price fell by 1.6p per litre between February and March to 137.5p per litre.\n\nThe inflation rate drop is an encouraging sign, Chancellor Rachel Reeves says, whilst acknowledging that there's \"more to be done\".\n\nAnalysts have warned that the fall may only be temporary as a spike is expected from April due to rising bills and higher business costs.\n\nShadow chancellor Mel Stride accused the Labour government of making policy choices that are \"keeping inflation higher for longer\".\n\nWe're wrapping up our live coverage but you can check out the latest updates in our story.",
    "clean_body": "uk inflation slows as petrol prices come down image source getty images a drop in fuel prices helped drive down uk inflation by more than expected in the year to march prices increased by 26 in the year to march falling for the second month in a row culture and recreation activities were another contributing factor for the drop with toys games and hobbies falling particularly sharply according to the office for national statistics ons the only significant offset came from the price of clothes which rose strongly this month grant fitzner chief economist at the ons says for petrol the average price fell by 16p per litre between february and march to 1375p per litre the inflation rate drop is an encouraging sign chancellor rachel reeves says whilst acknowledging that theres more to be done analysts have warned that the fall may only be temporary as a spike is expected from april due to rising bills and higher business costs shadow chancellor mel stride accused the labour government of making policy choices that are keeping inflation higher for longer were wrapping up our live coverage but you can check out the latest updates in our story",
    "summary": "UK inflation slows as petrol prices come downImage source, Getty ImagesA drop in fuel prices helped drive down UK inflation by more than expected in the year to March.\nPrices increased by 2.6% in the year to March, falling for the second month in a row.\nFor petrol, the average price fell by 1.6p per litre between February and March to 137.5p per litre.\nThe inflation rate drop is an encouraging sign, Chancellor Rachel Reeves says, whilst acknowledging that there's \"more to be done\".\nShadow chancellor Mel Stride accused the Labour government of making policy choices that are \"keeping inflation higher for longer\".",
    "keywords": [
      "expected",
      "live",
      "drop",
      "updates",
      "month",
      "drive",
      "uk",
      "falling",
      "price",
      "prices",
      "higher",
      "rate",
      "inflation",
      "petrol"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ebfa/live/3c660e30-1a81-11f0-8a1e-3ff815141b98.jpg"
  },
  "https://www.bbc.com/news/articles/c75dgz5pq2no": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c75dgz5pq2no",
    "date": "2025-04-30",
    "time": "00:00:00",
    "title": "Pakistan claims 'credible intelligence' India is planning an imminent military strike",
    "body": "Pakistan claims 'credible intelligence' India is planning an imminent military strike\n\nTarar said that India intends to use the attack as a \"false pretext\" for a strike and that \"any such military adventurism by India would be responded to assuredly and decisively\".\n\nAttaullah Tarar's comments come after India accused Pakistan of supporting militants behind an attack in Indian-administered Kashmir that killed 26 tourists last week. Islamabad rejects the allegations.\n\nPakistan's information minister says that the country has \"credible intelligence\" that India intends to launch a military strike within the next 24 to 36 hours.\n\nThe attack near the tourist town of Pahalgam was the deadliest attack on civilians in two decades in the disputed territory. Both India and Pakistan claim the region and have fought two wars over it.\n\nTroops from both sides have traded intermittent small-arms fire across the border in recent days.\n\nThere has been speculation over whether India will respond with military strikes against Pakistan, as it did after deadly militant attacks in 2019 and 2016.\n\nAuthorities said last week they had conducted extensive searches in Indian-administered Kashmir, detaining more than 1,500 people for questioning. More people have been detained since then, although the numbers are unclear.\n\nAuthorities have demolished the houses of at least 10 alleged militants. At least one was reportedly linked to a suspect named in the shootings.\n\nKashmir, which India and Pakistan claim in full but administer only in part, has been a flashpoint between the two nuclear-armed countries since they were partitioned in 1947.\n\nIndian-administered Kashmir has seen an armed insurgency against Indian rule since 1989, with militants targeting security forces and civilians alike.\n\nIndia has not named any group it suspects carried out the attack in Pahalgam and it remains unclear who did it. A little-known group called the Resistance Front, which was initially reported to have claimed it carried out the shootings, issued a statement denying involvement. The front is reportedly affiliated with Lashkar-e-Taiba, a Pakistan-based militant group.\n\nIndian police have named three of four suspected attackers. They said two were Pakistani nationals and one a local man from Indian-administered Kashmir. There is no information on the fourth man.\n\nMany survivors said the gunmen specifically targeted Hindu men.\n\nThe attack has sparked widespread anger in India, with Prime Minister Narendra Modi publicly saying the country will hunt the suspects \"till the ends of the earth\" and that those who planned and carried it out \"will be punished beyond their imagination\".",
    "clean_body": "pakistan claims credible intelligence india is planning an imminent military strike tarar said that india intends to use the attack as a false pretext for a strike and that any such military adventurism by india would be responded to assuredly and decisively attaullah tarars comments come after india accused pakistan of supporting militants behind an attack in indianadministered kashmir that killed 26 tourists last week islamabad rejects the allegations pakistans information minister says that the country has credible intelligence that india intends to launch a military strike within the next 24 to 36 hours the attack near the tourist town of pahalgam was the deadliest attack on civilians in two decades in the disputed territory both india and pakistan claim the region and have fought two wars over it troops from both sides have traded intermittent smallarms fire across the border in recent days there has been speculation over whether india will respond with military strikes against pakistan as it did after deadly militant attacks in 2019 and 2016 authorities said last week they had conducted extensive searches in indianadministered kashmir detaining more than 1500 people for questioning more people have been detained since then although the numbers are unclear authorities have demolished the houses of at least 10 alleged militants at least one was reportedly linked to a suspect named in the shootings kashmir which india and pakistan claim in full but administer only in part has been a flashpoint between the two nucleararmed countries since they were partitioned in 1947 indianadministered kashmir has seen an armed insurgency against indian rule since 1989 with militants targeting security forces and civilians alike india has not named any group it suspects carried out the attack in pahalgam and it remains unclear who did it a littleknown group called the resistance front which was initially reported to have claimed it carried out the shootings issued a statement denying involvement the front is reportedly affiliated with lashkaretaiba a pakistanbased militant group indian police have named three of four suspected attackers they said two were pakistani nationals and one a local man from indianadministered kashmir there is no information on the fourth man many survivors said the gunmen specifically targeted hindu men the attack has sparked widespread anger in india with prime minister narendra modi publicly saying the country will hunt the suspects till the ends of the earth and that those who planned and carried it out will be punished beyond their imagination",
    "summary": "Pakistan claims 'credible intelligence' India is planning an imminent military strikeTarar said that India intends to use the attack as a \"false pretext\" for a strike and that \"any such military adventurism by India would be responded to assuredly and decisively\".\nAttaullah Tarar's comments come after India accused Pakistan of supporting militants behind an attack in Indian-administered Kashmir that killed 26 tourists last week.\nPakistan's information minister says that the country has \"credible intelligence\" that India intends to launch a military strike within the next 24 to 36 hours.\nIndian-administered Kashmir has seen an armed insurgency against Indian rule since 1989, with militants targeting security forces and civilians alike.\nThey said two were Pakistani nationals and one a local man from Indian-administered Kashmir.",
    "keywords": [
      "attack",
      "strike",
      "credible",
      "kashmir",
      "named",
      "military",
      "indianadministered",
      "week",
      "militants",
      "india",
      "imminent",
      "claims",
      "planning",
      "pakistan",
      "carried",
      "intelligence"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/dd62/live/86ccd540-258e-11f0-8c93-17b95c5aba9f.jpg"
  },
  "https://www.bbc.com/news/articles/cn91peprnl2o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cn91peprnl2o",
    "date": "2025-04-27",
    "time": "00:00:00",
    "title": "Images of Pope Francis' tomb in Santa Maria Maggiore church released",
    "body": "Images of Pope Francis's tomb released\n\n27 April 2025 Share Save Aleks Phillips BBC News Share Save\n\nReuters The late pope was laid to rest at the Santa Maria Maggiore church in a private ceremony following his public funeral on Saturday\n\nImages of Pope Francis's tomb at the Santa Maria Maggiore church in Rome have been released. A single white rose was pictured lying on the stone tomb that bears the name he was known by during his pontificate, below a crucifix illuminated by a single spotlight. The late pope was laid to rest at the church - one of four major basilicas in the Italian capital, and one he would regularly visit during his time as cardinal and pontiff - in a private ceremony following his public funeral in the Vatican on Saturday. Thousands of mourners have been filing past the tomb since the church opened to the public on Sunday morning to pay their respects to Pope Francis, who died aged 88 on Monday.\n\nGetty Images A single white rose was pictured lying on the stone tomb bearing Pope Francis's name\n\nAmong them was Rosario Correale, an Italian, who said it was \"very emotional\" seeing the tomb. \"He really left a mark on us,\" he told the Associated Press. Polish pilgrim Maria Brzezinska felt the resting place befit the man. \"I feel like it's exactly in the way of the Pope. He was simple, and so is his place now,\" she told the news agency Reuters after visiting. Francis was particularly devoted to the Virgin Mary, and Santa Maria Maggiore was the first church to be dedicated to her when it was built in the 4th Century. The basilica sits near the Colosseum, a stone's throw from the city's endlessly bustling and chaotic central Termini station - well beyond the limits of the Vatican, where popes are traditionally entombed. But it was one the South American pontiff had a long-held affinity for. Its senior priest previously told an Italian newspaper that Pope Francis had said he wished to be laid to rest there in 2022, citing inspiration from the Virgin Mary. \"I thought it was amazing that he wanted to be buried here in this basilica,\" Amaya Morris, another pilgrim, told AP. \"Out of all of the [churches], he chose this one. So I thought that was really amazing. It's really humbling to be able to be here.\" Francis's funeral was attended by heads of state, heads of government and monarchs from around the world - as well as hundreds of thousands of Catholics who lined the streets leading to the Vatican to pay their respects. Hymns played out on giant speakers, occasionally drowned out by the sound of helicopters flying overhead, before 91-year-old Cardinal Giovanni Battista Re gave a homily on the pope's legacy. The cardinal emphasised that Pope Francis had repeatedly urged the world to \"build bridges, not walls\".\n\nReuters Mourners queued outside the church early on Sunday morning to be among the first to pay their respects",
    "clean_body": "images of pope franciss tomb released 27 april 2025 share save aleks phillips bbc news share save reuters the late pope was laid to rest at the santa maria maggiore church in a private ceremony following his public funeral on saturday images of pope franciss tomb at the santa maria maggiore church in rome have been released a single white rose was pictured lying on the stone tomb that bears the name he was known by during his pontificate below a crucifix illuminated by a single spotlight the late pope was laid to rest at the church one of four major basilicas in the italian capital and one he would regularly visit during his time as cardinal and pontiff in a private ceremony following his public funeral in the vatican on saturday thousands of mourners have been filing past the tomb since the church opened to the public on sunday morning to pay their respects to pope francis who died aged 88 on monday getty images a single white rose was pictured lying on the stone tomb bearing pope franciss name among them was rosario correale an italian who said it was very emotional seeing the tomb he really left a mark on us he told the associated press polish pilgrim maria brzezinska felt the resting place befit the man i feel like its exactly in the way of the pope he was simple and so is his place now she told the news agency reuters after visiting francis was particularly devoted to the virgin mary and santa maria maggiore was the first church to be dedicated to her when it was built in the 4th century the basilica sits near the colosseum a stones throw from the citys endlessly bustling and chaotic central termini station well beyond the limits of the vatican where popes are traditionally entombed but it was one the south american pontiff had a longheld affinity for its senior priest previously told an italian newspaper that pope francis had said he wished to be laid to rest there in 2022 citing inspiration from the virgin mary i thought it was amazing that he wanted to be buried here in this basilica amaya morris another pilgrim told ap out of all of the churches he chose this one so i thought that was really amazing its really humbling to be able to be here franciss funeral was attended by heads of state heads of government and monarchs from around the world as well as hundreds of thousands of catholics who lined the streets leading to the vatican to pay their respects hymns played out on giant speakers occasionally drowned out by the sound of helicopters flying overhead before 91yearold cardinal giovanni battista re gave a homily on the popes legacy the cardinal emphasised that pope francis had repeatedly urged the world to build bridges not walls reuters mourners queued outside the church early on sunday morning to be among the first to pay their respects",
    "summary": "Images of Pope Francis's tomb released27 April 2025 Share Save Aleks Phillips BBC News Share SaveReuters The late pope was laid to rest at the Santa Maria Maggiore church in a private ceremony following his public funeral on SaturdayImages of Pope Francis's tomb at the Santa Maria Maggiore church in Rome have been released.\nThousands of mourners have been filing past the tomb since the church opened to the public on Sunday morning to pay their respects to Pope Francis, who died aged 88 on Monday.\nGetty Images A single white rose was pictured lying on the stone tomb bearing Pope Francis's nameAmong them was Rosario Correale, an Italian, who said it was \"very emotional\" seeing the tomb.\nFrancis was particularly devoted to the Virgin Mary, and Santa Maria Maggiore was the first church to be dedicated to her when it was built in the 4th Century.\nThe cardinal emphasised that Pope Francis had repeatedly urged the world to \"build bridges, not walls\".",
    "keywords": [
      "tomb",
      "pope",
      "told",
      "maggiore",
      "francis",
      "images",
      "santa",
      "church",
      "maria",
      "vatican",
      "released",
      "single",
      "franciss"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/9c2c/live/2f9e40c0-2358-11f0-9060-674316cb3a1f.jpg"
  },
  "https://www.bbc.com/news/articles/c0l06z0z23po": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c0l06z0z23po",
    "date": "2025-04-14",
    "time": "00:00:00",
    "title": "Man dies after Eastbourne flat fire",
    "body": "Man dies and neighbours evacuated after flat fire\n\nSussex Police say emergency services attended the scene just after midnight on Sunday\n\nA man has died after a fire at a flat in Eastbourne, Sussex Police has said.\n\nCrews from East Sussex Fire and Rescue Service attended the blaze on the second floor of a building on Upperton Road shortly after midnight on Sunday morning.\n\nA police spokesperson said on Monday that neighbours had been safely evacuated but the sole occupant of the flat had died as a result of the incident.\n\nThey added that next of kin for the man, believed to be in his 70s, have been informed.",
    "clean_body": "man dies and neighbours evacuated after flat fire sussex police say emergency services attended the scene just after midnight on sunday a man has died after a fire at a flat in eastbourne sussex police has said crews from east sussex fire and rescue service attended the blaze on the second floor of a building on upperton road shortly after midnight on sunday morning a police spokesperson said on monday that neighbours had been safely evacuated but the sole occupant of the flat had died as a result of the incident they added that next of kin for the man believed to be in his 70s have been informed",
    "summary": "Man dies and neighbours evacuated after flat fireSussex Police say emergency services attended the scene just after midnight on SundayA man has died after a fire at a flat in Eastbourne, Sussex Police has said.\nCrews from East Sussex Fire and Rescue Service attended the blaze on the second floor of a building on Upperton Road shortly after midnight on Sunday morning.\nA police spokesperson said on Monday that neighbours had been safely evacuated but the sole occupant of the flat had died as a result of the incident.\nThey added that next of kin for the man, believed to be in his 70s, have been informed.",
    "keywords": [
      "flat",
      "evacuated",
      "died",
      "dies",
      "neighbours",
      "attended",
      "upperton",
      "sussex",
      "midnight",
      "man",
      "eastbourne",
      "sundaya"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/7763/live/dc110950-1836-11f0-b552-23f7caa5b442.jpg"
  },
  "https://www.bbc.com/news/articles/c70zg389p46o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c70zg389p46o",
    "date": "2025-04-29",
    "time": "00:00:00",
    "title": "Teen to be detained for eight years over Army chaplain stabbing",
    "body": "Boy gets eight years detention for Army chaplain stabbing\n\n29 April 2025 Share Save Share Save\n\nPA Media Father Paul Murphy outside the Central Criminal Court in Dublin on 29 April\n\nA 17-year-old boy who stabbed an Army chaplain outside a barracks in the Republic of Ireland last year has been sentenced to 10 years detention with the final two suspended. Fr Paul Murphy was stabbed seven times with a hunting knife while attempting to drive into Renmore Barracks in Galway in August 2024. The teenager, aged 16 at the time, was arrested at the scene after being restrained by members of the Defence Forces. The boy, who cannot be identified because of his age, had pleaded guilty to attempted murder earlier this year.\n\nIrish broadcaster RTÉ reported that the judge said the case demonstrated dangers to children caused by their exposure to and influence by extreme views online. The judge said the teenager had been radicalised and this was rooted in him being drawn in through the internet to extreme views. He said the teen's vulnerability to this was exacerbated by his social isolation, his prolonged engagement with certain websites and his autism spectrum disorder. The judge added that the boy was not experienced enough to understand the warped and twisted perspectives he encountered. The teenager was ordered by the judge to be supervised for three years after his release. The judge also ordered that he must undergo any programmes, including a deradicalisation programme, as directed by the Probation Service. Before the teenager was taken back into custody, Fr Murphy spoke to him for a few moments after shaking his hand. The sentence has been backdated to when the teenager entered custody in August.\n\nPA Media The incident happened at Renmore Barracks in County Galway in August 2024\n\nSpeaking outside the court on Tuesday, Fr Murphy said it was \"very easy for us to fight hatred with hatred and the world just becomes entrenched in hatred and that is the way the world is at the moment\". \"St John said that God is love and if we believe God to be love, then we know that love is stronger than hate and so to respond to hate with love will hopefully bring a different world for us all\". Fr Murphy said his \"only hope\" for the boy is that \"he will return to society better able to manage his own life and also to make a more positive contribution to society\". \"My focus now is to get home to prepare for the international and military pilgrimage to Lourdes which is coming up and then three days after that, I deploy to Lebanon for six months,\" he said.\n\nPrevious hearing\n\nFollowing a court hearing earlier in April, Fr Murphy offered forgiveness to the 17-year-old and hugged him. The Central Criminal Court in Dublin heard that the boy, who was 16 at the time, supported the so-called Islamic State (IS) group and had been radicalised online. CCTV footage showed showed Father Murphy driving his jeep through the gates of the barracks, after the teenager began stabbing him with a hunting knife. The boy hung on to the side of the vehicle and continued to stab the priest as the car moved. RTÉ reported that when the boy was arrested, he told gardaí: \"I did it. I attacked the guy in the car.\" He said he did it to \"protect the Irish Defence Forces work in Mali and all the stuff for Islam\". Analysis of a device found at his home found content suggestive of a radicalised Islamic mindset. A poster with Arabic writing saying 'Allahu Akhar' or 'God of Great' were found in the boy's home during a search. An Islamic State flag and a notebook with writing and graphic sketches depicting beheadings were also found. The teenager denied the sketches were his. The court heard he had converted to Islam at the age of 15. During interviews, the teenager claimed he had no real recollection of the incident, but he apologised, saying he did not realise the man he stabbed was a priest. He said he had mental health problems and said: \"I don't know what made me do it.\"",
    "clean_body": "boy gets eight years detention for army chaplain stabbing 29 april 2025 share save share save pa media father paul murphy outside the central criminal court in dublin on 29 april a 17yearold boy who stabbed an army chaplain outside a barracks in the republic of ireland last year has been sentenced to 10 years detention with the final two suspended fr paul murphy was stabbed seven times with a hunting knife while attempting to drive into renmore barracks in galway in august 2024 the teenager aged 16 at the time was arrested at the scene after being restrained by members of the defence forces the boy who cannot be identified because of his age had pleaded guilty to attempted murder earlier this year irish broadcaster rté reported that the judge said the case demonstrated dangers to children caused by their exposure to and influence by extreme views online the judge said the teenager had been radicalised and this was rooted in him being drawn in through the internet to extreme views he said the teens vulnerability to this was exacerbated by his social isolation his prolonged engagement with certain websites and his autism spectrum disorder the judge added that the boy was not experienced enough to understand the warped and twisted perspectives he encountered the teenager was ordered by the judge to be supervised for three years after his release the judge also ordered that he must undergo any programmes including a deradicalisation programme as directed by the probation service before the teenager was taken back into custody fr murphy spoke to him for a few moments after shaking his hand the sentence has been backdated to when the teenager entered custody in august pa media the incident happened at renmore barracks in county galway in august 2024 speaking outside the court on tuesday fr murphy said it was very easy for us to fight hatred with hatred and the world just becomes entrenched in hatred and that is the way the world is at the moment st john said that god is love and if we believe god to be love then we know that love is stronger than hate and so to respond to hate with love will hopefully bring a different world for us all fr murphy said his only hope for the boy is that he will return to society better able to manage his own life and also to make a more positive contribution to society my focus now is to get home to prepare for the international and military pilgrimage to lourdes which is coming up and then three days after that i deploy to lebanon for six months he said previous hearing following a court hearing earlier in april fr murphy offered forgiveness to the 17yearold and hugged him the central criminal court in dublin heard that the boy who was 16 at the time supported the socalled islamic state is group and had been radicalised online cctv footage showed showed father murphy driving his jeep through the gates of the barracks after the teenager began stabbing him with a hunting knife the boy hung on to the side of the vehicle and continued to stab the priest as the car moved rté reported that when the boy was arrested he told gardaí i did it i attacked the guy in the car he said he did it to protect the irish defence forces work in mali and all the stuff for islam analysis of a device found at his home found content suggestive of a radicalised islamic mindset a poster with arabic writing saying allahu akhar or god of great were found in the boys home during a search an islamic state flag and a notebook with writing and graphic sketches depicting beheadings were also found the teenager denied the sketches were his the court heard he had converted to islam at the age of 15 during interviews the teenager claimed he had no real recollection of the incident but he apologised saying he did not realise the man he stabbed was a priest he said he had mental health problems and said i dont know what made me do it",
    "summary": "Fr Paul Murphy was stabbed seven times with a hunting knife while attempting to drive into Renmore Barracks in Galway in August 2024.\nThe judge said the teenager had been radicalised and this was rooted in him being drawn in through the internet to extreme views.\nBefore the teenager was taken back into custody, Fr Murphy spoke to him for a few moments after shaking his hand.\nPrevious hearingFollowing a court hearing earlier in April, Fr Murphy offered forgiveness to the 17-year-old and hugged him.\nCCTV footage showed showed Father Murphy driving his jeep through the gates of the barracks, after the teenager began stabbing him with a hunting knife.",
    "keywords": [
      "teenager",
      "judge",
      "court",
      "barracks",
      "teen",
      "murphy",
      "world",
      "love",
      "detained",
      "army",
      "stabbing",
      "boy",
      "stabbed",
      "chaplain",
      "fr"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/e872/live/6592e8c0-250b-11f0-ab4d-3958b9b14770.jpg"
  },
  "https://www.bbc.com/news/articles/cy0xk86l9g9o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cy0xk86l9g9o",
    "date": "2025-04-12",
    "time": "00:00:00",
    "title": "Three million child deaths linked to drug resistance",
    "body": "Three million child deaths linked to drug resistance, study shows\n\n12 April 2025 Share Save Dominic Hughes Global health correspondent Share Save\n\nGetty Images Escherichia coli bacteria - also known as E. coli, the bug that causes food poisoning - is one of the bacteria that is showing greater resistance to front-line antibiotics\n\nMore than three million children around the world are thought to have died in 2022 as a result of infections that are resistant to antibiotics, according to a study by two leading experts in child health. Children in Africa and South East Asia were found to be most at risk. Antimicrobial resistance - known as AMR - develops when the microbes that cause infections evolve in such a way that antibiotic drugs no longer work. It has been identified as one of the biggest public health threats facing the world's population.\n\nA new study now reveals the toll that AMR is taking on children. Using data from multiple sources, including the World Health Organization (WHO) and the World Bank, the report's authors have calculated there were more than three million child deaths in 2022 linked to drug-resistant infections.\n\nExperts say this new study highlights a more than tenfold increase in AMR-related infections in children in just three years. The number could have been made worse by the impact of the Covid pandemic.\n\nIncreased use of antibiotics\n\nAntibiotics are used to treat or prevent a huge range of bacterial infections - everything from skin infections to pneumonia. They are also sometimes given as a precaution to prevent, rather than treat, an infection - for example if someone is having an operation or receiving chemotherapy treatment for cancer. Antibiotics have no impact on viral infections, though - illnesses such as the common cold, flu or Covid. But some bacteria have now evolved resistance to some drugs, due to their overuse and inappropriate use, while the production of new antibiotics - a lengthy and costly process - has slowed right down. The report's lead authors, Doctor Yanhong Jessika Hu of Murdoch Children's Research Institute in Australia and Professor Herb Harwell of the Clinton Health Access Initiative, point to a significant growth in the use of antibiotics that are meant to only be held back for the most serious infections. Between 2019 and 2021 the use of \"watch antibiotics\", drugs with a high risk of resistance, increased by 160% in South East Asia and 126% in Africa. Over the same period, \"reserve antibiotics\" - last-resort treatments for severe, multidrug-resistant infections - rose by 45% in South East Asia and 125% in Africa.\n\nDwindling options\n\nThe authors warn that if bacteria develop resistance to these antibiotics, there will be few, if any, alternatives for treating multidrug-resistant infections. Prof Harwell is presenting the findings at the Congress of the European Society of Clinical Microbiology and Infectious Diseases in Vienna later this month. \"AMR is a global problem. It affects everyone. We did this work really to focus on the disproportionate way in which AMR affects children,\" he said ahead of the event. \"We estimate three million deaths of children worldwide associated with antimicrobial resistance.\"\n\nIs there a solution to AMR?",
    "clean_body": "three million child deaths linked to drug resistance study shows 12 april 2025 share save dominic hughes global health correspondent share save getty images escherichia coli bacteria also known as e coli the bug that causes food poisoning is one of the bacteria that is showing greater resistance to frontline antibiotics more than three million children around the world are thought to have died in 2022 as a result of infections that are resistant to antibiotics according to a study by two leading experts in child health children in africa and south east asia were found to be most at risk antimicrobial resistance known as amr develops when the microbes that cause infections evolve in such a way that antibiotic drugs no longer work it has been identified as one of the biggest public health threats facing the worlds population a new study now reveals the toll that amr is taking on children using data from multiple sources including the world health organization who and the world bank the reports authors have calculated there were more than three million child deaths in 2022 linked to drugresistant infections experts say this new study highlights a more than tenfold increase in amrrelated infections in children in just three years the number could have been made worse by the impact of the covid pandemic increased use of antibiotics antibiotics are used to treat or prevent a huge range of bacterial infections everything from skin infections to pneumonia they are also sometimes given as a precaution to prevent rather than treat an infection for example if someone is having an operation or receiving chemotherapy treatment for cancer antibiotics have no impact on viral infections though illnesses such as the common cold flu or covid but some bacteria have now evolved resistance to some drugs due to their overuse and inappropriate use while the production of new antibiotics a lengthy and costly process has slowed right down the reports lead authors doctor yanhong jessika hu of murdoch childrens research institute in australia and professor herb harwell of the clinton health access initiative point to a significant growth in the use of antibiotics that are meant to only be held back for the most serious infections between 2019 and 2021 the use of watch antibiotics drugs with a high risk of resistance increased by 160 in south east asia and 126 in africa over the same period reserve antibiotics lastresort treatments for severe multidrugresistant infections rose by 45 in south east asia and 125 in africa dwindling options the authors warn that if bacteria develop resistance to these antibiotics there will be few if any alternatives for treating multidrugresistant infections prof harwell is presenting the findings at the congress of the european society of clinical microbiology and infectious diseases in vienna later this month amr is a global problem it affects everyone we did this work really to focus on the disproportionate way in which amr affects children he said ahead of the event we estimate three million deaths of children worldwide associated with antimicrobial resistance is there a solution to amr",
    "summary": "Antimicrobial resistance - known as AMR - develops when the microbes that cause infections evolve in such a way that antibiotic drugs no longer work.\nUsing data from multiple sources, including the World Health Organization (WHO) and the World Bank, the report's authors have calculated there were more than three million child deaths in 2022 linked to drug-resistant infections.\nExperts say this new study highlights a more than tenfold increase in AMR-related infections in children in just three years.\nDwindling optionsThe authors warn that if bacteria develop resistance to these antibiotics, there will be few, if any, alternatives for treating multidrug-resistant infections.\n\"We estimate three million deaths of children worldwide associated with antimicrobial resistance.\"",
    "keywords": [
      "amr",
      "study",
      "drug",
      "antibiotics",
      "children",
      "linked",
      "world",
      "resistance",
      "million",
      "child",
      "deaths",
      "health",
      "infections",
      "bacteria"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/e6e5/live/2ceb9b20-16e7-11f0-9b40-fbe9d39f3ec7.jpg"
  },
  "https://www.bbc.com/news/live/cdrgkr0xkelt": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/cdrgkr0xkelt",
    "date": "2025-04-17",
    "time": "00:00:00",
    "title": "Canadian party leaders face off in election debate",
    "body": "It's the final countdown before Canada heads to the polls\n\nImogen James\n\nLive reporter, Washington DC\n\nImage source, Adrian Wyld/POOL Image caption, From left to right: Pierre Poilievre, Mark Carney, Jagmeet Singh and Yves-François Blanchet\n\nTonight was the final shot for the leaders from four major Canadian political parties to argue their case for becoming Canada's next prime minister.\n\nWe heard arguments from Mark Carney, Liberal Party leader, Pierre Poilievre, Conservative Party leader, Jagmeet Singh, New Democratic Party leader and Yves-FrançoisBlanchet, Bloc Québécois leader.\n\nIt was fiery, quick - and very patriotic. They spoke on issues of security, tariffs, housing and the cost-of-living.\n\nThe United States - and President Donald Trump's threat to absorb Canada as the 51st state - also got a lot of attention.\n\nNow, all eyes look ahead to the election in 11 days.\n\nThough the leaders will get no more chances to take on their opponents face-to-face, they will continue heavy campaigning.\n\nIf you want a journalistic nightcap, we've summarised the key takeaways from the final leadership debate.\n\nThanks for joining us, and goodnight.\n\nThis page was edited by Jenna Moon and Caitlin Wilson. Lyse Doucet, Jessica Murphy and Nadine Yousif reported from Montreal and Toronto, and Imogen James, Ali Abbas Ahmadi and Kwasi Gyamfi Asiedu contributed blow-by-blow coverage from Washington DC and Toronto.",
    "clean_body": "its the final countdown before canada heads to the polls imogen james live reporter washington dc image source adrian wyldpool image caption from left to right pierre poilievre mark carney jagmeet singh and yvesfrançois blanchet tonight was the final shot for the leaders from four major canadian political parties to argue their case for becoming canadas next prime minister we heard arguments from mark carney liberal party leader pierre poilievre conservative party leader jagmeet singh new democratic party leader and yvesfrançoisblanchet bloc québécois leader it was fiery quick and very patriotic they spoke on issues of security tariffs housing and the costofliving the united states and president donald trumps threat to absorb canada as the 51st state also got a lot of attention now all eyes look ahead to the election in 11 days though the leaders will get no more chances to take on their opponents facetoface they will continue heavy campaigning if you want a journalistic nightcap weve summarised the key takeaways from the final leadership debate thanks for joining us and goodnight this page was edited by jenna moon and caitlin wilson lyse doucet jessica murphy and nadine yousif reported from montreal and toronto and imogen james ali abbas ahmadi and kwasi gyamfi asiedu contributed blowbyblow coverage from washington dc and toronto",
    "summary": "We heard arguments from Mark Carney, Liberal Party leader, Pierre Poilievre, Conservative Party leader, Jagmeet Singh, New Democratic Party leader and Yves-FrançoisBlanchet, Bloc Québécois leader.\nThe United States - and President Donald Trump's threat to absorb Canada as the 51st state - also got a lot of attention.\nThough the leaders will get no more chances to take on their opponents face-to-face, they will continue heavy campaigning.\nIf you want a journalistic nightcap, we've summarised the key takeaways from the final leadership debate.\nLyse Doucet, Jessica Murphy and Nadine Yousif reported from Montreal and Toronto, and Imogen James, Ali Abbas Ahmadi and Kwasi Gyamfi Asiedu contributed blow-by-blow coverage from Washington DC and Toronto.",
    "keywords": [
      "election",
      "face",
      "debate",
      "final",
      "poilievre",
      "pierre",
      "washington",
      "toronto",
      "mark",
      "leaders",
      "party",
      "singh",
      "canadian",
      "leader"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/09c7/live/86c54da0-1bea-11f0-a455-cf1d5f751d2f.jpg"
  },
  "https://www.bbc.com/news/articles/c87pnxe13z7o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c87pnxe13z7o",
    "date": "2025-04-29",
    "time": "00:00:00",
    "title": "Barton Aerodrome: Two men seriously injured in plane crash",
    "body": "Plane crash leaves two men seriously injured\n\n29 April 2025 Share Save Share Save\n\nMcroutlaws The men were helped out of the aircraft, say the fire service\n\nA man is in hospital with life-threatening injuries after a plane crashed at an aerodrome. The plane, a light aircraft, came down at Barton Aerodrome in Salford, Greater Manchester, just before 17:30 BST on Tuesday. Greater Manchester Police said a second man had suffered \"potentially life-threatening injuries\". The Air Accident Investigation Branch (AAIB) said it was carrying out an \"initial investigation\".\n\nThe two men were rescued from the wreckage and taken to Salford Royal Hospital.\n\nAnthony Parkes/Geograph Three fire engines attended the scene along with North West Ambulance Service and Greater Manchester Police\n\nA spokesperson for GMFRS said: \"At around 5.30pm today, three fire engines from across Greater Manchester and the technical response unit attended an aircraft crash at Barton Aerodrome, Eccles. \"Firefighters arrived quickly and assisted Greater Manchester Police, North West Ambulance Service and the airport fire service in making the area safe and helping two casualties out of the aircraft.\" GMP said: \"Emergency services are currently responding to a plane crash at Barton Aerodrome. \"Two men have been taken to hospital, one with life-threatening injuries and another with potentially life-changing injuries.\" The force added: \"A scene is in place whilst emergency service workers conduct their enquiries and people are asked to avoid the area.\"\n\nGoogle Barton Aerodrome said the AAIB have been informed and are carrying out an investigation\n\nBarton Aerodrome posted on its Facebook account: \"Today at 17:07 an aircraft accident occurred within the Barton Aerodrome boundary. \"The AAIB have been informed and are carrying out an investigation. \"Our onsite Rescue and Fire Fighting Services (RFFS) attended the incident and have worked alongside external emergency services. \"The two persons on board the aircraft have been taken to hospital via road ambulance.\"\n\nMore on this story Two critical after aircraft crash",
    "clean_body": "plane crash leaves two men seriously injured 29 april 2025 share save share save mcroutlaws the men were helped out of the aircraft say the fire service a man is in hospital with lifethreatening injuries after a plane crashed at an aerodrome the plane a light aircraft came down at barton aerodrome in salford greater manchester just before 1730 bst on tuesday greater manchester police said a second man had suffered potentially lifethreatening injuries the air accident investigation branch aaib said it was carrying out an initial investigation the two men were rescued from the wreckage and taken to salford royal hospital anthony parkesgeograph three fire engines attended the scene along with north west ambulance service and greater manchester police a spokesperson for gmfrs said at around 530pm today three fire engines from across greater manchester and the technical response unit attended an aircraft crash at barton aerodrome eccles firefighters arrived quickly and assisted greater manchester police north west ambulance service and the airport fire service in making the area safe and helping two casualties out of the aircraft gmp said emergency services are currently responding to a plane crash at barton aerodrome two men have been taken to hospital one with lifethreatening injuries and another with potentially lifechanging injuries the force added a scene is in place whilst emergency service workers conduct their enquiries and people are asked to avoid the area google barton aerodrome said the aaib have been informed and are carrying out an investigation barton aerodrome posted on its facebook account today at 1707 an aircraft accident occurred within the barton aerodrome boundary the aaib have been informed and are carrying out an investigation our onsite rescue and fire fighting services rffs attended the incident and have worked alongside external emergency services the two persons on board the aircraft have been taken to hospital via road ambulance more on this story two critical after aircraft crash",
    "summary": "Plane crash leaves two men seriously injured29 April 2025 Share Save Share SaveMcroutlaws The men were helped out of the aircraft, say the fire serviceA man is in hospital with life-threatening injuries after a plane crashed at an aerodrome.\nThe plane, a light aircraft, came down at Barton Aerodrome in Salford, Greater Manchester, just before 17:30 BST on Tuesday.\nGMP said: \"Emergency services are currently responding to a plane crash at Barton Aerodrome.\nGoogle Barton Aerodrome said the AAIB have been informed and are carrying out an investigationBarton Aerodrome posted on its Facebook account: \"Today at 17:07 an aircraft accident occurred within the Barton Aerodrome boundary.\nMore on this story Two critical after aircraft crash",
    "keywords": [
      "greater",
      "crash",
      "barton",
      "aerodrome",
      "men",
      "aircraft",
      "plane",
      "seriously",
      "service",
      "injuries",
      "injured",
      "manchester"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/a25e/live/42356dd0-2529-11f0-8c66-ebf25fc2cfef.jpg"
  },
  "https://www.bbc.com/news/articles/cly1n7jz587o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cly1n7jz587o",
    "date": "2025-04-27",
    "time": "00:00:00",
    "title": "Trump's first 100 days and the rapid remaking of a nation",
    "body": "The rapid remaking of a nation, in 100 days\n\n27 April 2025 Share Save Anthony Zurcher and Tom Geoghegan BBC News, Washington Share Save\n\nBBC\n\nDuring last year's presidential campaign, Donald Trump constantly repeated his intention to bring about dramatic change as soon as he returned to the White House. But few expected it to come at such breakneck speed. In the three months since he took the oath of office, the 47th president has deployed his power in a way that compares to few predecessors. In stacks of bound documents signed off with a presidential pen and policy announcements made in all caps on social media, his blizzard of executive actions has reached into every corner of American life. To his supporters, the shock-and-awe approach has been a tangible demonstration of an all-action president, delivering on his promises and enacting long-awaited reforms. But his critics fear he is doing irreparable harm to the country and overstepping his powers - crippling important government functions and perhaps permanently reshaping the presidency in the process. Here are six turning points from the first 100 days.\n\nA social media post sets off a constitutional firestorm\n\nFor once, it wasn't a Trump social media post that sparked an outcry. Three weeks into the new term, at 10.13am on a Sunday morning, Vice-President JD Vance wrote nine words that signalled a strategy which has since shaped the Trump administration's second term. \"Judges aren't allowed to control the executive's legitimate power,\" he declared on X. In the media frenzy that followed, legal experts lined up to challenge that assertion, pointing to a 220-year-old principle which lies at the heart of American democracy. Courts have the power to check and strike down any government action - laws, regulations and executive orders - they think violates the US Constitution. Vance's words represented a brazen challenge to judicial authority and, more broadly, the system of three co-equal branches of government crafted by America's founders. But Trump and his team remain unapologetic in extending the reach of the executive branch into the two other domains - Congress and the courts.\n\nGetty Images Three co-equal branches of government - legislative, executive, and judicial - were crafted by America's founders\n\nThe White House has moved aggressively to wrest control of spending from Congress, unilaterally defunding programmes and entire agencies. This erosion of its power has been largely met by silence on Capitol Hill, where Trump's Republicans hold slim majorities in both chambers. The courts have been more resistant, with well over 100 rulings so far halting presidential actions they deem to be unconstitutional, according to a tally by the New York Times. Some of the biggest clashes have been over Trump's immigration crackdown. In March, more than 200 Venezuelans deemed a danger to the US, were deported to El Salvador, many under sweeping wartime powers and without the usual process of evidence being presented in court. A Republican-appointed judge on a federal appeals court said he was \"shocked\" by how the White House had acted. \"Now the branches come too close to grinding irrevocably against one another in a conflict that promises to diminish both,\" Judge J. Harvie Wilkinson wrote. Trump and White House officials have said they will obey court rulings, even as the president lambasts many of the judges who issue them and the administration at times moves slowly to fully comply. It all amounts to a unique test of a constitutional system that for centuries has operated under a certain amount of good faith. While Trump has been at the centre of this push, one of his principal agents of chaos is a man who wasn't born in the US, but who built a business empire there.\n\nBrandishing a chainsaw, dressed in black\n\nElon Musk, dressed in black from head to toe and wearing sunglasses, stood centre stage and basked in the adulation of the Conservative Political Action Conference crowd. The richest man in the world, who wants to cut trillions of dollars from the federal government, said he had a special surprise. Argentinian President Javier Milei, known for his own budget-slashing, emerged from backstage and handed him a shiny gold chainsaw. \"This is the chainsaw for bureaucracy,\" Musk exclaimed. \"CHAINSAW!!\"\n\nGetty Images Elon Musk leaves the stage holding a chainsaw after speaking at the Conservative Political Action Conference\n\nIt was a dramatic illustration not only of Musk's enthusiasm for his \"Department of Government Efficiency\" (Doge) assignment, but also of the near rock-star status that the South African-born technologist has developed among the Trump faithful. Since that appearance, Musk has dispatched his operatives across the federal government, pushing to access sensitive government databases and identify programmes to slash. Although he has not come anywhere near to finding the trillions of dollars of waste he once promised, his cuts have drastically reduced dozens of agencies and departments - essentially shutting down the US Agency for International Development (USAID) and attempting to dismantle the Department of Education. While pledges to cut \"waste, fraud and abuse\" in government and trim the ballooning federal deficit typically have broad appeal, the manner in which Musk has used his metaphorical chainsaw has led to conflict with senior government officials and stoked anger among some of the American public. Some Trump supporters may approve of the administration's aggressive budget-cutting but other constituents have berated Republican legislators at town hall events. Hecklers have expressed fear that the cuts will adversely affect popular government programmes like Social Security retirement plans, veterans benefits, and health insurance coverage for the poor and elderly. Their concerns may not be entirely misplaced, given that these schemes make up the bulk of federal spending. If these programmes are not cut back, sweeping tax cuts that Trump has promised would further increase the scale of US government debt and put at risk arguably his biggest election promise - economic prosperity.\n\n'I had to think fast as billions was lost before my eyes'\n\nWhen trader Richard McDonald saw Trump hold up his charts in the White House Rose Garden showing a list of countries targeted by US tariffs, he knew he had to act fast. \"I jumped to my feet because I wasn't expecting a board [of charts] - I was expecting an announcement,\" he says. McDonald expected tariff cuts of 10% or 20%, but says \"nobody expected these huge numbers\". He raced to understand which companies might be worst hit. Then he sold. \"There are billions being wiped off share prices every second, so it's really 'fastest finger first'.\" He is one of the many traders who were at the coal face of global markets when share prices plunged everywhere following Trump's so-called \"Liberation Day\" tariff announcement. The S&P 500 index of the largest firms listed in the US was hit particularly hard - and even though the White House has reversed course on some of the highest tariffs, it hasn't fully recovered since.\n\nGetty Images The US stock market plummeted after President Trump announced \"Liberation Day\" tariffs\n\nThe economy was the biggest concern for US voters in November's election, and Trump rode a tide of deep unhappiness over Biden's handling of inflation all the way to victory. His pledge to cut prices, pare back government regulation and boost homegrown industry was a pro-business message warmly welcomed on Wall Street and by many working Americans. But as Trump tries to follow through on his promise of new tariffs, the economic costs, at least in the short term, have become painfully apparent. The stock market is sinking, interest rates - including for home mortgages - are rising, and consumer confidence is down. Unemployment is also ticking up, in part due to the growing number of federal employees forced out of their jobs. The Federal Reserve Bank, along with economic experts, warn Trump's plan will shrink economic growth and possibly lead to a recession. While the president's approval ratings on his handling of the economy have tumbled, many of his supporters are sticking with him. And in former industrial areas hollowed out by the loss of manufacturing jobs, there are hopes that tariffs could even the global playing field. \"Trump has earned back the respect,\" says truck driver Ben Maurer in Pennsylvania, referring to tariffs on China. \"We are still the force to be reckoned with.\" Economic concerns have contributed to Trump's overall decline in the polls, but in one key area, he is still largely on solid ground in the public's eye - immigration.\n\nSpotted in a photo - 'My son, shackled in prison'\n\n\"It's him! It's him! I recognise his features,\" says Myrelis Casique Lopez, pointing at a photo of men shackled and cuffed on the floor of one of the most infamous prisons in the world. She had spotted her son in the image, taken from above, of a sea of shaven heads belonging to men in white T-shirts sat in long, straight rows. At home in Maracay, Venezuela, Ms Casique was shown the photograph, first shared online by the El Salvador authorities, by a BBC reporter. When she last had contact with her son, he was in the US and facing deportation to Venezuela but now he was 1,430 miles (2,300 km) away from her, one of 238 men sent by US authorities to a notorious mega-jail in El Salvador.\n\nReuters US deports alleged members of the Venezuela gang Tren de Aragua to Cecot prison in El Salvador\n\nThe Trump administration says they are members of the Tren de Aragua gang - a powerful, multi-national crime operation - but Ms Casique insists her son is innocent. A tough stance on immigration was a central plank of Trump's re-election campaign, and the president has used his broad powers of enforcement to deliver that pledge. Illegal border crossings were falling at the end of the Biden presidency, but are now at their lowest monthly total for more than four years. A majority of the US public still backs the crackdown, but it has had a chilling effect on communities of foreign students who have found themselves caught up in the blitz. Some, including permanent residents, have been detained and face deportation because of their role in pro-Palestinian campus protests. They have rejected accusations that they support Hamas. Civil rights lawyers warn that some migrants are being deported without due process, sweeping up the innocent among the \"killers and thugs\" that Trump says are being targeted. While so far there haven't been the level of mass deportations that some hoped for and others feared, newly empowered immigration enforcement agents have taken action across the US in businesses, homes and churches. They have been active in universities too, which have become a prominent target of President Trump in several other ways.\n\nA clash with academic, media and corporate worlds\n\nOn 21 April, Harvard University's president, Alan Garber, decided to confront the White House head-on. In a letter to the university community, he announced a lawsuit challenging the Trump administration's move to freeze billions of dollars in federal grants. It was, he said, an illegal attempt to \"impose unprecedented and improper control\" over Harvard's operations. The White House said it had to take action because Harvard had not tackled antisemitism on campus - an issue that Garber said the university was taking steps to address. But the Ivy League college's move was the most prominent display of resistance against Trump's use of presidential power to target American higher education, a longstanding goal energised by pro-Palestinian protests that engulfed campuses in 2024. The president and his officials have since impounded or threatened to withhold billions of dollars in federal spending to reshape elite institutions like Harvard, which the president and many of his supporters think push a liberal ideology on students and researchers.\n\nGetty Images Protesters gather inside Harvard University\n\nEarlier in the month, Columbia University in New York City had agreed to a number of White House demands, including changes to its protest policies, campus security practices and Middle Eastern studies department. A similar dynamic has played out in the corporate and media worlds. Trump has used the withholding of federal contracts as a way to pressure law firms to recruit and represent more conservatives. Some of the firms have responded by offering the Trump administration millions of dollars in free legal services, while two firms have filed suit challenging the constitutionality of the administration's punishments. A defamation lawsuit Trump brought against ABC News has led to the media company contributing $15m (£11m) to Trump's presidential foundation. CBS is also in talks to settle a separate lawsuit over a Kamala Harris interview, as its parent company Paramount seeks federal approval for a merger with Skydance Media. The Associated Press, by contrast, has resisted administration pressure to accept Trump's \"Gulf of America\" name change despite the White House's efforts to block the news agency from coverage of the president. On the campaign trail, Trump warned about the runaway power of the federal government. Now in office, he is wielding that power in a way no previous modern president has attempted. Nowhere, however, have the impacts of his efforts been more visible than within the federal government agencies and departments that he now controls.\n\nA retreat on race and identity\n\nThe press conference at the White House began with a moment's silence for the victims of an aircraft collision over the Potomac River. Within seconds of the pause coming to an end, however, Trump was on the attack. A diversity and inclusion initiative at the Federal Aviation Agency was partly to blame for the tragedy, the president claimed, because it hired people with severe intellectual disabilities as air traffic controllers. He did not provide any evidence. It was a startling moment that was emblematic of the attack his presidency has launched against inclusivity programmes that have proliferated in recent years across the US government and corporate world.\n\nGetty Images A crane removes plane wreckage from the Potomac River\n\nTrump has directed the federal government to end its diversity and equity (DEI) programmes and investigate private companies and academic institutions thought to be engaged in \"illegal DEI\". His directive has accelerated moves among leading global companies like Meta and Goldman to cut back or eliminate these programmes. First introduced in the 1960s in the wake of civil rights victories, early forms of DEI were an attempt to expand opportunities for black Americans. They later expanded to take in women, LGBT rights and other racial groups. Efforts were stepped up and embraced by much of corporate America in the wake of the 2020 Black Lives Matters protests following the death of George Floyd at the hands of Minneapolis Police officers. But to its critics, DEI was putting politics and race above talent, creating division and was no longer needed in modern America. While Trump's directive seems to have support from a narrow majority of voters, some of the unexpected consequences have raised eyebrows. Arlington National Cemetery scrubbed from its website all mentions of the history of black and female service members. And the Enola Gay aircraft that dropped an atomic bomb on Japan was initially flagged for removal from Pentagon documents, apparently due to the word \"gay\".\n\nDonald Trump's first 100 days have been an unprecedented display of unilateral power exercised by a modern American president. His efforts to dismantle large swaths of the federal government will take years, if not decades, for subsequent presidents to restore - if they so desire. In other ways, however, Trump's efforts so far may end up being less permanent. Without the support of new laws passed by Congress, many of his sweeping reforms could be wiped away by a future president. And so to what extent this whirlwind start leads to lasting change remains an open question. Later this year, the narrow Republican majorities in Congress will attempt to provide the legislative backing for Trump's agenda, but their success is far from guaranteed. And in next year's mid-term congressional elections, those majorities could be replaced by hostile Democrats bent on investigating the administration and curtailing his authority. Meanwhile, more court battles loom - and while the US Supreme Court has a conservative tilt, its decisions on a number of key cases could ultimately cut against Trump's efforts. The first 100 days of Trump's second term have been a dramatic show of political force, but the next 1,361 will be the real test of whether he can carve an enduring legacy.",
    "clean_body": "the rapid remaking of a nation in 100 days 27 april 2025 share save anthony zurcher and tom geoghegan bbc news washington share save bbc during last years presidential campaign donald trump constantly repeated his intention to bring about dramatic change as soon as he returned to the white house but few expected it to come at such breakneck speed in the three months since he took the oath of office the 47th president has deployed his power in a way that compares to few predecessors in stacks of bound documents signed off with a presidential pen and policy announcements made in all caps on social media his blizzard of executive actions has reached into every corner of american life to his supporters the shockandawe approach has been a tangible demonstration of an allaction president delivering on his promises and enacting longawaited reforms but his critics fear he is doing irreparable harm to the country and overstepping his powers crippling important government functions and perhaps permanently reshaping the presidency in the process here are six turning points from the first 100 days a social media post sets off a constitutional firestorm for once it wasnt a trump social media post that sparked an outcry three weeks into the new term at 1013am on a sunday morning vicepresident jd vance wrote nine words that signalled a strategy which has since shaped the trump administrations second term judges arent allowed to control the executives legitimate power he declared on x in the media frenzy that followed legal experts lined up to challenge that assertion pointing to a 220yearold principle which lies at the heart of american democracy courts have the power to check and strike down any government action laws regulations and executive orders they think violates the us constitution vances words represented a brazen challenge to judicial authority and more broadly the system of three coequal branches of government crafted by americas founders but trump and his team remain unapologetic in extending the reach of the executive branch into the two other domains congress and the courts getty images three coequal branches of government legislative executive and judicial were crafted by americas founders the white house has moved aggressively to wrest control of spending from congress unilaterally defunding programmes and entire agencies this erosion of its power has been largely met by silence on capitol hill where trumps republicans hold slim majorities in both chambers the courts have been more resistant with well over 100 rulings so far halting presidential actions they deem to be unconstitutional according to a tally by the new york times some of the biggest clashes have been over trumps immigration crackdown in march more than 200 venezuelans deemed a danger to the us were deported to el salvador many under sweeping wartime powers and without the usual process of evidence being presented in court a republicanappointed judge on a federal appeals court said he was shocked by how the white house had acted now the branches come too close to grinding irrevocably against one another in a conflict that promises to diminish both judge j harvie wilkinson wrote trump and white house officials have said they will obey court rulings even as the president lambasts many of the judges who issue them and the administration at times moves slowly to fully comply it all amounts to a unique test of a constitutional system that for centuries has operated under a certain amount of good faith while trump has been at the centre of this push one of his principal agents of chaos is a man who wasnt born in the us but who built a business empire there brandishing a chainsaw dressed in black elon musk dressed in black from head to toe and wearing sunglasses stood centre stage and basked in the adulation of the conservative political action conference crowd the richest man in the world who wants to cut trillions of dollars from the federal government said he had a special surprise argentinian president javier milei known for his own budgetslashing emerged from backstage and handed him a shiny gold chainsaw this is the chainsaw for bureaucracy musk exclaimed chainsaw getty images elon musk leaves the stage holding a chainsaw after speaking at the conservative political action conference it was a dramatic illustration not only of musks enthusiasm for his department of government efficiency doge assignment but also of the near rockstar status that the south africanborn technologist has developed among the trump faithful since that appearance musk has dispatched his operatives across the federal government pushing to access sensitive government databases and identify programmes to slash although he has not come anywhere near to finding the trillions of dollars of waste he once promised his cuts have drastically reduced dozens of agencies and departments essentially shutting down the us agency for international development usaid and attempting to dismantle the department of education while pledges to cut waste fraud and abuse in government and trim the ballooning federal deficit typically have broad appeal the manner in which musk has used his metaphorical chainsaw has led to conflict with senior government officials and stoked anger among some of the american public some trump supporters may approve of the administrations aggressive budgetcutting but other constituents have berated republican legislators at town hall events hecklers have expressed fear that the cuts will adversely affect popular government programmes like social security retirement plans veterans benefits and health insurance coverage for the poor and elderly their concerns may not be entirely misplaced given that these schemes make up the bulk of federal spending if these programmes are not cut back sweeping tax cuts that trump has promised would further increase the scale of us government debt and put at risk arguably his biggest election promise economic prosperity i had to think fast as billions was lost before my eyes when trader richard mcdonald saw trump hold up his charts in the white house rose garden showing a list of countries targeted by us tariffs he knew he had to act fast i jumped to my feet because i wasnt expecting a board of charts i was expecting an announcement he says mcdonald expected tariff cuts of 10 or 20 but says nobody expected these huge numbers he raced to understand which companies might be worst hit then he sold there are billions being wiped off share prices every second so its really fastest finger first he is one of the many traders who were at the coal face of global markets when share prices plunged everywhere following trumps socalled liberation day tariff announcement the sp 500 index of the largest firms listed in the us was hit particularly hard and even though the white house has reversed course on some of the highest tariffs it hasnt fully recovered since getty images the us stock market plummeted after president trump announced liberation day tariffs the economy was the biggest concern for us voters in novembers election and trump rode a tide of deep unhappiness over bidens handling of inflation all the way to victory his pledge to cut prices pare back government regulation and boost homegrown industry was a probusiness message warmly welcomed on wall street and by many working americans but as trump tries to follow through on his promise of new tariffs the economic costs at least in the short term have become painfully apparent the stock market is sinking interest rates including for home mortgages are rising and consumer confidence is down unemployment is also ticking up in part due to the growing number of federal employees forced out of their jobs the federal reserve bank along with economic experts warn trumps plan will shrink economic growth and possibly lead to a recession while the presidents approval ratings on his handling of the economy have tumbled many of his supporters are sticking with him and in former industrial areas hollowed out by the loss of manufacturing jobs there are hopes that tariffs could even the global playing field trump has earned back the respect says truck driver ben maurer in pennsylvania referring to tariffs on china we are still the force to be reckoned with economic concerns have contributed to trumps overall decline in the polls but in one key area he is still largely on solid ground in the publics eye immigration spotted in a photo my son shackled in prison its him its him i recognise his features says myrelis casique lopez pointing at a photo of men shackled and cuffed on the floor of one of the most infamous prisons in the world she had spotted her son in the image taken from above of a sea of shaven heads belonging to men in white tshirts sat in long straight rows at home in maracay venezuela ms casique was shown the photograph first shared online by the el salvador authorities by a bbc reporter when she last had contact with her son he was in the us and facing deportation to venezuela but now he was 1430 miles 2300 km away from her one of 238 men sent by us authorities to a notorious megajail in el salvador reuters us deports alleged members of the venezuela gang tren de aragua to cecot prison in el salvador the trump administration says they are members of the tren de aragua gang a powerful multinational crime operation but ms casique insists her son is innocent a tough stance on immigration was a central plank of trumps reelection campaign and the president has used his broad powers of enforcement to deliver that pledge illegal border crossings were falling at the end of the biden presidency but are now at their lowest monthly total for more than four years a majority of the us public still backs the crackdown but it has had a chilling effect on communities of foreign students who have found themselves caught up in the blitz some including permanent residents have been detained and face deportation because of their role in propalestinian campus protests they have rejected accusations that they support hamas civil rights lawyers warn that some migrants are being deported without due process sweeping up the innocent among the killers and thugs that trump says are being targeted while so far there havent been the level of mass deportations that some hoped for and others feared newly empowered immigration enforcement agents have taken action across the us in businesses homes and churches they have been active in universities too which have become a prominent target of president trump in several other ways a clash with academic media and corporate worlds on 21 april harvard universitys president alan garber decided to confront the white house headon in a letter to the university community he announced a lawsuit challenging the trump administrations move to freeze billions of dollars in federal grants it was he said an illegal attempt to impose unprecedented and improper control over harvards operations the white house said it had to take action because harvard had not tackled antisemitism on campus an issue that garber said the university was taking steps to address but the ivy league colleges move was the most prominent display of resistance against trumps use of presidential power to target american higher education a longstanding goal energised by propalestinian protests that engulfed campuses in 2024 the president and his officials have since impounded or threatened to withhold billions of dollars in federal spending to reshape elite institutions like harvard which the president and many of his supporters think push a liberal ideology on students and researchers getty images protesters gather inside harvard university earlier in the month columbia university in new york city had agreed to a number of white house demands including changes to its protest policies campus security practices and middle eastern studies department a similar dynamic has played out in the corporate and media worlds trump has used the withholding of federal contracts as a way to pressure law firms to recruit and represent more conservatives some of the firms have responded by offering the trump administration millions of dollars in free legal services while two firms have filed suit challenging the constitutionality of the administrations punishments a defamation lawsuit trump brought against abc news has led to the media company contributing 15m £11m to trumps presidential foundation cbs is also in talks to settle a separate lawsuit over a kamala harris interview as its parent company paramount seeks federal approval for a merger with skydance media the associated press by contrast has resisted administration pressure to accept trumps gulf of america name change despite the white houses efforts to block the news agency from coverage of the president on the campaign trail trump warned about the runaway power of the federal government now in office he is wielding that power in a way no previous modern president has attempted nowhere however have the impacts of his efforts been more visible than within the federal government agencies and departments that he now controls a retreat on race and identity the press conference at the white house began with a moments silence for the victims of an aircraft collision over the potomac river within seconds of the pause coming to an end however trump was on the attack a diversity and inclusion initiative at the federal aviation agency was partly to blame for the tragedy the president claimed because it hired people with severe intellectual disabilities as air traffic controllers he did not provide any evidence it was a startling moment that was emblematic of the attack his presidency has launched against inclusivity programmes that have proliferated in recent years across the us government and corporate world getty images a crane removes plane wreckage from the potomac river trump has directed the federal government to end its diversity and equity dei programmes and investigate private companies and academic institutions thought to be engaged in illegal dei his directive has accelerated moves among leading global companies like meta and goldman to cut back or eliminate these programmes first introduced in the 1960s in the wake of civil rights victories early forms of dei were an attempt to expand opportunities for black americans they later expanded to take in women lgbt rights and other racial groups efforts were stepped up and embraced by much of corporate america in the wake of the 2020 black lives matters protests following the death of george floyd at the hands of minneapolis police officers but to its critics dei was putting politics and race above talent creating division and was no longer needed in modern america while trumps directive seems to have support from a narrow majority of voters some of the unexpected consequences have raised eyebrows arlington national cemetery scrubbed from its website all mentions of the history of black and female service members and the enola gay aircraft that dropped an atomic bomb on japan was initially flagged for removal from pentagon documents apparently due to the word gay donald trumps first 100 days have been an unprecedented display of unilateral power exercised by a modern american president his efforts to dismantle large swaths of the federal government will take years if not decades for subsequent presidents to restore if they so desire in other ways however trumps efforts so far may end up being less permanent without the support of new laws passed by congress many of his sweeping reforms could be wiped away by a future president and so to what extent this whirlwind start leads to lasting change remains an open question later this year the narrow republican majorities in congress will attempt to provide the legislative backing for trumps agenda but their success is far from guaranteed and in next years midterm congressional elections those majorities could be replaced by hostile democrats bent on investigating the administration and curtailing his authority meanwhile more court battles loom and while the us supreme court has a conservative tilt its decisions on a number of key cases could ultimately cut against trumps efforts the first 100 days of trumps second term have been a dramatic show of political force but the next 1361 will be the real test of whether he can carve an enduring legacy",
    "summary": "A Republican-appointed judge on a federal appeals court said he was \"shocked\" by how the White House had acted.\nThey have been active in universities too, which have become a prominent target of President Trump in several other ways.\nDonald Trump's first 100 days have been an unprecedented display of unilateral power exercised by a modern American president.\nIn other ways, however, Trump's efforts so far may end up being less permanent.\nMeanwhile, more court battles loom - and while the US Supreme Court has a conservative tilt, its decisions on a number of key cases could ultimately cut against Trump's efforts.",
    "keywords": [
      "remaking",
      "trump",
      "federal",
      "power",
      "trumps",
      "nation",
      "programmes",
      "president",
      "white",
      "house",
      "rapid",
      "efforts",
      "100",
      "days",
      "media"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/0219/live/9304a8d0-21c7-11f0-9c65-a5c3dc449bf3.png"
  },
  "https://www.bbc.com/news/articles/cedy6gl99eno": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cedy6gl99eno",
    "date": "2025-04-18",
    "time": "00:00:00",
    "title": "Nvidia, the chip giant caught between the US and China",
    "body": "Nvidia: The AI chip giant caught between US and China\n\n18 April 2025 Share Save James Chater BBC News Share Save\n\nGetty Images With the meteoric rise of Nvidia, chief executive Jensen Huang has been nicknamed a tech \"rock star\" and the 'Taylor Swift of tech'\n\nComputer chip giant Nvidia has once again found itself at the centre of US-China tensions over trade and technology. On Thursday Nvidia's chief executive Jensen Huang flew to Beijing to meet senior Chinese officials, just after the US imposed new export controls on its chips. The California-based company will require licenses to export its H20 AI chip to China, a move which the US Commerce Department said was designed to safeguard \"national and economic security\". Nvidia said federal officials had told them the requirement will be in force for the \"indefinite future\". But why is the company so pivotal in the race for AI supremacy between the US and China?\n\nWhat is Nvidia?\n\nNvidia designs advanced chips, or semiconductors, that are used in generative artificial intelligence. Generative AI can produce new content from a user's prompt, like ChatGPT. In recent years, a surge in global demand for AI chips led Nvidia to become one of the world's most valuable companies. In November, Nvidia briefly unseated Apple as the largest company in the world by market capitalisation. Because its chips are seen as so essential to advancements in generative AI, successive US administrations have scrutinised Nvidia's relationship with China. Washington hopes the new export controls will slow China's development of advanced AI chips - especially their use by the Chinese military - and secure an advantage in AI competition with Beijing.\n\nWhy is Trump targeting Nvidia's H20 chips?\n\nUS restrictions on Nvidia selling chips to China are not new. In 2022, Joe Biden's administration imposed separate export controls on the sale of advanced semiconductors to China. Nvidia specifically designed the H20 chip to comply with those existing restrictions. A more powerful Nvidia chip, the H100, was already banned for sale in China. However, the recent emergence of DeepSeek, a Chinese generative AI company, has prompted fresh concerns in the US that even less powerful chips could lead to significant technological breakthroughs. DeepSeek claimed it could operate as effectively as other applications like ChatGPT using less advanced chips. Now, there is increasing demand for Nvidia's H20 chips among Chinese technology companies such as Tencent, Alibaba, and ByteDance, the parent company of TikTok. Those companies have outstanding orders for the chips. But because there is no grace period on the imposition of the new curbs, Nvidia expects to be hit by losses of $5.5bn (£4.15bn) from these orders that it can no longer fulfil. Chim Lee, a senior analyst at the Economist Intelligence Unit in Beijing, told the BBC that there are alternative AI chips being developed in China, by companies like Huawei. Although they are currently viewed as inferior to Nvidia's, Mr Lee said the US curbs could prompt China to focus on developing better chips. \"It will introduce challenges to China's AI scene, but it won't massively slow down China's AI development and deployment,\" Mr Lee added.\n\nGetty Images A surge in global demand for AI chips led Nvidia to become one of the world's most valuable companies\n\nWhy is Nvidia's CEO in China?\n\nChina is a critical market for Nvidia. The world's second-largest economy accounted for 13% of its total sales last year, though that is still far less than the United States, which accounted for nearly half. The timing of Mr Huang's trip is being seen as an effort to shore up Nvidia's business in China despite the latest curbs. In his Beijing meeting with Ren Hongbin, head of the China Council for the Promotion of International Trade, Mr Huang said he hoped \"to continue to cooperate with China\", according to state broadcaster CCTV. On Thursday, the Financial Times reported that Mr Huang's trip to China also included a meeting with DeepSeek's founder, Liang Wenfeng. Separately, top Chinese official He Lifeng told Mr Huang that \"China's market investment and consumption potential is huge\", according to state news agency Xinhua. During talks with Shanghai's mayor on Friday, Mr Huang said he was committed to the Chinese market, according to a Shanghai government statement.\n\nHow will the export controls impact US-China competition?\n\nGetty Images New US-imposed export controls on AI chips caused a sharp drop in Nvidia's shares",
    "clean_body": "nvidia the ai chip giant caught between us and china 18 april 2025 share save james chater bbc news share save getty images with the meteoric rise of nvidia chief executive jensen huang has been nicknamed a tech rock star and the taylor swift of tech computer chip giant nvidia has once again found itself at the centre of uschina tensions over trade and technology on thursday nvidias chief executive jensen huang flew to beijing to meet senior chinese officials just after the us imposed new export controls on its chips the californiabased company will require licenses to export its h20 ai chip to china a move which the us commerce department said was designed to safeguard national and economic security nvidia said federal officials had told them the requirement will be in force for the indefinite future but why is the company so pivotal in the race for ai supremacy between the us and china what is nvidia nvidia designs advanced chips or semiconductors that are used in generative artificial intelligence generative ai can produce new content from a users prompt like chatgpt in recent years a surge in global demand for ai chips led nvidia to become one of the worlds most valuable companies in november nvidia briefly unseated apple as the largest company in the world by market capitalisation because its chips are seen as so essential to advancements in generative ai successive us administrations have scrutinised nvidias relationship with china washington hopes the new export controls will slow chinas development of advanced ai chips especially their use by the chinese military and secure an advantage in ai competition with beijing why is trump targeting nvidias h20 chips us restrictions on nvidia selling chips to china are not new in 2022 joe bidens administration imposed separate export controls on the sale of advanced semiconductors to china nvidia specifically designed the h20 chip to comply with those existing restrictions a more powerful nvidia chip the h100 was already banned for sale in china however the recent emergence of deepseek a chinese generative ai company has prompted fresh concerns in the us that even less powerful chips could lead to significant technological breakthroughs deepseek claimed it could operate as effectively as other applications like chatgpt using less advanced chips now there is increasing demand for nvidias h20 chips among chinese technology companies such as tencent alibaba and bytedance the parent company of tiktok those companies have outstanding orders for the chips but because there is no grace period on the imposition of the new curbs nvidia expects to be hit by losses of 55bn £415bn from these orders that it can no longer fulfil chim lee a senior analyst at the economist intelligence unit in beijing told the bbc that there are alternative ai chips being developed in china by companies like huawei although they are currently viewed as inferior to nvidias mr lee said the us curbs could prompt china to focus on developing better chips it will introduce challenges to chinas ai scene but it wont massively slow down chinas ai development and deployment mr lee added getty images a surge in global demand for ai chips led nvidia to become one of the worlds most valuable companies why is nvidias ceo in china china is a critical market for nvidia the worlds secondlargest economy accounted for 13 of its total sales last year though that is still far less than the united states which accounted for nearly half the timing of mr huangs trip is being seen as an effort to shore up nvidias business in china despite the latest curbs in his beijing meeting with ren hongbin head of the china council for the promotion of international trade mr huang said he hoped to continue to cooperate with china according to state broadcaster cctv on thursday the financial times reported that mr huangs trip to china also included a meeting with deepseeks founder liang wenfeng separately top chinese official he lifeng told mr huang that chinas market investment and consumption potential is huge according to state news agency xinhua during talks with shanghais mayor on friday mr huang said he was committed to the chinese market according to a shanghai government statement how will the export controls impact uschina competition getty images new usimposed export controls on ai chips caused a sharp drop in nvidias shares",
    "summary": "In recent years, a surge in global demand for AI chips led Nvidia to become one of the world's most valuable companies.\nIn 2022, Joe Biden's administration imposed separate export controls on the sale of advanced semiconductors to China.\nA more powerful Nvidia chip, the H100, was already banned for sale in China.\nGetty Images A surge in global demand for AI chips led Nvidia to become one of the world's most valuable companiesWhy is Nvidia's CEO in China?\nGetty Images New US-imposed export controls on AI chips caused a sharp drop in Nvidia's shares",
    "keywords": [
      "nvidia",
      "china",
      "export",
      "chips",
      "huang",
      "ai",
      "giant",
      "controls",
      "caught",
      "nvidias",
      "chip",
      "chinese",
      "mr"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f36d/live/fc723a70-1c19-11f0-ad6b-9b308fd76963.jpg"
  },
  "https://www.bbc.com/news/articles/ce923vr0g4yo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/ce923vr0g4yo",
    "date": "2025-04-14",
    "time": "00:00:00",
    "title": "Man charged with sexual offences while on Armagh GAA trip",
    "body": "Man charged with sexual offences while on Armagh GAA trip\n\nA 30-year-old man has been charged with a number of sexual offences alleged to have occurred in the United States in November last year.\n\nIt is understood the charges are in connection with an alleged incident while Armagh GAA was on a trip to the United States.\n\nThe man was arrested on 10 December, 2024 and was later released on bail.\n\nHe was charged on Monday with two counts of sexual assault and two counts of causing a person to engage in sexual activity without consent, police said.",
    "clean_body": "man charged with sexual offences while on armagh gaa trip a 30yearold man has been charged with a number of sexual offences alleged to have occurred in the united states in november last year it is understood the charges are in connection with an alleged incident while armagh gaa was on a trip to the united states the man was arrested on 10 december 2024 and was later released on bail he was charged on monday with two counts of sexual assault and two counts of causing a person to engage in sexual activity without consent police said",
    "summary": "Man charged with sexual offences while on Armagh GAA tripA 30-year-old man has been charged with a number of sexual offences alleged to have occurred in the United States in November last year.\nIt is understood the charges are in connection with an alleged incident while Armagh GAA was on a trip to the United States.\nThe man was arrested on 10 December, 2024 and was later released on bail.\nHe was charged on Monday with two counts of sexual assault and two counts of causing a person to engage in sexual activity without consent, police said.",
    "keywords": [
      "offences",
      "gaa",
      "sexual",
      "counts",
      "armagh",
      "charged",
      "united",
      "alleged",
      "yearit",
      "trip",
      "man"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3e6f/live/b7cc60d0-1953-11f0-b0b2-81a2c168ede5.jpg"
  },
  "https://www.bbc.com/news/articles/c70zlj8dpn8o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c70zlj8dpn8o",
    "date": "2025-04-21",
    "time": "00:00:00",
    "title": "Ex-US senator's wife convicted in gold bars bribery scheme",
    "body": "Ex-US senator's wife convicted in gold bars bribery scheme\n\nNadine Menendez was spotted outside of court after she was found guilty on all charges for her role in a bribery scheme\n\nA sentencing date for Menendez has been set for 12 June. Her husband was convicted in July 2024 and sentenced to 11 years in prison.\n\nShe was indicted with her husband in September 2023 but had her trial delayed for breast cancer treatments.\n\nNadine Menendez, 58, was found guilty on all 15 counts, including bribery and obstruction of justice, for aiding her husband, ex-Sen Robert Menendez, who received lavish gifts in exchange for political favours.\n\nA New York jury has found the wife of a former New Jersey senator guilty for her role in a years-long bribery scheme that included stacks of cash, gold bars and a Mercedes-Benz.\n\nIn a statement, the US attorney's office for the Southern District of New York said the couple were \"partners in crime\" who participated in \"corrupt official acts\".\n\n\"Today's verdict sends the clear message that the power of government officials may not be put up for sale,\" the statement said.\n\nDuring the trial, prosecutors argued that Menendez was an indispensable part of her husband's bribery scheme, telling the jury it was she who often accepted the cash and other gifts on behalf of the former senator.\n\nHer husband, at the time, was the top-ranking Democrat on the powerful Senate Foreign Relations Committee for more than five years, a position that gave him significant influence over US foreign policy.\n\n\"She was keeping him in the loop every step of the way,\" Paul M Monteleoni, a prosecutor, said in a closing argument, the New York Times reported.\n\nMenendez's lawyers said the government failed to prove a link between the gold and stacks of cash found in the couple's home to any \"official act\" taken by her husband.\n\nHer lawyer Barry Coburn said he was \"devastated by the verdict\", standing outside the New York courthouse on Monday afternoon.\n\n\"We fought hard and it hurts,\" Mr Coburn said. \"This is a very rough day for us.\"\n\nMenendez and her husband were convicted of participating in a wide-ranging scheme to secretly aid the Egyptian government using the former senator's perch in Washington, prosecutors had said.\n\nThe government backed up its claims with evidence from a 2022 FBI search at the couple's New Jersey home that included over $100,000 (£80,000) worth of gold bars and hundreds of thousands of dollars in cash in envelopes or hidden in clothes.\n\nThey also showed digital evidence that included text messages between the couple and their associates, and a Google search by the former senator that said: \"How much is one kilo of gold worth?\"\n\nFred Daibes, a New Jersey property developer, and Wael Hana, the Egyptian-born operator of a halal certification company, were also charged and convicted for their roles.\n\nInsurance broker Jose Uribe pleaded guilty in March 2024 to charges related to the corrupt scheme.",
    "clean_body": "exus senators wife convicted in gold bars bribery scheme nadine menendez was spotted outside of court after she was found guilty on all charges for her role in a bribery scheme a sentencing date for menendez has been set for 12 june her husband was convicted in july 2024 and sentenced to 11 years in prison she was indicted with her husband in september 2023 but had her trial delayed for breast cancer treatments nadine menendez 58 was found guilty on all 15 counts including bribery and obstruction of justice for aiding her husband exsen robert menendez who received lavish gifts in exchange for political favours a new york jury has found the wife of a former new jersey senator guilty for her role in a yearslong bribery scheme that included stacks of cash gold bars and a mercedesbenz in a statement the us attorneys office for the southern district of new york said the couple were partners in crime who participated in corrupt official acts todays verdict sends the clear message that the power of government officials may not be put up for sale the statement said during the trial prosecutors argued that menendez was an indispensable part of her husbands bribery scheme telling the jury it was she who often accepted the cash and other gifts on behalf of the former senator her husband at the time was the topranking democrat on the powerful senate foreign relations committee for more than five years a position that gave him significant influence over us foreign policy she was keeping him in the loop every step of the way paul m monteleoni a prosecutor said in a closing argument the new york times reported menendezs lawyers said the government failed to prove a link between the gold and stacks of cash found in the couples home to any official act taken by her husband her lawyer barry coburn said he was devastated by the verdict standing outside the new york courthouse on monday afternoon we fought hard and it hurts mr coburn said this is a very rough day for us menendez and her husband were convicted of participating in a wideranging scheme to secretly aid the egyptian government using the former senators perch in washington prosecutors had said the government backed up its claims with evidence from a 2022 fbi search at the couples new jersey home that included over 100000 £80000 worth of gold bars and hundreds of thousands of dollars in cash in envelopes or hidden in clothes they also showed digital evidence that included text messages between the couple and their associates and a google search by the former senator that said how much is one kilo of gold worth fred daibes a new jersey property developer and wael hana the egyptianborn operator of a halal certification company were also charged and convicted for their roles insurance broker jose uribe pleaded guilty in march 2024 to charges related to the corrupt scheme",
    "summary": "Ex-US senator's wife convicted in gold bars bribery schemeNadine Menendez was spotted outside of court after she was found guilty on all charges for her role in a bribery schemeA sentencing date for Menendez has been set for 12 June.\nHer husband was convicted in July 2024 and sentenced to 11 years in prison.\nA New York jury has found the wife of a former New Jersey senator guilty for her role in a years-long bribery scheme that included stacks of cash, gold bars and a Mercedes-Benz.\nMenendez and her husband were convicted of participating in a wide-ranging scheme to secretly aid the Egyptian government using the former senator's perch in Washington, prosecutors had said.\nInsurance broker Jose Uribe pleaded guilty in March 2024 to charges related to the corrupt scheme.",
    "keywords": [
      "jersey",
      "senators",
      "gold",
      "bribery",
      "wife",
      "york",
      "husband",
      "exus",
      "guilty",
      "convicted",
      "scheme",
      "menendez",
      "cash",
      "bars"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/86da/live/d4a78fd0-1ef4-11f0-80b3-83959215671c.jpg"
  }
}