{
  "https://www.bbc.com/news/articles/c1wq15zwlr8o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c1wq15zwlr8o",
    "date": "2025-01-05",
    "time": "00:00:00",
    "title": "Woman had eight organs removed in rare cancer treatment",
    "body": "Woman had eight organs removed in cancer treatment\n\n5 January 2025 Share Save Christian Fuller BBC News, South East Share Save\n\nFaye Louise Faye Louise, from Horsham, began planning her own funeral after a tumour was found in her appendix\n\nA woman who had eight organs removed after being diagnosed with a rare cancer has returned to work. Faye Louise, from Horsham, West Sussex, began planning her own funeral after doctors found a tumour in her appendix in 2023. But after \"the mother of all surgeries\", she said she was cancer free and able to return to work as a flight dispatcher at Gatwick Airport. \"To have been told there is no evidence of disease, it was the greatest Christmas gift that I could have got,\" she said.\n\nMs Louise added that she was unsure if she'd be able to work again this time last year. \"The job is very physical, but I love aviation and I'm happy that I'm back in the role,\" she told BBC Radio Sussex.\n\nCancer Research UK Faye Louise said she was \"cancer free\" having been diagnosed with pseudomyxoma peritonei in 2023\n\nThe former model began to have pains in spring 2023, which she initially put down to period problems, before an ultrasound revealed an ovarian cyst. However, after an operation to rectify the problems, she said she \"heard the dreaded C-word\" and was diagnosed with pseudomyxoma peritonei – a rare tumour that causes a build-up of a jelly-like substance in the abdomen. As the tumour had ruptured, spreading cancer cells around her body, Ms Louise needed an operation which involved removing eight of her organs. The surgery included the removal of her spleen, gallbladder, appendix, ovaries, uterus, fallopian tubes, belly button, greater and lesser omentum - which connect the stomach and duodenum to other abdominal organs - and part of her liver, as well as the scraping of her diaphragm and pelvis. She will continue to have yearly scans every November as a result. \"Waiting for the results will sadly make or break every Christmas for me. But you just have to keep pushing forward and never give up,\" she said. \"Some days I have been down to the depths of despair, but more often than not now, I'm having more positive days.\"\n\nCancer Research UK Faye Louise has been fundraising for Cancer Research UK\n\nShe has since returned to work, and fundraised for Cancer Research UK – including being gunged with 15 litres of orange gloop in the garden of the Red Lyon pub in Slinfold. She has also completed the Race for Life in Stanmer Park, Brighton, to raise funds for the charity.\n\nFollow BBC Sussex on Facebook, on X, and on Instagram. Send your story ideas to southeasttoday@bbc.co.uk or WhatsApp us on 08081 002250.\n\nRelated stories Brighton man makes film on his brain cancer care",
    "clean_body": "woman had eight organs removed in cancer treatment 5 january 2025 share save christian fuller bbc news south east share save faye louise faye louise from horsham began planning her own funeral after a tumour was found in her appendix a woman who had eight organs removed after being diagnosed with a rare cancer has returned to work faye louise from horsham west sussex began planning her own funeral after doctors found a tumour in her appendix in 2023 but after the mother of all surgeries she said she was cancer free and able to return to work as a flight dispatcher at gatwick airport to have been told there is no evidence of disease it was the greatest christmas gift that i could have got she said ms louise added that she was unsure if shed be able to work again this time last year the job is very physical but i love aviation and im happy that im back in the role she told bbc radio sussex cancer research uk faye louise said she was cancer free having been diagnosed with pseudomyxoma peritonei in 2023 the former model began to have pains in spring 2023 which she initially put down to period problems before an ultrasound revealed an ovarian cyst however after an operation to rectify the problems she said she heard the dreaded cword and was diagnosed with pseudomyxoma peritonei – a rare tumour that causes a buildup of a jellylike substance in the abdomen as the tumour had ruptured spreading cancer cells around her body ms louise needed an operation which involved removing eight of her organs the surgery included the removal of her spleen gallbladder appendix ovaries uterus fallopian tubes belly button greater and lesser omentum which connect the stomach and duodenum to other abdominal organs and part of her liver as well as the scraping of her diaphragm and pelvis she will continue to have yearly scans every november as a result waiting for the results will sadly make or break every christmas for me but you just have to keep pushing forward and never give up she said some days i have been down to the depths of despair but more often than not now im having more positive days cancer research uk faye louise has been fundraising for cancer research uk she has since returned to work and fundraised for cancer research uk – including being gunged with 15 litres of orange gloop in the garden of the red lyon pub in slinfold she has also completed the race for life in stanmer park brighton to raise funds for the charity follow bbc sussex on facebook on x and on instagram send your story ideas to southeasttodaybbccouk or whatsapp us on 08081 002250 related stories brighton man makes film on his brain cancer care",
    "summary": "Woman had eight organs removed in cancer treatment5 January 2025 Share Save Christian Fuller BBC News, South East Share SaveFaye Louise Faye Louise, from Horsham, began planning her own funeral after a tumour was found in her appendixA woman who had eight organs removed after being diagnosed with a rare cancer has returned to work.\nFaye Louise, from Horsham, West Sussex, began planning her own funeral after doctors found a tumour in her appendix in 2023.\nCancer Research UK Faye Louise said she was \"cancer free\" having been diagnosed with pseudomyxoma peritonei in 2023The former model began to have pains in spring 2023, which she initially put down to period problems, before an ultrasound revealed an ovarian cyst.\nAs the tumour had ruptured, spreading cancer cells around her body, Ms Louise needed an operation which involved removing eight of her organs.\nCancer Research UK Faye Louise has been fundraising for Cancer Research UKShe has since returned to work, and fundraised for Cancer Research UK – including being gunged with 15 litres of orange gloop in the garden of the Red Lyon pub in Slinfold.",
    "keywords": [
      "louise",
      "diagnosed",
      "work",
      "faye",
      "removed",
      "cancer",
      "tumour",
      "research",
      "organs",
      "rare",
      "im",
      "woman",
      "uk",
      "treatment"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/879c/live/9539d500-cb67-11ef-94cb-5f844ceb9e30.jpg"
  },
  "https://www.bbc.com/news/live/c77j0n6385zt": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/c77j0n6385zt",
    "date": "2025-01-03",
    "time": "00:00:00",
    "title": "Live updates: Mike Johnson survives razor-thin vote to remain House Speaker",
    "body": "Representative Norman: 'I feel really good about where we are'\n\nRachel Looker\n\nReporting from Capitol Hill\n\nImage source, Getty Images\n\nBefore Mike Johnson could retain his role as speaker, he had to convince three Republicans who had initially voted against him to change their minds.\n\nUp on Capitol Hill, we've just heard from one of these dissenting voices, Representative Ralph Norman, who tells reporters that he now trusts Johnson in the leadership role.\n\nNorman assures reporters that \"no deals were cut\" after he initially refused to back Donald Trump's pick for speaker, but says he voted against Johnson at first to show his \"frustration\" at the last 15 months.\n\nBut, Norman describes how by speaking with Johnson after voting, the speaker candidate was able to assure him that he would focus on \"more conservative measures\".\n\nNorman says he even interrupted the incoming president during a game of golf for a call from the House floor, where Trump told him that his pick was the only one with the \"likeability factor\".\n\nAnd, with Johnson now re-elected, Norman says the disruption he and two other colleagues caused was \"worth the hour it took\".\n\n\"I feel really good about where we are,\" he stresses.",
    "clean_body": "representative norman i feel really good about where we are rachel looker reporting from capitol hill image source getty images before mike johnson could retain his role as speaker he had to convince three republicans who had initially voted against him to change their minds up on capitol hill weve just heard from one of these dissenting voices representative ralph norman who tells reporters that he now trusts johnson in the leadership role norman assures reporters that no deals were cut after he initially refused to back donald trumps pick for speaker but says he voted against johnson at first to show his frustration at the last 15 months but norman describes how by speaking with johnson after voting the speaker candidate was able to assure him that he would focus on more conservative measures norman says he even interrupted the incoming president during a game of golf for a call from the house floor where trump told him that his pick was the only one with the likeability factor and with johnson now reelected norman says the disruption he and two other colleagues caused was worth the hour it took i feel really good about where we are he stresses",
    "summary": "Representative Norman: 'I feel really good about where we are'Rachel LookerReporting from Capitol HillImage source, Getty ImagesBefore Mike Johnson could retain his role as speaker, he had to convince three Republicans who had initially voted against him to change their minds.\nUp on Capitol Hill, we've just heard from one of these dissenting voices, Representative Ralph Norman, who tells reporters that he now trusts Johnson in the leadership role.\nBut, Norman describes how by speaking with Johnson after voting, the speaker candidate was able to assure him that he would focus on \"more conservative measures\".\nAnd, with Johnson now re-elected, Norman says the disruption he and two other colleagues caused was \"worth the hour it took\".\n\"I feel really good about where we are,\" he stresses.",
    "keywords": [
      "razorthin",
      "vote",
      "live",
      "johnson",
      "pick",
      "house",
      "speaker",
      "mike",
      "norman",
      "representative",
      "remain",
      "reporters",
      "updates",
      "really",
      "good",
      "initially",
      "survives",
      "voted"
    ],
    "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png"
  },
  "https://www.bbc.com/news/articles/c5y6lq2yd9zo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c5y6lq2yd9zo",
    "date": "2025-01-30",
    "time": "00:00:00",
    "title": "NICE backs 'life-changing' tablet for dust mite allergies",
    "body": "'Life-changing' tablet for dust mite allergies\n\n30 January 2025 Share Save Share Save\n\nGetty Images An estimated 13,000 people suffer from the allergy in England could benefit from the new tablet\n\nThousands of people with a severe dust mite allergy could benefit from a \"life changing\" new daily treatment. The National Institute for Healthcare and Care Excellence (NICE) is recommending a daily tablet that has been shown to reduce symptoms. Dr Helen Evans-Howells, a Bournemouth GP and expert in allergy patients, said the evidence \"clearly\" showed the treatment was an \"effective solution\". The tablet, known as Acarizax, is the first of its kind according to a statement released by NICE.\n\nThe institute has published its recommendations for the tablet, made by ALK-Abello, which is an option to treat moderate-to-severe house dust mite allergic rhinitis. An estimated 13,000 people suffer from the allergy in England and this new treatment will be suitable for those between 12 and 65 years old.\n\nDr Helen Evans-Howells Dr Helen Evans-Howells said the treatment could be life-changing for dust mite allergy sufferers\n\nDr Evans-Howells said she had \"lived experience\" of allergies. She explained: \"This drug could be life-changing for those affected by severe symptoms which include significant fatigue, congestion, and facial swelling. \"The evidence clearly shows it offers an effective solution for those who have struggled with standard treatments.\" Acarizax, which would be available via the NHS in England, works by increasing the body's resistance to house dust mites. NICE said clinical trials showed the treatment was \"particularly beneficial\" for those whose symptoms cannot be managed by standard treatments, like steroid nasal sprays and antihistamines. Helen Knight, director of medicines evaluation at NICE, said: \"This is a chronic, debilitating condition which can prevent people from going to their workplace or school. \"This medicine has been found to improve symptoms, helping people to live their lives and has potential to be truly life changing.\" Amena Warner, Head of Clinical Services at Allergy UK, added: \"Although initial access to a specialist allergy service will mainly be required to commence treatment, importantly it can be continued as a home treatment, without the need for frequent hospital visits which incur travel and time costs. \"The patient benefit will be far reaching, and we welcome this decision.\"",
    "clean_body": "lifechanging tablet for dust mite allergies 30 january 2025 share save share save getty images an estimated 13000 people suffer from the allergy in england could benefit from the new tablet thousands of people with a severe dust mite allergy could benefit from a life changing new daily treatment the national institute for healthcare and care excellence nice is recommending a daily tablet that has been shown to reduce symptoms dr helen evanshowells a bournemouth gp and expert in allergy patients said the evidence clearly showed the treatment was an effective solution the tablet known as acarizax is the first of its kind according to a statement released by nice the institute has published its recommendations for the tablet made by alkabello which is an option to treat moderatetosevere house dust mite allergic rhinitis an estimated 13000 people suffer from the allergy in england and this new treatment will be suitable for those between 12 and 65 years old dr helen evanshowells dr helen evanshowells said the treatment could be lifechanging for dust mite allergy sufferers dr evanshowells said she had lived experience of allergies she explained this drug could be lifechanging for those affected by severe symptoms which include significant fatigue congestion and facial swelling the evidence clearly shows it offers an effective solution for those who have struggled with standard treatments acarizax which would be available via the nhs in england works by increasing the bodys resistance to house dust mites nice said clinical trials showed the treatment was particularly beneficial for those whose symptoms cannot be managed by standard treatments like steroid nasal sprays and antihistamines helen knight director of medicines evaluation at nice said this is a chronic debilitating condition which can prevent people from going to their workplace or school this medicine has been found to improve symptoms helping people to live their lives and has potential to be truly life changing amena warner head of clinical services at allergy uk added although initial access to a specialist allergy service will mainly be required to commence treatment importantly it can be continued as a home treatment without the need for frequent hospital visits which incur travel and time costs the patient benefit will be far reaching and we welcome this decision",
    "summary": "'Life-changing' tablet for dust mite allergies30 January 2025 Share Save Share SaveGetty Images An estimated 13,000 people suffer from the allergy in England could benefit from the new tabletThousands of people with a severe dust mite allergy could benefit from a \"life changing\" new daily treatment.\nThe National Institute for Healthcare and Care Excellence (NICE) is recommending a daily tablet that has been shown to reduce symptoms.\nDr Helen Evans-Howells, a Bournemouth GP and expert in allergy patients, said the evidence \"clearly\" showed the treatment was an \"effective solution\".\nThe institute has published its recommendations for the tablet, made by ALK-Abello, which is an option to treat moderate-to-severe house dust mite allergic rhinitis.\nDr Helen Evans-Howells Dr Helen Evans-Howells said the treatment could be life-changing for dust mite allergy sufferersDr Evans-Howells said she had \"lived experience\" of allergies.",
    "keywords": [
      "allergy",
      "nice",
      "mite",
      "evanshowells",
      "lifechanging",
      "allergies",
      "backs",
      "helen",
      "tablet",
      "dust",
      "symptoms",
      "treatment"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3da3/live/a009d5f0-de6f-11ef-a103-5df090d22fd4.jpg"
  },
  "https://www.bbc.com/news/articles/c07grnmlyp9o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c07grnmlyp9o",
    "date": "2025-01-02",
    "time": "00:00:00",
    "title": "Weather: Warning for ice across Northern Ireland",
    "body": "Yellow weather warning for ice in NI\n\n2 January 2025 Share Save Barra Best and Angie Phillips BBC News NI weather team Share Save\n\nPA Media Twins Ava and Mia enjoying the snow in a park near Portglenone Marina\n\nYellow warnings for ice and low temperatures were issued across Northern Ireland on Thursday night. The Met Office issued the alert, which is in place between 17:00 GMT on Thursday and 10:00 GMT on Friday. The warning is in place for counties Antrim, Armagh, Down, Londonderry and Tyrone. The Met Office said icy surfaces could lead to difficult travel conditions.\n\nColleen Webb A snowy bridge in Portglenone, County Antrim\n\nThere may be some icy patches on some untreated roads, pavements and cycling paths and conditions could lead to an increased risk of injuries from slips and falls. As the cold weather continues, NI Water has reminded the public to be aware of the risk of frozen pipes, as they pose a risk to properties and possessions. Advice includes wrapping your pipes and water tanks up, fixing dripping taps, knowing how to turn off your property's stop tap, checking your central heating boiler has been serviced and leaving the heating on low if you are going away.\n\nBBC Weather Watcher, Porta Snow fell in Ballymena, County Antrim\n\nThere was widespread frost and a warning for ice and slippery surfaces on Friday morning with temperatures down to -1 degrees in some areas. Friday night will be another frosty and icy one and with light winds freezing fog could become an added hazard as we head into Saturday morning. Later on Saturday, an area of low pressure moves in from the southwest bringing spells of rain which potentially could turn to a disruptive spell of snow for some as it meets the cold air. This system will be accompanied by brisk east or northeasterly winds which could also lead to drifting snow, particularly on hills. Details about how much snow and where are still uncertain at this point.\n\nMark Osmer Cullybackey in County Antrim experienced icy conditions\n\nRepublic of Ireland",
    "clean_body": "yellow weather warning for ice in ni 2 january 2025 share save barra best and angie phillips bbc news ni weather team share save pa media twins ava and mia enjoying the snow in a park near portglenone marina yellow warnings for ice and low temperatures were issued across northern ireland on thursday night the met office issued the alert which is in place between 1700 gmt on thursday and 1000 gmt on friday the warning is in place for counties antrim armagh down londonderry and tyrone the met office said icy surfaces could lead to difficult travel conditions colleen webb a snowy bridge in portglenone county antrim there may be some icy patches on some untreated roads pavements and cycling paths and conditions could lead to an increased risk of injuries from slips and falls as the cold weather continues ni water has reminded the public to be aware of the risk of frozen pipes as they pose a risk to properties and possessions advice includes wrapping your pipes and water tanks up fixing dripping taps knowing how to turn off your propertys stop tap checking your central heating boiler has been serviced and leaving the heating on low if you are going away bbc weather watcher porta snow fell in ballymena county antrim there was widespread frost and a warning for ice and slippery surfaces on friday morning with temperatures down to 1 degrees in some areas friday night will be another frosty and icy one and with light winds freezing fog could become an added hazard as we head into saturday morning later on saturday an area of low pressure moves in from the southwest bringing spells of rain which potentially could turn to a disruptive spell of snow for some as it meets the cold air this system will be accompanied by brisk east or northeasterly winds which could also lead to drifting snow particularly on hills details about how much snow and where are still uncertain at this point mark osmer cullybackey in county antrim experienced icy conditions republic of ireland",
    "summary": "Yellow weather warning for ice in NI2 January 2025 Share Save Barra Best and Angie Phillips BBC News NI weather team Share SavePA Media Twins Ava and Mia enjoying the snow in a park near Portglenone MarinaYellow warnings for ice and low temperatures were issued across Northern Ireland on Thursday night.\nThe Met Office issued the alert, which is in place between 17:00 GMT on Thursday and 10:00 GMT on Friday.\nBBC Weather Watcher, Porta Snow fell in Ballymena, County AntrimThere was widespread frost and a warning for ice and slippery surfaces on Friday morning with temperatures down to -1 degrees in some areas.\nThis system will be accompanied by brisk east or northeasterly winds which could also lead to drifting snow, particularly on hills.\nMark Osmer Cullybackey in County Antrim experienced icy conditionsRepublic of Ireland",
    "keywords": [
      "weather",
      "northern",
      "risk",
      "county",
      "ice",
      "winds",
      "warning",
      "lead",
      "snow",
      "ireland",
      "icy",
      "low"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/b650/live/a8e85ae0-c919-11ef-87df-d575b9a434a4.jpg"
  },
  "https://www.bbc.com/news/live/cj6zjjnrlp4t": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/cj6zjjnrlp4t",
    "date": "2025-01-06",
    "time": "00:00:00",
    "title": "As it happened: Severe warning removed but East Midlands flood disruption continues",
    "body": "Residents rescued in overnight evacuation\n\nAsha Patel\n\nBBC News, East Midlands\n\nVolunteers from Leicestershire's Search and Rescue service worked through the night to help residents escape their flooded homes in the Belgrave area of Leicester.\n\nNick Canham, the voluntary organisation's chair, said the team was called to the Abbey Lane and Corporation Road area of the city at about 19:00 GMT on Monday, by Leicestershire Fire and Rescue Service.\n\nImage source, Leicestershire Search and Rescue\n\n\"We were there to support them initially but it quickly became evident that we would need to get involved in evacuating further residents, which we did right the way through to about 02:00,\" Mr Canham said.\n\n\"On Abbey Lane [the water] was probably knee-deep but as you turned into some of the side streets it immediately became waist-deep. It's just an awful situation and you just can't remain in the property when it gets that bad.\"",
    "clean_body": "residents rescued in overnight evacuation asha patel bbc news east midlands volunteers from leicestershires search and rescue service worked through the night to help residents escape their flooded homes in the belgrave area of leicester nick canham the voluntary organisations chair said the team was called to the abbey lane and corporation road area of the city at about 1900 gmt on monday by leicestershire fire and rescue service image source leicestershire search and rescue we were there to support them initially but it quickly became evident that we would need to get involved in evacuating further residents which we did right the way through to about 0200 mr canham said on abbey lane the water was probably kneedeep but as you turned into some of the side streets it immediately became waistdeep its just an awful situation and you just cant remain in the property when it gets that bad",
    "summary": "Residents rescued in overnight evacuationAsha PatelBBC News, East MidlandsVolunteers from Leicestershire's Search and Rescue service worked through the night to help residents escape their flooded homes in the Belgrave area of Leicester.\nNick Canham, the voluntary organisation's chair, said the team was called to the Abbey Lane and Corporation Road area of the city at about 19:00 GMT on Monday, by Leicestershire Fire and Rescue Service.\nImage source, Leicestershire Search and Rescue\"We were there to support them initially but it quickly became evident that we would need to get involved in evacuating further residents, which we did right the way through to about 02:00,\" Mr Canham said.\n\"On Abbey Lane [the water] was probably knee-deep but as you turned into some of the side streets it immediately became waist-deep.\nIt's just an awful situation and you just can't remain in the property when it gets that bad.\"",
    "keywords": [
      "happened",
      "warning",
      "rescue",
      "continues",
      "midlands",
      "abbey",
      "east",
      "worked",
      "leicestershire",
      "lane",
      "residents",
      "flood",
      "disruption",
      "search",
      "way",
      "removed",
      "canham",
      "area",
      "severe"
    ],
    "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png"
  },
  "https://www.bbc.com/news/articles/c17edyz11nno": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c17edyz11nno",
    "date": "2025-01-16",
    "time": "00:00:00",
    "title": "Badenoch criticises Tory handling of Brexit",
    "body": "Badenoch criticises Tory handling of Brexit\n\n16 January 2025 Share Save Sam Francis Political reporter Share Save\n\nGetty Images\n\nConservative leader Kemi Badenoch has criticised her predecessors for mishandling Brexit, saying leaving the EU without a growth plan was a \"mistake\". In her first major speech of 2025, Badenoch attacked the Labour's government but also her own party for repeatedly pledging to lower immigration as numbers \"kept going up\" and for promising net zero carbon emissions by 2050 without a clear plan. Badenoch pledged to tell hard truths \"even when it's difficult to hear\" to restore trust with the public. Labour chairwoman Ellie Reeves accused the Tory leader of \"doing the exact opposite\" of rebuilding trust - offering nothing in opposition but more \"infighting\".\n\nBadenoch said the public \"will never trust politicians unless we can accept our mistakes\". \"I will acknowledge the Conservative Party made mistakes,\" she said. Badenoch has not named who she holds responsible, but in her speech said: \"We announced that we would leave the European Union before we had a plan for growth outside the EU. \"We made it the law that we would deliver net zero carbon emissions by 2050. And only then did we start thinking about how we would do that. \"We announced that we would lower immigration, but immigration kept going up. \"These mistakes were made because we told people what they wanted to hear first and then tried to work it out later. \"That is going to stop under my leadership. If we are going to turn our country around, we're going to have to say some things that aren't easy to hear.\"\n\nBadenoch served as a minister under her three Conservative prime ministers - Boris Johnson, Liz Truss and Rishi Sunak. A committed Brexiteer she voted for both Johnson and Theresa May's Brexit withdrawal agreement after becoming an MP in 2017. She served as international trade secretary under Truss, responsible for landing post-Brexit trade deals and promoting UK exports globally. Badenoch retained the post under Sunak who added the business and women and equalities briefs.\n\nBadenoch claimed that as business secretary, she helped the Tory government scrap \"about 4,000 EU laws\" and end the \"supremacy of the European Court of Justice\". But she admitted she left office with unfinished work. \"What we need to start doing is looking at where we have competitive advantage with countries around the world and use our regulatory system to exploit that competitive advantage,\" she said. Badenoch said she would \"back\" Prime Minister Sir Keir Starmer \"if he does the right thing using Brexit\". \"I do not care who gets the credit - we just have to start getting our country back on track,\" she said.\n\nBadenoch used her speech to draw a sharp contrast with Sir Keir, who she claims \"does not believe he's ever made a mistake\". She attacked Labour for announcing policies without a plan to back them up. \"When you haven't worked out what you're going to do in opposition, you will accept whatever you're given in government,\" she said. \"That's why Rachel Reeves announced mad and bad ideas on snatching winter fuel and taxing family farms. \"Those options were presented to us, time and time again by officials, and we rejected them time and time again because they would hurt so many people for so little benefit.\" Badenoch, who was elected Tory leader in November, has previously said she will focus on rebuilding voters' trust before announcing her own policies. In her November victory speech, Badenoch promised to \"renew\" the party by returning the Conservatives to \"first principles\". Responding to her latest comments, Ellie Reeves said: \"The public rightly lost trust in the Conservatives after 14 long years of failure in government.\" She accused Badenoch of offering \"another speech, but no apology for her role in Liz Truss' disastrous mini-Budget that crashed the economy and left a £22bn black hole in the public finances\". \"The Conservatives under Kemi Badenoch have nothing to offer in opposition apart from recklessly continuing to make unfunded spending commitments and overseeing yet more Conservative chaos and infighting.\"\n\nIn a media Q&A after her speech, Badenoch faced criticism that she had struck a \"depressing\" and \"joyless\" tone, giving Nigel Farage and Reform UK room to champion right-wing politics with a positive spin. She said Farage \"has had a head start\" after \"knocking around for 20 plus years\" as the leader of UKIP, the Brexit Party and now Reform UK. \"I have been leading the Conservative Party for 10 weeks - let's see where we are in a few months and a few years,\" she said. Badenoch also dismissed the idea of the Tories merging with Reform UK, saying: \"Nigel Farage says he wants to destroy the Conservative Party, why on earth would we merge with that?\"",
    "clean_body": "badenoch criticises tory handling of brexit 16 january 2025 share save sam francis political reporter share save getty images conservative leader kemi badenoch has criticised her predecessors for mishandling brexit saying leaving the eu without a growth plan was a mistake in her first major speech of 2025 badenoch attacked the labours government but also her own party for repeatedly pledging to lower immigration as numbers kept going up and for promising net zero carbon emissions by 2050 without a clear plan badenoch pledged to tell hard truths even when its difficult to hear to restore trust with the public labour chairwoman ellie reeves accused the tory leader of doing the exact opposite of rebuilding trust offering nothing in opposition but more infighting badenoch said the public will never trust politicians unless we can accept our mistakes i will acknowledge the conservative party made mistakes she said badenoch has not named who she holds responsible but in her speech said we announced that we would leave the european union before we had a plan for growth outside the eu we made it the law that we would deliver net zero carbon emissions by 2050 and only then did we start thinking about how we would do that we announced that we would lower immigration but immigration kept going up these mistakes were made because we told people what they wanted to hear first and then tried to work it out later that is going to stop under my leadership if we are going to turn our country around were going to have to say some things that arent easy to hear badenoch served as a minister under her three conservative prime ministers boris johnson liz truss and rishi sunak a committed brexiteer she voted for both johnson and theresa mays brexit withdrawal agreement after becoming an mp in 2017 she served as international trade secretary under truss responsible for landing postbrexit trade deals and promoting uk exports globally badenoch retained the post under sunak who added the business and women and equalities briefs badenoch claimed that as business secretary she helped the tory government scrap about 4000 eu laws and end the supremacy of the european court of justice but she admitted she left office with unfinished work what we need to start doing is looking at where we have competitive advantage with countries around the world and use our regulatory system to exploit that competitive advantage she said badenoch said she would back prime minister sir keir starmer if he does the right thing using brexit i do not care who gets the credit we just have to start getting our country back on track she said badenoch used her speech to draw a sharp contrast with sir keir who she claims does not believe hes ever made a mistake she attacked labour for announcing policies without a plan to back them up when you havent worked out what youre going to do in opposition you will accept whatever youre given in government she said thats why rachel reeves announced mad and bad ideas on snatching winter fuel and taxing family farms those options were presented to us time and time again by officials and we rejected them time and time again because they would hurt so many people for so little benefit badenoch who was elected tory leader in november has previously said she will focus on rebuilding voters trust before announcing her own policies in her november victory speech badenoch promised to renew the party by returning the conservatives to first principles responding to her latest comments ellie reeves said the public rightly lost trust in the conservatives after 14 long years of failure in government she accused badenoch of offering another speech but no apology for her role in liz truss disastrous minibudget that crashed the economy and left a £22bn black hole in the public finances the conservatives under kemi badenoch have nothing to offer in opposition apart from recklessly continuing to make unfunded spending commitments and overseeing yet more conservative chaos and infighting in a media qa after her speech badenoch faced criticism that she had struck a depressing and joyless tone giving nigel farage and reform uk room to champion rightwing politics with a positive spin she said farage has had a head start after knocking around for 20 plus years as the leader of ukip the brexit party and now reform uk i have been leading the conservative party for 10 weeks lets see where we are in a few months and a few years she said badenoch also dismissed the idea of the tories merging with reform uk saying nigel farage says he wants to destroy the conservative party why on earth would we merge with that",
    "summary": "Badenoch criticises Tory handling of Brexit16 January 2025 Share Save Sam Francis Political reporter Share SaveGetty ImagesConservative leader Kemi Badenoch has criticised her predecessors for mishandling Brexit, saying leaving the EU without a growth plan was a \"mistake\".\n\"I will acknowledge the Conservative Party made mistakes,\" she said.\nBadenoch, who was elected Tory leader in November, has previously said she will focus on rebuilding voters' trust before announcing her own policies.\nIn her November victory speech, Badenoch promised to \"renew\" the party by returning the Conservatives to \"first principles\".\n\"I have been leading the Conservative Party for 10 weeks - let's see where we are in a few months and a few years,\" she said.",
    "keywords": [
      "conservative",
      "party",
      "criticises",
      "start",
      "brexit",
      "public",
      "uk",
      "handling",
      "going",
      "trust",
      "speech",
      "badenoch",
      "tory"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/7fbf/live/7f8c3cf0-d41a-11ef-9321-378935dad855.jpg"
  },
  "https://www.bbc.com/news/articles/ckg75jqwwqjo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/ckg75jqwwqjo",
    "date": "2025-01-20",
    "time": "00:00:00",
    "title": "Victims of surgeon Sam Eljamel face two-year wait over charges",
    "body": "Eljamel victims face two-year wait over charges\n\n20 January 2025 Share Save Susie Forrest and Jonathan Geddes BBC Scotland News Share Save\n\nBBC Sam Eljamel was the head of the neurosurgery department in Ninewells Hospital in Dundee\n\nPatients who believe they were harmed by a disgraced brain surgeon will have to wait up to two years to find out whether he will face criminal charges. Sam Eljamel left some with life-changing injuries while head of neurosurgery at Ninewells Hospital in Dundee. Former patient Jules Rose, who has become a leading campaigner for victims, met with the Lord Advocate on Monday to discuss the long-running police probe. She told BBC Scotland News that Dorothy Bain KC confirmed the surgeon's employers, NHS Tayside, were also being investigated for criminal charges.\n\nSpeaking after the two-hour meeting, Ms Rose said: \"The Lord Advocate was very open and honest, and did say it's anticipated Operation Stringent would take another one-and-a-half to two years before any decision is made on criminality. \"What was welcoming to hear is that it's not just Eljamel being investigated, but it's also NHS Tayside.\" Ms Rose said she was \"very happy\" at how the meeting had gone, and that Ms Bain agreed to provide a timeline for the investigation, in an attempt to speed up the probe. She added: \"They are seeking to appoint more medical expert witnesses to assist with the medical records of the patients, and that was very welcoming to hear.\" It is believed Eljamel now works in Libya. He was head of neurosurgery at Ninewells until December 2013, when he was suspended. However a due diligence review into the health board found NHS Tayside placed him under indirect supervision in June 2013 rather than suspending him, meaning he was able to operate for a further six months. It was during that period that he twice operated on Ms Rose.\n\nJules Rose was operated on twice by Eljamel during a time he was under investigation",
    "clean_body": "eljamel victims face twoyear wait over charges 20 january 2025 share save susie forrest and jonathan geddes bbc scotland news share save bbc sam eljamel was the head of the neurosurgery department in ninewells hospital in dundee patients who believe they were harmed by a disgraced brain surgeon will have to wait up to two years to find out whether he will face criminal charges sam eljamel left some with lifechanging injuries while head of neurosurgery at ninewells hospital in dundee former patient jules rose who has become a leading campaigner for victims met with the lord advocate on monday to discuss the longrunning police probe she told bbc scotland news that dorothy bain kc confirmed the surgeons employers nhs tayside were also being investigated for criminal charges speaking after the twohour meeting ms rose said the lord advocate was very open and honest and did say its anticipated operation stringent would take another oneandahalf to two years before any decision is made on criminality what was welcoming to hear is that its not just eljamel being investigated but its also nhs tayside ms rose said she was very happy at how the meeting had gone and that ms bain agreed to provide a timeline for the investigation in an attempt to speed up the probe she added they are seeking to appoint more medical expert witnesses to assist with the medical records of the patients and that was very welcoming to hear it is believed eljamel now works in libya he was head of neurosurgery at ninewells until december 2013 when he was suspended however a due diligence review into the health board found nhs tayside placed him under indirect supervision in june 2013 rather than suspending him meaning he was able to operate for a further six months it was during that period that he twice operated on ms rose jules rose was operated on twice by eljamel during a time he was under investigation",
    "summary": "Sam Eljamel left some with life-changing injuries while head of neurosurgery at Ninewells Hospital in Dundee.\nShe told BBC Scotland News that Dorothy Bain KC confirmed the surgeon's employers, NHS Tayside, were also being investigated for criminal charges.\n\"What was welcoming to hear is that it's not just Eljamel being investigated, but it's also NHS Tayside.\"\nMs Rose said she was \"very happy\" at how the meeting had gone, and that Ms Bain agreed to provide a timeline for the investigation, in an attempt to speed up the probe.\nIt was during that period that he twice operated on Ms Rose.",
    "keywords": [
      "surgeon",
      "tayside",
      "ninewells",
      "face",
      "wait",
      "victims",
      "charges",
      "rose",
      "ms",
      "nhs",
      "sam",
      "neurosurgery",
      "head",
      "twoyear",
      "eljamel",
      "welcoming"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4901/live/4eb71de0-d76f-11ef-87df-d575b9a434a4.jpg"
  },
  "https://www.bbc.com/news/articles/c3vr077965wo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c3vr077965wo",
    "date": "2025-01-02",
    "time": "00:00:00",
    "title": "Stormzy: Rapper banned from driving after mobile phone use",
    "body": "Stormzy banned from driving after mobile phone use\n\nThe 31-year-old rapper already had six points on his licence\n\nStormzy has been banned from driving for nine months after an off-duty police officer caught him using a mobile phone behind the wheel of a Rolls-Royce in London.\n\nThe 31-year-old rapper, whose real name is Michael Ebenazer Owuo Junior, pleaded guilty via a letter to driving the Rolls-Royce Wraith while using a device on Addison Road, west Kensington, in March last year.\n\nDistrict judge Andrew Sweet said Stormzy's driving record was \"not good\" and criticised his \"dangerous and irresponsible\" actions. The court was told he already had six points on his licence for previous speeding offences.\n\nStormzy's solicitor told Wimbledon Magistrates' Court his client accepted responsibility for his actions.",
    "clean_body": "stormzy banned from driving after mobile phone use the 31yearold rapper already had six points on his licence stormzy has been banned from driving for nine months after an offduty police officer caught him using a mobile phone behind the wheel of a rollsroyce in london the 31yearold rapper whose real name is michael ebenazer owuo junior pleaded guilty via a letter to driving the rollsroyce wraith while using a device on addison road west kensington in march last year district judge andrew sweet said stormzys driving record was not good and criticised his dangerous and irresponsible actions the court was told he already had six points on his licence for previous speeding offences stormzys solicitor told wimbledon magistrates court his client accepted responsibility for his actions",
    "summary": "Stormzy banned from driving after mobile phone useThe 31-year-old rapper already had six points on his licenceStormzy has been banned from driving for nine months after an off-duty police officer caught him using a mobile phone behind the wheel of a Rolls-Royce in London.\nThe 31-year-old rapper, whose real name is Michael Ebenazer Owuo Junior, pleaded guilty via a letter to driving the Rolls-Royce Wraith while using a device on Addison Road, west Kensington, in March last year.\nDistrict judge Andrew Sweet said Stormzy's driving record was \"not good\" and criticised his \"dangerous and irresponsible\" actions.\nThe court was told he already had six points on his licence for previous speeding offences.\nStormzy's solicitor told Wimbledon Magistrates' Court his client accepted responsibility for his actions.",
    "keywords": [
      "stormzy",
      "mobile",
      "points",
      "court",
      "rapper",
      "told",
      "phone",
      "driving",
      "using",
      "rollsroyce",
      "banned"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/cddc/live/ecb62e00-c900-11ef-94cb-5f844ceb9e30.jpg"
  },
  "https://www.bbc.com/news/articles/cdeke468rwpo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cdeke468rwpo",
    "date": "2025-01-09",
    "time": "00:00:00",
    "title": "Chaos on Hollywood streets as people flee Sunset fire",
    "body": "'Where do I go?' Chaos on Hollywood streets as people flee flames\n\nMuch of the heart of Hollywood is blanketed in thick smoke. You can barely see the tops of the towering palm trees that line streets here.\n\nIt is utter chaos on the streets near the fire. People are using sweatshirts to cover their faces so they can breathe. Many are carrying bags and suitcases looking for a place to go.\n\nSome are wearing pyjamas, clearly taken by surprise.\n\nThe Sunset fire broke out at around 18:00 (02:00 GMT) local time on Wednesday, covering much of Hollywood in thick smoke and forcing an evacuation order. By midnight local time the fire covered an area of 60 acres.\n\nWhile driving in Hollywood, I saw many people running away from their homes with whatever belongings they could carry.\n\nAs I pulled over, some of them responded to me in fear and anxiety.\n\n\"Are you here to help people? Where do I go?\" Anna Waldman asked as I got out of my car.\n\n\"Where is it safe?\"",
    "clean_body": "where do i go chaos on hollywood streets as people flee flames much of the heart of hollywood is blanketed in thick smoke you can barely see the tops of the towering palm trees that line streets here it is utter chaos on the streets near the fire people are using sweatshirts to cover their faces so they can breathe many are carrying bags and suitcases looking for a place to go some are wearing pyjamas clearly taken by surprise the sunset fire broke out at around 1800 0200 gmt local time on wednesday covering much of hollywood in thick smoke and forcing an evacuation order by midnight local time the fire covered an area of 60 acres while driving in hollywood i saw many people running away from their homes with whatever belongings they could carry as i pulled over some of them responded to me in fear and anxiety are you here to help people where do i go anna waldman asked as i got out of my car where is it safe",
    "summary": "Chaos on Hollywood streets as people flee flamesMuch of the heart of Hollywood is blanketed in thick smoke.\nYou can barely see the tops of the towering palm trees that line streets here.\nIt is utter chaos on the streets near the fire.\nThe Sunset fire broke out at around 18:00 (02:00 GMT) local time on Wednesday, covering much of Hollywood in thick smoke and forcing an evacuation order.\nWhile driving in Hollywood, I saw many people running away from their homes with whatever belongings they could carry.",
    "keywords": [
      "hollywood",
      "thick",
      "sunset",
      "flee",
      "utter",
      "waldman",
      "local",
      "smoke",
      "wearing",
      "using",
      "streets",
      "chaos"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/d233/live/ffd640d0-ce58-11ef-87df-d575b9a434a4.jpg"
  },
  "https://www.bbc.com/news/articles/ceve9lgl0n2o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/ceve9lgl0n2o",
    "date": "2025-01-17",
    "time": "00:00:00",
    "title": "Calorie labelling has modest effect, latest evidence finds",
    "body": "Calorie labels have small effect on eating habits - study\n\n17 January 2025 Share Save Philippa Roxby and Hannah Karpel Health reporters Share Save\n\nGetty Images Calories must now appear on menus in large restaurants and take-aways\n\nPutting calories on food labels and menus \"is no silver bullet\", say researchers who analysed the best evidence to date on how effective the policy can be. A review of 25 studies on calorie labelling in a number of countries found a small reduction in the calories people chose to eat - equivalent to two almonds - but even this modest effect could help prevent adults putting on weight as they get older. The new rules on calorie labelling came into force in England in 2022 as part of government plans to encourage people to make healthier choices. The government said it would continue to evaluate the impact, including on people with eating disorders.\n\nRestaurants, cafes and take-aways with more than 250 staff must now show how many calories are in meals on their menus. For Imara, a 27-year-old HR assistant from Birmingham, the change has been a positive part of her weight-loss journey. \"It has meant that I have been able to stay on track, stay within my calorie deficit and still enjoy a nice meal out with friends, or with my husband, and still have a good time and not worry about falling off track. \"Sometimes I will just have a meal and not think about the calories,\" she says. \"But if it is a day or a week where I do want to stay on track then I will look at the calories and see whether it is something that will fit within my goals.\"\n\nImara says calories can help her focus on her weight-loss goals\n\nThe research looked at studies of the impact of calorie labels in supermarkets, restaurants and other food outlets in countries including the United States, UK, Canada and France. In a 600-calorie meal, it found an average reduction of 11 calories (or 1.8%) in the food people chose and bought. Senior author Dr Gareth Hollands from University College London, said there was \"a small but potentially meaningful effect on people's food choices\" but \"we should not expect miracles\". He said calorie labelling \"may have a useful role\" alongside other measures, such as taxes on food and drinks, marketing restrictions and reformulation - making manufacturers adjust recipes for food products to make them healthier. Dr Natasha Clarke of Bath Spa University, who began the project at the University of Cambridge, says the evidence is \"robust\". And as calorie labelling becomes more widespread, the effect could have a \"meaningful contribution\" to public health.\n\n'Toxic way to look at food'\n\nMilly Goldsmith Milly says counting calories is what drove her eating disorder",
    "clean_body": "calorie labels have small effect on eating habits study 17 january 2025 share save philippa roxby and hannah karpel health reporters share save getty images calories must now appear on menus in large restaurants and takeaways putting calories on food labels and menus is no silver bullet say researchers who analysed the best evidence to date on how effective the policy can be a review of 25 studies on calorie labelling in a number of countries found a small reduction in the calories people chose to eat equivalent to two almonds but even this modest effect could help prevent adults putting on weight as they get older the new rules on calorie labelling came into force in england in 2022 as part of government plans to encourage people to make healthier choices the government said it would continue to evaluate the impact including on people with eating disorders restaurants cafes and takeaways with more than 250 staff must now show how many calories are in meals on their menus for imara a 27yearold hr assistant from birmingham the change has been a positive part of her weightloss journey it has meant that i have been able to stay on track stay within my calorie deficit and still enjoy a nice meal out with friends or with my husband and still have a good time and not worry about falling off track sometimes i will just have a meal and not think about the calories she says but if it is a day or a week where i do want to stay on track then i will look at the calories and see whether it is something that will fit within my goals imara says calories can help her focus on her weightloss goals the research looked at studies of the impact of calorie labels in supermarkets restaurants and other food outlets in countries including the united states uk canada and france in a 600calorie meal it found an average reduction of 11 calories or 18 in the food people chose and bought senior author dr gareth hollands from university college london said there was a small but potentially meaningful effect on peoples food choices but we should not expect miracles he said calorie labelling may have a useful role alongside other measures such as taxes on food and drinks marketing restrictions and reformulation making manufacturers adjust recipes for food products to make them healthier dr natasha clarke of bath spa university who began the project at the university of cambridge says the evidence is robust and as calorie labelling becomes more widespread the effect could have a meaningful contribution to public health toxic way to look at food milly goldsmith milly says counting calories is what drove her eating disorder",
    "summary": "A review of 25 studies on calorie labelling in a number of countries found a small reduction in the calories people chose to eat - equivalent to two almonds - but even this modest effect could help prevent adults putting on weight as they get older.\nThe new rules on calorie labelling came into force in England in 2022 as part of government plans to encourage people to make healthier choices.\nHe said calorie labelling \"may have a useful role\" alongside other measures, such as taxes on food and drinks, marketing restrictions and reformulation - making manufacturers adjust recipes for food products to make them healthier.\nDr Natasha Clarke of Bath Spa University, who began the project at the University of Cambridge, says the evidence is \"robust\".\nAnd as calorie labelling becomes more widespread, the effect could have a \"meaningful contribution\" to public health.",
    "keywords": [
      "finds",
      "calorie",
      "labelling",
      "university",
      "effect",
      "calories",
      "food",
      "latest",
      "menus",
      "small",
      "evidence",
      "track",
      "stay",
      "modest"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3d7f/live/0a75b2f0-d4cb-11ef-9789-03dbac2525e2.jpg"
  },
  "https://www.bbc.com/news/articles/c62q7de37vyo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c62q7de37vyo",
    "date": "2025-01-16",
    "time": "00:00:00",
    "title": "'Joy and worry' from Israeli hostage families as ceasefire deal reached",
    "body": "'Joy and worry' from hostage families as deal reached\n\n16 January 2025 Share Save Mallory Moench BBC News Share Save\n\nGetty Images People on the streets of Tel Aviv after the announcement of the ceasefire deal\n\n\"I need to invent a new word to describe it - when joy and worry meet,\" says Efrat Machikawa. Her uncle, Gadi Moses, was taken hostage by Hamas fighters from his home in southern Israel on 7 October 2023. But there is now very real hope for his release, after Israel and Hamas agreed a Gaza ceasefire and hostage release deal. Despite the deal, which should see all the hostages held by Hamas released in stages, families remain cautious.\n\n\"Controlled optimism\" are the words Ms Machikawa used to explain how she was feeling after hearing the news. She described the negotiations as a \"rollercoaster\". \"We hardly breathe,\" she said, adding she had no idea when her uncle would be released. \"I believe Gadi will be fine. It will take time but he will be hugged so warmly and slowly. Together we shall overcome.\"\n\nPhoto supplied Gadi Moses was taken hostage by Hamas fighters from his home in southern Israel on 7 October 2023\n\nIn Tel Aviv, a square that has often been packed with protesters demanding the release of the hostages was empty soon after the ceasefire and hostage release deal was announced. The agreement is expected to be approved by the Israeli cabinet, after which the ceasefire is expected to happen in three stages. The first phase would last six weeks and see 33 hostages - including women, children and elderly people - exchanged for Palestinian prisoners in Israeli jails. Negotiations for the second phase - which should see the remaining hostages released, a full Israeli troop withdrawal from Gaza and a return to \"sustainable calm\" - would start on the 16th day. The third and final stage would involve the reconstruction of Gaza and the return of any remaining hostages' bodies.\n\n\"We actually don't know anything. It's scary,\" said Yosi Schnaider, cousin of hostage Shiri Bibas, who was abducted with her two children and husband. \"We don't know if they're on the list, if they're going to come back in the first phase. If they are alive, if not,\" he added.\n\nGetty Images Nimrod Cohen was just 19 years old when he was abducted by Hamas",
    "clean_body": "joy and worry from hostage families as deal reached 16 january 2025 share save mallory moench bbc news share save getty images people on the streets of tel aviv after the announcement of the ceasefire deal i need to invent a new word to describe it when joy and worry meet says efrat machikawa her uncle gadi moses was taken hostage by hamas fighters from his home in southern israel on 7 october 2023 but there is now very real hope for his release after israel and hamas agreed a gaza ceasefire and hostage release deal despite the deal which should see all the hostages held by hamas released in stages families remain cautious controlled optimism are the words ms machikawa used to explain how she was feeling after hearing the news she described the negotiations as a rollercoaster we hardly breathe she said adding she had no idea when her uncle would be released i believe gadi will be fine it will take time but he will be hugged so warmly and slowly together we shall overcome photo supplied gadi moses was taken hostage by hamas fighters from his home in southern israel on 7 october 2023 in tel aviv a square that has often been packed with protesters demanding the release of the hostages was empty soon after the ceasefire and hostage release deal was announced the agreement is expected to be approved by the israeli cabinet after which the ceasefire is expected to happen in three stages the first phase would last six weeks and see 33 hostages including women children and elderly people exchanged for palestinian prisoners in israeli jails negotiations for the second phase which should see the remaining hostages released a full israeli troop withdrawal from gaza and a return to sustainable calm would start on the 16th day the third and final stage would involve the reconstruction of gaza and the return of any remaining hostages bodies we actually dont know anything its scary said yosi schnaider cousin of hostage shiri bibas who was abducted with her two children and husband we dont know if theyre on the list if theyre going to come back in the first phase if they are alive if not he added getty images nimrod cohen was just 19 years old when he was abducted by hamas",
    "summary": "'Joy and worry' from hostage families as deal reached16 January 2025 Share Save Mallory Moench BBC News Share SaveGetty Images People on the streets of Tel Aviv after the announcement of the ceasefire deal\"I need to invent a new word to describe it - when joy and worry meet,\" says Efrat Machikawa.\nHer uncle, Gadi Moses, was taken hostage by Hamas fighters from his home in southern Israel on 7 October 2023.\nBut there is now very real hope for his release, after Israel and Hamas agreed a Gaza ceasefire and hostage release deal.\nDespite the deal, which should see all the hostages held by Hamas released in stages, families remain cautious.\nThe agreement is expected to be approved by the Israeli cabinet, after which the ceasefire is expected to happen in three stages.",
    "keywords": [
      "hostage",
      "worry",
      "families",
      "israeli",
      "joy",
      "ceasefire",
      "hostages",
      "release",
      "phase",
      "deal",
      "israel",
      "hamas",
      "reached",
      "released"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/6ecb/live/63c82b00-d3a2-11ef-8b00-85fcdbabfa0e.jpg"
  },
  "https://www.bbc.com/news/articles/czj3mde43k2o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/czj3mde43k2o",
    "date": "2025-01-26",
    "time": "00:00:00",
    "title": "Auschwitz survivors return as world remembers Nazi death camp 80 years on",
    "body": "Survivors return as world remembers Auschwitz 80 years after liberation\n\n26 January 2025 Share Save Paul Kirby Reporting from Auschwitz Share Save\n\nBBC Conditions at Birkenau are harsh in January and organisers have erected a tent on the site to protect them\n\nAbout 50 survivors of the Nazi death camp at Auschwitz-Birkenau will return to the site on Monday to remember the day it was finally liberated on 27 January 1945. They will be joined by heads of state including King Charles and other European royalty, Emmanuel Macron of France and German President Frank-Walter Steinmeier. But it will be the survivors - most in their late 80s and 90s - not the dignitaries, whose voices will be heard during the commemorations at the camp, where 1.1 million people were murdered, most of them Jews. Their message is to tell the world what happened here and ensure that it never happens again.\n\n\"Every soul on this earth has the right to live,\" says Jona Laks, who is now 94 and arrived with her twin and elder sisters in 1944. \"Auschwitz was a laboratory for killing people. This was its task and it proved itself: few survived Auschwitz.\"\n\nClaims Conference Jona Laks, now 94, survived the medical experiments of Josef Mengele at Auschwitz\n\nAlthough daytime temperatures in recent days have climbed well above freezing and much of the snow has melted, many of the 50 arriving for Monday's commemorations are now too frail to stay in the open for long. Instead, an enormous, heated tent has been erected over the \"Death Gate\", as the entrance to Birkenau is known. The day will begin with survivors and Polish President Andrzej Duda laying a wreath at \"Death Wall\" at the first Auschwitz camp, where thousands of Polish prisoners, Jews and Soviet prisoners of war were shot. UK Prime Minister Keir Starmer laid a wreath here recently and it was still there at the weekend. The scene will later move to the death camp at Birkenau, known as Auschwitz II. Each big anniversary to mark the camp's liberation by Soviet troops is different. Thirty years ago, there was far less international interest, as renowned writer Elie Wiesel led a large group of fellow survivors and relatives to one of the crematoria blown up by the Nazis before they fled.\n\nUS States Holocaust Memorial Museum This aerial photo of Birkenau from December 21 1944 shows how the Nazis had already begun to destroy the gas chambers and crematoria\n\nGerman historian Susanne Willems speaks lovingly of the survivors she has met over several decades: \"Many were like favourite grandfathers to me. Of course we've lost many of them and it's my duty to carry on and become their witness.\" There will be no political speeches from international leaders beside the Death Gate, and no Russian presence because of the full-scale war launched against Ukraine almost three years ago, even though the camp was liberated by the Russian-dominated 60th Army of the First Ukrainian Front. Vladimir Putin attended the 60th anniversary; he is not welcome now. The Nazis' decision to wipe out Europe's Jewish population in extermination camps went into operation early in 1942. Six were built in occupied Poland: at Chelmno, Belzec, Sobibor, Treblinka, Majdanek and Auschwitz-Birkenau. Treblinka was far smaller than Auschwitz, and yet 800,000-850,000 Jews were murdered there in a far shorter period. Heinrich Himmler, supreme chief of the dreaded SS, and camp commandant Rudolf Höss oversaw the expansion of the Auschwitz complex to construct a second camp at Birkenau for industrial murder. By the end of 1942 there were four separate gas chambers and crematoria.\n\nSome of the blocks for the Nazis' prisoners at Auschwitz-Birkenau are still intact\n\nThe first mass deportations of Jews to Birkenau came from Slovakia and France in March 1942, and then in July from the Netherlands and Belgium as well, walking under the notorious sign Arbeit macht frei (Work sets you free) at Auschwitz and on to their deaths in the new camp. Soon trains would arrive at Birkenau at a specially constructed ramp, a short distance away from two gas chambers, and at one point 12,000 Jews were being gassed and their bodies burned every day. Jona Laks had already lost her parents at Chelmo and arrived in 1944 with her twin sister Miriam and elder sister Chana from the Lodz ghetto further north. \"I was ordered to go to the left, which meant the crematorium, whereas my twin was sent to the right. That was only because the man was so bored, he would say 'Left, right, left, right' not even looking at the the people. I didn't know that left meant death, but I did know it wasn't good,\" she told the BBC.\n\nJona Laks Jona Laks (L), with twin sister Miriam, survived the Lodz Ghetto, Auschwitz and the death march\n\nEighty to 90% of new arrivals were sent to their deaths while others were selected for slave labour. \"I was already very close to the gate; I could see the sparks, fire coming out of the chimneys and I could even feel the smell of burned flesh.\" Jona Laks was saved only because her elder sister shouted out that she should not be separated from her twin and word reached the infamous Nazi \"Angel of Death\" at the camp, Josef Mengele, who used part of Birkenau for often deadly medical experiments on twins. Women and children, the elderly and infirm were sent immediately to the gas chambers. My own grandfather, on the first Dutch transport, survived slave labour for a month and a day, until 18 August 1942. His sister, Geertje van Hasselt, her school headteacher husband Simon, and their two daughters Hermi, 14 , and nine-year-old Sophia were murdered on arrival on 12 February 1943.\n\nHermi van Hasselt was 14 when she was murdered, her sister Sophia was nine\n\nAlmost a million European Jews were murdered here from 1941 to 1945. But the dead also include some 70,000 Polish prisoners, 21,000 Roma and 15,000 Soviet prisoners of war, and an unknown number of gay men. Auschwitz drew 1.83 million visitors last year and although it is closed for the commemoration large numbers walked around the museum spread out in many of the old blocks across Auschwitz 1 at the weekend, and then the desolate, sprawling site of Birkenau.\n\nThe scale of the site is daunting. The remains of many of the blocks are cordoned off, with brick foundations all that is left as you peer into the distance. But the ruins of two gas chambers and crematoria remain, blown up as the Nazis sought to destroy the evidence. \"It makes you feel anxious being here. You don't realise how sad it is until you see it,\" said a young woman with a group of friends from Lancashire, all aged 18.\n\nAbigail, Siah, Molly, Eve and Millie visited the site of the Birkenau death camp at the weekend\n\n\"Obviously you learn about it, but it's crazy when you see it in real life,\" said another. \"It's crazy to think that some people don't think it exists.\" Far-right parties have made big advances in several European countries, not least in Germany, where Alternative für Deutschland (AfD) is in second place in opinion polls ahead of next month's election. Historian Susanne Willems, who has for years brought groups to Auschwitz, last week took a group of police from Berlin to Auschwitz to explain the rise of Nazism and how any military-type of hierarchy runs the risk of moving into authoritarianism. \"I'm doing this work to help these people have a clear understanding of what the limits of police action need to be, and that whatever they're asked to do, it remains their own decision whether to obey or not; and that they have the right, in fact the duty, to refuse anything that is, from their understanding, against human rights.\" Hours before the commemorations at Auschwitz, Prime Minister Keir Starmer pledged to make Holocaust education in the UK \"a truly national endeavour\", to defend the truth against anyone denying it. \"We will ensure all schools teach it and seek to give every young person the opportunity to hear a recorded survivor testimony, because by learning from survivors we can develop that empathy for others and that appreciation of our common humanity, which is the ultimate way to defeat the hatred of difference.\"\n\nThe ruins of the sprawling Birkenau site stretch far into the distance",
    "clean_body": "survivors return as world remembers auschwitz 80 years after liberation 26 january 2025 share save paul kirby reporting from auschwitz share save bbc conditions at birkenau are harsh in january and organisers have erected a tent on the site to protect them about 50 survivors of the nazi death camp at auschwitzbirkenau will return to the site on monday to remember the day it was finally liberated on 27 january 1945 they will be joined by heads of state including king charles and other european royalty emmanuel macron of france and german president frankwalter steinmeier but it will be the survivors most in their late 80s and 90s not the dignitaries whose voices will be heard during the commemorations at the camp where 11 million people were murdered most of them jews their message is to tell the world what happened here and ensure that it never happens again every soul on this earth has the right to live says jona laks who is now 94 and arrived with her twin and elder sisters in 1944 auschwitz was a laboratory for killing people this was its task and it proved itself few survived auschwitz claims conference jona laks now 94 survived the medical experiments of josef mengele at auschwitz although daytime temperatures in recent days have climbed well above freezing and much of the snow has melted many of the 50 arriving for mondays commemorations are now too frail to stay in the open for long instead an enormous heated tent has been erected over the death gate as the entrance to birkenau is known the day will begin with survivors and polish president andrzej duda laying a wreath at death wall at the first auschwitz camp where thousands of polish prisoners jews and soviet prisoners of war were shot uk prime minister keir starmer laid a wreath here recently and it was still there at the weekend the scene will later move to the death camp at birkenau known as auschwitz ii each big anniversary to mark the camps liberation by soviet troops is different thirty years ago there was far less international interest as renowned writer elie wiesel led a large group of fellow survivors and relatives to one of the crematoria blown up by the nazis before they fled us states holocaust memorial museum this aerial photo of birkenau from december 21 1944 shows how the nazis had already begun to destroy the gas chambers and crematoria german historian susanne willems speaks lovingly of the survivors she has met over several decades many were like favourite grandfathers to me of course weve lost many of them and its my duty to carry on and become their witness there will be no political speeches from international leaders beside the death gate and no russian presence because of the fullscale war launched against ukraine almost three years ago even though the camp was liberated by the russiandominated 60th army of the first ukrainian front vladimir putin attended the 60th anniversary he is not welcome now the nazis decision to wipe out europes jewish population in extermination camps went into operation early in 1942 six were built in occupied poland at chelmno belzec sobibor treblinka majdanek and auschwitzbirkenau treblinka was far smaller than auschwitz and yet 800000850000 jews were murdered there in a far shorter period heinrich himmler supreme chief of the dreaded ss and camp commandant rudolf höss oversaw the expansion of the auschwitz complex to construct a second camp at birkenau for industrial murder by the end of 1942 there were four separate gas chambers and crematoria some of the blocks for the nazis prisoners at auschwitzbirkenau are still intact the first mass deportations of jews to birkenau came from slovakia and france in march 1942 and then in july from the netherlands and belgium as well walking under the notorious sign arbeit macht frei work sets you free at auschwitz and on to their deaths in the new camp soon trains would arrive at birkenau at a specially constructed ramp a short distance away from two gas chambers and at one point 12000 jews were being gassed and their bodies burned every day jona laks had already lost her parents at chelmo and arrived in 1944 with her twin sister miriam and elder sister chana from the lodz ghetto further north i was ordered to go to the left which meant the crematorium whereas my twin was sent to the right that was only because the man was so bored he would say left right left right not even looking at the the people i didnt know that left meant death but i did know it wasnt good she told the bbc jona laks jona laks l with twin sister miriam survived the lodz ghetto auschwitz and the death march eighty to 90 of new arrivals were sent to their deaths while others were selected for slave labour i was already very close to the gate i could see the sparks fire coming out of the chimneys and i could even feel the smell of burned flesh jona laks was saved only because her elder sister shouted out that she should not be separated from her twin and word reached the infamous nazi angel of death at the camp josef mengele who used part of birkenau for often deadly medical experiments on twins women and children the elderly and infirm were sent immediately to the gas chambers my own grandfather on the first dutch transport survived slave labour for a month and a day until 18 august 1942 his sister geertje van hasselt her school headteacher husband simon and their two daughters hermi 14 and nineyearold sophia were murdered on arrival on 12 february 1943 hermi van hasselt was 14 when she was murdered her sister sophia was nine almost a million european jews were murdered here from 1941 to 1945 but the dead also include some 70000 polish prisoners 21000 roma and 15000 soviet prisoners of war and an unknown number of gay men auschwitz drew 183 million visitors last year and although it is closed for the commemoration large numbers walked around the museum spread out in many of the old blocks across auschwitz 1 at the weekend and then the desolate sprawling site of birkenau the scale of the site is daunting the remains of many of the blocks are cordoned off with brick foundations all that is left as you peer into the distance but the ruins of two gas chambers and crematoria remain blown up as the nazis sought to destroy the evidence it makes you feel anxious being here you dont realise how sad it is until you see it said a young woman with a group of friends from lancashire all aged 18 abigail siah molly eve and millie visited the site of the birkenau death camp at the weekend obviously you learn about it but its crazy when you see it in real life said another its crazy to think that some people dont think it exists farright parties have made big advances in several european countries not least in germany where alternative für deutschland afd is in second place in opinion polls ahead of next months election historian susanne willems who has for years brought groups to auschwitz last week took a group of police from berlin to auschwitz to explain the rise of nazism and how any militarytype of hierarchy runs the risk of moving into authoritarianism im doing this work to help these people have a clear understanding of what the limits of police action need to be and that whatever theyre asked to do it remains their own decision whether to obey or not and that they have the right in fact the duty to refuse anything that is from their understanding against human rights hours before the commemorations at auschwitz prime minister keir starmer pledged to make holocaust education in the uk a truly national endeavour to defend the truth against anyone denying it we will ensure all schools teach it and seek to give every young person the opportunity to hear a recorded survivor testimony because by learning from survivors we can develop that empathy for others and that appreciation of our common humanity which is the ultimate way to defeat the hatred of difference the ruins of the sprawling birkenau site stretch far into the distance",
    "summary": "Instead, an enormous, heated tent has been erected over the \"Death Gate\", as the entrance to Birkenau is known.\nThe day will begin with survivors and Polish President Andrzej Duda laying a wreath at \"Death Wall\" at the first Auschwitz camp, where thousands of Polish prisoners, Jews and Soviet prisoners of war were shot.\nThe scene will later move to the death camp at Birkenau, known as Auschwitz II.\nAbigail, Siah, Molly, Eve and Millie visited the site of the Birkenau death camp at the weekend\"Obviously you learn about it, but it's crazy when you see it in real life,\" said another.\nThe ruins of the sprawling Birkenau site stretch far into the distance",
    "keywords": [
      "birkenau",
      "remembers",
      "site",
      "twin",
      "death",
      "nazi",
      "auschwitz",
      "jews",
      "survivors",
      "camp",
      "80",
      "return",
      "sister",
      "laks",
      "world"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/78c7/live/5793e1e0-dbf3-11ef-99c3-d14ec5dc850f.jpg"
  },
  "https://www.bbc.com/news/articles/c86w8546ezpo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c86w8546ezpo",
    "date": "2025-01-07",
    "time": "00:00:00",
    "title": "Disabled man becomes first to ski solo to South Pole unsupported",
    "body": "Disabled man completes South Pole trek\n\n7 January 2025 Share Save Share Save\n\nAntarctic Logistics & Expeditions (ALE) Jonny Huntington reached the South Pole after enduring extreme conditions and 24-hour sunlight\n\nA former GB para athlete has become the first disabled person to ski solo and unsupported to the South Pole. Jonny Huntington, from Kingsbridge, Devon, covered 566 miles (911km) of Antarctic ice in 46 days despite the effects of a debilitating stroke he suffered in 2014. The 38-year-old set off from Fuchs-Messner on 21 November 2024 and arrived at the South Pole on Monday. Throughout his expedition, he skied in extreme conditions, including freezing temperatures and 24-hour sunlight, while dragging a 242lb (110kg) sled carrying his food and equipment.\n\nSpeaking via a satellite phone on arrival at the South Pole, Mr Huntington said: \"It's been a bit of a whirlwind since getting here. It's pretty emotional. \"My right leg is pretty sore, which I think is probably reasonable, because it's done most of the work.\" Only 52 people have successfully skied to the South Pole without support but Mr Huntington is understood to be the first explorer with a disability to do so. A former Army officer, Mr Huntington was left paralysed from the neck down on his left side when he suffered a stroke at the age of 28.\n\nIt took years of rehabilitation before he was able to fully walk again and he was left with restricted movement down his left side. He said the final stage of his expedition was much more challenging because he encountered huge ice formations called sastrugi, as well as soft snow, which made progress difficult.\n\nJonny Huntington Carrying equipment, Jonny Huntington had to ski for nine to 11 hours per day\n\n\"This has been tough, the injury has certainly made it more difficult,\" said Mr Huntington. \"In the last couple of weeks I have been in a position where I've worried if my good side is going to survive this.\" During his stroke recovery, Mr Huntington became a member of the Armed Forces Para-Snowsport Team (AFPST), which ignited his love for skiing.\n\n'Refused to stop'\n\nHe went on to join the GB para Nordic ski team, competing between 2017 and 2020 at World Cups in Lviv, Ukraine, and Vuokatti, Finland, as well as the inaugural European Paralympic Committee Games in Poland in 2020. The idea for the South Pole expedition came after he stopped skiing competitively and he planned and trained for the expedition for five years. He said: \"I don't think I've pushed any boundaries in the sense of the route I've done, or anything like that - but, at the same time, I've dragged a pretty mangled body through that route. \"I'm just a normal bloke from South Devon - like, there is no magic formula and there's nothing special about me to enable me to have done what I've done. \"On this trip, I kept putting one foot in front of the other until I got to the end. \"When things were really tough, I just refused to stop putting one foot in front of the other.\" Mr Huntington said he was looking forward to celebrating his achievement with a steak and a glass of red wine.",
    "clean_body": "disabled man completes south pole trek 7 january 2025 share save share save antarctic logistics expeditions ale jonny huntington reached the south pole after enduring extreme conditions and 24hour sunlight a former gb para athlete has become the first disabled person to ski solo and unsupported to the south pole jonny huntington from kingsbridge devon covered 566 miles 911km of antarctic ice in 46 days despite the effects of a debilitating stroke he suffered in 2014 the 38yearold set off from fuchsmessner on 21 november 2024 and arrived at the south pole on monday throughout his expedition he skied in extreme conditions including freezing temperatures and 24hour sunlight while dragging a 242lb 110kg sled carrying his food and equipment speaking via a satellite phone on arrival at the south pole mr huntington said its been a bit of a whirlwind since getting here its pretty emotional my right leg is pretty sore which i think is probably reasonable because its done most of the work only 52 people have successfully skied to the south pole without support but mr huntington is understood to be the first explorer with a disability to do so a former army officer mr huntington was left paralysed from the neck down on his left side when he suffered a stroke at the age of 28 it took years of rehabilitation before he was able to fully walk again and he was left with restricted movement down his left side he said the final stage of his expedition was much more challenging because he encountered huge ice formations called sastrugi as well as soft snow which made progress difficult jonny huntington carrying equipment jonny huntington had to ski for nine to 11 hours per day this has been tough the injury has certainly made it more difficult said mr huntington in the last couple of weeks i have been in a position where ive worried if my good side is going to survive this during his stroke recovery mr huntington became a member of the armed forces parasnowsport team afpst which ignited his love for skiing refused to stop he went on to join the gb para nordic ski team competing between 2017 and 2020 at world cups in lviv ukraine and vuokatti finland as well as the inaugural european paralympic committee games in poland in 2020 the idea for the south pole expedition came after he stopped skiing competitively and he planned and trained for the expedition for five years he said i dont think ive pushed any boundaries in the sense of the route ive done or anything like that but at the same time ive dragged a pretty mangled body through that route im just a normal bloke from south devon like there is no magic formula and theres nothing special about me to enable me to have done what ive done on this trip i kept putting one foot in front of the other until i got to the end when things were really tough i just refused to stop putting one foot in front of the other mr huntington said he was looking forward to celebrating his achievement with a steak and a glass of red wine",
    "summary": "Disabled man completes South Pole trek7 January 2025 Share Save Share SaveAntarctic Logistics & Expeditions (ALE) Jonny Huntington reached the South Pole after enduring extreme conditions and 24-hour sunlightA former GB para athlete has become the first disabled person to ski solo and unsupported to the South Pole.\nThe 38-year-old set off from Fuchs-Messner on 21 November 2024 and arrived at the South Pole on Monday.\nSpeaking via a satellite phone on arrival at the South Pole, Mr Huntington said: \"It's been a bit of a whirlwind since getting here.\nThe idea for the South Pole expedition came after he stopped skiing competitively and he planned and trained for the expedition for five years.\nMr Huntington said he was looking forward to celebrating his achievement with a steak and a glass of red wine.",
    "keywords": [
      "south",
      "pole",
      "stroke",
      "ive",
      "left",
      "disabled",
      "expedition",
      "pretty",
      "ski",
      "unsupported",
      "mr",
      "huntington",
      "man",
      "solo"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/dd5f/live/e2b45900-cce2-11ef-9f81-4d65801d86b1.jpg"
  },
  "https://www.bbc.com/news/articles/c17dx4v5plvo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c17dx4v5plvo",
    "date": "2025-01-06",
    "time": "00:00:00",
    "title": "Saving a species: Slow return of the Iberian lynx",
    "body": "Saving a species: The slow return of the Iberian lynx\n\n6 January 2025 Share Save António Fernandes BBC News, Portugal Share Save\n\nCNRLI Navarro the male lynx, photographed here by a camera trap\n\nWith his leopard-like spots, Navarro - a male lynx - calls out during mating season as he walks towards a camera trap. Just short of 100cm (39 inches) in length and 45cm in height, the Iberian lynx is a rare sight. But there are now more than 2,000 in the wild across Spain and Portugal, so you're much more likely to see them than you were 20 years ago. \"The Iberian lynx was very, very close to extinction,\" says Rodrigo Serra, who runs the reproduction programme across Spain and Portugal. At the lowest point there were fewer than 100 lynxes left in two populations that didn't interact, and only 25 of them were females of reproductive age. \"The only feline species that was threatened at this level was the sabre tooth tiger thousands of years ago.\" The decline of the lynx population was partly down to more and more land being used for agriculture, a rise in fatalities on the roads, and a struggle for food. Wild rabbits are essential prey for the lynx and two pandemics led to a 95% fall in their number. By 2005, Portugal had no lynxes left, but it was also the year that Spain saw the first litter born in captivity. It took another three years before Portugal decided on a national conservation action plan to save the species. A National Breeding Centre for Iberian lynxes was built in Silves in the Algarve. Here they are monitored 24 hours a day. The aim is twofold – to prepare them for life in the wild and to pair them for reproduction. Serra speaks in a whisper, because even from a distance of 200m you can cause stress to the animals in the 16 pens where most of the animals are kept. Sometimes, though, stress is exactly what the lynxes need.\n\nCNRLI The clinic in Silves makes sure the lynxes are ready for life in the wild\n\n\"When we notice a litter is becoming a bit more confident, we go in and chase them and make noise so they are scared again and climb the fences,\" says Serra. \"We're training them not to get close to people in the wild.\" That's partly for their own protection, but also so they stay away from people and their animals. \"A lynx should be a lynx, not be treated like a house cat.\" So the lynxes never associate food with people, they are fed through a tunnel system at the centre. Then, when the time comes, they are released into the wild. Genetics determines where they end up, to diminish the risks of inbreeding or disease. Even if a lynx was born in Portugal it might be taken to Spain. Pedro Sarmento is responsible for reintroducing the lynx in Portugal and has studied the Iberian lynx for 30 years. \"As a biologist there are two things that strike me when I'm handling a lynx. It's an animal with a fairly small head for its body and extraordinarily wide paws. That gives them an impulse and ability to jump which are rare.\" The breeding programme and the return of the lynx have been hailed as great successes, but as their numbers climb there may be problems too. As lynxes are often released on private land in Portugal, the organisers of the reproduction programme have to reach an agreement with the owners first.\n\nBBC/António Fernandes Pedro Sarmento is responsible for reintroducing lynxes to Portugal\n\nWhere the animals go after that is up to them, and although there have been some attacks on chicken coops, Sarmento says there have not been many. \"This can lead to uneasiness within locals. We've been strengthening the coops so lynxes can't access them, and in some cases we keep monitoring the lynxes and scare them off if needed.\" He recounts the story of Lítio, one of the first lynxes released in Portugal. For six months Lítio stayed in the same area but then the team lost track of him. He eventually made his way to Doñana, a national park in southern Spain where he had come from originally. As Lítio was sick, he was treated and then returned to the reproduction team in the Algarve. Within days of his release from the centre he began heading back to Doñana, swimming across the Guadiana river to reach Spain. For a time he disappeared, but eventually he was brought back to the Algarve.\n\nBBC/António Fernandes The lynxes are monitored with camera traps and tracking apps\n\nWhen he was released for a third time, Lítio did not venture back to Spain but instead he walked 3km (two miles), found a female and never moved again. \"He is the oldest lynx we have here, and he's fathered plenty of cubs ever since,\" says Sarmento. Three decades after Spain decided to save the lynx, the species is no longer endangered, and Sarmento hopes it'll reach a favourable conservation status by 2035. For that to happen, the numbers need to reach 5,000-6,000 in the wild. \"I saw the species disappearing. It's surreal that we're in a place where we can see lynxes in nature or through camera trapping almost daily,\" says Sarmento. The reproduction team are not being complacent and there are risks involved in their work. Last year 80% of lynx deaths took place on the roads. For now, though, they feel confident the Iberian lynx has been saved.",
    "clean_body": "saving a species the slow return of the iberian lynx 6 january 2025 share save antónio fernandes bbc news portugal share save cnrli navarro the male lynx photographed here by a camera trap with his leopardlike spots navarro a male lynx calls out during mating season as he walks towards a camera trap just short of 100cm 39 inches in length and 45cm in height the iberian lynx is a rare sight but there are now more than 2000 in the wild across spain and portugal so youre much more likely to see them than you were 20 years ago the iberian lynx was very very close to extinction says rodrigo serra who runs the reproduction programme across spain and portugal at the lowest point there were fewer than 100 lynxes left in two populations that didnt interact and only 25 of them were females of reproductive age the only feline species that was threatened at this level was the sabre tooth tiger thousands of years ago the decline of the lynx population was partly down to more and more land being used for agriculture a rise in fatalities on the roads and a struggle for food wild rabbits are essential prey for the lynx and two pandemics led to a 95 fall in their number by 2005 portugal had no lynxes left but it was also the year that spain saw the first litter born in captivity it took another three years before portugal decided on a national conservation action plan to save the species a national breeding centre for iberian lynxes was built in silves in the algarve here they are monitored 24 hours a day the aim is twofold – to prepare them for life in the wild and to pair them for reproduction serra speaks in a whisper because even from a distance of 200m you can cause stress to the animals in the 16 pens where most of the animals are kept sometimes though stress is exactly what the lynxes need cnrli the clinic in silves makes sure the lynxes are ready for life in the wild when we notice a litter is becoming a bit more confident we go in and chase them and make noise so they are scared again and climb the fences says serra were training them not to get close to people in the wild thats partly for their own protection but also so they stay away from people and their animals a lynx should be a lynx not be treated like a house cat so the lynxes never associate food with people they are fed through a tunnel system at the centre then when the time comes they are released into the wild genetics determines where they end up to diminish the risks of inbreeding or disease even if a lynx was born in portugal it might be taken to spain pedro sarmento is responsible for reintroducing the lynx in portugal and has studied the iberian lynx for 30 years as a biologist there are two things that strike me when im handling a lynx its an animal with a fairly small head for its body and extraordinarily wide paws that gives them an impulse and ability to jump which are rare the breeding programme and the return of the lynx have been hailed as great successes but as their numbers climb there may be problems too as lynxes are often released on private land in portugal the organisers of the reproduction programme have to reach an agreement with the owners first bbcantónio fernandes pedro sarmento is responsible for reintroducing lynxes to portugal where the animals go after that is up to them and although there have been some attacks on chicken coops sarmento says there have not been many this can lead to uneasiness within locals weve been strengthening the coops so lynxes cant access them and in some cases we keep monitoring the lynxes and scare them off if needed he recounts the story of lítio one of the first lynxes released in portugal for six months lítio stayed in the same area but then the team lost track of him he eventually made his way to doñana a national park in southern spain where he had come from originally as lítio was sick he was treated and then returned to the reproduction team in the algarve within days of his release from the centre he began heading back to doñana swimming across the guadiana river to reach spain for a time he disappeared but eventually he was brought back to the algarve bbcantónio fernandes the lynxes are monitored with camera traps and tracking apps when he was released for a third time lítio did not venture back to spain but instead he walked 3km two miles found a female and never moved again he is the oldest lynx we have here and hes fathered plenty of cubs ever since says sarmento three decades after spain decided to save the lynx the species is no longer endangered and sarmento hopes itll reach a favourable conservation status by 2035 for that to happen the numbers need to reach 50006000 in the wild i saw the species disappearing its surreal that were in a place where we can see lynxes in nature or through camera trapping almost daily says sarmento the reproduction team are not being complacent and there are risks involved in their work last year 80 of lynx deaths took place on the roads for now though they feel confident the iberian lynx has been saved",
    "summary": "Just short of 100cm (39 inches) in length and 45cm in height, the Iberian lynx is a rare sight.\n\"The Iberian lynx was very, very close to extinction,\" says Rodrigo Serra, who runs the reproduction programme across Spain and Portugal.\nA National Breeding Centre for Iberian lynxes was built in Silves in the Algarve.\nPedro Sarmento is responsible for reintroducing the lynx in Portugal and has studied the Iberian lynx for 30 years.\nFor now, though, they feel confident the Iberian lynx has been saved.",
    "keywords": [
      "lynx",
      "slow",
      "return",
      "reproduction",
      "species",
      "spain",
      "lynxes",
      "wild",
      "saving",
      "iberian",
      "portugal",
      "sarmento",
      "released"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f0df/live/5a98b3a0-c8fe-11ef-94cb-5f844ceb9e30.jpg"
  },
  "https://www.bbc.com/news/articles/cvg9lgp34e3o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cvg9lgp34e3o",
    "date": "2025-01-03",
    "time": "00:00:00",
    "title": "Why Apple is offering rare iPhone discounts in China",
    "body": "Why Apple is offering rare iPhone discounts in China\n\n3 January 2025 Share Save João da Silva Business reporter Share Save\n\nGetty Images The US tech giant cuts prices in China as it faces growing competition from local rivals\n\nShoppers in China are getting rare discounts on iPhones as Apple faces growing competition from local brands. The four-day promotion, which starts this Saturday (4 January), includes discounts of as much as 500 yuan ($68.50, £55.30) on some of the US technology giant's newest handsets. Chinese phone maker Huawei has also cut prices of its high-end mobile devices by as much as 20%. The discounts come as consumers in China remain hesitant about spending because of the country's economic challenges.\n\nThe offer covers Apple's top models as well as older handsets and some other devices. The biggest discount of 500 yuan will apply to Apple's flagship iPhone 16 Pro, which has a starting price of 7,999 yuan, and the iPhone 16 Pro Max which currently costs 9,999 yuan. The firm held a similar promotion in China last year ahead of the Lunar New Year holiday. This year, the festival starts at the end of January.\n\nChanging behaviour\n\n\"Apple's strategy has changed to adapt to the change in Chinese consumers' shopping behaviour,\" said Will Wong, a senior research manager for market intelligence firm International Data Corporation (IDC). \"The value-seeking trend has made price discounts more attractive to consumers. Apple may fall behind other competitors if it doesn't adopt such a pricing strategy.\" The discounts being offered by Apple and Huawei reflect a wider trend in China. From online retail giants to the country's car makers, deals are being offered in a bid to attract customers who have been reluctant to spend as the world's second largest economy slows. The Chinese government has also stepped up efforts to boost consumption. Last year, Beijing launched a trade-in programme to encourage consumers to replace old products such as cars and household appliances. The plan was expanded on Friday to include mobile phones, tablets, smartwatches and fitness bands.\n\nLocal competition",
    "clean_body": "why apple is offering rare iphone discounts in china 3 january 2025 share save joão da silva business reporter share save getty images the us tech giant cuts prices in china as it faces growing competition from local rivals shoppers in china are getting rare discounts on iphones as apple faces growing competition from local brands the fourday promotion which starts this saturday 4 january includes discounts of as much as 500 yuan 6850 £5530 on some of the us technology giants newest handsets chinese phone maker huawei has also cut prices of its highend mobile devices by as much as 20 the discounts come as consumers in china remain hesitant about spending because of the countrys economic challenges the offer covers apples top models as well as older handsets and some other devices the biggest discount of 500 yuan will apply to apples flagship iphone 16 pro which has a starting price of 7999 yuan and the iphone 16 pro max which currently costs 9999 yuan the firm held a similar promotion in china last year ahead of the lunar new year holiday this year the festival starts at the end of january changing behaviour apples strategy has changed to adapt to the change in chinese consumers shopping behaviour said will wong a senior research manager for market intelligence firm international data corporation idc the valueseeking trend has made price discounts more attractive to consumers apple may fall behind other competitors if it doesnt adopt such a pricing strategy the discounts being offered by apple and huawei reflect a wider trend in china from online retail giants to the countrys car makers deals are being offered in a bid to attract customers who have been reluctant to spend as the worlds second largest economy slows the chinese government has also stepped up efforts to boost consumption last year beijing launched a tradein programme to encourage consumers to replace old products such as cars and household appliances the plan was expanded on friday to include mobile phones tablets smartwatches and fitness bands local competition",
    "summary": "Why Apple is offering rare iPhone discounts in China3 January 2025 Share Save João da Silva Business reporter Share SaveGetty Images The US tech giant cuts prices in China as it faces growing competition from local rivalsShoppers in China are getting rare discounts on iPhones as Apple faces growing competition from local brands.\nThe discounts come as consumers in China remain hesitant about spending because of the country's economic challenges.\nThe biggest discount of 500 yuan will apply to Apple's flagship iPhone 16 Pro, which has a starting price of 7,999 yuan, and the iPhone 16 Pro Max which currently costs 9,999 yuan.\nThe firm held a similar promotion in China last year ahead of the Lunar New Year holiday.\nThe discounts being offered by Apple and Huawei reflect a wider trend in China.",
    "keywords": [
      "consumers",
      "trend",
      "china",
      "offering",
      "strategy",
      "apple",
      "rare",
      "competition",
      "chinese",
      "discounts",
      "yuan",
      "iphone"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/cf5b/live/e1dd48e0-c97f-11ef-b228-653528087df0.jpg"
  },
  "https://www.bbc.com/news/articles/cwy4l3d11xro": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cwy4l3d11xro",
    "date": "2025-01-04",
    "time": "00:00:00",
    "title": "Why does Britain face flight chaos during bad weather?",
    "body": "Why does Britain face flight chaos during bad weather?\n\n4 January 2025 Share Save Faarea Masud BBC Business reporter Share Save\n\nPA Media Bad weather can cause travel disruption for passengers, as seen at the end of 2024 in the UK (file photo from 2017)\n\nPassengers at British airports have faced travel chaos on multiple occasions over the last few weeks, from heavy winds to fog. Now, the Met Office has issued an amber warning for snow and ice in the Midlands, north of England and Wales, which says that delays and cancellations to air travel are \"expected\". It can seem a mystery to many frustrated flyers that a brief spell of bad weather can upend schedules, especially since British weather isn't exactly famed for being the best. So why, with all the technological advancements of planes and airports in recent years, do flights get affected so badly?\n\nHow efficiency can quickly turn to chaos\n\nWhile planes are designed to deal with the likes of snow and ice, fog and high winds, air traffic control often imposes strict safety limits in these situations. As a result, \"airports go into a kind of slow motion\" with the spacing between arriving and departing aircraft increased, says travel expert Simon Calder. If the conditions \"require air-traffic controllers to increase the spacing between aircraft by 50%, capacity is immediately reduced by one third – and cancellations begin,\" he adds. There's little slack in the system, as when things are running smoothly, schedules at London Heathrow - Europe's busiest airport - are based on landing aircraft as close as 80 seconds apart. And London Gatwick, the UK's second busiest airport, can facilitate a take-off or landing every 65 seconds. The spacing between arriving and departing aircraft was increased at London Gatwick last weekend during the fog, which Mr Calder estimates led to about 75,000 passengers being affected. Among them were James and Madison King, whose flight from Stockholm to London took a lengthy diversion because of the fog-related spacing limits. They were within touching distance of home when the pilot announced they did not have enough fuel for a 50-minute holding pattern at Gatwick, so the plane diverted to Dublin to refuel. Flight crew shift limits then meant all the passengers had to fly back to where they started in the Swedish capital. James says he still hasn't been reimbursed for the £200 he spent on a hotel and dinner during this impromptu additional overnight stay in Stockholm.\n\nJames King/ Madison King James and Madison King were delayed over Christmas\n\nHeathrow also saw delays and cancellations during high winds before Christmas. Despite some airports trialling artificial intelligence to help planes land in low visibility, controllers in on-the-ground towers still need to clearly see an aircraft arriving before issuing a landing clearance, aviation expert Scott Bateman MBE wrote on X. He says the majority of modern aircraft can automatically land in the worst fog, but that in practice visibility limits are imposed so pilots can see sufficiently to taxi off the runway. Elif Arjin Celik's flight from London Gatwick to Istanbul was delayed for hours because of poor visibility in the fog on 28 December 2024. She saw thousands of people waiting in the terminal with nowhere to sit, and says it was \"grim\" having to wait 20 minutes to use the toilet because of the \"extreme overcrowding\". With upcoming warnings of snow, Mr Calder advises passengers to brace for more disruption to their flights because of spacing limits and runway closures. \"The UK has seen some shocking snow closures, where big airports have simply not been able to cope,\" he says, citing an incident in 2010 where hundreds of thousands of passengers saw cancellations at Heathrow because of snow. Snow also caused Manchester Airport to close both its runways in December 2022 and again in January 2023, with flights diverted as far away as Dublin and Paris. Although the extreme cost of disruption on this scale has led to British airports investing more in hardware and training to clear snow quicker, don't expect us to cope like airports in places such as Iceland and Greenland. Mr Calder says we might never be as good as other countries at keeping an efficient schedule in unusual weather. \"Historically the UK has had a benign climate,\" he says. \"Spending millions preparing for an unlikely event has been hard to justify.\"\n\nDisruption could grow\n\nThere's not great news on the horizon because in the future, we can expect more disruption from weather related to climate change, says Dr Ella Gilbert, a climate expert from the British Antarctic Survey. \"Aviation tends to be most impacted by extreme precipitation and stormy weather that makes flying unsafe - two weather types that are enhanced by higher temperatures,\" she says. She adds that climate heating increases the frequency and intensity of rain and snowfall events, making storms \"stronger and more frequent\" and increasing the frequency of aircraft turbulence. Nats, the national air traffic service, is allowed to take action to reduce the amount of planes in the sky and space them apart more during adverse weather under the Transport Act 2000. Given this is part of Nats' obligation to prioritise safety over all other factors, it doesn't have to compensate airlines for these restrictions - which in turn means airlines don't need to compensate passengers for the resulting delays either. The organisation told the BBC that it recognises there's a tough balancing act. \"Flow regulations are only ever employed when absolutely necessary and have to be expertly timed,\" a Nats spokesperson said. \"Unexpected additional or delayed air traffic can increase the pressure on controllers, particularly when the weather clears. \"If restrictions are lifted too early, they can risk an overpopulated airspace, while on the flip side, restrictions remaining in place longer than they need to can lead to unnecessary delays, which no one wants.\" This is brought into sharp focus during storms, Nats explained. \"Fundamentally, pilots don't want to fly through storms,\" it told the BBC. \"Although aircraft are robust, storms can still affect aircraft systems and excessive winds within unstable storm clouds make it much more difficult for aircraft to maintain their levels. It also increases turbulence, which negatively impacts passenger comfort.\" This leads to planes being in unexpected parts of the sky at different times, and all these new routes needing to be recalibrated to avoid any collisions. Nats says it does have measures to mitigate disruption, including specialist Met Office weather equipment which can help foresee the need for safety limits to be imposed, while pilots also have more tech on board to help them fly around bad weather patches and inform air traffic controllers of potential issues.\n\nWhat are your rights if a flight is cancelled due to poor weather?",
    "clean_body": "why does britain face flight chaos during bad weather 4 january 2025 share save faarea masud bbc business reporter share save pa media bad weather can cause travel disruption for passengers as seen at the end of 2024 in the uk file photo from 2017 passengers at british airports have faced travel chaos on multiple occasions over the last few weeks from heavy winds to fog now the met office has issued an amber warning for snow and ice in the midlands north of england and wales which says that delays and cancellations to air travel are expected it can seem a mystery to many frustrated flyers that a brief spell of bad weather can upend schedules especially since british weather isnt exactly famed for being the best so why with all the technological advancements of planes and airports in recent years do flights get affected so badly how efficiency can quickly turn to chaos while planes are designed to deal with the likes of snow and ice fog and high winds air traffic control often imposes strict safety limits in these situations as a result airports go into a kind of slow motion with the spacing between arriving and departing aircraft increased says travel expert simon calder if the conditions require airtraffic controllers to increase the spacing between aircraft by 50 capacity is immediately reduced by one third – and cancellations begin he adds theres little slack in the system as when things are running smoothly schedules at london heathrow europes busiest airport are based on landing aircraft as close as 80 seconds apart and london gatwick the uks second busiest airport can facilitate a takeoff or landing every 65 seconds the spacing between arriving and departing aircraft was increased at london gatwick last weekend during the fog which mr calder estimates led to about 75000 passengers being affected among them were james and madison king whose flight from stockholm to london took a lengthy diversion because of the fogrelated spacing limits they were within touching distance of home when the pilot announced they did not have enough fuel for a 50minute holding pattern at gatwick so the plane diverted to dublin to refuel flight crew shift limits then meant all the passengers had to fly back to where they started in the swedish capital james says he still hasnt been reimbursed for the £200 he spent on a hotel and dinner during this impromptu additional overnight stay in stockholm james king madison king james and madison king were delayed over christmas heathrow also saw delays and cancellations during high winds before christmas despite some airports trialling artificial intelligence to help planes land in low visibility controllers in ontheground towers still need to clearly see an aircraft arriving before issuing a landing clearance aviation expert scott bateman mbe wrote on x he says the majority of modern aircraft can automatically land in the worst fog but that in practice visibility limits are imposed so pilots can see sufficiently to taxi off the runway elif arjin celiks flight from london gatwick to istanbul was delayed for hours because of poor visibility in the fog on 28 december 2024 she saw thousands of people waiting in the terminal with nowhere to sit and says it was grim having to wait 20 minutes to use the toilet because of the extreme overcrowding with upcoming warnings of snow mr calder advises passengers to brace for more disruption to their flights because of spacing limits and runway closures the uk has seen some shocking snow closures where big airports have simply not been able to cope he says citing an incident in 2010 where hundreds of thousands of passengers saw cancellations at heathrow because of snow snow also caused manchester airport to close both its runways in december 2022 and again in january 2023 with flights diverted as far away as dublin and paris although the extreme cost of disruption on this scale has led to british airports investing more in hardware and training to clear snow quicker dont expect us to cope like airports in places such as iceland and greenland mr calder says we might never be as good as other countries at keeping an efficient schedule in unusual weather historically the uk has had a benign climate he says spending millions preparing for an unlikely event has been hard to justify disruption could grow theres not great news on the horizon because in the future we can expect more disruption from weather related to climate change says dr ella gilbert a climate expert from the british antarctic survey aviation tends to be most impacted by extreme precipitation and stormy weather that makes flying unsafe two weather types that are enhanced by higher temperatures she says she adds that climate heating increases the frequency and intensity of rain and snowfall events making storms stronger and more frequent and increasing the frequency of aircraft turbulence nats the national air traffic service is allowed to take action to reduce the amount of planes in the sky and space them apart more during adverse weather under the transport act 2000 given this is part of nats obligation to prioritise safety over all other factors it doesnt have to compensate airlines for these restrictions which in turn means airlines dont need to compensate passengers for the resulting delays either the organisation told the bbc that it recognises theres a tough balancing act flow regulations are only ever employed when absolutely necessary and have to be expertly timed a nats spokesperson said unexpected additional or delayed air traffic can increase the pressure on controllers particularly when the weather clears if restrictions are lifted too early they can risk an overpopulated airspace while on the flip side restrictions remaining in place longer than they need to can lead to unnecessary delays which no one wants this is brought into sharp focus during storms nats explained fundamentally pilots dont want to fly through storms it told the bbc although aircraft are robust storms can still affect aircraft systems and excessive winds within unstable storm clouds make it much more difficult for aircraft to maintain their levels it also increases turbulence which negatively impacts passenger comfort this leads to planes being in unexpected parts of the sky at different times and all these new routes needing to be recalibrated to avoid any collisions nats says it does have measures to mitigate disruption including specialist met office weather equipment which can help foresee the need for safety limits to be imposed while pilots also have more tech on board to help them fly around bad weather patches and inform air traffic controllers of potential issues what are your rights if a flight is cancelled due to poor weather",
    "summary": "Why does Britain face flight chaos during bad weather?\nIt can seem a mystery to many frustrated flyers that a brief spell of bad weather can upend schedules, especially since British weather isn't exactly famed for being the best.\nSo why, with all the technological advancements of planes and airports in recent years, do flights get affected so badly?\nAmong them were James and Madison King, whose flight from Stockholm to London took a lengthy diversion because of the fog-related spacing limits.\nWith upcoming warnings of snow, Mr Calder advises passengers to brace for more disruption to their flights because of spacing limits and runway closures.",
    "keywords": [
      "weather",
      "aircraft",
      "does",
      "airports",
      "face",
      "snow",
      "nats",
      "bad",
      "britain",
      "spacing",
      "flight",
      "passengers",
      "planes",
      "limits",
      "london",
      "chaos"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/e503/live/1630c380-ca00-11ef-94cb-5f844ceb9e30.jpg"
  },
  "https://www.bbc.com/news/articles/c0mvmy3dwe1o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c0mvmy3dwe1o",
    "date": "2025-01-09",
    "time": "00:00:00",
    "title": "The 20 child abuse inquiry recommendations",
    "body": "The 20 child abuse inquiry proposals - what has happened so far?\n\n9 January 2025 Share Save Tom Symonds Political correspondent Share Save\n\nGetty Images\n\nIn October 2022, child protection expert Prof Alexis Jay finished a seven-year inquiry into the countless ways children had been sexually abused in England and Wales. She had presided over hundreds of days of evidence in which victims described their treatment and those who had the duty to protect them answered for their failings. Her team had investigated abuse in churches, schools, custodial institutions, political parties, religious groups, and children's homes. She found that over decades, children had been harmed online, offline, in the UK and abroad, by individuals and paedophile networks, including grooming gangs, on the streets of British towns and cities. Her conclusion: the nation had been scarred by an \"epidemic that left thousands of victims in its poisonous wake\". The abuse was often covered up by institutions that \"prioritised their reputations above the welfare of those they were duty bound to protect\". Her inquiry was not a court. No one will go to prison because of her findings, but she had the power to make recommendations for change and to monitor whether they happened. There were 20 in the final report of the Independent Inquiry into Child Sexual Abuse (IICSA). The Conservative government was given the task of delivering them but lost last year's general election. Now, 27 months on from the recommendations first being made, all remain outstanding. The new Labour government says it is \"working at pace\" to deliver them.\n\nMandatory reporting\n\nThe biggest single reform Prof Jay recommended was for people in regulated jobs working with children to have the duty to report any abuse they witnessed or were told about by either the child or perpetrator. Not doing so would be a criminal offence, as would covering up abuse. The Conservative government agreed but, to the dismay of campaigners, decided the sanction would be less severe - a ban on working with children. A criminal offence would be committed only by those who actively prevented the authorities finding out about abuse. This policy was slated to go to Parliament in 2024, but the election was called before it could become law. The Labour government has resurrected the issue, with Home Secretary Yvette Cooper telling the Commons on Monday 6 January she would introduce criminal sanctions for both the cover-up of child sexual abuse and the failure to report it. The government says mandatory reporting will be part of the Crime and Policing Bill planned for this Spring.\n\nPA Media Prof Alexis Jay\n\nProduce better data\n\nThe inquiry recommended a major effort to produce better data on child abuse, creating a single core set of figures covering the age, sex and ethnicity of victims and perpetrators, the places in which abuse happens, and the factors that make children vulnerable. The Conservatives set up research projects in several government departments to improve the data. Suella Braverman, then home secretary, created what she described as a \"grooming gangs taskforce\". The police disliked the grooming gangs description and rebadged it as the child sexual exploitation taskforce as it would also fight groups of abusers in institutions, families and online. It provides intelligence and expertise to police forces through a variety of programmes, and has begun to gather consistent data. However, statistics on the ethnicity of abusers, a key issue in the grooming gangs debate, are hard to obtain. Prof Jay's inquiry found police were \"not confident\" about gathering this information. A suspect's race can be identified definitively only after they have been arrested, by asking them at a time when they have a right to remain silent. Latest figures show there is a long way to go. In 2023, police tackling organised abuse recorded the ethnicity of 34% of suspects and 47% of victims. Cooper says she is working to \"improve the accuracy and robustness of the data and analysis\".\n\nNo new child protection authority\n\nProf Jay recommended the appointment of a new cabinet minister for children. Several junior ministers are responsible for aspects of young people's lives, and Education Secretary Bridget Phillipson attends cabinet, but there is no cabinet minister with the title envisaged by the inquiry. A bigger change involves the recommendation for a child protection authority for England and Wales. The Conservatives preferred instead to make existing institutions work better. The new government wants what has been described as a \"fuller conversation\" on a new authority. Setting one up would involve several government departments. Lucy Duckworth, from campaign group Act On IICSA, says it should operate like the Health and Safety Executive, providing training and support in protecting children. The recommendation for a national public awareness campaign remains outstanding, though the government already funds a series of campaigns. Prof Jay wanted it to extend to content on TV and digital channels but also to use \"positive role models\" in creative media such as drama. They include better registration of staff in children's homes, as well as young offender institutions and secure training centres. She demanded more use of the vetting and barring list of approved employees, that the government took steps to improve compliance with it, and its extension to those working with children overseas. These measures were \"in progress\" according to a Conservative government update in 2023. A related recommendation is to ban staff in institutions from using pain to get children to comply. The last government would not give a clear commitment to this, saying in 2023 there might be a need for it to prevent serious physical harm to a child or adult. Ms Duckworth says banning the use of pain restraint is essential, saying it amounts to \"legalising a form of child abuse\", and points out some perpetrators might deliberately seek out jobs where they can hurt children. The last government was concerned about the implications of the proposal to change the Children's Act to give courts powers over local councils when children are at risk. This has not happened.\n\nOnline safety\n\nDuring the seven years Prof Jay's inquiry was investigating, abuse online was growing steadily. She recommended platform providers pre-screen for known child sexual abuse material. The Conservatives passed the Online Safety Act. Ofcom now requires some internet companies to remove harmful images using databases that contain profiles for known child abuse pictures. The act toughens the law on age verification online, another inquiry recommendation. Ofcom is due to publish new guidance for pornography sites. The inquiry's demand covered a wider group of \"online services and social media platforms\". In response, Ofcom said it will be expecting \"much greater use of age-assurance\" systems in future. There were a range of recommendations for the courts, police and prosecutors. Prof Jay wanted an end to the three-year limit for victims of abuse to sue for damages, as it often takes them longer to feel able to disclose what has happened. The Conservatives launched a consultation but it ended shortly before the election.\n\nCompensation for victims\n\nThe inquiry's call for a single redress scheme for victims of institutional abuse to apply for a payment to reflect their experiences remains outstanding. It could cost billions, with central and local government footing the bill. Changes to the Criminal Injuries Compensation Scheme were recommended to expand the range of compensation to cover the mental health effects of abuse. Work is ongoing. The proposal for a national guarantee of specialist therapy for child victims will be challenging for the government to respond to. The Jay Inquiry demanded it be \"fully funded\", with councils delivering the service. Yet child mental health facilities are under pressure and local authorities are already struggling to deliver social care services. Another big issue in historical cases has been access to records relating to child abuse held by authorities. The job of ensuring this is possible has been given to the Information Commissioner's Office. An investigation of whether the criminal justice system was complying with the Victim's Code is being carried out. However, the inquiry first called for it in 2018. The government has made consulting victims and survivors of abuse a priority. It has announced a panel to work with ministers on the delivery of the recommendations.\n\nSlow progress",
    "clean_body": "the 20 child abuse inquiry proposals what has happened so far 9 january 2025 share save tom symonds political correspondent share save getty images in october 2022 child protection expert prof alexis jay finished a sevenyear inquiry into the countless ways children had been sexually abused in england and wales she had presided over hundreds of days of evidence in which victims described their treatment and those who had the duty to protect them answered for their failings her team had investigated abuse in churches schools custodial institutions political parties religious groups and childrens homes she found that over decades children had been harmed online offline in the uk and abroad by individuals and paedophile networks including grooming gangs on the streets of british towns and cities her conclusion the nation had been scarred by an epidemic that left thousands of victims in its poisonous wake the abuse was often covered up by institutions that prioritised their reputations above the welfare of those they were duty bound to protect her inquiry was not a court no one will go to prison because of her findings but she had the power to make recommendations for change and to monitor whether they happened there were 20 in the final report of the independent inquiry into child sexual abuse iicsa the conservative government was given the task of delivering them but lost last years general election now 27 months on from the recommendations first being made all remain outstanding the new labour government says it is working at pace to deliver them mandatory reporting the biggest single reform prof jay recommended was for people in regulated jobs working with children to have the duty to report any abuse they witnessed or were told about by either the child or perpetrator not doing so would be a criminal offence as would covering up abuse the conservative government agreed but to the dismay of campaigners decided the sanction would be less severe a ban on working with children a criminal offence would be committed only by those who actively prevented the authorities finding out about abuse this policy was slated to go to parliament in 2024 but the election was called before it could become law the labour government has resurrected the issue with home secretary yvette cooper telling the commons on monday 6 january she would introduce criminal sanctions for both the coverup of child sexual abuse and the failure to report it the government says mandatory reporting will be part of the crime and policing bill planned for this spring pa media prof alexis jay produce better data the inquiry recommended a major effort to produce better data on child abuse creating a single core set of figures covering the age sex and ethnicity of victims and perpetrators the places in which abuse happens and the factors that make children vulnerable the conservatives set up research projects in several government departments to improve the data suella braverman then home secretary created what she described as a grooming gangs taskforce the police disliked the grooming gangs description and rebadged it as the child sexual exploitation taskforce as it would also fight groups of abusers in institutions families and online it provides intelligence and expertise to police forces through a variety of programmes and has begun to gather consistent data however statistics on the ethnicity of abusers a key issue in the grooming gangs debate are hard to obtain prof jays inquiry found police were not confident about gathering this information a suspects race can be identified definitively only after they have been arrested by asking them at a time when they have a right to remain silent latest figures show there is a long way to go in 2023 police tackling organised abuse recorded the ethnicity of 34 of suspects and 47 of victims cooper says she is working to improve the accuracy and robustness of the data and analysis no new child protection authority prof jay recommended the appointment of a new cabinet minister for children several junior ministers are responsible for aspects of young peoples lives and education secretary bridget phillipson attends cabinet but there is no cabinet minister with the title envisaged by the inquiry a bigger change involves the recommendation for a child protection authority for england and wales the conservatives preferred instead to make existing institutions work better the new government wants what has been described as a fuller conversation on a new authority setting one up would involve several government departments lucy duckworth from campaign group act on iicsa says it should operate like the health and safety executive providing training and support in protecting children the recommendation for a national public awareness campaign remains outstanding though the government already funds a series of campaigns prof jay wanted it to extend to content on tv and digital channels but also to use positive role models in creative media such as drama they include better registration of staff in childrens homes as well as young offender institutions and secure training centres she demanded more use of the vetting and barring list of approved employees that the government took steps to improve compliance with it and its extension to those working with children overseas these measures were in progress according to a conservative government update in 2023 a related recommendation is to ban staff in institutions from using pain to get children to comply the last government would not give a clear commitment to this saying in 2023 there might be a need for it to prevent serious physical harm to a child or adult ms duckworth says banning the use of pain restraint is essential saying it amounts to legalising a form of child abuse and points out some perpetrators might deliberately seek out jobs where they can hurt children the last government was concerned about the implications of the proposal to change the childrens act to give courts powers over local councils when children are at risk this has not happened online safety during the seven years prof jays inquiry was investigating abuse online was growing steadily she recommended platform providers prescreen for known child sexual abuse material the conservatives passed the online safety act ofcom now requires some internet companies to remove harmful images using databases that contain profiles for known child abuse pictures the act toughens the law on age verification online another inquiry recommendation ofcom is due to publish new guidance for pornography sites the inquirys demand covered a wider group of online services and social media platforms in response ofcom said it will be expecting much greater use of ageassurance systems in future there were a range of recommendations for the courts police and prosecutors prof jay wanted an end to the threeyear limit for victims of abuse to sue for damages as it often takes them longer to feel able to disclose what has happened the conservatives launched a consultation but it ended shortly before the election compensation for victims the inquirys call for a single redress scheme for victims of institutional abuse to apply for a payment to reflect their experiences remains outstanding it could cost billions with central and local government footing the bill changes to the criminal injuries compensation scheme were recommended to expand the range of compensation to cover the mental health effects of abuse work is ongoing the proposal for a national guarantee of specialist therapy for child victims will be challenging for the government to respond to the jay inquiry demanded it be fully funded with councils delivering the service yet child mental health facilities are under pressure and local authorities are already struggling to deliver social care services another big issue in historical cases has been access to records relating to child abuse held by authorities the job of ensuring this is possible has been given to the information commissioners office an investigation of whether the criminal justice system was complying with the victims code is being carried out however the inquiry first called for it in 2018 the government has made consulting victims and survivors of abuse a priority it has announced a panel to work with ministers on the delivery of the recommendations slow progress",
    "summary": "The 20 child abuse inquiry proposals - what has happened so far?\nThere were 20 in the final report of the Independent Inquiry into Child Sexual Abuse (IICSA).\nOfcom now requires some internet companies to remove harmful images using databases that contain profiles for known child abuse pictures.\nThe proposal for a national guarantee of specialist therapy for child victims will be challenging for the government to respond to.\nAnother big issue in historical cases has been access to records relating to child abuse held by authorities.",
    "keywords": [
      "jay",
      "child",
      "online",
      "recommendations",
      "working",
      "victims",
      "abuse",
      "institutions",
      "prof",
      "20",
      "inquiry",
      "children"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/8a5e/live/e975b480-ce9c-11ef-94cb-5f844ceb9e30.jpg"
  },
  "https://www.bbc.com/news/articles/clyvy41ej3vo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/clyvy41ej3vo",
    "date": "2025-01-09",
    "time": "00:00:00",
    "title": "Rory Gallagher accuses GAA president Jarlath Burns of sabotage over Naas intervention",
    "body": "Gallagher accuses GAA president of sabotage over Naas intervention\n\n9 January 2025 Share Save Share Save\n\nGetty Images Rory Gallagher, pictured here in March 2023, resigned as Derry GAA's senior football manager in May of the same year\n\nRory Gallagher has accused the GAA president Jarlath Burns of trying to sabotage his career after he intervened in his potential appointment at Naas GAA. In a statement to BBC News NI, Mr Gallagher said Mr Burns' actions were \"unprecedented\" and \"misguided\" and threatened legal action if the remarks were not retracted. The former Derry county football manager was offered a coaching role with Naas but the offer was then withdrawn after details of the appointment were made public at the weekend. It later emerged Mr Burns had contacted the club to express his concern at the proposed appointment.\n\nMr Gallagher stepped down as Derry manager in 2023 just weeks before the team played in the Ulster Senior Football Final. It followed allegations of abuse made by his estranged wife Nicola Gallagher, which he denied. When news of the appointment at Naas appeared in the media, the association's president spoke to the Naas club chairman before sending an email which was then read at a meeting of party officers at which it was decided not to proceed with Mr Gallagher's appointment. In the email, which has been seen by the BBC, Mr Burns said he felt compelled to share his perspective given the \"potential implications for Naas GAA and the wider association\". He said decisions made by the club \"reverberate far beyond your immediate community\" and send a \"message about the values we uphold and the standards we set for our members and supporters\". He also warned of the implications for the GAA's Game Changer Initiative which was launched in November to challenge the \"social and cultural norms that contribute to domestic, sexual and gender based violence\".\n\nMr Burns said employing Mr Gallagher could attract negative attention and criticism for the club\n\nClaims made by estranged wife\n\nAfter Mr Gallagher resigned as Derry manager, he was \"temporarily debarred\" by the GAA in September 2023 when an independent panel was asked to investigate the claims made by his estranged wife. Mr Gallagher successfully challenged that debarment in February 2024 and a statement from his solicitors in September said there was no \"legal impediment\" to prevent him returning to a senior role in the game. \"I have engaged with every procedure available to me. The PPS have issued two separate decisions finding that I have no case to answer,\" Mr Gallagher added in his statement to the BBC. \"Despite having engaged with due process and procedure, it seems clear that the president has now opted to take matters into his own hands. \"It seems that social media commentary and controversy now equates to a license for presidential intervention.\"\n\nIn the email to Naas GAA, Mr Burns said the \"appointment of Rory Gallagher given the allegations that have been made public, risks undermining the principles of the Game Changer Initiative and the positive work being done across the GAA\". He added: \"The controversy surrounding his personal life has created significant division and concern within the wider GAA community. \"Such a decision by Naas GAA could have far reaching consequences.\" Mr Burns added the appointment would likely \"polarise opinion\" and create unnecessary tension within the club and he questioned the \"confusing message\" it would send to younger members. In conclusion the GAA president said he had \"no authority to dictate club decisions\" but he had a \"responsibility to advocate\" for what he believed was in the best interests of the association and its members. \"By choosing not to proceed with this appointment you will be making a statement about the principles that define Naas GAA,\" he added.\n\nLegal action threatened\n\nMr Gallagher has called on the GAA president to withdraw his remarks. \"I have never asked for sympathy or support. I do however ask that this action is formally withdrawn and the contents of the correspondence is retracted,\" he said. \"The president should lead by example and accept when he has overstepped the mark. \"Absent such a retraction, I will have no other alternative but to take legal action to cure the irreparable damage done to me and my family in my ability to continue to work as a manger in the years ahead. When approached the GAA said it acknowledged the receipt of queries from media organisations in \"relation to coaching positions with the Naas senior football team\", but that it had no comment to make at this time.",
    "clean_body": "gallagher accuses gaa president of sabotage over naas intervention 9 january 2025 share save share save getty images rory gallagher pictured here in march 2023 resigned as derry gaas senior football manager in may of the same year rory gallagher has accused the gaa president jarlath burns of trying to sabotage his career after he intervened in his potential appointment at naas gaa in a statement to bbc news ni mr gallagher said mr burns actions were unprecedented and misguided and threatened legal action if the remarks were not retracted the former derry county football manager was offered a coaching role with naas but the offer was then withdrawn after details of the appointment were made public at the weekend it later emerged mr burns had contacted the club to express his concern at the proposed appointment mr gallagher stepped down as derry manager in 2023 just weeks before the team played in the ulster senior football final it followed allegations of abuse made by his estranged wife nicola gallagher which he denied when news of the appointment at naas appeared in the media the associations president spoke to the naas club chairman before sending an email which was then read at a meeting of party officers at which it was decided not to proceed with mr gallaghers appointment in the email which has been seen by the bbc mr burns said he felt compelled to share his perspective given the potential implications for naas gaa and the wider association he said decisions made by the club reverberate far beyond your immediate community and send a message about the values we uphold and the standards we set for our members and supporters he also warned of the implications for the gaas game changer initiative which was launched in november to challenge the social and cultural norms that contribute to domestic sexual and gender based violence mr burns said employing mr gallagher could attract negative attention and criticism for the club claims made by estranged wife after mr gallagher resigned as derry manager he was temporarily debarred by the gaa in september 2023 when an independent panel was asked to investigate the claims made by his estranged wife mr gallagher successfully challenged that debarment in february 2024 and a statement from his solicitors in september said there was no legal impediment to prevent him returning to a senior role in the game i have engaged with every procedure available to me the pps have issued two separate decisions finding that i have no case to answer mr gallagher added in his statement to the bbc despite having engaged with due process and procedure it seems clear that the president has now opted to take matters into his own hands it seems that social media commentary and controversy now equates to a license for presidential intervention in the email to naas gaa mr burns said the appointment of rory gallagher given the allegations that have been made public risks undermining the principles of the game changer initiative and the positive work being done across the gaa he added the controversy surrounding his personal life has created significant division and concern within the wider gaa community such a decision by naas gaa could have far reaching consequences mr burns added the appointment would likely polarise opinion and create unnecessary tension within the club and he questioned the confusing message it would send to younger members in conclusion the gaa president said he had no authority to dictate club decisions but he had a responsibility to advocate for what he believed was in the best interests of the association and its members by choosing not to proceed with this appointment you will be making a statement about the principles that define naas gaa he added legal action threatened mr gallagher has called on the gaa president to withdraw his remarks i have never asked for sympathy or support i do however ask that this action is formally withdrawn and the contents of the correspondence is retracted he said the president should lead by example and accept when he has overstepped the mark absent such a retraction i will have no other alternative but to take legal action to cure the irreparable damage done to me and my family in my ability to continue to work as a manger in the years ahead when approached the gaa said it acknowledged the receipt of queries from media organisations in relation to coaching positions with the naas senior football team but that it had no comment to make at this time",
    "summary": "Gallagher accuses GAA president of sabotage over Naas intervention9 January 2025 Share Save Share SaveGetty Images Rory Gallagher, pictured here in March 2023, resigned as Derry GAA's senior football manager in May of the same yearRory Gallagher has accused the GAA president Jarlath Burns of trying to sabotage his career after he intervened in his potential appointment at Naas GAA.\nIn a statement to BBC News NI, Mr Gallagher said Mr Burns' actions were \"unprecedented\" and \"misguided\" and threatened legal action if the remarks were not retracted.\nMr Gallagher stepped down as Derry manager in 2023 just weeks before the team played in the Ulster Senior Football Final.\n\"Such a decision by Naas GAA could have far reaching consequences.\"\nLegal action threatenedMr Gallagher has called on the GAA president to withdraw his remarks.",
    "keywords": [
      "senior",
      "naas",
      "burns",
      "jarlath",
      "rory",
      "appointment",
      "club",
      "intervention",
      "gallagher",
      "accuses",
      "mr",
      "sabotage",
      "president",
      "gaa",
      "statement"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/efd6/live/3aebf100-cdc4-11ef-8651-f9189da675cd.jpg"
  },
  "https://www.bbc.com/news/articles/cm218dy149ro": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cm218dy149ro",
    "date": "2025-01-28",
    "time": "00:00:00",
    "title": "David Coote: Nigel Owens says he understands why referee hid sexuality",
    "body": "'I understand why Coote hid his sexuality' - Owens\n\n28 January 2025 Share Save Paul Pigott BBC News Share Save\n\nGetty Images Nigel Owens came out in 2007 and retired from refereeing international matches in 2020\n\nFormer international rugby referee Nigel Owens has said he understands why ex-Premier League referee David Coote hid his sexuality over fears of being abused. \"Homophobia remains a problem in all sport\", he said but added it was serious in football with some people making \"horrendous\" comments online. Coote, 42, said the pressure of his work contributed to the behaviour that led to his sacking by the Professional Game Match Officials Limited (PGMOL) in December. He told the Sun: \"I'm gay and I have struggled with feeling proud of being 'me' over a long period of time.\n\nOwens, the first openly-gay man to referee in international rugby, told BBC Radio Wales Breakfast he understands from his own experiences how hiding your sexuality was a \"very dark and difficult place to be.\" He came out in 2007 and retired from refereeing international matches in 2020.\n\nCoote, who officiated more than 100 top-flight games, apologised for the behaviour and asked people to understand it involved \"private moments taken during very low times in my life\". \"I have received deeply unpleasant abuse during my career as a ref and to add my sexuality to that would have been really difficult.\" Owens said the fact that Coote felt he could not come out as gay \"shows why we still need to have conversations on creating an environment in all sport where people can feel comfortable\". \"Rugby is probably way ahead here and has shown the way. Football has to catch up.\"\n\nGetty Images David Coote officiated his first Premier League game in 2018",
    "clean_body": "i understand why coote hid his sexuality owens 28 january 2025 share save paul pigott bbc news share save getty images nigel owens came out in 2007 and retired from refereeing international matches in 2020 former international rugby referee nigel owens has said he understands why expremier league referee david coote hid his sexuality over fears of being abused homophobia remains a problem in all sport he said but added it was serious in football with some people making horrendous comments online coote 42 said the pressure of his work contributed to the behaviour that led to his sacking by the professional game match officials limited pgmol in december he told the sun im gay and i have struggled with feeling proud of being me over a long period of time owens the first openlygay man to referee in international rugby told bbc radio wales breakfast he understands from his own experiences how hiding your sexuality was a very dark and difficult place to be he came out in 2007 and retired from refereeing international matches in 2020 coote who officiated more than 100 topflight games apologised for the behaviour and asked people to understand it involved private moments taken during very low times in my life i have received deeply unpleasant abuse during my career as a ref and to add my sexuality to that would have been really difficult owens said the fact that coote felt he could not come out as gay shows why we still need to have conversations on creating an environment in all sport where people can feel comfortable rugby is probably way ahead here and has shown the way football has to catch up getty images david coote officiated his first premier league game in 2018",
    "summary": "'I understand why Coote hid his sexuality' - Owens28 January 2025 Share Save Paul Pigott BBC News Share SaveGetty Images Nigel Owens came out in 2007 and retired from refereeing international matches in 2020Former international rugby referee Nigel Owens has said he understands why ex-Premier League referee David Coote hid his sexuality over fears of being abused.\n\"Homophobia remains a problem in all sport\", he said but added it was serious in football with some people making \"horrendous\" comments online.\nOwens, the first openly-gay man to referee in international rugby, told BBC Radio Wales Breakfast he understands from his own experiences how hiding your sexuality was a \"very dark and difficult place to be.\"\n\"I have received deeply unpleasant abuse during my career as a ref and to add my sexuality to that would have been really difficult.\"\nGetty Images David Coote officiated his first Premier League game in 2018",
    "keywords": [
      "nigel",
      "david",
      "international",
      "owens",
      "understands",
      "hid",
      "coote",
      "understand",
      "sexuality",
      "rugby",
      "told",
      "referee",
      "way"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3900/live/838bf180-dd55-11ef-8e2a-672c89b13e12.jpg"
  },
  "https://www.bbc.com/news/articles/c74mjxmg10zo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c74mjxmg10zo",
    "date": "2025-01-29",
    "time": "00:00:00",
    "title": "Elizabeth Struhs: Australian sect members guilty of killing girl",
    "body": "Australian sect members guilty of causing girl's death\n\n29 January 2025 Share Save Hannah Ritchie BBC News, Sydney Share Save\n\nJayde Struhs Elizabeth Struhs (right) pictured with her sister, Jayde, who testified against the defendants at trial\n\nFourteen members of an Australian religious group have been convicted of killing an eight-year-old diabetic girl who was denied insulin for almost a week. Elizabeth Struhs died at home in 2022 from diabetic ketoacidosis, which causes a dangerous build-up of ketones - a type of acid - and blood sugar spikes. The court heard that Elizabeth's treatment was withheld because the group, known as the Saints, opposed medical care, believing God would heal her. Her father Jason Struhs and the group's leader Brendan Stevens were on trial for murder but convicted of the lesser charge of manslaughter. Twelve other members, including Elizabeth's mother and brother, were also convicted of manslaughter. All had pleaded not guilty.\n\nWhen handing down his almost 500-page verdict on Wednesday, Justice Martin Burns said that although it was clear Elizabeth's parents and \"every member of the church including all other accused\" had adored her, their actions had resulted in her death. \"It cannot be doubted that Elizabeth was lovingly cared for in almost every way,\" he said. \"However, due to a singular belief in the healing power of God… she was deprived of the one thing that would most definitely have kept her alive.\" The Saints are not affiliated with an established church in Australia and have roughly two dozen members from three families. The judge-alone trial in the Supreme Court of Queensland began in July last year and lasted several months. Prosecutors called 60 witnesses and painted a picture of an \"intelligent\" child who suffered greatly in her final days. \"She was described as speaking little, needing help going to the toilet, and being incontinent,\" prosecutor Caroline Marco said, adding that the girl would have endured vomiting, extreme lethargy, and a loss of consciousness. The congregation, meanwhile, had prayed and sung for Elizabeth, whose health deteriorated as she lay on a mattress at her home in Toowoomba, about 125km (78 miles) west of Brisbane.\n\nABC News: Sharon Gordon Prosecutors said the defendants shunned the use of medicine and instead trusted God to \"heal\" Elizabeth\n\nNo effort was made to call a doctor, and authorities were not notified until 36 hours after her death, as the group believed she could be brought back to life, the court heard. The 14 defendants, aged between 22 and 67, represented themselves at trial, having all refused legal representation or to enter pleas. The court was required to enter not guilty pleas on their behalf. Most had been charged because they had either counselled or aided her father in his decision to withhold Elizabeth's insulin, the court heard. Prosecutors said that Jason Struhs, 53, had converted to the church much later than his wife Kerrie Struhs, 49, and that he had previously supported giving Elizabeth medicine. They argued he changed his mind after being baptised into the group and that ultimately he knew the decision would end his daughter's life. Speaking through tears when it was his turn to take the stand at trial, Jason Struhs said that he and Elizabeth had agreed to \"stop the insulin\" together, and that he still believed his daughter would be resurrected. \"Elizabeth is only sleeping, and I will see her again,\" he told the court. Stevens, 63, defended the group's actions as faith-based and described the trial as an act of \"religious persecution\". He said that the group was within its \"rights to believe in the word of God completely\" and that their decision not to enter pleas was because the congregation had \"no intention of fighting\" the case by using law.\n\nElizabeth's sister Jayde Struhs told the trial she had left the Saints and fled her family home at 16, after coming out as gay, and was now estranged from them. She and other witnesses described the congregation as having increasingly strict views, including that mainstream healthcare should be shunned and that both Christmas and Easter were \"pagan\" or ungodly festivals.\n\nABC News: Sharon Gordon Elizabeth's father Jason Struhs said he believed Elizabeth would be \"resurrected\" after her death\n\nThe court also heard that Elizabeth's life had been in danger in 2019 when she was admitted to hospital in a diabetic coma weighing just 15kg (2st 5lb), after having become too weak to walk. She was then diagnosed with type 1 diabetes, and her family was told she would need daily insulin injections. Both parents were charged over that incident - however Jason Struhs testified against his wife and received a more lenient sentence. At the time, he said his wife - who had been a member of the Saints for years - did not believe in providing their kids with medical treatment for religious reasons. He also openly expressed regret for having \"let his daughter down\". The court heard he later helped provide her with insulin for a period while his wife was in jail, but that he then faced pressure from other members of the religious group to stop doing so. Giving his verdict, Justice Burns said that Jason Struhs and Stevens couldn't be convicted of murder because prosecutors had not proved beyond a reasonable doubt that the pair had intended to kill or cause grievous bodily harm to Elizabeth. But all 14 defendants were guilty of manslaughter, he ruled, because they were jointly involved in a crime that resulted in her death. Jayde Struhs said that while she was pleased with the verdict, the \"system had failed\" her sister. \"We are only here today because more wasn't done sooner to protect her or remove her from an incredibly unsafe situation in her own home,\" she said in a statement outside court. The group is expected to be sentenced next month.",
    "clean_body": "australian sect members guilty of causing girls death 29 january 2025 share save hannah ritchie bbc news sydney share save jayde struhs elizabeth struhs right pictured with her sister jayde who testified against the defendants at trial fourteen members of an australian religious group have been convicted of killing an eightyearold diabetic girl who was denied insulin for almost a week elizabeth struhs died at home in 2022 from diabetic ketoacidosis which causes a dangerous buildup of ketones a type of acid and blood sugar spikes the court heard that elizabeths treatment was withheld because the group known as the saints opposed medical care believing god would heal her her father jason struhs and the groups leader brendan stevens were on trial for murder but convicted of the lesser charge of manslaughter twelve other members including elizabeths mother and brother were also convicted of manslaughter all had pleaded not guilty when handing down his almost 500page verdict on wednesday justice martin burns said that although it was clear elizabeths parents and every member of the church including all other accused had adored her their actions had resulted in her death it cannot be doubted that elizabeth was lovingly cared for in almost every way he said however due to a singular belief in the healing power of god… she was deprived of the one thing that would most definitely have kept her alive the saints are not affiliated with an established church in australia and have roughly two dozen members from three families the judgealone trial in the supreme court of queensland began in july last year and lasted several months prosecutors called 60 witnesses and painted a picture of an intelligent child who suffered greatly in her final days she was described as speaking little needing help going to the toilet and being incontinent prosecutor caroline marco said adding that the girl would have endured vomiting extreme lethargy and a loss of consciousness the congregation meanwhile had prayed and sung for elizabeth whose health deteriorated as she lay on a mattress at her home in toowoomba about 125km 78 miles west of brisbane abc news sharon gordon prosecutors said the defendants shunned the use of medicine and instead trusted god to heal elizabeth no effort was made to call a doctor and authorities were not notified until 36 hours after her death as the group believed she could be brought back to life the court heard the 14 defendants aged between 22 and 67 represented themselves at trial having all refused legal representation or to enter pleas the court was required to enter not guilty pleas on their behalf most had been charged because they had either counselled or aided her father in his decision to withhold elizabeths insulin the court heard prosecutors said that jason struhs 53 had converted to the church much later than his wife kerrie struhs 49 and that he had previously supported giving elizabeth medicine they argued he changed his mind after being baptised into the group and that ultimately he knew the decision would end his daughters life speaking through tears when it was his turn to take the stand at trial jason struhs said that he and elizabeth had agreed to stop the insulin together and that he still believed his daughter would be resurrected elizabeth is only sleeping and i will see her again he told the court stevens 63 defended the groups actions as faithbased and described the trial as an act of religious persecution he said that the group was within its rights to believe in the word of god completely and that their decision not to enter pleas was because the congregation had no intention of fighting the case by using law elizabeths sister jayde struhs told the trial she had left the saints and fled her family home at 16 after coming out as gay and was now estranged from them she and other witnesses described the congregation as having increasingly strict views including that mainstream healthcare should be shunned and that both christmas and easter were pagan or ungodly festivals abc news sharon gordon elizabeths father jason struhs said he believed elizabeth would be resurrected after her death the court also heard that elizabeths life had been in danger in 2019 when she was admitted to hospital in a diabetic coma weighing just 15kg 2st 5lb after having become too weak to walk she was then diagnosed with type 1 diabetes and her family was told she would need daily insulin injections both parents were charged over that incident however jason struhs testified against his wife and received a more lenient sentence at the time he said his wife who had been a member of the saints for years did not believe in providing their kids with medical treatment for religious reasons he also openly expressed regret for having let his daughter down the court heard he later helped provide her with insulin for a period while his wife was in jail but that he then faced pressure from other members of the religious group to stop doing so giving his verdict justice burns said that jason struhs and stevens couldnt be convicted of murder because prosecutors had not proved beyond a reasonable doubt that the pair had intended to kill or cause grievous bodily harm to elizabeth but all 14 defendants were guilty of manslaughter he ruled because they were jointly involved in a crime that resulted in her death jayde struhs said that while she was pleased with the verdict the system had failed her sister we are only here today because more wasnt done sooner to protect her or remove her from an incredibly unsafe situation in her own home she said in a statement outside court the group is expected to be sentenced next month",
    "summary": "Australian sect members guilty of causing girl's death29 January 2025 Share Save Hannah Ritchie BBC News, Sydney Share SaveJayde Struhs Elizabeth Struhs (right) pictured with her sister, Jayde, who testified against the defendants at trialFourteen members of an Australian religious group have been convicted of killing an eight-year-old diabetic girl who was denied insulin for almost a week.\nElizabeth Struhs died at home in 2022 from diabetic ketoacidosis, which causes a dangerous build-up of ketones - a type of acid - and blood sugar spikes.\nHer father Jason Struhs and the group's leader Brendan Stevens were on trial for murder but convicted of the lesser charge of manslaughter.\nProsecutors said that Jason Struhs, 53, had converted to the church much later than his wife Kerrie Struhs, 49, and that he had previously supported giving Elizabeth medicine.\nBoth parents were charged over that incident - however Jason Struhs testified against his wife and received a more lenient sentence.",
    "keywords": [
      "girl",
      "trial",
      "members",
      "sect",
      "australian",
      "group",
      "elizabeths",
      "guilty",
      "killing",
      "elizabeth",
      "heard",
      "insulin",
      "jason",
      "court",
      "struhs"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/ab9a/live/b1751770-de22-11ef-902e-cf9b84dc1357.jpg"
  },
  "https://www.bbc.com/news/articles/cg5yzm58vyro": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cg5yzm58vyro",
    "date": "2025-01-24",
    "time": "00:00:00",
    "title": "Oscars 2025: Wallace and Gromit's Nick Park 'ecstatic' about nomination",
    "body": "Animator Park 'ecstatic' about Oscar nomination\n\nNick Park said it was a \"surprise and real privilege\" to be nominated for a fifth Oscar\n\nPark said the latest nomination had come as a \"surprise and real privilege\".\n\nPreston-born Park and his Bristol-based Aardman Animations team have already won four Oscars.\n\nWallace and Gromit: Vengeance Most Fowl has been shortlisted in the Animated Feature Film category at this year's Academy Awards.\n\nWallace and Gromit creator Nick Park said he was \"ecstatic\" to receive another Oscar nomination.\n\nWallace and Gromit have been delighting audiences young and old for many years\n\n\"You don't get get used to it,\" said Park, who added: \"You cannot expect it.\n\n\"We didn't make the film for this and it still comes as incredible to be counted up there.\n\n\"Every artist loves to have their work rewarded in some way or other and it's a great reflection on our amazing team of animators and all the talented people, the director of photography, the music, everything that has gone into the film.\n\n\"So many people have worked so hard.\"\n\nHis Bristol-based company still uses traditional stop motion animation.\n\nObjects have to be painstakingly moved between every frame.\n\n\"We try to stick to the fact that it is very much much about the clay models and the stop motion animation,\" Mr Park said.\n\n\"It's a very old technique, but I think it brings with it a kind of humour, and a kind of of humanity in the way that you can get expressions on the face.\n\n\"You can do all kinds of amazing things in CGI, but it's worth sticking with [stop motion] because it's almost the limitations are what helps us create the gags.\"\n\nPark has previously won Oscars for Wallace and Gromit films The Wrong Trousers, A Close Shave, The Curse of the Were-Rabbit and short film Creature Comforts.\n\nHe described Aardman Animations as \"an amazing place to work\" and a \"privilege because you are surrounded by this powerhouse of creativity\".\n\nThe 2025 Academy Awards will be presented on 2 March in Los Angeles.",
    "clean_body": "animator park ecstatic about oscar nomination nick park said it was a surprise and real privilege to be nominated for a fifth oscar park said the latest nomination had come as a surprise and real privilege prestonborn park and his bristolbased aardman animations team have already won four oscars wallace and gromit vengeance most fowl has been shortlisted in the animated feature film category at this years academy awards wallace and gromit creator nick park said he was ecstatic to receive another oscar nomination wallace and gromit have been delighting audiences young and old for many years you dont get get used to it said park who added you cannot expect it we didnt make the film for this and it still comes as incredible to be counted up there every artist loves to have their work rewarded in some way or other and its a great reflection on our amazing team of animators and all the talented people the director of photography the music everything that has gone into the film so many people have worked so hard his bristolbased company still uses traditional stop motion animation objects have to be painstakingly moved between every frame we try to stick to the fact that it is very much much about the clay models and the stop motion animation mr park said its a very old technique but i think it brings with it a kind of humour and a kind of of humanity in the way that you can get expressions on the face you can do all kinds of amazing things in cgi but its worth sticking with stop motion because its almost the limitations are what helps us create the gags park has previously won oscars for wallace and gromit films the wrong trousers a close shave the curse of the wererabbit and short film creature comforts he described aardman animations as an amazing place to work and a privilege because you are surrounded by this powerhouse of creativity the 2025 academy awards will be presented on 2 march in los angeles",
    "summary": "Preston-born Park and his Bristol-based Aardman Animations team have already won four Oscars.\nWallace and Gromit: Vengeance Most Fowl has been shortlisted in the Animated Feature Film category at this year's Academy Awards.\nWallace and Gromit creator Nick Park said he was \"ecstatic\" to receive another Oscar nomination.\nHis Bristol-based company still uses traditional stop motion animation.\n\"We try to stick to the fact that it is very much much about the clay models and the stop motion animation,\" Mr Park said.",
    "keywords": [
      "film",
      "work",
      "park",
      "stop",
      "team",
      "won",
      "oscars",
      "amazing",
      "wallace",
      "motion",
      "gromit",
      "ecstatic",
      "way",
      "2025",
      "nick",
      "nomination",
      "gromits"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/0db1/live/6b263be0-da63-11ef-b14c-579fe25fdf67.jpg"
  },
  "https://www.bbc.com/news/live/c5yep0l5545t": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/live/c5yep0l5545t",
    "date": "2025-01-27",
    "time": "00:00:00",
    "title": "Holocaust survivors recall horrors of Auschwitz as Prince William and Kate attend London memorial",
    "body": "'It really did something to your soul,' says Holocaust survivor\n\nKatya Adler and Kathy Long\n\nReporting from Auschwitz\n\nOne of the survivors who attended today's commemorations is Mala Tribich, now in her 90s, who was nine when she was forced into a Jewish ghetto in Nazi-occupied Poland.\n\nShe was moved to the Ravensbrück concentration camp at the start of the war and later liberated from the Bergen-Belsen camp in 1945.\n\nSpeaking earlier today to BBC Radio 4's Today programme, Tribich says she's honoured to be representing all the remaining British Holocaust survivors at the commemorations.\n\n\"I'm privileged because I feel that it is so important to be here and to remember the victims,\" she says, adding the site serves as a warning \"to act when you see that there is an injustice\".\n\n\"The message is to try and change the world to a better place, so there should be no discrimination against people who happen to have a different religion or a different colour of skin or whatever. There should be more tolerance of one another\".\n\nTribich recalls the \"process of dehumanisation\" at the Ravensbrück concentration camp, where everyone was ordered to strip naked, had their heads shaved and were given a uniform.\n\n\"When we looked at one another, we really couldn't recognise each other,\" she says, \"It's so different when one hasn't got one's hair. It really did something to our soul.\"\n\nAfter she was liberated from Bergen-Belsen, Tribich moved to the UK where she was reunited with her brother.\n\nShe now spends her time sharing her story with young people across the UK through the Holocaust Educational Trust’s outreach programme.",
    "clean_body": "it really did something to your soul says holocaust survivor katya adler and kathy long reporting from auschwitz one of the survivors who attended todays commemorations is mala tribich now in her 90s who was nine when she was forced into a jewish ghetto in nazioccupied poland she was moved to the ravensbrück concentration camp at the start of the war and later liberated from the bergenbelsen camp in 1945 speaking earlier today to bbc radio 4s today programme tribich says shes honoured to be representing all the remaining british holocaust survivors at the commemorations im privileged because i feel that it is so important to be here and to remember the victims she says adding the site serves as a warning to act when you see that there is an injustice the message is to try and change the world to a better place so there should be no discrimination against people who happen to have a different religion or a different colour of skin or whatever there should be more tolerance of one another tribich recalls the process of dehumanisation at the ravensbrück concentration camp where everyone was ordered to strip naked had their heads shaved and were given a uniform when we looked at one another we really couldnt recognise each other she says its so different when one hasnt got ones hair it really did something to our soul after she was liberated from bergenbelsen tribich moved to the uk where she was reunited with her brother she now spends her time sharing her story with young people across the uk through the holocaust educational trust’s outreach programme",
    "summary": "She was moved to the Ravensbrück concentration camp at the start of the war and later liberated from the Bergen-Belsen camp in 1945.\nSpeaking earlier today to BBC Radio 4's Today programme, Tribich says she's honoured to be representing all the remaining British Holocaust survivors at the commemorations.\n\"When we looked at one another, we really couldn't recognise each other,\" she says, \"It's so different when one hasn't got one's hair.\nAfter she was liberated from Bergen-Belsen, Tribich moved to the UK where she was reunited with her brother.\nShe now spends her time sharing her story with young people across the UK through the Holocaust Educational Trust’s outreach programme.",
    "keywords": [
      "today",
      "auschwitz",
      "william",
      "holocaust",
      "different",
      "survivors",
      "memorial",
      "recall",
      "camp",
      "tribich",
      "really",
      "ravensbrück",
      "programme",
      "prince",
      "horrors",
      "kate",
      "uk",
      "london"
    ],
    "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png"
  },
  "https://www.bbc.com/news/articles/clyel13n91qo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/clyel13n91qo",
    "date": "2025-01-24",
    "time": "00:00:00",
    "title": "Hugh Grant calls for police to investigate Sun owners",
    "body": "Hugh Grant urges police to investigate Sun owners\n\n24 January 2025 Share Save Maia Davies BBC News Share Save\n\nGetty Images\n\nHugh Grant has called for police to open a new criminal investigation into the owners of The Sun, saying the job is not done \"by any means\" after Prince Harry settled his privacy claim on Wednesday. News Group Newspapers (NGN) agreed to pay \"substantial damages\" and apologised to the Duke of Sussex for \"serious intrusion\" by The Sun between 1996 and 2011, and admitted \"incidents of unlawful activity\" were carried out by private investigators working for the newspaper. Grant also settled a privacy claim against NGN in 2024, saying he could have faced a bill of up to £10m even if he had won. The actor said both incidents had shown a civil case was \"not the right instrument\" to get to \"the real truth\" of what happened at the newspaper.\n\nFormer deputy Labour leader Lord Tom Watson, who also reached a settlement with NGN on Wednesday, said a legal team would be passing a dossier to the Metropolitan Police. The force said on Friday there were no active investigations into allegations of phone hacking or related matters. \"We await any correspondence from the parties involved, which we will respond to in due course,\" a spokesperson said. Grant said NGN had \"gamed\" the civil courts to silence complainants and a criminal investigation was needed. \"That's what they've done consistently over the last 10 years,\" he told BBC Radio 4's Today programme on Friday. \"They've spent £1bn to make sure these things are never looked at in court… and you don't get proper judicial findings. \"I think what they're terrified of is that those findings would trigger a new criminal inquiry.\" In the civil courts, claimants could end up paying the costs of their opponents if the damages award is less than they have been offered to settle - even if they win. Grant had accused The Sun of using private investigators to tap his phone and burgle his house, and said he settled because he could not face the possible costs of proceeding to trial. NGN had denied the allegations and said the settlement was reached \"without admission of liability\". The actor called on the Crown Prosecution Service (CPS) and the Metropolitan Police to investigate. The CPS told the BBC criminal investigations were matters for the police.\n\nReuters Prince Harry pictured outside the High Court, in a separate court case against the Daily Mirror publisher in June 2023",
    "clean_body": "hugh grant urges police to investigate sun owners 24 january 2025 share save maia davies bbc news share save getty images hugh grant has called for police to open a new criminal investigation into the owners of the sun saying the job is not done by any means after prince harry settled his privacy claim on wednesday news group newspapers ngn agreed to pay substantial damages and apologised to the duke of sussex for serious intrusion by the sun between 1996 and 2011 and admitted incidents of unlawful activity were carried out by private investigators working for the newspaper grant also settled a privacy claim against ngn in 2024 saying he could have faced a bill of up to £10m even if he had won the actor said both incidents had shown a civil case was not the right instrument to get to the real truth of what happened at the newspaper former deputy labour leader lord tom watson who also reached a settlement with ngn on wednesday said a legal team would be passing a dossier to the metropolitan police the force said on friday there were no active investigations into allegations of phone hacking or related matters we await any correspondence from the parties involved which we will respond to in due course a spokesperson said grant said ngn had gamed the civil courts to silence complainants and a criminal investigation was needed thats what theyve done consistently over the last 10 years he told bbc radio 4s today programme on friday theyve spent £1bn to make sure these things are never looked at in court… and you dont get proper judicial findings i think what theyre terrified of is that those findings would trigger a new criminal inquiry in the civil courts claimants could end up paying the costs of their opponents if the damages award is less than they have been offered to settle even if they win grant had accused the sun of using private investigators to tap his phone and burgle his house and said he settled because he could not face the possible costs of proceeding to trial ngn had denied the allegations and said the settlement was reached without admission of liability the actor called on the crown prosecution service cps and the metropolitan police to investigate the cps told the bbc criminal investigations were matters for the police reuters prince harry pictured outside the high court in a separate court case against the daily mirror publisher in june 2023",
    "summary": "Grant also settled a privacy claim against NGN in 2024, saying he could have faced a bill of up to £10m even if he had won.\nGrant said NGN had \"gamed\" the civil courts to silence complainants and a criminal investigation was needed.\n\"That's what they've done consistently over the last 10 years,\" he told BBC Radio 4's Today programme on Friday.\nThe CPS told the BBC criminal investigations were matters for the police.\nReuters Prince Harry pictured outside the High Court, in a separate court case against the Daily Mirror publisher in June 2023",
    "keywords": [
      "hugh",
      "civil",
      "ngn",
      "calls",
      "criminal",
      "grant",
      "theyve",
      "settled",
      "told",
      "investigate",
      "share",
      "bbc",
      "owners",
      "court"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/304e/live/ec69cdd0-da3a-11ef-8b07-4761c1d59bea.jpg"
  },
  "https://www.bbc.com/news/articles/cp31ggzqn3zo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cp31ggzqn3zo",
    "date": "2025-01-06",
    "time": "00:00:00",
    "title": "Heavy rain and snow causes disruption across West Midlands",
    "body": "Heavy rain and snow causes disruption across region\n\n6 January 2025 Share Save Richard Price & Alex McIntyre BBC News, West Midlands Share Save\n\nWarwickshire Police Police advised people not to attempt to drive through flood water\n\nHeavy rainfall and overnight snow have caused widespread disruption across the West Midlands. Yellow weather warnings for rain, snow and ice, as well as a number of flood warnings, were in place across the region on Monday. Rail and road travel were disrupted and dozens of schools were closed with Staffordshire most impacted, largely due to snow. People's homes have also been affected by flooding, including those living in Wolston, Warwickshire.\n\nResident Shân Dobinson said she was stranded upstairs in her house in the village due to the flooding downstairs. \"It's now thigh-deep where our cars were,\" she told BBC CWR. \"We can't get in or out, we're totally stranded. We're still waiting for sandbags, the fire service is here but there's nothing they can do – and all our electrics have gone as well.\" It came almost a year after properties in the village were heavily damaged by flooding brought by Storm Henk.\n\nWendy Hatfield Drivers in Long Itchington, Warwickshire, had to navigate flood waters on Monday\n\nIn Coventry, John Mcmellion said he was left stranded on Balsall Street after his engine became flooded. \"I'm in a transit van and it's up to the door,\" he told BBC CWR. \"The police have been out to see me and say they can't do anything about it.\"\n\nKibbo, BBC Weather Watcher Snow covered large parts of Staffordshire and Cheshire on Monday, bringing difficulties for travellers\n\nMeanwhile, the snowfall in Staffordshire caused issues for people trying to get to hospital. The University Hospitals of North Midlands NHS Trust, which runs County Hospital, Stafford, and the Royal Stoke University Hospital, said its staff and patients had been affected. Dr Mark Poulson, deputy chief medical officer, told BBC Radio Stoke: \"We had to support staff getting into hospital by using 4x4s - sending them out to help bring them in.\" He said they had done what they could to make the hospitals safe for patients, including making sure the sites were clear of snow. \"It's been a difficult morning, but services have continued as normal,\" he added.\n\nThe snow caused problems on the roads in Staffordshire, including in Endon\n\nThe weather conditions led to 45 schools being closed in Staffordshire, with several in south Cheshire also forced to shut. Four schools in Telford also delayed opening until later on Monday, and The Bridge School was fully closed for the day, according to the council. The railways were also affected by the flooding, including the line between Birmingham Snow Hill and Stratford-upon-Avon. Replacement buses were operating between Shirley and Stratford-upon-Avon, according to West Midlands Rail. Lines were closed between Hereford and Worcester Shrub Hill stations due to heavy rainfall but have since reopened. A number of roads in the region were forced to close too, with Herefordshire, Worcestershire, Staffordshire and Warwickshire the worst affected.\n\nFollow BBC Stoke & Staffordshire on BBC Sounds, Facebook, X and Instagram.",
    "clean_body": "heavy rain and snow causes disruption across region 6 january 2025 share save richard price alex mcintyre bbc news west midlands share save warwickshire police police advised people not to attempt to drive through flood water heavy rainfall and overnight snow have caused widespread disruption across the west midlands yellow weather warnings for rain snow and ice as well as a number of flood warnings were in place across the region on monday rail and road travel were disrupted and dozens of schools were closed with staffordshire most impacted largely due to snow peoples homes have also been affected by flooding including those living in wolston warwickshire resident shân dobinson said she was stranded upstairs in her house in the village due to the flooding downstairs its now thighdeep where our cars were she told bbc cwr we cant get in or out were totally stranded were still waiting for sandbags the fire service is here but theres nothing they can do – and all our electrics have gone as well it came almost a year after properties in the village were heavily damaged by flooding brought by storm henk wendy hatfield drivers in long itchington warwickshire had to navigate flood waters on monday in coventry john mcmellion said he was left stranded on balsall street after his engine became flooded im in a transit van and its up to the door he told bbc cwr the police have been out to see me and say they cant do anything about it kibbo bbc weather watcher snow covered large parts of staffordshire and cheshire on monday bringing difficulties for travellers meanwhile the snowfall in staffordshire caused issues for people trying to get to hospital the university hospitals of north midlands nhs trust which runs county hospital stafford and the royal stoke university hospital said its staff and patients had been affected dr mark poulson deputy chief medical officer told bbc radio stoke we had to support staff getting into hospital by using 4x4s sending them out to help bring them in he said they had done what they could to make the hospitals safe for patients including making sure the sites were clear of snow its been a difficult morning but services have continued as normal he added the snow caused problems on the roads in staffordshire including in endon the weather conditions led to 45 schools being closed in staffordshire with several in south cheshire also forced to shut four schools in telford also delayed opening until later on monday and the bridge school was fully closed for the day according to the council the railways were also affected by the flooding including the line between birmingham snow hill and stratforduponavon replacement buses were operating between shirley and stratforduponavon according to west midlands rail lines were closed between hereford and worcester shrub hill stations due to heavy rainfall but have since reopened a number of roads in the region were forced to close too with herefordshire worcestershire staffordshire and warwickshire the worst affected follow bbc stoke staffordshire on bbc sounds facebook x and instagram",
    "summary": "Heavy rain and snow causes disruption across region6 January 2025 Share Save Richard Price & Alex McIntyre BBC News, West Midlands Share SaveWarwickshire Police Police advised people not to attempt to drive through flood waterHeavy rainfall and overnight snow have caused widespread disruption across the West Midlands.\nRail and road travel were disrupted and dozens of schools were closed with Staffordshire most impacted, largely due to snow.\nPeople's homes have also been affected by flooding, including those living in Wolston, Warwickshire.\nThe railways were also affected by the flooding, including the line between Birmingham Snow Hill and Stratford-upon-Avon.\nReplacement buses were operating between Shirley and Stratford-upon-Avon, according to West Midlands Rail.",
    "keywords": [
      "weather",
      "causes",
      "staffordshire",
      "including",
      "closed",
      "heavy",
      "snow",
      "flooding",
      "disruption",
      "bbc",
      "hospital",
      "midlands",
      "west",
      "rain"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/08c5/live/ff2e8090-cc12-11ef-95ee-b7d7e6412a71.jpg"
  },
  "https://www.bbc.com/news/articles/cjw4q7v7ez1o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cjw4q7v7ez1o",
    "date": "2025-01-23",
    "time": "00:00:00",
    "title": "Trump tells Putin to end 'ridiculous war' in Ukraine or face new sanctions",
    "body": "Trump tells Putin to end 'ridiculous war' in Ukraine or face new sanctions\n\nResponding to the threat of harsher sanctions, the Kremlin said it remains \"ready for an equal dialogue, a mutually respectful dialogue\".\n\nTrump had previously said he would negotiate a settlement to Russia's full-scale invasion launched in February 2022, in a single day.\n\nWriting on his social media platform Truth Social, he said that by pushing to settle the war he was doing Russia and its president a \"very big favour\".\n\nDonald Trump has warned he will impose high tariffs and further sanctions on Russia if Vladimir Putin fails to end the war in Ukraine.\n\n\"We're waiting for signals that are yet to arrive,\" said President Vladimir Putin's spokesman, Dmitry Peskov.\n\nHe added that Russia sees nothing new in Donald Trump's threats to impose sanctions.\n\n\"He likes these methods, at least he liked them during his first presidency.\"\n\nPutin has said repeatedly that he is prepared to negotiate an end to the war, which first began in 2014, but that Ukraine would have to accept the reality of Russian territorial gains, which are currently about 20% of its land. He also refuses to accept Ukraine joining Nato, the military alliance of Western countries.\n\nKyiv does not want to give up its territory, although President Volodymyr Zelensky has conceded he may have to cede some currently occupied land temporarily.\n\nOn Tuesday, Trump told a news conference he would be talking to Putin \"very soon\" and it \"sounds likely\" that he would apply more sanctions if the Russian leader did not come to the table.\n\nBut in his Truth Social post the next day, he went further: \"I'm going to do Russia, whose Economy is failing, and President Putin, a very big FAVOR,\" he wrote.\n\n\"Settle now, and STOP this ridiculous War! IT'S ONLY GOING TO GET WORSE. If we don't make a 'deal', and soon, I have no other choice but to put high levels of Taxes, Tariffs, and Sanctions on anything being sold by Russia to the United States, and various other participating countries.\"\n\nContinuing, he wrote: \"Let's get this war, which never would have started if I were President, over with! We can do it the easy way, or the hard way - and the easy way is always better. It's time to 'MAKE A DEAL'.\"\n\nTrump's former special representative for Ukraine, Kurt Volker, said Trump's threat of more serious sanctions on Russia \"gives a signal to Vladimir Putin this is going to get worse, not better\". Speaking to BBC Radio 4's Today programme, he added: \"We should incentivise Putin to say, 'OK, it's time actually to have a ceasefire.'\"\n\nMeanwhile, Ukrainian President Volodymyr Zelensky told the World Economic Forum on Tuesday that at least 200,000 peacekeepers would be needed under any agreement.\n\nAnd he told Bloomberg that any peacekeeping force for his country would have to include US troops to pose a realistic deterrent to Russia.\n\n\"It can't be without the United States... Even if some European friends think it can be, no, it will not be,\" he said, adding that no-one else would risk such a move without the US.\n\nWhile Ukraine's leaders might appreciate this tougher-talking Trump - they have always said Putin only understands strength - the initial reaction in Kyiv to the US president's comments suggest that it is actions people are waiting for, not words.\n\nTrump has not specified where more economic penalties might be aimed, or when. Russian imports to the US have plummeted since 2022 and there are all sorts of heavy restrictions already in place.\n\nCurrently, the main Russian exports to the US are phosphate-based fertilisers and platinum.\n\nSpeaking to the BBC, Volker said the Russian economy could take \"substantial\" damage if Trump chose to preserve or strengthen the toughest US sanctions so far, which he said were only levied as Trump's predecessor Joe Biden left office. \"Russia really didn't feel as much pressure as they could,\" he commented.",
    "clean_body": "trump tells putin to end ridiculous war in ukraine or face new sanctions responding to the threat of harsher sanctions the kremlin said it remains ready for an equal dialogue a mutually respectful dialogue trump had previously said he would negotiate a settlement to russias fullscale invasion launched in february 2022 in a single day writing on his social media platform truth social he said that by pushing to settle the war he was doing russia and its president a very big favour donald trump has warned he will impose high tariffs and further sanctions on russia if vladimir putin fails to end the war in ukraine were waiting for signals that are yet to arrive said president vladimir putins spokesman dmitry peskov he added that russia sees nothing new in donald trumps threats to impose sanctions he likes these methods at least he liked them during his first presidency putin has said repeatedly that he is prepared to negotiate an end to the war which first began in 2014 but that ukraine would have to accept the reality of russian territorial gains which are currently about 20 of its land he also refuses to accept ukraine joining nato the military alliance of western countries kyiv does not want to give up its territory although president volodymyr zelensky has conceded he may have to cede some currently occupied land temporarily on tuesday trump told a news conference he would be talking to putin very soon and it sounds likely that he would apply more sanctions if the russian leader did not come to the table but in his truth social post the next day he went further im going to do russia whose economy is failing and president putin a very big favor he wrote settle now and stop this ridiculous war its only going to get worse if we dont make a deal and soon i have no other choice but to put high levels of taxes tariffs and sanctions on anything being sold by russia to the united states and various other participating countries continuing he wrote lets get this war which never would have started if i were president over with we can do it the easy way or the hard way and the easy way is always better its time to make a deal trumps former special representative for ukraine kurt volker said trumps threat of more serious sanctions on russia gives a signal to vladimir putin this is going to get worse not better speaking to bbc radio 4s today programme he added we should incentivise putin to say ok its time actually to have a ceasefire meanwhile ukrainian president volodymyr zelensky told the world economic forum on tuesday that at least 200000 peacekeepers would be needed under any agreement and he told bloomberg that any peacekeeping force for his country would have to include us troops to pose a realistic deterrent to russia it cant be without the united states even if some european friends think it can be no it will not be he said adding that noone else would risk such a move without the us while ukraines leaders might appreciate this toughertalking trump they have always said putin only understands strength the initial reaction in kyiv to the us presidents comments suggest that it is actions people are waiting for not words trump has not specified where more economic penalties might be aimed or when russian imports to the us have plummeted since 2022 and there are all sorts of heavy restrictions already in place currently the main russian exports to the us are phosphatebased fertilisers and platinum speaking to the bbc volker said the russian economy could take substantial damage if trump chose to preserve or strengthen the toughest us sanctions so far which he said were only levied as trumps predecessor joe biden left office russia really didnt feel as much pressure as they could he commented",
    "summary": "Trump tells Putin to end 'ridiculous war' in Ukraine or face new sanctionsResponding to the threat of harsher sanctions, the Kremlin said it remains \"ready for an equal dialogue, a mutually respectful dialogue\".\nDonald Trump has warned he will impose high tariffs and further sanctions on Russia if Vladimir Putin fails to end the war in Ukraine.\n\"We're waiting for signals that are yet to arrive,\" said President Vladimir Putin's spokesman, Dmitry Peskov.\nBut in his Truth Social post the next day, he went further: \"I'm going to do Russia, whose Economy is failing, and President Putin, a very big FAVOR,\" he wrote.\nTrump's former special representative for Ukraine, Kurt Volker, said Trump's threat of more serious sanctions on Russia \"gives a signal to Vladimir Putin this is going to get worse, not better\".",
    "keywords": [
      "ukraine",
      "war",
      "face",
      "president",
      "tells",
      "russia",
      "sanctions",
      "putin",
      "trump",
      "way",
      "russian",
      "ridiculous",
      "vladimir",
      "end"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/3cea/live/5c1d9080-d905-11ef-b3df-5b8de1cd53ce.jpg"
  },
  "https://www.bbc.com/news/articles/cn93g04yrpwo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cn93g04yrpwo",
    "date": "2025-01-17",
    "time": "00:00:00",
    "title": "Cher Lloyd on making new music, Swagger Jagger and Liam Payne",
    "body": "Cher Lloyd on making new music, Swagger Jagger and Liam Payne's unmatched talent\n\n17 January 2025 Share Save Eleanor Shearwood BBC Newsbeat Share Save\n\nMila Austin Still got that swagger: Cher Lloyd's releasing new music for the first time since 2020\n\nThe world first met Cher Lloyd in 2010 when, aged 16 - she walked on to the X Factor stage and blew the audience away with her version of Keri Hilson's Turn My Swag On. It ended up being a fourth-place finish in the TV talent show for Cher, who signed with Simon Cowell's record label, releasing number one single Swagger Jagger and two studio albums. Since that early success she's been in and out of the spotlight, and stunned fans at the start of this year when she announced an upcoming single - her first since 2020. Speaking to BBC Newsbeat 15 years later, Cher says music's still \"everything\" to her and she's \"spilling the tea\" on her new track Head Down. \"I was on such a huge reality TV show and the experience that I had was just a rollercoaster of emotions,\" she says. \"I just felt like I needed to get a lot of stuff off my chest. \"Head Down for me was a way to do that without blurting it all out and getting in trouble.\"\n\nGetty Images Cher was the focus of many tabloid stories during her stint on X Factor\n\nLooking back, Cher says her time on the X Factor was a \"shock to the system\". \"I had this illusion that the show was just going to be about singing and performing and I didn't realise that 80 or 90% of it was reality TV.\" Cher got a tough time from the tabloid press during her time on the show - with stories about \"diva\" behaviour turning some of the audience against the teenager. She says it makes her \"really sad\" feeling that she gained a reputation as the series villain. \"That was never my intention,\" she says. \"I feel like it kind of overshadowed the reason why I was there and that was because I love to sing\". When asked how she coped with the negative attention, Cher says she didn't. \"That's why you saw me spiral and make bad decisions,\" she says. One person who helped her through, though, was Liam Payne. The One Direction star died last year in a fall from a hotel balcony. \"He was always the level-headed one,\" says Cher. \"He looked after everyone and he had this nurturing energy. And the passion that he had for performing was just unmatched. \"I don't think I've spoken about it like this before, but the talent he had was just unbelievable\".\n\nGetty Images Cher appeared on the X Factor alongside One Direction\n\nCher's now a mum, and says knowing there's more to life than performing is the \"thing that keeps her sane\". \"The biggest most important thing is to be a decent person and to treat people well\". That's brought new challenges for her, and she wants to see working parents in the music industry \"cut a bit more slack\". Cher says she's still \"expected to do it all\". \"It's just this that vicious circle and I'm still trying to get my head around it and understand it,\" she says. Having children's just one way her career has shifted. Cher's musical style has also changed, but there's one track that she can't escape. Swagger Jagger. She says she didn't perform her debut single for years, seeing as \"the old me\". \"As an artist, I've moved on from that,\" she says. But the internet hasn't.\n\nSwagger Jagger 'part of my story'\n\nCher's music got a huge boost thanks to a viral video of two young girls recording a music video in their bedroom. It starts with one saying: \"I'm gonna sing Cher Lloyd by Cher Lloyd\". They launch into one of Cher's songs, titled Oath, but are interrupted when a mum bursts into the room, angrily asking: \"Why does somebody not know how to flush a toilet?\". Needless to say, Cher thinks it's \"hilarious\". \"Every time I see it I'm just in stitches,\" she says. \"And the fact that my name is attached to it. It's just gold. \"I'd love nothing more than to recreate that video… how funny would that be?!\" When Cher performed Swagger Jagger at a festival last year, she says seeing the crowd go mad changed her own feelings towards it. \"The feeling I got from it was just like… how can I not perform this?\" \"I know I'm not there artistically anymore with Swagger Jagger, but it's such a huge part of my story… I just have to do it.\" Being Bradford - The secret behind Bad Boy Chiller Crew\n\nWhy global stars like Coldplay and Ed Sheeran are hitting India\n\nThe artists tipped to top your playlists in 2025 But Cher is keen to show there's more to her than one track, and says her new music is ready to go. \"I'm just gonna keep rolling the songs out,\" she says. And Cher says that being back making music makes her feel \"worth it again\". \"I know that sounds really dark,\" she says. \"But when you've been in a bad place, when you have that thing that makes you feel good again, you've just got to hold on to it.\"",
    "clean_body": "cher lloyd on making new music swagger jagger and liam paynes unmatched talent 17 january 2025 share save eleanor shearwood bbc newsbeat share save mila austin still got that swagger cher lloyds releasing new music for the first time since 2020 the world first met cher lloyd in 2010 when aged 16 she walked on to the x factor stage and blew the audience away with her version of keri hilsons turn my swag on it ended up being a fourthplace finish in the tv talent show for cher who signed with simon cowells record label releasing number one single swagger jagger and two studio albums since that early success shes been in and out of the spotlight and stunned fans at the start of this year when she announced an upcoming single her first since 2020 speaking to bbc newsbeat 15 years later cher says musics still everything to her and shes spilling the tea on her new track head down i was on such a huge reality tv show and the experience that i had was just a rollercoaster of emotions she says i just felt like i needed to get a lot of stuff off my chest head down for me was a way to do that without blurting it all out and getting in trouble getty images cher was the focus of many tabloid stories during her stint on x factor looking back cher says her time on the x factor was a shock to the system i had this illusion that the show was just going to be about singing and performing and i didnt realise that 80 or 90 of it was reality tv cher got a tough time from the tabloid press during her time on the show with stories about diva behaviour turning some of the audience against the teenager she says it makes her really sad feeling that she gained a reputation as the series villain that was never my intention she says i feel like it kind of overshadowed the reason why i was there and that was because i love to sing when asked how she coped with the negative attention cher says she didnt thats why you saw me spiral and make bad decisions she says one person who helped her through though was liam payne the one direction star died last year in a fall from a hotel balcony he was always the levelheaded one says cher he looked after everyone and he had this nurturing energy and the passion that he had for performing was just unmatched i dont think ive spoken about it like this before but the talent he had was just unbelievable getty images cher appeared on the x factor alongside one direction chers now a mum and says knowing theres more to life than performing is the thing that keeps her sane the biggest most important thing is to be a decent person and to treat people well thats brought new challenges for her and she wants to see working parents in the music industry cut a bit more slack cher says shes still expected to do it all its just this that vicious circle and im still trying to get my head around it and understand it she says having childrens just one way her career has shifted chers musical style has also changed but theres one track that she cant escape swagger jagger she says she didnt perform her debut single for years seeing as the old me as an artist ive moved on from that she says but the internet hasnt swagger jagger part of my story chers music got a huge boost thanks to a viral video of two young girls recording a music video in their bedroom it starts with one saying im gonna sing cher lloyd by cher lloyd they launch into one of chers songs titled oath but are interrupted when a mum bursts into the room angrily asking why does somebody not know how to flush a toilet needless to say cher thinks its hilarious every time i see it im just in stitches she says and the fact that my name is attached to it its just gold id love nothing more than to recreate that video… how funny would that be when cher performed swagger jagger at a festival last year she says seeing the crowd go mad changed her own feelings towards it the feeling i got from it was just like… how can i not perform this i know im not there artistically anymore with swagger jagger but its such a huge part of my story… i just have to do it being bradford the secret behind bad boy chiller crew why global stars like coldplay and ed sheeran are hitting india the artists tipped to top your playlists in 2025 but cher is keen to show theres more to her than one track and says her new music is ready to go im just gonna keep rolling the songs out she says and cher says that being back making music makes her feel worth it again i know that sounds really dark she says but when youve been in a bad place when you have that thing that makes you feel good again youve just got to hold on to it",
    "summary": "Cher Lloyd on making new music, Swagger Jagger and Liam Payne's unmatched talent17 January 2025 Share Save Eleanor Shearwood BBC Newsbeat Share SaveMila Austin Still got that swagger: Cher Lloyd's releasing new music for the first time since 2020The world first met Cher Lloyd in 2010 when, aged 16 - she walked on to the X Factor stage and blew the audience away with her version of Keri Hilson's Turn My Swag On.\nSwagger Jagger.\nSwagger Jagger 'part of my story'Cher's music got a huge boost thanks to a viral video of two young girls recording a music video in their bedroom.\nIt starts with one saying: \"I'm gonna sing Cher Lloyd by Cher Lloyd\".\nWhen Cher performed Swagger Jagger at a festival last year, she says seeing the crowd go mad changed her own feelings towards it.",
    "keywords": [
      "video",
      "jagger",
      "lloyd",
      "music",
      "cher",
      "x",
      "payne",
      "tv",
      "track",
      "liam",
      "im",
      "making",
      "swagger"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/f3cc/live/d6962d30-d4b5-11ef-94cb-5f844ceb9e30.jpg"
  },
  "https://www.bbc.com/news/articles/cj48vp1r51eo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cj48vp1r51eo",
    "date": "2025-01-17",
    "time": "00:00:00",
    "title": "Ukrainians' hopes and concerns as Trump presidency nears",
    "body": "'War will last as long as Russia does': Ukrainian talk of victory fades as Trump returns\n\n17 January 2025 Share Save Orla Guerin Senior International Correspondent Reporting from Kyiv and Dnipro Share Save\n\nBBC/Xavier Vanpevenaege Anastasiia's husband, Andriy, will never get the chance to meet his baby daughter\n\nAnastasiia Fedchenko, 36, wails in anguish – her agony echoing around the gilded walls of St Michael's Cathedral in Kyiv. She sits with her hands resting on both sides of her stomach. She is heavily pregnant with her first child, a baby girl. Her husband Andriy Kusmenko is just inches away, in uniform - in an open coffin. The marine commander was killed in action in eastern Ukraine on 4 January this year. He is now and forever 33. While Andriy fought in the war, Anastasiia wrote about it, as a journalist. His brothers in arms file past, dropping red roses into his coffin. As funeral prayers come to an end, Anastasiia leans forward and gives \"the love of her life\" one last kiss.\n\nBBC/Xavier Vanpevenaege Andriy was killed in action on the front line at the start of the year\n\nOutside the cathedral she pays tribute to her \"most handsome husband\" who died for his country. \"I am sorry my daughter will never see her father,\" she tells the BBC, \"but she will know that he was a soldier, an officer, and that he did everything he could for Ukraine to exist for her and for other generations.\" \"This war will last as long as Russia does. I truly fear our children will inherit it from us and will have to go and fight.\" Not according to Donald Trump, who famously claimed he could end the war in a day, and who returns to the White House next week. He is already pushing for peace talks between Ukraine and Russia. That would dishonour the dead, according to Sgt Dmytro, call sign \"Smile\", who fought alongside Andriy and came to the cathedral to mourn him. \"Let the people in power decide, but I don't think the ones who fell would want them [Ukraine's leadership] to sit around the table,\" he says. \"After the funeral, we are heading back to work. We will fight for every Ukrainian who fell.\" Plenty here believe – like Anastasiia and Dmytro - that far too many Ukrainians have been killed to try to do a deal with Russia. But public opinion is shifting, and others believe there is too much death and destruction not to do a deal.\n\nBBC/Xavier Vanpevenaege Andriy Kusmenko's fellow soldiers came to the cathedral to honour him\n\nAs Ukraine battles through its third winter of war, one word is now little spoken here – \"victory\". In the early days of Russia's full-scale invasion in February 2022, we heard it everywhere. It was a rallying cry for a nation suddenly confronted by columns of enemy tanks. But the past is truly a foreign country – and one with more territory. Moscow now controls almost one-fifth of its neighbour (including the Crimean Peninsula, captured in 2014) and says any peace talks must take that into account. The Ukraine of 2025 is a place of cold, hard realities – where cities empty, graveyards fill, and plenty of soldiers desert their posts.\n\nBBC/Goktay Koraltan Up to 100,000 cases have been opened against soldiers, such as Serhiy Hnezdilov, who have deserted their units\n\nSix hours drive from the capital, in the heart of Ukraine, a young soldier is in the dock. Serhiy Hnezdilov, a burly 24-year-old, is locked in a glass cubicle in a packed courtroom in the city of Dnipro. He is on trial on charges of desertion, and is one of many. Since 2022, around 100,000 cases have been opened against soldiers who left their units, according to data from Ukraine's General Prosecutor's office. When Hnezdilov went absent without leave, he went public with demands for a clear time frame for ending military service. He says he is ready to fight but not without a plan for demobilisation. He has already served for five years, including two before Russia's full-scale invasion. \"We must continue to fight,\" he told me during a break in the hearing, \"we have no other choice.\" \"But soldiers are not slaves. Everyone who has spent three years or more on the front line deserves the right to rest. The authorities have been promising for a very long time to set terms of service, but they have not done it.\" In court he also complained of corruption among commanders, and of deadly incompetence. After the brief procedural hearing, he was handcuffed for the journey back to prison. If convicted he faces up to 12 years in jail. \"Help Ukraine,\" he told us, as he was led away.\n\nBBC/Goktay Koraltan \"I am tired... time off is rare,\" says Mykhailo, a drone unit commander\n\nMany other Ukrainian soldiers are still straining every sinew on the front lines, trying to at least slow the Russian advance. Mykhailo, 42, the chain-smoking commander of a drone unit, does battle every night fuelled by \"Non-Stop\" - a Ukrainian energy drink. He is with the 68th \"Jaeger\" Brigade, fighting to hold on to the eastern front-line city of Pokrovsk – a key transportation hub. The Russians are closing in on two sides. Mykhailo drives us to a Ukrainian position – a journey we can only risk after dark, and in an armoured car. The Russians too have eyes in the skies. Their drones are a constant threat. He is watchful, and weary. \"I went to the enlistment office in the first days,\" he tells us, \"and I hoped everything would go quickly. Honestly, I am tired. Time off is rare [in his case a total of 40 days in three years]. The only thing that saves me is that I can video chat with my family.\"\n\nBBC/Goktay Koraltan Mykhailo and his fellow soldiers at a pop-up drone position, trying to slow the Russian advance on the eastern city of Pokrovsk\n\nWe arrive at a disused house where Mykhailo and his men unload their equipment and set up a pop-up drone position. Screens are carried in, and cables connected. Outside, troops erect an antenna taller than a two-story building. They work fast under torchlight – using red beams not white as these are harder to detect. Then they assemble bombs to arm their \"vampire\" – a supersized attack drone. For the next few hours, we have front-row seats as Mykhailo - call sign \"Admin\" – pilots the drone, his eyes darting from screen to screen. First, he drops supplies to front-line Ukrainian troops and then drops an anti-tank mine on Russian forces underground. It falls slightly wide of its target. He is up against high winds and Russian jamming. All the while he is on the look-out for incoming enemy drones.\n\nBBC/Goktay Koraltan Ukrainian troops send supersized attack drones into combat in the skies as the Russians inch forward\n\nMykhailo detects a Russian warplane in the skies. Minutes later we hear the distinct thud of three Russian glide bombs. \"It's far,\" he tells us. That turns out to mean two to three kilometres away. During a lull, I ask Mykhailo if he thinks a peace deal is possible. \"Maybe not,\" he says. \"This [Putin] is a completely unstable person, and that's putting it very gently.\" \"I hope that at some stage the enemy will stop because they tire out, or someone with a sound mind comes to power.\" He won't comment on President Trump. While Mykhailo is a veteran of this war, one of his men is a beginner. Twenty-four-year-old David joined up last September as the Russians neared his hometown. He now spends his time handling explosives – though he would prefer to be at college learning languages.\n\nBBC/Goktay Koraltan Mykhailo's unit works under torchlight – using red beams not white as these are harder to detect\n\n\"No-one knows how long the war will last,\" he says, \"maybe not even the politicians\". \"I would like it to end soon so that civilians won't suffer, and people won't die anymore. But considering how things are now on the front line, it won't be soon.\" He believes that if the guns are silenced, it will be only a pause, before Moscow comes back for more. The winds get stronger and the vampire drone crash-lands. It's out of action for now. The unit pack up and leave, as fast as they came. They will be back in action at nightfall, resuming the duels in the sky. But on the ground the Russians keep inching forward, and the Trump presidency will mean pressure for a deal. And there is one more hard truth here: if it comes it is unlikely to be on Ukraine's terms.",
    "clean_body": "war will last as long as russia does ukrainian talk of victory fades as trump returns 17 january 2025 share save orla guerin senior international correspondent reporting from kyiv and dnipro share save bbcxavier vanpevenaege anastasiias husband andriy will never get the chance to meet his baby daughter anastasiia fedchenko 36 wails in anguish – her agony echoing around the gilded walls of st michaels cathedral in kyiv she sits with her hands resting on both sides of her stomach she is heavily pregnant with her first child a baby girl her husband andriy kusmenko is just inches away in uniform in an open coffin the marine commander was killed in action in eastern ukraine on 4 january this year he is now and forever 33 while andriy fought in the war anastasiia wrote about it as a journalist his brothers in arms file past dropping red roses into his coffin as funeral prayers come to an end anastasiia leans forward and gives the love of her life one last kiss bbcxavier vanpevenaege andriy was killed in action on the front line at the start of the year outside the cathedral she pays tribute to her most handsome husband who died for his country i am sorry my daughter will never see her father she tells the bbc but she will know that he was a soldier an officer and that he did everything he could for ukraine to exist for her and for other generations this war will last as long as russia does i truly fear our children will inherit it from us and will have to go and fight not according to donald trump who famously claimed he could end the war in a day and who returns to the white house next week he is already pushing for peace talks between ukraine and russia that would dishonour the dead according to sgt dmytro call sign smile who fought alongside andriy and came to the cathedral to mourn him let the people in power decide but i dont think the ones who fell would want them ukraines leadership to sit around the table he says after the funeral we are heading back to work we will fight for every ukrainian who fell plenty here believe – like anastasiia and dmytro that far too many ukrainians have been killed to try to do a deal with russia but public opinion is shifting and others believe there is too much death and destruction not to do a deal bbcxavier vanpevenaege andriy kusmenkos fellow soldiers came to the cathedral to honour him as ukraine battles through its third winter of war one word is now little spoken here – victory in the early days of russias fullscale invasion in february 2022 we heard it everywhere it was a rallying cry for a nation suddenly confronted by columns of enemy tanks but the past is truly a foreign country – and one with more territory moscow now controls almost onefifth of its neighbour including the crimean peninsula captured in 2014 and says any peace talks must take that into account the ukraine of 2025 is a place of cold hard realities – where cities empty graveyards fill and plenty of soldiers desert their posts bbcgoktay koraltan up to 100000 cases have been opened against soldiers such as serhiy hnezdilov who have deserted their units six hours drive from the capital in the heart of ukraine a young soldier is in the dock serhiy hnezdilov a burly 24yearold is locked in a glass cubicle in a packed courtroom in the city of dnipro he is on trial on charges of desertion and is one of many since 2022 around 100000 cases have been opened against soldiers who left their units according to data from ukraines general prosecutors office when hnezdilov went absent without leave he went public with demands for a clear time frame for ending military service he says he is ready to fight but not without a plan for demobilisation he has already served for five years including two before russias fullscale invasion we must continue to fight he told me during a break in the hearing we have no other choice but soldiers are not slaves everyone who has spent three years or more on the front line deserves the right to rest the authorities have been promising for a very long time to set terms of service but they have not done it in court he also complained of corruption among commanders and of deadly incompetence after the brief procedural hearing he was handcuffed for the journey back to prison if convicted he faces up to 12 years in jail help ukraine he told us as he was led away bbcgoktay koraltan i am tired time off is rare says mykhailo a drone unit commander many other ukrainian soldiers are still straining every sinew on the front lines trying to at least slow the russian advance mykhailo 42 the chainsmoking commander of a drone unit does battle every night fuelled by nonstop a ukrainian energy drink he is with the 68th jaeger brigade fighting to hold on to the eastern frontline city of pokrovsk – a key transportation hub the russians are closing in on two sides mykhailo drives us to a ukrainian position – a journey we can only risk after dark and in an armoured car the russians too have eyes in the skies their drones are a constant threat he is watchful and weary i went to the enlistment office in the first days he tells us and i hoped everything would go quickly honestly i am tired time off is rare in his case a total of 40 days in three years the only thing that saves me is that i can video chat with my family bbcgoktay koraltan mykhailo and his fellow soldiers at a popup drone position trying to slow the russian advance on the eastern city of pokrovsk we arrive at a disused house where mykhailo and his men unload their equipment and set up a popup drone position screens are carried in and cables connected outside troops erect an antenna taller than a twostory building they work fast under torchlight – using red beams not white as these are harder to detect then they assemble bombs to arm their vampire – a supersized attack drone for the next few hours we have frontrow seats as mykhailo call sign admin – pilots the drone his eyes darting from screen to screen first he drops supplies to frontline ukrainian troops and then drops an antitank mine on russian forces underground it falls slightly wide of its target he is up against high winds and russian jamming all the while he is on the lookout for incoming enemy drones bbcgoktay koraltan ukrainian troops send supersized attack drones into combat in the skies as the russians inch forward mykhailo detects a russian warplane in the skies minutes later we hear the distinct thud of three russian glide bombs its far he tells us that turns out to mean two to three kilometres away during a lull i ask mykhailo if he thinks a peace deal is possible maybe not he says this putin is a completely unstable person and thats putting it very gently i hope that at some stage the enemy will stop because they tire out or someone with a sound mind comes to power he wont comment on president trump while mykhailo is a veteran of this war one of his men is a beginner twentyfouryearold david joined up last september as the russians neared his hometown he now spends his time handling explosives – though he would prefer to be at college learning languages bbcgoktay koraltan mykhailos unit works under torchlight – using red beams not white as these are harder to detect noone knows how long the war will last he says maybe not even the politicians i would like it to end soon so that civilians wont suffer and people wont die anymore but considering how things are now on the front line it wont be soon he believes that if the guns are silenced it will be only a pause before moscow comes back for more the winds get stronger and the vampire drone crashlands its out of action for now the unit pack up and leave as fast as they came they will be back in action at nightfall resuming the duels in the sky but on the ground the russians keep inching forward and the trump presidency will mean pressure for a deal and there is one more hard truth here if it comes it is unlikely to be on ukraines terms",
    "summary": "As funeral prayers come to an end, Anastasiia leans forward and gives \"the love of her life\" one last kiss.\nNot according to Donald Trump, who famously claimed he could end the war in a day, and who returns to the White House next week.\nPlenty here believe – like Anastasiia and Dmytro - that far too many Ukrainians have been killed to try to do a deal with Russia.\nBBC/Goktay Koraltan Ukrainian troops send supersized attack drones into combat in the skies as the Russians inch forwardMykhailo detects a Russian warplane in the skies.\nBut on the ground the Russians keep inching forward, and the Trump presidency will mean pressure for a deal.",
    "keywords": [
      "presidency",
      "russians",
      "soldiers",
      "ukraine",
      "ukrainians",
      "war",
      "drone",
      "concerns",
      "trump",
      "nears",
      "hopes",
      "koraltan",
      "russian",
      "andriy",
      "ukrainian",
      "mykhailo"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/a9bc/live/29445420-d282-11ef-9377-192b32874917.jpg"
  },
  "https://www.bbc.com/news/articles/c3w8e051j0do": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c3w8e051j0do",
    "date": "2025-01-16",
    "time": "00:00:00",
    "title": "Up to Greenland to decide its future, Danish PM tells Trump",
    "body": "Up to Greenland to decide its future, Danish PM tells Trump\n\nShe also reiterated the statements of the Greenland PM, Mute Egede, who recently said that Greenland was not for sale.\n\nIn a 45-minute phone call on Wednesday, Frederiksen told Trump that Denmark was prepared to increase its responsibility for security in the Arctic.\n\nThe US president-elect sparked turmoil in Copenhagen and Nuuk, Greenland's capital, last week when he signalled that the US wanted to acquire the huge arctic island, which is an autonomous territory of Denmark.\n\nDenmark's Prime Minister Mette Frederiksen has told Donald Trump that it is up to Greenland to decide its own future.\n\nTrump did not react to the call publicly. However, he reposted on his TruthSocial account a 2019 poll that indicated 68% of Greenlanders supported independence from Denmark.\n\nA referendum on independence is thought to be on the cards and Denmark has said it would respect any result.\n\nWhen he was last president, Trump said he wanted to buy Greenland. When Frederiksen called the proposal \"absurd\", he abruptly cancelled a trip to Denmark.\n\nThe Danish government said that in her phone call with Trump, Frederiksen also emphasised that \"Danish companies contribute to growth and jobs in the US, and that the EU and the US have a common interest in strengthened trade.\"\n\nLast week, Trump threatened Denmark with high tariffs if the country did not give up Greenland.\n\nThe suggestion set off alarm bells among Danish industry leaders, as the US is Denmark's second largest export market and any targeted tariffs would have a significant impact on the Danish economy.\n\nOn Thursday, Frederiksen will hold what Danish media dubbed a \"crisis meeting\" with business leaders, including the CEOs of beer giant Carlsberg and drugmaker Novo Nordisk, which produces obesity and diabetes drugs popular in the US.\n\nShe is also due to host an extraordinary Foreign Policy Council meeting with members from across parliament.\n\nGreenlandic member of parliament Aaja Chemnitz said she was satisfied with Frederiksen's line that any decision about Greenland should be taken by Greenlanders.\n\n\"I have great confidence in the prime minister's task, and I also have great confidence in Egede. I think it is important that they have a close dialogue,\" she said.\n\nEarlier this week, Egede said his government was ready to start a dialogue with the incoming Trump administration.\n\nBut opposition MP Rasmus Jarlov said that he disapproved of Frederiksen's approach.\n\nWriting on X, he said: \"It is completely unacceptable that [Frederiksen] renounces Denmark's rights in Greenland and places sovereignty solely with the [Greenlander] self-government when she talks to the President of the United States.\"\n\nTrump's comments and his son's visit to Greenland last week sparked huge concern in Denmark. Faced with the prospect of angering what she repeatedly called \"Denmark's closest ally\", Frederiksen measured her words while emphasising Greenland's right to self-determination.\n\nHans Redder, TV2's political editor, said the fact that Trump had set aside 45 minutes for a phone call with Frederiksen indicated that \"this Greenland thing is really something that is on Trump's mind - it's not just a passing thought\".",
    "clean_body": "up to greenland to decide its future danish pm tells trump she also reiterated the statements of the greenland pm mute egede who recently said that greenland was not for sale in a 45minute phone call on wednesday frederiksen told trump that denmark was prepared to increase its responsibility for security in the arctic the us presidentelect sparked turmoil in copenhagen and nuuk greenlands capital last week when he signalled that the us wanted to acquire the huge arctic island which is an autonomous territory of denmark denmarks prime minister mette frederiksen has told donald trump that it is up to greenland to decide its own future trump did not react to the call publicly however he reposted on his truthsocial account a 2019 poll that indicated 68 of greenlanders supported independence from denmark a referendum on independence is thought to be on the cards and denmark has said it would respect any result when he was last president trump said he wanted to buy greenland when frederiksen called the proposal absurd he abruptly cancelled a trip to denmark the danish government said that in her phone call with trump frederiksen also emphasised that danish companies contribute to growth and jobs in the us and that the eu and the us have a common interest in strengthened trade last week trump threatened denmark with high tariffs if the country did not give up greenland the suggestion set off alarm bells among danish industry leaders as the us is denmarks second largest export market and any targeted tariffs would have a significant impact on the danish economy on thursday frederiksen will hold what danish media dubbed a crisis meeting with business leaders including the ceos of beer giant carlsberg and drugmaker novo nordisk which produces obesity and diabetes drugs popular in the us she is also due to host an extraordinary foreign policy council meeting with members from across parliament greenlandic member of parliament aaja chemnitz said she was satisfied with frederiksens line that any decision about greenland should be taken by greenlanders i have great confidence in the prime ministers task and i also have great confidence in egede i think it is important that they have a close dialogue she said earlier this week egede said his government was ready to start a dialogue with the incoming trump administration but opposition mp rasmus jarlov said that he disapproved of frederiksens approach writing on x he said it is completely unacceptable that frederiksen renounces denmarks rights in greenland and places sovereignty solely with the greenlander selfgovernment when she talks to the president of the united states trumps comments and his sons visit to greenland last week sparked huge concern in denmark faced with the prospect of angering what she repeatedly called denmarks closest ally frederiksen measured her words while emphasising greenlands right to selfdetermination hans redder tv2s political editor said the fact that trump had set aside 45 minutes for a phone call with frederiksen indicated that this greenland thing is really something that is on trumps mind its not just a passing thought",
    "summary": "Up to Greenland to decide its future, Danish PM tells TrumpShe also reiterated the statements of the Greenland PM, Mute Egede, who recently said that Greenland was not for sale.\nIn a 45-minute phone call on Wednesday, Frederiksen told Trump that Denmark was prepared to increase its responsibility for security in the Arctic.\nDenmark's Prime Minister Mette Frederiksen has told Donald Trump that it is up to Greenland to decide its own future.\nLast week, Trump threatened Denmark with high tariffs if the country did not give up Greenland.\nEarlier this week, Egede said his government was ready to start a dialogue with the incoming Trump administration.",
    "keywords": [
      "decide",
      "denmarks",
      "egede",
      "week",
      "tells",
      "greenland",
      "denmark",
      "danish",
      "trump",
      "wanted",
      "frederiksen",
      "phone",
      "future"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/70d5/live/274c1ec0-d410-11ef-b387-69ed9121b472.jpg"
  },
  "https://www.bbc.com/news/articles/c20kp037weko": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c20kp037weko",
    "date": "2025-01-13",
    "time": "00:00:00",
    "title": "Eastbourne: Derelict house fires 'deliberate but not linked'",
    "body": "Derelict house fires 'deliberate but not linked'\n\nThe fire has destroyed the roof of the building in Eastbourne\n\nFires at two derelict houses in an area of East Sussex were both started deliberately but are not linked, authorities have said.\n\nCrews tackled a blaze at an abandoned property in Coast Road, Pevensey Bay, at about 23:50 GMT on Friday.\n\nAt about 01:00 on Monday, firefighters were then called to a fire at another abandoned property in Kings Drive, Eastbourne.\n\nSussex Police are asking anyone who saw the Kings Drive incident, has footage of it, or noticed any suspicious behaviour to come forward.",
    "clean_body": "derelict house fires deliberate but not linked the fire has destroyed the roof of the building in eastbourne fires at two derelict houses in an area of east sussex were both started deliberately but are not linked authorities have said crews tackled a blaze at an abandoned property in coast road pevensey bay at about 2350 gmt on friday at about 0100 on monday firefighters were then called to a fire at another abandoned property in kings drive eastbourne sussex police are asking anyone who saw the kings drive incident has footage of it or noticed any suspicious behaviour to come forward",
    "summary": "Derelict house fires 'deliberate but not linked'The fire has destroyed the roof of the building in EastbourneFires at two derelict houses in an area of East Sussex were both started deliberately but are not linked, authorities have said.\nCrews tackled a blaze at an abandoned property in Coast Road, Pevensey Bay, at about 23:50 GMT on Friday.\nAt about 01:00 on Monday, firefighters were then called to a fire at another abandoned property in Kings Drive, Eastbourne.\nSussex Police are asking anyone who saw the Kings Drive incident, has footage of it, or noticed any suspicious behaviour to come forward.",
    "keywords": [
      "linked",
      "saw",
      "property",
      "suspicious",
      "drive",
      "fires",
      "sussex",
      "house",
      "eastbourne",
      "deliberate",
      "kings",
      "abandoned",
      "started",
      "derelict",
      "tackled"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/346f/live/c4880290-d1ad-11ef-bbe0-eb255759a6ac.jpg"
  },
  "https://www.bbc.com/news/articles/czxknwyxk09o": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/czxknwyxk09o",
    "date": "2025-01-30",
    "time": "00:00:00",
    "title": "At a glance: what was in Rachel Reeves speech?",
    "body": "At a glance: What was in Rachel Reeves's speech?\n\n30 January 2025 Share Save Sam Francis Political reporter Share Save\n\nGetty Images\n\nRachel Reeves has set out a series of major announcements on infrastructure projects, including backing plans for a third runway at Heathrow Airport. She promised to go \"further and faster\" than previous governments after years of sluggish growth in the UK. However, many of the projects still need to go through a formal planning process so it could be years before building starts and the economy sees any benefit. How quickly could the plans boost growth?\n\nHow will the UK's growth plans affect me?\n\nHeathrow expansion\n\nReeves confirmed the government is backing plans to build a third runway at Heathrow Airport, arguing it could create 100,000 jobs. The plans received parliamentary approval in June 2018, but have been stuck in limbo after legal challenges ever since. She invited Heathrow to submit plans to expand the airport by the end of the summer, but promised the government would only sign them off if they were \"in line with legal environmental and climate objectives\". The government has already backed the expansion of City Airport and Stansted Airport around London. A decision to expand Luton Airport and build an emergency runway at Gatwick Airport will be delivered soon, she promised. The government will work with local authorities to reopen the Doncaster Sheffield Airport, aiming to turn it into a thriving regional hub. There will also be a new partnership between Prologis and Manchester Airport Group will build a new advanced manufacturing and logistics park, resulting in £1bn of investment and 2,000 jobs, Reeves said. Reeves later said a third runway could be built by 2035, however others believe it will be closer to 2050.\n\n'Silicon Valley'\n\nReeves vowed to build \"Europe's Silicon Valley\" between Oxford and Cambridge, with policies aimed at boosting the region's growth, saying they would add £78bn to the UK economy in the next 10 years. Funding has been confirmed for transport projects, including new services on an East-West Rail line beginning this year - reviving plans shelved by Boris Johnson in 2022. She also promised an upgrade on the A428 between Milton Keynes and Cambridge. The University of Cambridge will open an innovation hub in the city centre, which will be built alongside 4,500 new homes and schools, after the Environment Agency dropped its opposition. Approvals for new towns are expected soon as the government has already received proposals along the rail with 18 submissions for sizeable new developments. A new Cambridge Cancer Research Hospital will also be prioritised. Lord Patrick Vallance, the ex-chief scientific adviser to the government and now a Labour minister, will be in charge of overseeing the project. Governments of all stripes have been looking at creating large-scale housing projects in the so-called Oxford-Cambridge Arc since at least 2003. Various projects gained support under Johnson, Theresa May and Rishi Sunak - but were killed off by funding concerns and local opposition. The original plans had promised the new rail line would be completed by 2030 and one million new homes and jobs delivered in the area by 2050. What do government plans mean for Cambridge?\n\nNew reservoirs\n\nThe government has approved £7.9bn in investment for water companies to build nine new reservoirs, including a new Fens Reservoir to serve Cambridge. There will also be a new Abingdon Reservoir near Oxford. Officials agreed water resources management plans with water firms in December, with the first reservoirs due to open in 2028, and 2050 as the completion date for all projects.\n\nChanging infrastructure rules\n\nGovernment guidance on building major projects will be reviewed in order to support investments outside of the wealthy and productive south-east of England, Reeves said. \"This means that investment in all regions is given a fair hearing by the Treasury that I lead,\" she said. This will work alongside other major changes set out in the government's upcoming Planning and Infrastructure Bill. PM vows to curb 'Nimby' legal blocks on infrastructure\n\nRedevelopment of Old Trafford\n\nOne of the projects to benefit is plans to redevelop Manchester United's Old Trafford football stadium. Manchester United are set to make a decision by the end of the season on whether to redevelop the existing stadium into an 87,000-capacity venue or build a brand-new 100,000-capacity ground. The club said it would make the final decision by the summer. The Old Trafford scheme is expected to use public money to move three rail freight terminals blocking the redevelopment. Mayor of Greater Manchester Andy Burnham has promised the scheme will build 5,000 homes and create a second \"major football campus\" in the city. New Man Utd stadium could bring £7bn boost report finds\n\nTrade trips\n\nReeves announced the government will be hosting a range of trade trips. Business Secretary Jonathan Reynolds is going to India next month for trade talk while the UK resets \"the relationship\" with the EU. Building on \"our special relationship with the United States under President Trump\" is in the national interest, Reeves said. Can opposites Trump and Starmer find common ground?\n\nSecret UK 'mini cabinet' tries to plan for unpredictable Trump\n\nNational Wealth Fund investments\n\nThe government will invest in two green energy projects through the National Wealth Fund set up under Labour. Reeves said £65m will be given to electric vehicle charging company Connected Kerb project to extend their network. Meanwhile £28m will be invested in Cornish Metals, which provide the raw material for solar panels, wind turbines and electric vehicles. The funding is expected to be released shortly. Government fund pledges £30m to reopen tin mine\n\nLower Thames Crossing\n\nReeves mentioned the new Lower Thames Crossing, the UK's largest road tunnel, which will link Tilbury in Essex and Gravesend in Kent. The £9bn tunnel under the Thames river will be one of the most expensive infrastructure projects in British history. The government is exploring how to finance it privately. Private sector could finance crossing, says chancellor\n\nAround the UK",
    "clean_body": "at a glance what was in rachel reevess speech 30 january 2025 share save sam francis political reporter share save getty images rachel reeves has set out a series of major announcements on infrastructure projects including backing plans for a third runway at heathrow airport she promised to go further and faster than previous governments after years of sluggish growth in the uk however many of the projects still need to go through a formal planning process so it could be years before building starts and the economy sees any benefit how quickly could the plans boost growth how will the uks growth plans affect me heathrow expansion reeves confirmed the government is backing plans to build a third runway at heathrow airport arguing it could create 100000 jobs the plans received parliamentary approval in june 2018 but have been stuck in limbo after legal challenges ever since she invited heathrow to submit plans to expand the airport by the end of the summer but promised the government would only sign them off if they were in line with legal environmental and climate objectives the government has already backed the expansion of city airport and stansted airport around london a decision to expand luton airport and build an emergency runway at gatwick airport will be delivered soon she promised the government will work with local authorities to reopen the doncaster sheffield airport aiming to turn it into a thriving regional hub there will also be a new partnership between prologis and manchester airport group will build a new advanced manufacturing and logistics park resulting in £1bn of investment and 2000 jobs reeves said reeves later said a third runway could be built by 2035 however others believe it will be closer to 2050 silicon valley reeves vowed to build europes silicon valley between oxford and cambridge with policies aimed at boosting the regions growth saying they would add £78bn to the uk economy in the next 10 years funding has been confirmed for transport projects including new services on an eastwest rail line beginning this year reviving plans shelved by boris johnson in 2022 she also promised an upgrade on the a428 between milton keynes and cambridge the university of cambridge will open an innovation hub in the city centre which will be built alongside 4500 new homes and schools after the environment agency dropped its opposition approvals for new towns are expected soon as the government has already received proposals along the rail with 18 submissions for sizeable new developments a new cambridge cancer research hospital will also be prioritised lord patrick vallance the exchief scientific adviser to the government and now a labour minister will be in charge of overseeing the project governments of all stripes have been looking at creating largescale housing projects in the socalled oxfordcambridge arc since at least 2003 various projects gained support under johnson theresa may and rishi sunak but were killed off by funding concerns and local opposition the original plans had promised the new rail line would be completed by 2030 and one million new homes and jobs delivered in the area by 2050 what do government plans mean for cambridge new reservoirs the government has approved £79bn in investment for water companies to build nine new reservoirs including a new fens reservoir to serve cambridge there will also be a new abingdon reservoir near oxford officials agreed water resources management plans with water firms in december with the first reservoirs due to open in 2028 and 2050 as the completion date for all projects changing infrastructure rules government guidance on building major projects will be reviewed in order to support investments outside of the wealthy and productive southeast of england reeves said this means that investment in all regions is given a fair hearing by the treasury that i lead she said this will work alongside other major changes set out in the governments upcoming planning and infrastructure bill pm vows to curb nimby legal blocks on infrastructure redevelopment of old trafford one of the projects to benefit is plans to redevelop manchester uniteds old trafford football stadium manchester united are set to make a decision by the end of the season on whether to redevelop the existing stadium into an 87000capacity venue or build a brandnew 100000capacity ground the club said it would make the final decision by the summer the old trafford scheme is expected to use public money to move three rail freight terminals blocking the redevelopment mayor of greater manchester andy burnham has promised the scheme will build 5000 homes and create a second major football campus in the city new man utd stadium could bring £7bn boost report finds trade trips reeves announced the government will be hosting a range of trade trips business secretary jonathan reynolds is going to india next month for trade talk while the uk resets the relationship with the eu building on our special relationship with the united states under president trump is in the national interest reeves said can opposites trump and starmer find common ground secret uk mini cabinet tries to plan for unpredictable trump national wealth fund investments the government will invest in two green energy projects through the national wealth fund set up under labour reeves said £65m will be given to electric vehicle charging company connected kerb project to extend their network meanwhile £28m will be invested in cornish metals which provide the raw material for solar panels wind turbines and electric vehicles the funding is expected to be released shortly government fund pledges £30m to reopen tin mine lower thames crossing reeves mentioned the new lower thames crossing the uks largest road tunnel which will link tilbury in essex and gravesend in kent the £9bn tunnel under the thames river will be one of the most expensive infrastructure projects in british history the government is exploring how to finance it privately private sector could finance crossing says chancellor around the uk",
    "summary": "At a glance: What was in Rachel Reeves's speech?\nHeathrow expansionReeves confirmed the government is backing plans to build a third runway at Heathrow Airport, arguing it could create 100,000 jobs.\nA decision to expand Luton Airport and build an emergency runway at Gatwick Airport will be delivered soon, she promised.\nReeves later said a third runway could be built by 2035, however others believe it will be closer to 2050.\nBuilding on \"our special relationship with the United States under President Trump\" is in the national interest, Reeves said.",
    "keywords": [
      "cambridge",
      "airport",
      "projects",
      "reeves",
      "runway",
      "promised",
      "plans",
      "glance",
      "rachel",
      "uk",
      "speech",
      "set",
      "build"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4a5f/live/79e8eeb0-de60-11ef-bd1b-d536627785f2.jpg"
  }
}