{
  "https://www.nytimes.com/2025/05/10/business/us-china-talks-trump-tariffs.html": {
    "source": "NY Times",
    "url": "https://www.nytimes.com/2025/05/10/business/us-china-talks-trump-tariffs.html",
    "date": "2025-05-10",
    "time": "23:42:06 UTC",
    "title": "US and China Meet for First Time Since Trump Imposed Tariffs",
    "body": "Top economic officials from the United States and China concluded their first day of meetings in Geneva on Saturday evening, setting up a second day of high-stakes negotiations on Sunday that could determine the fate of a global economy that has been jolted by President Trump’s trade war.\n\nNeither side provided an immediate formal readout about how the talks went. Mr. Trump, writing on social media on Saturday evening, described the meeting as “very good” in a “friendly, but constructive, manner.”\n\n“A very good meeting today with China, in Switzerland. Many things discussed, much agreed to. A total reset negotiated in a friendly, but constructive, manner. We want to see, for the good of both China and the U.S., an opening up of China to American business. GREAT PROGRESS MADE!!!”\n\nThe meetings are the first since Mr. Trump ratcheted up tariffs on Chinese imports to 145 percent and China retaliated with its own levies of 125 percent on U.S. goods. The tit-for-tat effectively cut off trade between the world’s largest economies while raising the possibility of a global economic downturn.",
    "summary": "Neither side provided an immediate formal readout about how the talks went.\nMr. Trump, writing on social media on Saturday evening, described the meeting as “very good” in a “friendly, but constructive, manner.”“A very good meeting today with China, in Switzerland.\nWe want to see, for the good of both China and the U.S., an opening up of China to American business.\n!”The meetings are the first since Mr. Trump ratcheted up tariffs on Chinese imports to 145 percent and China retaliated with its own levies of 125 percent on U.S. goods.\nThe tit-for-tat effectively cut off trade between the world’s largest economies while raising the possibility of a global economic downturn.",
    "keywords": [
      "trump",
      "meetings",
      "imposed",
      "meet",
      "china",
      "good",
      "evening",
      "mr",
      "trade",
      "tariffs",
      "meeting",
      "global",
      "friendly"
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/10/multimedia/10dc-uschina-talks-01-hjmz/10dc-uschina-talks-01-hjmz-facebookJumbo.jpg",
    "clean_body": "top economic official united state china concluded first day meeting geneva saturday evening setting second day highstakes negotiation sunday could determine fate global economy jolted president trump 's trade war neither side provided immediate formal readout talk went mr trump writing social medium saturday evening described meeting `` good '' `` friendly constructive manner '' '' good meeting today china switzerland many thing discussed much agreed total reset negotiated friendly constructive manner want see good china u opening china american business great progress made '' meeting first since mr trump ratcheted tariff chinese import percent china retaliated levy percent u good titfortat effectively cut trade world 's largest economy raising possibility global economic downturn",
    "t": 1
  },
  "https://www.theguardian.com/world/2025/may/10/five-fishermen-lost-at-sea-for-55-days-rescued-by-ecuadorian-tuna-boat": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2025/may/10/five-fishermen-lost-at-sea-for-55-days-rescued-by-ecuadorian-tuna-boat",
    "date": "2025-05-10",
    "time": "22:52:06 UTC",
    "title": "Five fishers lost at sea for 55 days rescued by Ecuadorian tuna boat",
    "body": "Five fishers who spent 55 days adrift at sea arrived on Saturday at a port in the Galápagos after being rescued by a tuna boat, the Ecuadorian navy said on X.\n\nThe three Peruvians and two Colombians had been missing since mid-March and were found on 7 May by an Ecuadorian boat called Aldo.\n\nThe fishers had reported damage to the boat’s alternator two days after setting sail from Pucusana Bay, to the south of Peru’s capital Lima, the navy said in a separate post on Friday.\n\nThe failure caused communication and navigation tools to malfunction, Ecuadorian navy frigate captain María Fares told the Associated Press, adding that they had no power on the boat.\n\n“They had no starter, lights and everything that a battery generates,” she said. To survive, they had to “take rusted water out of the engine [and] when a fish passed by, they caught it and parboiled it to eat”. They also drank rain and sea water to survive, Fares added.\n\nThe men are in stable condition and the navy said it was coordinating with local and foreign authorities to ensure their safe return to their respective countries.\n\nEarlier this year, another Peruvian fisher, 61-year-old Máximo Napa, spent 95 days at sea alone. He was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
    "summary": "Five fishers who spent 55 days adrift at sea arrived on Saturday at a port in the Galápagos after being rescued by a tuna boat, the Ecuadorian navy said on X.\nThe failure caused communication and navigation tools to malfunction, Ecuadorian navy frigate captain María Fares told the Associated Press, adding that they had no power on the boat.\nThey also drank rain and sea water to survive, Fares added.\nEarlier this year, another Peruvian fisher, 61-year-old Máximo Napa, spent 95 days at sea alone.\nHe was also rescued by an Ecuadorian vessel and returned to Lima in mid-March to be reunited with his family.",
    "keywords": [
      "days",
      "sea",
      "lost",
      "fishers",
      "survive",
      "midmarch",
      "tuna",
      "spent",
      "55",
      "rescued",
      "water",
      "ecuadorian",
      "lima",
      "boat",
      "navy"
    ],
    "image_url": "https://i.guim.co.uk/img/media/c5c03310ce5d0c9a30cae1bbc69a0c00241415a7/95_0_953_762/master/953.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=eeb542bcd3e16a5c8ded994ad3d9812d",
    "clean_body": "five fisher spent day adrift sea arrived saturday port galapagos rescued tuna boat ecuadorian navy said x three peruvian two colombian missing since midmarch found may ecuadorian boat called aldo fisher reported damage boat 's alternator two day setting sail pucusana bay south peru 's capital lima navy said separate post friday failure caused communication navigation tool malfunction ecuadorian navy frigate captain maria fare told associated press adding power boat '' starter light everything battery generates '' said survive `` take rusted water engine fish passed caught parboiled eat '' also drank rain sea water survive fare added men stable condition navy said coordinating local foreign authority ensure safe return respective country earlier year another peruvian fisher yearold maximo napa spent day sea alone also rescued ecuadorian vessel returned lima midmarch reunited family",
    "t": 1
  },
  "https://www.theguardian.com/world/2025/may/10/leaders-britain-france-germany-poland-arrive-kyiv-ukraine": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2025/may/10/leaders-britain-france-germany-poland-arrive-kyiv-ukraine",
    "date": "2025-05-10",
    "time": "23:43:50 UTC",
    "title": "Vladimir Putin rejects ceasefire ultimatum proposed by European leaders",
    "body": "Vladimir Putin has rejected an ultimatum by European leaders to agree to a ceasefire with Ukraine or face increased sanctions, but has proposed holding direct negotiations with Kyiv this week.\n\nThe leaders of Britain, France, Germany and Poland told the Russian president either to sign up to an unconditional ceasefire by Monday or face increased sanctions and weapons transfers to Ukraine.\n\n“All of us here, together with the US, are calling Putin out. If he’s serious about peace, then he has a chance to show it now,” said UK prime minister, Keir Starmer, at a joint press conference of the five leaders in Kyiv.\n\nStarmer said the leaders were demanding “an unconditional ceasefire, rejecting Putin’s conditions, and [are] clear that if he turns his back on peace, we will respond, working with President Trump, with all our partners, we will ramp up sanctions, and increase our military aid for Ukraine’s defence to pressure Russia back to the table.”\n\n0:53 European leaders call for unconditional 30-day ceasefire in Ukraine – video\n\nStarmer, Emmanuel Macron and Friedrich Merz arrived in the Ukrainian capital on the same train on Saturday morning, while Donald Tusk travelled on a separate train. The leaders met Zelenskyy for talks in central Kyiv. It is Macron’s first visit to Kyiv since summer 2022, and the first visit for Merz as chancellor, having only taken office this week.\n\n“All five leaders had a fruitful call with @POTUS focused on peace efforts,” Ukraine’s foreign minister, Andrii Sybiha, wrote on X, adding a picture of the five men gathered around a mobile phone on speaker mode.\n\nSybiha added: “Ukraine and all allies are ready for a full unconditional ceasefire on land, air, and at sea for at least 30 days starting already on Monday. If Russia agrees and effective monitoring is ensured, a durable ceasefire and confidence-building measures can pave the way to peace negotiations.”\n\nRussia’s response to the ultimatum came in a press briefing for Russian media and western television networks, held in the Kremlin close to 2am local time on Sunday morning. Putin rejected the calls for a ceasefire, but said he was ready for direct negotiations with Ukraine.\n\nHe suggested delegations from the two countries could meet in Istanbul this Thursday to begin talks. “We don’t exclude that during these negotiations we will be able to agree on new ceasefires,” Putin said.\n\nMacron said on Sunday that Putin’s talks proposal was “a first step, but not enough”. “An unconditional ceasefire is not preceded by negotiations,” the French president said, adding that the Russian leader was “looking for a way out, but he still wants to buy time”.\n\nUkraine and European capitals have previously demanded a full ceasefire as a precondition to starting negotiations. Putin left the briefing, for which journalists had been kept waiting for up to seven hours, without answering any questions.\n\nThere was no immediate readout from the White House on the call, or on whether Trump had made specific commitments if Putin rejects the ceasefire.\n\nTrump and the US administration have said a 30-day ceasefire could be the first step on the way to a sustainable peace deal. Ukraine has said it is ready to implement such a ceasefire, but Russia has so far refused, saying it would only do so if all western weapons deliveries to Ukraine were halted.\n\nView image in fullscreen Volodymyr Zelenskyy, Emmanuel Macron and Keir Starmer in Kyiv, Ukraine. Photograph: Thomas Peter/Reuters\n\nIn an early sign that Russia may not be receptive to the latest ultimatum, the hawkish former president, Dmitry Medvedev, wrote on X: “Macron, Merz, Starmer, and Tusk were supposed to discuss peace in Kyiv. Instead, they are blurting out threats against Russia … You think that’s smart, eh? Shove these peace plans up your pangender arses.”\n\nInstead, Moscow unilaterally declared a three-day ceasefire beginning on 8 May, which Kyiv said was designed to avoid Ukrainian drone attacks on Russia during celebrations of 80 years of the Soviet victory in the second world war, held in Moscow on Friday.\n\nThousands of troops marched through Red Square for the annual Victory Day parade, with numerous world leaders in attendance, most notably China’s Xi Jinping, and the Brazilian president, Luiz Inácio Lula da Silva. Robert Fico and Aleksandar Vučić, the prime minister of EU member Slovakia and the president of EU hopeful Serbia, respectively, also attended the parade, drawing irritation from other European leaders.\n\nFighting has continued along the frontlines during the supposed ceasefire, both sides have said, but Russia has largely refrained from drone and missile attacks on Ukraine.\n\n“Putin didn’t need conditions when he wanted a ceasefire to have a parade, and he doesn’t need them now. Ukraine has shown the willingness to engage again and again, but again and again Putin has refused,” said Starmer.\n\nStarmer said Putin had drawn the wrong lessons from the second world war. “We understand the lessons of history, the lesson that any veteran of Normandy or north Africa or of any other campaign will tell you, but that Putin has not yet grasped. There is no glory in aggression and conquest, glory comes from fighting for your country, defending the people, and winning the peace,” he said.\n\nView image in fullscreen L-R: Friedrich Merz, Emmanuel Macron, Volodymyr Zelenskyy, Olena Zelenska, Keir Starmer and Donald Tusk in Maidan Square. Photograph: WPA/Getty Images\n\nMacron also referenced VE Day, and said that “the defence of the principles on which our continent and, more generally, the international order is based” was at stake in the war in Ukraine.\n\nThe four European leaders visited Kyiv’s Maidan on Saturday morning with Zelenskyy and his wife, Olena Zelenska. Thousands of flags have been erected in the central square to remember those killed in the war with Russia. The leaders paid their respects and had a moment of silence, before heading to the talks with Zelenskyy. The five then had a virtual meeting with other leaders on progress being made for a so-called “air, land, maritime and regeneration force” that is planned to be part of a peace deal.\n\nTrump has yet to comment publicly on his conversation with the group of leaders. On Friday, he was asked by reporters in the Oval Office if he had a message for Putin. “I have a message for both parties: get this war ended,” he said, adding: “Get this stupid war finished. That’s my message for both of them.”\n\nThe Trump administration has so far appeared to be much tougher on Kyiv than Moscow, but there are some small signals that the mood in Washington might be changing, after a positive meeting between Trump and Zelenskyy in the Vatican on the sidelines of the pope’s funeral.\n\nEven the vice-president, JD Vance, seen as the most sceptical of voices on support for Ukraine, has criticised Moscow’s stance in recent days. “Right now, the Russians are asking for a certain set of requirements, a certain set of concessions in order to end the conflict. We think they’re asking for too much,” he said this week.\n\nThe US embassy in Kyiv put out a public warning late on Friday night that it had received intelligence of a “potentially significant air attack that may occur at any time over the next several days”. It did not give further details, but it later emerged that Russia will close its airspace over the Kapustin Yar missile testing range on Monday and Tuesday, which could indicate the potential launch of ballistic missiles.",
    "summary": "Vladimir Putin has rejected an ultimatum by European leaders to agree to a ceasefire with Ukraine or face increased sanctions, but has proposed holding direct negotiations with Kyiv this week.\nPutin rejected the calls for a ceasefire, but said he was ready for direct negotiations with Ukraine.\nThere was no immediate readout from the White House on the call, or on whether Trump had made specific commitments if Putin rejects the ceasefire.\nView image in fullscreen Volodymyr Zelenskyy, Emmanuel Macron and Keir Starmer in Kyiv, Ukraine.\n“Putin didn’t need conditions when he wanted a ceasefire to have a parade, and he doesn’t need them now.",
    "keywords": [
      "ultimatum",
      "war",
      "kyiv",
      "rejects",
      "ceasefire",
      "president",
      "peace",
      "putin",
      "russia",
      "ukraine",
      "european",
      "leaders",
      "vladimir",
      "zelenskyy",
      "proposed"
    ],
    "image_url": "https://i.guim.co.uk/img/media/31a6095e6e4b437a4a1405bedbedb82b87f6bdfd/461_0_4606_3685/master/4606.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ae399f547bedd1927052a3ee99735af",
    "clean_body": "vladimir putin rejected ultimatum european leader agree ceasefire ukraine face increased sanction proposed holding direct negotiation kyiv week leader britain france germany poland told russian president either sign unconditional ceasefire monday face increased sanction weapon transfer ukraine '' u together u calling putin 's serious peace chance show '' said uk prime minister keir starmer joint press conference five leader kyiv starmer said leader demanding `` unconditional ceasefire rejecting putin 's condition clear turn back peace respond working president trump partner ramp sanction increase military aid ukraine 's defence pressure russia back table '' european leader call unconditional day ceasefire ukraine - video starmer emmanuel macron friedrich merz arrived ukrainian capital train saturday morning donald tusk travelled separate train leader met zelenskyy talk central kyiv macron 's first visit kyiv since summer first visit merz chancellor taken office week '' five leader fruitful call potus focused peace effort '' ukraine 's foreign minister andrii sybiha wrote x adding picture five men gathered around mobile phone speaker mode sybiha added `` ukraine ally ready full unconditional ceasefire land air sea least day starting already monday russia agrees effective monitoring ensured durable ceasefire confidencebuilding measure pave way peace negotiation '' russia 's response ultimatum came press briefing russian medium western television network held kremlin close local time sunday morning putin rejected call ceasefire said ready direct negotiation ukraine suggested delegation two country could meet istanbul thursday begin talk `` n't exclude negotiation able agree new ceasefires '' putin said macron said sunday putin 's talk proposal `` first step enough '' `` unconditional ceasefire preceded negotiation '' french president said adding russian leader `` looking way still want buy time '' ukraine european capital previously demanded full ceasefire precondition starting negotiation putin left briefing journalist kept waiting seven hour without answering question immediate readout white house call whether trump made specific commitment putin reject ceasefire trump u administration said day ceasefire could first step way sustainable peace deal ukraine said ready implement ceasefire russia far refused saying would western weapon delivery ukraine halted view image fullscreen volodymyr zelenskyy emmanuel macron keir starmer kyiv ukraine photograph thomas peterreuters early sign russia may receptive latest ultimatum hawkish former president dmitry medvedev wrote x `` macron merz starmer tusk supposed discus peace kyiv instead blurting threat russia ... think 's smart eh shove peace plan pangender arses '' instead moscow unilaterally declared threeday ceasefire beginning may kyiv said designed avoid ukrainian drone attack russia celebration year soviet victory second world war held moscow friday thousand troop marched red square annual victory day parade numerous world leader attendance notably china 's xi jinping brazilian president luiz inacio lula da silva robert fico aleksandar vucic prime minister eu member slovakia president eu hopeful serbia respectively also attended parade drawing irritation european leader fighting continued along frontlines supposed ceasefire side said russia largely refrained drone missile attack ukraine '' putin n't need condition wanted ceasefire parade n't need ukraine shown willingness engage putin refused '' said starmer starmer said putin drawn wrong lesson second world war `` understand lesson history lesson veteran normandy north africa campaign tell putin yet grasped glory aggression conquest glory come fighting country defending people winning peace '' said view image fullscreen lr friedrich merz emmanuel macron volodymyr zelenskyy olena zelenska keir starmer donald tusk maidan square photograph wpagetty image macron also referenced day said `` defence principle continent generally international order based '' stake war ukraine four european leader visited kyiv 's maidan saturday morning zelenskyy wife olena zelenska thousand flag erected central square remember killed war russia leader paid respect moment silence heading talk zelenskyy five virtual meeting leader progress made socalled `` air land maritime regeneration force '' planned part peace deal trump yet comment publicly conversation group leader friday asked reporter oval office message putin `` message party get war ended '' said adding `` get stupid war finished 's message '' trump administration far appeared much tougher kyiv moscow small signal mood washington might changing positive meeting trump zelenskyy vatican sideline pope 's funeral even vicepresident jd vance seen sceptical voice support ukraine criticised moscow 's stance recent day `` right russian asking certain set requirement certain set concession order end conflict think 're asking much '' said week u embassy kyiv put public warning late friday night received intelligence `` potentially significant air attack may occur time next several day '' give detail later emerged russia close airspace kapustin yar missile testing range monday tuesday could indicate potential launch ballistic missile",
    "t": 1
  },
  "https://www.theguardian.com/world/2025/may/10/bangladeshi-interim-cabinet-bans-all-activities-of-ousted-awami-league-party": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/world/2025/may/10/bangladeshi-interim-cabinet-bans-all-activities-of-ousted-awami-league-party",
    "date": "2025-05-10",
    "time": "21:48:26 UTC",
    "title": "Bangladeshi interim cabinet bans all ousted Awami League party activities",
    "body": "The interim government in Bangladesh has banned all activities of the former ruling Awami League party headed by former influential prime minister Sheikh Hasina, who was ousted last year in a mass uprising.\n\nAsif Nazrul, the country’s law affairs adviser, said on Saturday the interim cabinet headed by the Nobel peace prize laureate Muhammad Yunus decided to ban the party’s activities online and elsewhere under the country’s Anti-Terrorism Act. The ban would stay in place until a special tribunal completes a trial of the party and its leaders over the deaths of hundreds of students and other protesters during an anti-government uprising in July and August last year.\n\n“This decision is aimed at ensuring national security and sovereignty, protection of activists of the July movement, and plaintiffs and witnesses involved in the tribunal proceedings,” Nazrul told reporters after a special cabinet meeting.\n\nNazrul said the meeting on Saturday also expanded scope for trying any political parties involving charges of killing during the anti-Hasina protest being handled by the international crimes tribunal.\n\nHe said a government notification regarding the ban would be published soon with details.\n\nHasina and many of her senior party colleagues have been accused of murder in many cases after her ouster last year. She has been in exile in India since 5 August as her official residence was stormed by protesters soon after she left the country.\n\nThe UNs human rights office said in a report in February that up to 1,400 people may have been killed during three weeks of anti-Hasina protest.\n\nSaturday night’s dramatic decision came after thousands of protesters, including supporters of a newly formed political party by students, took to the streets in Dhaka and issued an ultimatum to ban the Awami League party by Saturday night. The members of the student wing of the Jamaat-e-Islami party also prominently took part in the protest.\n\nThere was no immediate reaction from Hasina or her party, but the chief of the Jatiya Nagorik or National Citizen party, Nahid Islam, who is also a student leader, applauded the Yunus-led government for its decision.\n\nThe student-led uprising ended Hasina’s 15 years of rule, and three days after her fall Yunus took office as interim leader.",
    "summary": "The interim government in Bangladesh has banned all activities of the former ruling Awami League party headed by former influential prime minister Sheikh Hasina, who was ousted last year in a mass uprising.\nHasina and many of her senior party colleagues have been accused of murder in many cases after her ouster last year.\nSaturday night’s dramatic decision came after thousands of protesters, including supporters of a newly formed political party by students, took to the streets in Dhaka and issued an ultimatum to ban the Awami League party by Saturday night.\nThe members of the student wing of the Jamaat-e-Islami party also prominently took part in the protest.\nThe student-led uprising ended Hasina’s 15 years of rule, and three days after her fall Yunus took office as interim leader.",
    "keywords": [
      "activities",
      "ban",
      "bans",
      "party",
      "yunus",
      "bangladeshi",
      "student",
      "tribunal",
      "interim",
      "cabinet",
      "ousted",
      "took",
      "protesters",
      "uprising",
      "awami",
      "students",
      "league"
    ],
    "image_url": "https://i.guim.co.uk/img/media/f3dcfa694239c7bfb5a584168fa140061f22a63e/396_0_5847_4679/master/5847.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=02c6b047d067968f61391a4ed3e22533",
    "clean_body": "interim government bangladesh banned activity former ruling awami league party headed former influential prime minister sheikh hasina ousted last year mass uprising asif nazrul country 's law affair adviser said saturday interim cabinet headed nobel peace prize laureate muhammad yunus decided ban party 's activity online elsewhere country 's antiterrorism act ban would stay place special tribunal completes trial party leader death hundred student protester antigovernment uprising july august last year '' decision aimed ensuring national security sovereignty protection activist july movement plaintiff witness involved tribunal proceeding '' nazrul told reporter special cabinet meeting nazrul said meeting saturday also expanded scope trying political party involving charge killing antihasina protest handled international crime tribunal said government notification regarding ban would published soon detail hasina many senior party colleague accused murder many case ouster last year exile india since august official residence stormed protester soon left country un human right office said report february people may killed three week antihasina protest saturday night 's dramatic decision came thousand protester including supporter newly formed political party student took street dhaka issued ultimatum ban awami league party saturday night member student wing jamaateislami party also prominently took part protest immediate reaction hasina party chief jatiya nagorik national citizen party nahid islam also student leader applauded yunusled government decision studentled uprising ended hasina 's year rule three day fall yunus took office interim leader",
    "t": 1
  }
}