{
  "https://www.bbc.com/news/articles/cwy6zk9wkrdo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cwy6zk9wkrdo",
    "date": "2025-05-02",
    "time": "00:00:00",
    "title": "AfD classified as extreme-right by German intelligence",
    "body": "AfD classified as extreme-right by German intelligence\n\n2 May 2025 Share Save Paul Kirby Europe digital editor Share Save\n\nReuters Alice Weidel, joint AfD leader, said the decision was a \"severe blow against German democracy\"\n\nGermany's Alternative für Deutschland (AfD) party has been designated as right-wing extremist by the country's federal office for the protection of the constitution. \"The ethnicity- and ancestry-based understanding of the people prevailing within the party is incompatible with the free democratic order,\" the domestic intelligence agency said in a statement. The German foreign ministry defended the decision after US Secretary of State Marco Rubio called the move \"tyranny in disguise\" and Vice-President JD Vance said the Berlin Wall was being rebuilt. The AfD came second in federal elections in February, winning a record 152 seats in the 630-seat parliament with 20.8% of the vote.\n\nThe parliament, or Bundestag, will hold a vote next week to confirm conservative leader Friedrich Merz as chancellor, heading a coalition with the centre-left Social Democrats. AfD joint leaders Alice Weidel and Tino Chrupalla said the decision was \"clearly politically motivated\" and a \"severe blow to German democracy\". They argued their party was being \"discredited and criminalised\" shortly before the change of government. The far-right AfD had already been placed under observation for suspected extremism in Germany, and the intelligence agency had also classed it as right-wing extremist in three states in the east, where its popularity is highest. The agency, or Verfassungsschutz, said specifically that the AfD did not consider citizens of a \"migration background from predominantly Muslim countries\" as equal members of the German people. AfD deputy chairman Stephan Brandner said the decision was \"complete nonsense, has absolutely nothing to do with law and order\". However, acting Interior Minister Nancy Faeser said the agency had made a clear and unambiguous decision with \"no political influence whatsoever\", after a comprehensive review and a report of 1,100 pages. Bundestag Vice-President Andrea Lindholz said that as a designated right-wing extremist group the AfD should not be treated as other parties, especially in parliament. Because of their large number of seats, AfD members could be eligible to chair parliamentary committees, but Lindholz said that idea was now \"almost unthinkable\".\n\nAfter their election success, AfD leaders said the so-called firewall that had prevented other parties from working with them should end. \"Anyone who erects firewalls will get grilled behind them,\" said Tino Chrupalla. Having doubled its share of the vote in under four years, Chrupalla's party is still second in the opinion polls behind Merz's conservatives, despite several scandals, including one high-profile member being convicted of using banned Nazi slogans. Earlier this year Alice Weidel embraced the term \"remigration\", widely seen as meaning the mass deportation of people with a migrant background, although she rejected that definition. The AfD also attracted the support of leading figures in the Trump administration. Nine days before the election, US Vice-President JD Vance met Weidel in Munich and said there was no place for \"firewalls\", alleging that free speech was in retreat in Europe. Tech billionaire Elon Musk gave Weidel a long audience in a livestreamed chat on X and called on Germans to vote for the AfD. He then repeatedly posted his support for Weidel's party in the run-up to the election. On Friday JD Vance posted on X that \"the AfD is the most popular party in Germany, and by far the most representative of East Germany. Now the bureaucrats try to destroy it.\" He also accused the \"German establishment\" of rebuilding the Berlin Wall - a reference to the barrier built in 1961 to separate East and West Berlin during the Cold War. US Secretary of State Marco Rubio said the decision taken by the German intelligence agency meant it had been given \"new powers to surveil the opposition. That's not democracy - it's tyranny in disguise\". This prompted a rare retort from the German Foreign Office. \"This is democracy,\" it posted on X. \"We have learnt from our history that rightwing extremism needs to be stopped.\"",
    "clean_body": "afd classified as extremeright by german intelligence 2 may 2025 share save paul kirby europe digital editor share save reuters alice weidel joint afd leader said the decision was a severe blow against german democracy germanys alternative für deutschland afd party has been designated as rightwing extremist by the countrys federal office for the protection of the constitution the ethnicity and ancestrybased understanding of the people prevailing within the party is incompatible with the free democratic order the domestic intelligence agency said in a statement the german foreign ministry defended the decision after us secretary of state marco rubio called the move tyranny in disguise and vicepresident jd vance said the berlin wall was being rebuilt the afd came second in federal elections in february winning a record 152 seats in the 630seat parliament with 208 of the vote the parliament or bundestag will hold a vote next week to confirm conservative leader friedrich merz as chancellor heading a coalition with the centreleft social democrats afd joint leaders alice weidel and tino chrupalla said the decision was clearly politically motivated and a severe blow to german democracy they argued their party was being discredited and criminalised shortly before the change of government the farright afd had already been placed under observation for suspected extremism in germany and the intelligence agency had also classed it as rightwing extremist in three states in the east where its popularity is highest the agency or verfassungsschutz said specifically that the afd did not consider citizens of a migration background from predominantly muslim countries as equal members of the german people afd deputy chairman stephan brandner said the decision was complete nonsense has absolutely nothing to do with law and order however acting interior minister nancy faeser said the agency had made a clear and unambiguous decision with no political influence whatsoever after a comprehensive review and a report of 1100 pages bundestag vicepresident andrea lindholz said that as a designated rightwing extremist group the afd should not be treated as other parties especially in parliament because of their large number of seats afd members could be eligible to chair parliamentary committees but lindholz said that idea was now almost unthinkable after their election success afd leaders said the socalled firewall that had prevented other parties from working with them should end anyone who erects firewalls will get grilled behind them said tino chrupalla having doubled its share of the vote in under four years chrupallas party is still second in the opinion polls behind merzs conservatives despite several scandals including one highprofile member being convicted of using banned nazi slogans earlier this year alice weidel embraced the term remigration widely seen as meaning the mass deportation of people with a migrant background although she rejected that definition the afd also attracted the support of leading figures in the trump administration nine days before the election us vicepresident jd vance met weidel in munich and said there was no place for firewalls alleging that free speech was in retreat in europe tech billionaire elon musk gave weidel a long audience in a livestreamed chat on x and called on germans to vote for the afd he then repeatedly posted his support for weidels party in the runup to the election on friday jd vance posted on x that the afd is the most popular party in germany and by far the most representative of east germany now the bureaucrats try to destroy it he also accused the german establishment of rebuilding the berlin wall a reference to the barrier built in 1961 to separate east and west berlin during the cold war us secretary of state marco rubio said the decision taken by the german intelligence agency meant it had been given new powers to surveil the opposition thats not democracy its tyranny in disguise this prompted a rare retort from the german foreign office this is democracy it posted on x we have learnt from our history that rightwing extremism needs to be stopped",
    "summary": "AfD classified as extreme-right by German intelligence2 May 2025 Share Save Paul Kirby Europe digital editor Share SaveReuters Alice Weidel, joint AfD leader, said the decision was a \"severe blow against German democracy\"Germany's Alternative für Deutschland (AfD) party has been designated as right-wing extremist by the country's federal office for the protection of the constitution.\nThe AfD came second in federal elections in February, winning a record 152 seats in the 630-seat parliament with 20.8% of the vote.\nAfD joint leaders Alice Weidel and Tino Chrupalla said the decision was \"clearly politically motivated\" and a \"severe blow to German democracy\".\nAfD deputy chairman Stephan Brandner said the decision was \"complete nonsense, has absolutely nothing to do with law and order\".\nUS Secretary of State Marco Rubio said the decision taken by the German intelligence agency meant it had been given \"new powers to surveil the opposition.",
    "keywords": [
      "vote",
      "vicepresident",
      "decision",
      "weidel",
      "german",
      "extremeright",
      "x",
      "intelligence",
      "party",
      "classified",
      "agency",
      "rightwing",
      "afd"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/6b19/live/e3b6f9f0-274d-11f0-8c66-ebf25fc2cfef.jpg"
  },
  "https://www.bbc.com/news/articles/c7930xpd4dvo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c7930xpd4dvo",
    "date": "2025-05-02",
    "time": "00:00:00",
    "title": "North Tyneside mayor's election race a narrow win for Labour's Karen Clark",
    "body": "Labour narrowly wins North Tyneside mayoral race\n\n2 May 2025 Share Save Helen Richardson Political reporter, BBC North East and Cumbria Reporting from North Tyneside Austen Shakespeare Local Democracy Reporting Service Share Save\n\nBBC Karen Clark said the political picture nationally affected the vote in North Tyneside\n\nLabour has retained the mayoralty of North Tyneside after beating Reform UK by a thin margin. Karen Clark tallied 16,230 votes, putting her just 444 ahead of John Falkenstein. Clark, who effectively becomes leader of North Tyneside Council, said the close result was down to people using a protest vote over the national political landscape. The Conservatives, who are the official opposition on the local authority, came third.\n\nClark, who has been a councillor and cabinet member for a number of years, urged voters to look at \"what Labour has achieved on North Tyneside\" in the last 12 years. Thanking people for her election, she said she would \"work to the best of my abilities for the residents of this borough, as promised, to make our North Tyneside an even better place to live, work and visit\". On her battle against Reform UK, she said: \"I think it's in keeping with the national trend. \"It is always difficult when you're a party that is in government. \"The government has found itself in a difficult position after 14 years of Conservative government and has had to make difficult decisions. \"They know the whole situation of the finances in government.\"\n\nClark succeeds Dame Norma Redfearn, who had held the post since 2013. Tynemouth MP and Labour chief whip Alan Campbell said it had been \"important\" for the party to retain the mayoralty \"after the fantastic work Norma did\". He added he was \"grateful that voters across North Tyneside have put their faith\" in Clark for the next four years.\n\nFalkenstein told the Local Democracy Reporting Service: \"I think we have diminished what I believed to be a 30,000 majority. \"I cannot see how this is a real victory for the Labour Party.\" The former barrister, with experience in youth work, also stated that had his campaign had more resources and a longer than four-week start, the end result could well have been different. \"They [Labour] have not done themselves much justice.\" Liam Bones, who stood for the Conservatives, said the result was \"clearly indicative of a national sense of distrust towards the main parties\". He added: \"That is something we need to address if we are to regain the trust of the British people. \"Reform is a protest party, they stood in this election with no local policies and no understanding of how local services are actually delivered on the ground.\" Reform UK leader and MP Nigel Farage visited Newton Aycliffe in County Durham to celebrate his party taking control of the county council. In a speech, he said the party had came \"within a whisker\" of winning the North Tyneside mayoral contest in a Labour heartland and had \"frightened the life out of the governing Conservatives\" in Northumberland. The count had faced a delay owing to a discrepancy between previously announced vote and turnout figures. Initially announced as 31%, the turnout was later confirmed to be 33%, the Local Democracy Reporting Service said. Elsewhere, the Conservatives remain the biggest party on Northumberland County Council following the local elections there, but Reform UK came a close second. The council remains under no overall control.",
    "clean_body": "labour narrowly wins north tyneside mayoral race 2 may 2025 share save helen richardson political reporter bbc north east and cumbria reporting from north tyneside austen shakespeare local democracy reporting service share save bbc karen clark said the political picture nationally affected the vote in north tyneside labour has retained the mayoralty of north tyneside after beating reform uk by a thin margin karen clark tallied 16230 votes putting her just 444 ahead of john falkenstein clark who effectively becomes leader of north tyneside council said the close result was down to people using a protest vote over the national political landscape the conservatives who are the official opposition on the local authority came third clark who has been a councillor and cabinet member for a number of years urged voters to look at what labour has achieved on north tyneside in the last 12 years thanking people for her election she said she would work to the best of my abilities for the residents of this borough as promised to make our north tyneside an even better place to live work and visit on her battle against reform uk she said i think its in keeping with the national trend it is always difficult when youre a party that is in government the government has found itself in a difficult position after 14 years of conservative government and has had to make difficult decisions they know the whole situation of the finances in government clark succeeds dame norma redfearn who had held the post since 2013 tynemouth mp and labour chief whip alan campbell said it had been important for the party to retain the mayoralty after the fantastic work norma did he added he was grateful that voters across north tyneside have put their faith in clark for the next four years falkenstein told the local democracy reporting service i think we have diminished what i believed to be a 30000 majority i cannot see how this is a real victory for the labour party the former barrister with experience in youth work also stated that had his campaign had more resources and a longer than fourweek start the end result could well have been different they labour have not done themselves much justice liam bones who stood for the conservatives said the result was clearly indicative of a national sense of distrust towards the main parties he added that is something we need to address if we are to regain the trust of the british people reform is a protest party they stood in this election with no local policies and no understanding of how local services are actually delivered on the ground reform uk leader and mp nigel farage visited newton aycliffe in county durham to celebrate his party taking control of the county council in a speech he said the party had came within a whisker of winning the north tyneside mayoral contest in a labour heartland and had frightened the life out of the governing conservatives in northumberland the count had faced a delay owing to a discrepancy between previously announced vote and turnout figures initially announced as 31 the turnout was later confirmed to be 33 the local democracy reporting service said elsewhere the conservatives remain the biggest party on northumberland county council following the local elections there but reform uk came a close second the council remains under no overall control",
    "summary": "Clark, who effectively becomes leader of North Tyneside Council, said the close result was down to people using a protest vote over the national political landscape.\nClark, who has been a councillor and cabinet member for a number of years, urged voters to look at \"what Labour has achieved on North Tyneside\" in the last 12 years.\nOn her battle against Reform UK, she said: \"I think it's in keeping with the national trend.\nHe added he was \"grateful that voters across North Tyneside have put their faith\" in Clark for the next four years.\n\"I cannot see how this is a real victory for the Labour Party.\"",
    "keywords": [
      "work",
      "mayors",
      "election",
      "race",
      "local",
      "labours",
      "win",
      "uk",
      "reporting",
      "reform",
      "north",
      "council",
      "karen",
      "party",
      "tyneside",
      "clark",
      "narrow",
      "labour"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/4c99/live/4b761c30-271a-11f0-857c-91cf9a8b6cb2.jpg"
  },
  "https://www.bbc.com/news/articles/c14xdlmgv3do": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c14xdlmgv3do",
    "date": "2025-05-01",
    "time": "00:00:00",
    "title": "Rap group Kneecap's show in Plymouth cancelled",
    "body": "Rap group Kneecap has Plymouth show cancelled\n\nA show was arranged to take place on 4 July at Plymouth Pavilions\n\nRap group Kneecap's recently announced show in Plymouth has been cancelled due to safety concerns, organisers have said.\n\nOn Tuesday the Eden Sessions in Cornwall announced the band's appearance scheduled for 4 July had been cancelled before a gig for the same date at Plymouth Pavilions was announced by the band later in the day.\n\nPlymouth Pavilions said this show has now been called off after it had \"taken advice from relevant authorities and agencies.\"\n\nThe band has faced criticism after a video emerged of the west Belfast trio at a November 2023 gig appearing to show one person from the band saying: \"The only good Tory is a dead Tory. Kill your local MP.\"",
    "clean_body": "rap group kneecap has plymouth show cancelled a show was arranged to take place on 4 july at plymouth pavilions rap group kneecaps recently announced show in plymouth has been cancelled due to safety concerns organisers have said on tuesday the eden sessions in cornwall announced the bands appearance scheduled for 4 july had been cancelled before a gig for the same date at plymouth pavilions was announced by the band later in the day plymouth pavilions said this show has now been called off after it had taken advice from relevant authorities and agencies the band has faced criticism after a video emerged of the west belfast trio at a november 2023 gig appearing to show one person from the band saying the only good tory is a dead tory kill your local mp",
    "summary": "Rap group Kneecap has Plymouth show cancelledA show was arranged to take place on 4 July at Plymouth PavilionsRap group Kneecap's recently announced show in Plymouth has been cancelled due to safety concerns, organisers have said.\nOn Tuesday the Eden Sessions in Cornwall announced the band's appearance scheduled for 4 July had been cancelled before a gig for the same date at Plymouth Pavilions was announced by the band later in the day.\nPlymouth Pavilions said this show has now been called off after it had \"taken advice from relevant authorities and agencies.\"\nThe band has faced criticism after a video emerged of the west Belfast trio at a November 2023 gig appearing to show one person from the band saying: \"The only good Tory is a dead Tory.\nKill your local MP.\"",
    "keywords": [
      "video",
      "band",
      "kneecaps",
      "pavilions",
      "rap",
      "gig",
      "announced",
      "group",
      "plymouth",
      "tory",
      "cancelled",
      "west"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/e54c/live/ea839ab0-2683-11f0-9b5b-234434c99085.jpg"
  },
  "https://www.bbc.com/news/articles/cy5rd764kqeo": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cy5rd764kqeo",
    "date": "2025-05-04",
    "time": "00:00:00",
    "title": "Water safety changes 'not happening quick enough'",
    "body": "Water safety changes 'not happening quick enough'\n\n4 May 2025 Share Save Lynette Horsburgh BBC News, Lancashire Share Save\n\nBBC Rebecca Ramsay says there have been strides made in water safety but youngsters were still losing their lives\n\nA water safety campaigner has described her \"frustration\" at changes \"not being put in quick enough\" to prevent lives being lost. Rebecca Ramsay's son Dylan drowned at Hill Top Quarry in Whittle-le-Woods, near Chorley, in 2011. Since then she has devoted her life to improving water safety and got it added to the national school curriculum after a 12-year campaign. Ms Ramsay, from Chorley, said it was \"absolutely heartbreaking\" young people are still tragically losing their lives when getting into difficulty swimming in open water.\n\nFamily photograph Dylan Ramsay drowned at Hill Top Quarry in Whittle-le-Woods in 2011\n\nShe told BBC Radio Lancashire she always worried when the weather got warmer and was desperate for young people to stay away from swimming in quarries and reservoirs. Ms Ramsay, who was awarded a British Empire Medal in 2019 for her work in campaigning for water safety, has visited schools to educate children on the risks since her son's death. She said since water safety was put on the national curriculum she had noticed \"small changes\", with schools she offered to go to having already booked someone to speak to children about it, or having done it themselves. \"That's refreshing,\" she said. \"Changes are being put in place but we are not doing it quick enough. \"Some changes that are being put in place now... I was putting those recommendations in within weeks of Dylan losing his life. She added: \"It is quite frustrating that it has taken 14 years for things to pass down.\"",
    "clean_body": "water safety changes not happening quick enough 4 may 2025 share save lynette horsburgh bbc news lancashire share save bbc rebecca ramsay says there have been strides made in water safety but youngsters were still losing their lives a water safety campaigner has described her frustration at changes not being put in quick enough to prevent lives being lost rebecca ramsays son dylan drowned at hill top quarry in whittlelewoods near chorley in 2011 since then she has devoted her life to improving water safety and got it added to the national school curriculum after a 12year campaign ms ramsay from chorley said it was absolutely heartbreaking young people are still tragically losing their lives when getting into difficulty swimming in open water family photograph dylan ramsay drowned at hill top quarry in whittlelewoods in 2011 she told bbc radio lancashire she always worried when the weather got warmer and was desperate for young people to stay away from swimming in quarries and reservoirs ms ramsay who was awarded a british empire medal in 2019 for her work in campaigning for water safety has visited schools to educate children on the risks since her sons death she said since water safety was put on the national curriculum she had noticed small changes with schools she offered to go to having already booked someone to speak to children about it or having done it themselves thats refreshing she said changes are being put in place but we are not doing it quick enough some changes that are being put in place now i was putting those recommendations in within weeks of dylan losing his life she added it is quite frustrating that it has taken 14 years for things to pass down",
    "summary": "Water safety changes 'not happening quick enough'4 May 2025 Share Save Lynette Horsburgh BBC News, Lancashire Share SaveBBC Rebecca Ramsay says there have been strides made in water safety but youngsters were still losing their livesA water safety campaigner has described her \"frustration\" at changes \"not being put in quick enough\" to prevent lives being lost.\nSince then she has devoted her life to improving water safety and got it added to the national school curriculum after a 12-year campaign.\nMs Ramsay, who was awarded a British Empire Medal in 2019 for her work in campaigning for water safety, has visited schools to educate children on the risks since her son's death.\nShe said since water safety was put on the national curriculum she had noticed \"small changes\", with schools she offered to go to having already booked someone to speak to children about it, or having done it themselves.\nI was putting those recommendations in within weeks of Dylan losing his life.",
    "keywords": [
      "safety",
      "quick",
      "swimming",
      "changes",
      "water",
      "losing",
      "young",
      "ramsay",
      "dylan",
      "whittlelewoods",
      "happening"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/78d0/live/c5c0b7e0-25e7-11f0-8561-fb867c4a75db.jpg"
  },
  "https://www.bbc.com/news/articles/cy5rz9p2d5ko": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/cy5rz9p2d5ko",
    "date": "2025-05-02",
    "time": "00:00:00",
    "title": "M&S cyber attack: Retailer working 'day and night' to manage impact",
    "body": "M&S working 'day and night' over cyber attack\n\n2 May 2025 Share Save Vishala Sri-Pathma Business Reporter Share Save\n\nEPA\n\nThe boss of Marks & Spencer has told customers the retailer is \"working day and night\" to manage the cyber attack that has forced it to temporarily shut down its online operations. Stuart Machin said he was \"really sorry\" for the disruption to services, but did not say when normal business would resume. M&S's problems began over the Easter weekend, and last week it confirmed it was dealing with a \"cyber incident\" and paused online orders on its website and apps. The Co-op and luxury department store Harrods have also been targeted and the National Cyber Security Centre (NCSC) has urged retailers to be vigilant.\n\nIn his message, Mr Machin said: \"We are working day and night to manage the current cyber incident and get things back to normal for you as quickly as possible.\" He also thanked customers for \"all the support you have shown us\". The cyber attack has already had a significant impact on the retailer, as online transactions account for about a third of its clothing and home sales. On average, £3.8m is spent on clothing and home products on its website and apps every day. There have also been gaps on the food shelves in some stores after the firm took some of its systems offline in an attempt to manage the attack, while its loyalty scheme and gift card payments have been disrupted too. Analysts have pointed out that M&S risks losing out to rivals, as online shoppers can quickly switch to other retailers' websites. The problems have also coincided with a period of warmer weather, when people are likely to want to buy new summer clothes. M&S shares dropped almost 2% on Friday morning, and are now down about 5% from the point when the company first disclosed its IT systems had been disrupted.",
    "clean_body": "ms working day and night over cyber attack 2 may 2025 share save vishala sripathma business reporter share save epa the boss of marks spencer has told customers the retailer is working day and night to manage the cyber attack that has forced it to temporarily shut down its online operations stuart machin said he was really sorry for the disruption to services but did not say when normal business would resume mss problems began over the easter weekend and last week it confirmed it was dealing with a cyber incident and paused online orders on its website and apps the coop and luxury department store harrods have also been targeted and the national cyber security centre ncsc has urged retailers to be vigilant in his message mr machin said we are working day and night to manage the current cyber incident and get things back to normal for you as quickly as possible he also thanked customers for all the support you have shown us the cyber attack has already had a significant impact on the retailer as online transactions account for about a third of its clothing and home sales on average £38m is spent on clothing and home products on its website and apps every day there have also been gaps on the food shelves in some stores after the firm took some of its systems offline in an attempt to manage the attack while its loyalty scheme and gift card payments have been disrupted too analysts have pointed out that ms risks losing out to rivals as online shoppers can quickly switch to other retailers websites the problems have also coincided with a period of warmer weather when people are likely to want to buy new summer clothes ms shares dropped almost 2 on friday morning and are now down about 5 from the point when the company first disclosed its it systems had been disrupted",
    "summary": "M&S working 'day and night' over cyber attack2 May 2025 Share Save Vishala Sri-Pathma Business Reporter Share SaveEPAThe boss of Marks & Spencer has told customers the retailer is \"working day and night\" to manage the cyber attack that has forced it to temporarily shut down its online operations.\nIn his message, Mr Machin said: \"We are working day and night to manage the current cyber incident and get things back to normal for you as quickly as possible.\"\nThe cyber attack has already had a significant impact on the retailer, as online transactions account for about a third of its clothing and home sales.\nOn average, £3.8m is spent on clothing and home products on its website and apps every day.\nAnalysts have pointed out that M&S risks losing out to rivals, as online shoppers can quickly switch to other retailers' websites.",
    "keywords": [
      "attack",
      "systems",
      "night",
      "impact",
      "website",
      "ms",
      "retailer",
      "working",
      "cyber",
      "online",
      "manage",
      "day"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/e67e/live/2e674940-273b-11f0-b426-e7e24cc847d9.jpg"
  }
}