{
  "https://www.aljazeera.com/news/2025/5/3/israelis-protest-for-captives-against-netanyahus-gaza-war-expansion": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/5/3/israelis-protest-for-captives-against-netanyahus-gaza-war-expansion",
    "date": "2025-05-03",
    "time": "00:00:00",
    "title": "Israelis protest for captives, against Netanyahu’s Gaza war expansion",
    "body": "Thousands of Israelis have gathered outside the Ministry of Defence in Tel Aviv, urging the government to prioritise the release of captives still held in Gaza instead of escalating military operations in the Palestinian territory.\n\nThe demonstration on Saturday was held as Prime Minister Benjamin Netanyahu’s government authorised the mobilisation of up to 60,000 reserve troops, signalling plans to intensify its assault on the besieged Palestinian enclave.\n\nOne protester held aloft a placard castigating Netanyahu that read, “our tyrant is a liar, because of him the state is on fire”.\n\nGovernment officials claim an expanded military offensive on Gaza will pressure Hamas into releasing the 59 remaining captives, but critics argue it further endangers their lives. Ending the fleeting ceasefire, which saw Palestinian prisoners exchanged for Israeli captives earlier this year, has not led to any more releases.\n\nA video circulated by Hamas on Saturday purported to show one of the Israeli captives, whom local media identified as Maxim Herkin. In the four-minute video posted online, Herkin is seen being rescued by Hamas members after an Israeli attack struck a tunnel, burying and injuring the Israeli captive.\n\nAdvertisement\n\nFamilies of the captives released a statement saying they spent the Sabbath gripped by “excruciating anxiety” after news of the government’s planned escalation and the effect it could have on those still held in Gaza.\n\nThe Bring Them Home Campaign, a group representing the relatives, condemned the move as reckless.\n\n“Israel is on its way to sinking into the Gaza mud in the name of the illusion that it is possible to achieve any victory without returning our brothers and sisters from captivity,” the group said in a post on X. “Expanding the fighting will endanger the kidnapped, the living and the dead alike.”\n\nThey urged Netanyahu to abandon the offensive and instead reach an agreement that would secure the captives’ return. “Stop this mistake,” the group said.\n\n‘Protests not enough to influence Netanyahu’\n\nSpeaking to Al Jazeera, Israeli journalist Gideon Levy said the protest movement remains consistent, but lacks the momentum to challenge Netanyahu’s coalition. “It’s the same old protest, very courageous and devoted, but not big enough to influence Netanyahu,” Levy said.\n\nHe noted that a large segment of Israeli society continues to support the war effort, even amid rising frustration from the captives’ families, and that “when [Israelis] are called to war, they will obey.”\n\nNetanyahu, speaking Thursday at a public event in Jerusalem, seemed to suggest that defeating Hamas remains Israel’s top priority instead of the release of captives. “We want to bring all our hostages home,” he said. “The war has a supreme goal, and the supreme goal is victory over our enemies, and this we will achieve.”\n\nAdvertisement\n\nCaptives’ families have accused Netanyahu of undermining previous attempts to reach a truce and swap deal. Some believe his refusal to compromise reflects political motives, aimed at ensuring the survival of his far-right coalition government, rather than genuine concern for the captives.",
    "clean_body": "thousands of israelis have gathered outside the ministry of defence in tel aviv urging the government to prioritise the release of captives still held in gaza instead of escalating military operations in the palestinian territory the demonstration on saturday was held as prime minister benjamin netanyahu’s government authorised the mobilisation of up to 60000 reserve troops signalling plans to intensify its assault on the besieged palestinian enclave one protester held aloft a placard castigating netanyahu that read “our tyrant is a liar because of him the state is on fire” government officials claim an expanded military offensive on gaza will pressure hamas into releasing the 59 remaining captives but critics argue it further endangers their lives ending the fleeting ceasefire which saw palestinian prisoners exchanged for israeli captives earlier this year has not led to any more releases a video circulated by hamas on saturday purported to show one of the israeli captives whom local media identified as maxim herkin in the fourminute video posted online herkin is seen being rescued by hamas members after an israeli attack struck a tunnel burying and injuring the israeli captive advertisement families of the captives released a statement saying they spent the sabbath gripped by “excruciating anxiety” after news of the government’s planned escalation and the effect it could have on those still held in gaza the bring them home campaign a group representing the relatives condemned the move as reckless “israel is on its way to sinking into the gaza mud in the name of the illusion that it is possible to achieve any victory without returning our brothers and sisters from captivity” the group said in a post on x “expanding the fighting will endanger the kidnapped the living and the dead alike” they urged netanyahu to abandon the offensive and instead reach an agreement that would secure the captives’ return “stop this mistake” the group said ‘protests not enough to influence netanyahu’ speaking to al jazeera israeli journalist gideon levy said the protest movement remains consistent but lacks the momentum to challenge netanyahu’s coalition “it’s the same old protest very courageous and devoted but not big enough to influence netanyahu” levy said he noted that a large segment of israeli society continues to support the war effort even amid rising frustration from the captives’ families and that “when israelis are called to war they will obey” netanyahu speaking thursday at a public event in jerusalem seemed to suggest that defeating hamas remains israel’s top priority instead of the release of captives “we want to bring all our hostages home” he said “the war has a supreme goal and the supreme goal is victory over our enemies and this we will achieve” advertisement captives’ families have accused netanyahu of undermining previous attempts to reach a truce and swap deal some believe his refusal to compromise reflects political motives aimed at ensuring the survival of his farright coalition government rather than genuine concern for the captives",
    "summary": "Thousands of Israelis have gathered outside the Ministry of Defence in Tel Aviv, urging the government to prioritise the release of captives still held in Gaza instead of escalating military operations in the Palestinian territory.\nGovernment officials claim an expanded military offensive on Gaza will pressure Hamas into releasing the 59 remaining captives, but critics argue it further endangers their lives.\nEnding the fleeting ceasefire, which saw Palestinian prisoners exchanged for Israeli captives earlier this year, has not led to any more releases.\nA video circulated by Hamas on Saturday purported to show one of the Israeli captives, whom local media identified as Maxim Herkin.\n“It’s the same old protest, very courageous and devoted, but not big enough to influence Netanyahu,” Levy said.",
    "keywords": [
      "war",
      "protest",
      "netanyahu",
      "hamas",
      "israelis",
      "gaza",
      "held",
      "captives",
      "israeli",
      "netanyahus",
      "instead",
      "palestinian",
      "expansion",
      "group"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/05/AFP__20250503__44DN4BN__v2__HighRes__TopshotIsraelPalestinianConflictDemonstration-1746297126.jpg?resize=1920%2C1440",
    "t": 9
  },
  "https://www.aljazeera.com/news/2025/5/4/romania-votes-in-crucial-presidential-election-rerun?traffic_source=rss": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/5/4/romania-votes-in-crucial-presidential-election-rerun?traffic_source=rss",
    "date": "2025-05-04",
    "time": "00:00:00",
    "title": "Far-right Simion tops first round of Romania’s presidential election",
    "body": "Far-right politician George Simion has topped the first round of Romania’s presidential election rerun, after a vote held in November was annulled over allegations of Russian interference.\n\nSimion, who leads the Alliance for the Union of Romanians, will face off against the centrist mayor of Bucharest, Nicusor Dan, in a May 18 run-off following Sunday’s vote.\n\nWith 99 percent of ballots counted, Simion had 40.5 percent of the vote, compared to Dan’s 20.9 percent.\n\nFormer Senator Crin Antonescu, the candidate of the governing coalition, came third, with 20.3 percent of the vote.\n\nPolls opened at 7am local time (04:00 GMT) and closed at 9pm (18:00 GMT). Simion had been expected to win the first round, according to exit polls.\n\n“I want to thank from the bottom of my heart all those who chose to vote [for me] with the number-one position on the ballot paper,” Simion said after the exit poll results were released. “It was an act of courage, trust and solidarity. I am grateful and assure them that their trust will not be betrayed.”\n\nAdvertisement\n\nThe Constitutional Court nullified the result of the last election won by NATO critic Calin Georgescu, who was barred from contesting Sunday’s rerun.\n\nGeorgescu was excluded after authorities said his campaign had been boosted by an inauthentic TikTok campaign and Russian meddling, sparking sometimes violent protests.\n\nHe was effectively replaced by Simion, one of 11 candidates for the presidency, which plays a large role in shaping foreign policy.\n\nSimion opposes military aid to neighbouring Ukraine, is critical of European Union leadership and says he is aligned with United States President Donald Trump’s “Make America Great Again” movement.\n\nPrior to the election, he was polling at about 30 percent, a comfortable lead but well short of the 50 percent needed to avoid a run-off vote.\n\nDan, a mathematician and activist, backs Ukraine, and is running as an independent on a pro-EU, anticorruption platform.\n\n“George Simion equals Calin Georgescu, he gets my vote,” Aurelia, 66, a pensioner who declined to give her last name, told the Reuters news agency.\n\nShe said she felt “humiliated” by the cancellation of November’s first round.\n\n“Everything is lacking here. My children are not here: Did they leave to work abroad because things were so good here?”\n\nPensioner Eugenia Niculescu, 65, who lives in Bucharest and has struggled to pay for her medication and other bills amid soaring inflation, told the AFP news agency: “We want a capable person who knows how to speak up for the Romanian people in the EU.”\n\nAdvertisement\n\nRomania’s president is limited to two five-year terms, and has a semi-executive role that includes commanding the armed forces and chairing the security council that makes decisions on military aid.\n\nThe president represents Romania at EU and NATO summits, can veto important EU votes, and appoints the prime minister, chief judges, prosecutors and top intelligence officials.",
    "clean_body": "farright politician george simion has topped the first round of romania’s presidential election rerun after a vote held in november was annulled over allegations of russian interference simion who leads the alliance for the union of romanians will face off against the centrist mayor of bucharest nicusor dan in a may 18 runoff following sunday’s vote with 99 percent of ballots counted simion had 405 percent of the vote compared to dan’s 209 percent former senator crin antonescu the candidate of the governing coalition came third with 203 percent of the vote polls opened at 7am local time 0400 gmt and closed at 9pm 1800 gmt simion had been expected to win the first round according to exit polls “i want to thank from the bottom of my heart all those who chose to vote for me with the numberone position on the ballot paper” simion said after the exit poll results were released “it was an act of courage trust and solidarity i am grateful and assure them that their trust will not be betrayed” advertisement the constitutional court nullified the result of the last election won by nato critic calin georgescu who was barred from contesting sunday’s rerun georgescu was excluded after authorities said his campaign had been boosted by an inauthentic tiktok campaign and russian meddling sparking sometimes violent protests he was effectively replaced by simion one of 11 candidates for the presidency which plays a large role in shaping foreign policy simion opposes military aid to neighbouring ukraine is critical of european union leadership and says he is aligned with united states president donald trump’s “make america great again” movement prior to the election he was polling at about 30 percent a comfortable lead but well short of the 50 percent needed to avoid a runoff vote dan a mathematician and activist backs ukraine and is running as an independent on a proeu anticorruption platform “george simion equals calin georgescu he gets my vote” aurelia 66 a pensioner who declined to give her last name told the reuters news agency she said she felt “humiliated” by the cancellation of november’s first round “everything is lacking here my children are not here did they leave to work abroad because things were so good here” pensioner eugenia niculescu 65 who lives in bucharest and has struggled to pay for her medication and other bills amid soaring inflation told the afp news agency “we want a capable person who knows how to speak up for the romanian people in the eu” advertisement romania’s president is limited to two fiveyear terms and has a semiexecutive role that includes commanding the armed forces and chairing the security council that makes decisions on military aid the president represents romania at eu and nato summits can veto important eu votes and appoints the prime minister chief judges prosecutors and top intelligence officials",
    "summary": "Far-right politician George Simion has topped the first round of Romania’s presidential election rerun, after a vote held in November was annulled over allegations of Russian interference.\nSimion, who leads the Alliance for the Union of Romanians, will face off against the centrist mayor of Bucharest, Nicusor Dan, in a May 18 run-off following Sunday’s vote.\nWith 99 percent of ballots counted, Simion had 40.5 percent of the vote, compared to Dan’s 20.9 percent.\nSimion had been expected to win the first round, according to exit polls.\nHe was effectively replaced by Simion, one of 11 candidates for the presidency, which plays a large role in shaping foreign policy.",
    "keywords": [
      "union",
      "trust",
      "round",
      "romanias",
      "farright",
      "presidential",
      "simion",
      "vote",
      "told",
      "russian",
      "election",
      "sundays",
      "ukraine",
      "president",
      "tops"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/05/AP25073618688708-1746424210.jpg?resize=1920%2C1440",
    "t": 8
  },
  "https://www.aljazeera.com/news/2025/5/1/kenya-mps-killing-appears-targeted-and-premeditated-police-say": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/5/1/kenya-mps-killing-appears-targeted-and-premeditated-police-say",
    "date": "2025-05-01",
    "time": "00:00:00",
    "title": "Kenya MP’s killing appears ‘targeted and premeditated’, police say",
    "body": "Charles Ong’ondo Were had complained his life was in danger before attack, local reports say\n\nThe fatal shooting of an opposition MP in Kenya appears to have been a targeted killing, police have said.\n\nCharles Ong’ondo Were was shot dead on Wednesday evening after his vehicle stopped at a traffic light on Ngong Road, in the capital Nairobi, according to police.\n\nPolice said bystanders witnessed the passenger of a motorcycle open fire on the MP’s car while it was stopped at the junction.\n\n“The nature of this crime appears to be both targeted and premeditated,” National Police Service spokesperson Muchiri Nyaga said in a statement.\n\n“At this stage, it is too early to provide further details,” Nyaga added.\n\nWere served as a legislator for the constituency of Kasipul, in western Kenya, under the banner of the centre-left Orange Democratic Movement, which arose out of opposition to a 2005 proposal to replace the constitution with a text that critics said placed exorbitant power in the presidency.\n\nKenya’s Daily Nation newspaper reported that Were had “openly complained his life was in danger”.\n\nAdvertisement\n\nKenyan President William Ruto, allied with the centre-right United Democratic Alliance, expressed his condolences to Were’s family and the people of Kasipul.\n\n“We urge the police to conduct a thorough investigation into this incident,” Ruto said on X.\n\n“Those responsible must be held to account.”\n\nFormer Prime Minister Raila Odinga, who founded the Orange Democratic Movement, said Kenya had lost a “gallant son of the soil”.\n\nOdinga challenged the results of the 2022 election after losing to Ruto, claiming in a petition to the Supreme Court that the poll had been tainted by “premeditated unlawful and criminal subversion”.\n\nIn March, Odinga and Ruto signed a memorandum of understanding to work together in a “broad-based government”.",
    "clean_body": "charles ong’ondo were had complained his life was in danger before attack local reports say the fatal shooting of an opposition mp in kenya appears to have been a targeted killing police have said charles ong’ondo were was shot dead on wednesday evening after his vehicle stopped at a traffic light on ngong road in the capital nairobi according to police police said bystanders witnessed the passenger of a motorcycle open fire on the mp’s car while it was stopped at the junction “the nature of this crime appears to be both targeted and premeditated” national police service spokesperson muchiri nyaga said in a statement “at this stage it is too early to provide further details” nyaga added were served as a legislator for the constituency of kasipul in western kenya under the banner of the centreleft orange democratic movement which arose out of opposition to a 2005 proposal to replace the constitution with a text that critics said placed exorbitant power in the presidency kenya’s daily nation newspaper reported that were had “openly complained his life was in danger” advertisement kenyan president william ruto allied with the centreright united democratic alliance expressed his condolences to were’s family and the people of kasipul “we urge the police to conduct a thorough investigation into this incident” ruto said on x “those responsible must be held to account” former prime minister raila odinga who founded the orange democratic movement said kenya had lost a “gallant son of the soil” odinga challenged the results of the 2022 election after losing to ruto claiming in a petition to the supreme court that the poll had been tainted by “premeditated unlawful and criminal subversion” in march odinga and ruto signed a memorandum of understanding to work together in a “broadbased government”",
    "summary": "Charles Ong’ondo Were had complained his life was in danger before attack, local reports sayThe fatal shooting of an opposition MP in Kenya appears to have been a targeted killing, police have said.\nPolice said bystanders witnessed the passenger of a motorcycle open fire on the MP’s car while it was stopped at the junction.\n“The nature of this crime appears to be both targeted and premeditated,” National Police Service spokesperson Muchiri Nyaga said in a statement.\n“Those responsible must be held to account.”Former Prime Minister Raila Odinga, who founded the Orange Democratic Movement, said Kenya had lost a “gallant son of the soil”.\nIn March, Odinga and Ruto signed a memorandum of understanding to work together in a “broad-based government”.",
    "keywords": [
      "premeditated",
      "appears",
      "ruto",
      "orange",
      "targeted",
      "democratic",
      "opposition",
      "say",
      "stopped",
      "kenya",
      "killing",
      "odinga",
      "mps",
      "ongondo"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/05/AFP__20250501__446J42H__v2__HighRes__TopshotKenyaPoliticsCrime-1746087633.jpg?resize=1920%2C1440",
    "t": 11
  }
}