{
  "https://www.aljazeera.com/news/2025/4/21/pope-francis-obituary": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/21/pope-francis-obituary",
    "date": "2025-04-21",
    "time": "00:00:00",
    "title": "Pope Francis, pontiff who pushed church boundaries — but didn’t break them",
    "body": "The pope, who pushed for a less opaque Vatican and connected to common and marginalised people’s concerns, died aged 88.\n\nPope Francis, the Argentinian pontiff who brought the plight of the world’s most marginalised back to the centre of the Roman Catholic Church’s attention, has died aged 88, the Vatican announced on Monday.\n\nA charismatic communicator with a friendly demeanour, Francis succeeded in broadening Catholicism’s appeal at a time of growing disenchantment towards the Church, an institution embroiled in financial and sexual scandals.\n\nThroughout his papacy from 2013 to 2025, the pope stripped the Vatican of some layers of opacity and connected with the concerns of common people. He highlighted the plight of the poor and that of prisoners.\n\nFrancis condemned the Church’s abuse of power while engaging with other faiths.\n\nFrancis’s tone marked a radical departure from his predecessor, Benedict XVI, who believed that nurturing the Church’s most ardent believers was the way to strengthen the institution.\n\nBut Francis’s shift never translated into fundamental changes to the Church’s doctrine on contentious issues. In most instances, he remained in line with previous papacies, staunchly opposing gay marriage, women becoming priests and priests marrying.\n\nAdvertisement\n\nStill, his steps to open up the Church drew the ire of traditionalists, while the lack of radical change under his watch drew criticism from progressives.\n\nReligious pluralism and inequality\n\nFrancis was born Jorge Mario Bergoglio in 1936 in the Argentinian capital, Buenos Aires, to immigrant parents who fled Italy’s fascist dictatorship of Benito Mussolini.\n\nHe trained as a chemical technician, worked in the food processing industry, and, for a brief time, was a bouncer in a nightclub in Cordoba before becoming a priest in 1969.\n\nHe liked to dance tango, although he preferred milonga, Francis said in a 2010 interview, referring to the faster-paced music that preceded tango.\n\nHis upbringing in Buenos Aires exposed him to religious pluralism and socioeconomic inequalities – two factors that experts believe explain his commitment to interfaith dialogue and pointed criticism of capitalism and consumerism.\n\nAt just 36 years of age, he became the head of Argentina’s Jesuits, a Roman Catholic order of priests.\n\nBack then, he was a stern disciplinarian, experts and biographers say. At the time, liberation theology, a left-wing interpretation of the Gospel that centred on concern for the poor and oppressed groups, was popular among Jesuits in Latin America, but Francis did not subscribe to the ideology.\n\nAdvertisement\n\nDirty War\n\nFrancis’s tenure then coincided with the years of Argentina’s Dirty War, which lasted from 1976 to 1983 – seven years of brutal military dictatorship.\n\nTens of thousands of people were tortured, killed and disappeared. The role of Argentina’s Church in those years remains contentious, with Francis never openly denouncing the regime.\n\nAs archbishop of Buenos Aires, a position he assumed in 1998, he said he was not aware of the scale of what was happening in the late 1970s – a position refuted by critics and associates who argue that there was no way he could not have known at the time.\n\n“Let us pray … for the complicit silence of most of society and of the Church,” he said during a ceremony in 1999, a quote some read as an admission of complacency.\n\nDuring his time as archbishop, he would become an outspoken critic of social injustice and economic inequality.\n\n“The Church can’t just sit sucking its finger when faced with a frivolous, cold and calculating market economy,” he once said during a sermon.\n\nBreaking with tradition\n\nIn 2013, the Catholic world was shocked when the then-Pope Benedict XVI resigned, breaking a centuries-old tradition of holding papal duties until death.\n\nFrancis, who by then had been elected cardinal, rushed to the Vatican to vote for a new pope.\n\nIn what was a tight race, Francis, who had already been a runner-up in the previous papal conclave in 2005, was elected.\n\nAdvertisement\n\nWith him, the Church chose its first non-European pontiff in 1,282 years – the last one was Gregory III, elected in 731 from Syria – and also its first leader since then from the Global South, which today is home to the majority of Christians worldwide.\n\nFrancis set the tone of his papacy immediately. When he stood on the large balcony and faced the huge crowd in Saint Peter’s Square after being elected, he broke with the tradition of blessing the crowd, asking people instead to pray for him.\n\nHe refused to move to the grand papal apartment on the top floor of the Vatican palace, opting to stay in the more modest Domus Sanctae Marthae residence. He preferred to be driven around in a Fiat rather than a Mercedes-Benz.\n\n“Be shepherds with the smell of sheep,” he told a crowd of priests in 2013, urging a departure from the pomp and splendour often associated with the clergy’s top hierarchy.\n\nOn his first trip outside Rome as pope, he travelled to Lampedusa, an Italian island and key point of entry for migrants and refugees trying to reach Europe. He threw a crown of flowers into the sea to commemorate the people who died in the Mediterranean Sea while risking their lives to come to Europe.\n\nFrancis criticised then-US President Donald Trump’s plan in 2017 to build a wall along the Mexican border and his speeches targeting Muslims.\n\n“In Pope Francis, the message that ‘everybody is brothers and sisters’ is very strong, along with insisting that God pushes for religious pluralism,” said Marco Politi, a Vatican expert and author of the book Pope Francis Among the Wolves: The Inside Story of a Revolution.\n\nAdvertisement\n\nSuch pluralism translated into a more inclusive approach towards other religions, Politi said, putting an end to the “culture war of previous papacies”.\n\nFrom the Vatican to the Arabian Peninsula\n\nTies between the Church and Muslims around the world had soured when Francis’s predecessor, Benedict XVI, made a speech in September 2006 that was perceived as linking Islam to violence.\n\nFrancis became the first pontiff ever to travel to the Arabian Peninsula. In February 2019, he landed in the United Arab Emirates, where he met Ahmed el-Tayeb, the grand imam of Cairo’s Al-Azhar Mosque.\n\nTogether, they signed a document rejecting religious fundamentalism, exhorting people to see in the other a “brother to support and love”. The pope had also met el-Tayeb previously, in 2016, at the Vatican.\n\nIn another first, Francis, in 2015, published the encyclical Laudato si’ (Praise be to you), in which he urged the world to address the threat of climate change while also stressing the need to rethink the economic balance between the industrialised and developing worlds.\n\nResponse to sexual abuse in the Church\n\nThe issue of sexual abuses perpetrated by Church officials dominated the tenure of Benedict XVI, whose papacy saw a wave of scandals.\n\nFrancis began addressing the issue of abuse in 2019 by abolishing the rule of “pontifical secrecy” on cases related to sexual violence.\n\nThis meant that testimonies collected in the canonical process were finally made available to legal authorities.\n\nThat same year, after the pope himself admitted to having dismissed valid claims of sexual abuse in Chile, he introduced a law outlining clear rules for reporting child sexual abuse committed by Church officials and attempts to cover it up.\n\nAdvertisement\n\nFour years later, that rule was updated and strengthened to widen the category of victims to vulnerable adults, while laypeople working for the Church could also now face punishment. But victims’ advocates and critics say Francis did not go far enough to ensure justice.\n\n‘Who am I to judge?’\n\nFrancis drastically changed the tone of the Church towards homosexuality, ending the Vatican’s long demonisation of gay people.\n\n“Who am I to judge?” he famously said in 2013, his words a stark contrast to those of Pope John Paul II, who more than 10 years earlier called a gay rights march in Rome “an offence to Christian values”.\n\nMore recently, on his way back from a trip to South Sudan, Francis said being gay was not a crime.\n\nHe expressed support for same-sex civil unions. In 2023, he hinted that he was open to reviewing the practice of celibacy.\n\nIn December 2023, the Vatican, in a landmark ruling, decided that Catholic priests would be able to administer blessings to same-sex couples, provided these were not given in the context of civil unions or weddings or Church liturgies.\n\nAt the same time, the pontiff remained opposed to gay marriage and abortion, and while he included women in the Vatican’s government, he always ruled out their becoming priests.\n\nThroughout his papacy, Francis often found himself under attack from both conservative and progressive camps.\n\nAdvertisement\n\nThose following the traditional doctrine saw him as too much of a reformer and a socialist, while those seeking deeper changes within the Church did not consider him bold enough.\n\nPoliti, the Vatican expert, argues that Francis’s decision not to make changes that were too radical stemmed from an understanding that this would have torn apart an already much-divided Church. Instead, he says, Francis opted “to trigger processes of transformation in its mentality through gestures and words”.",
    "clean_body": "the pope who pushed for a less opaque vatican and connected to common and marginalised people’s concerns died aged 88 pope francis the argentinian pontiff who brought the plight of the world’s most marginalised back to the centre of the roman catholic church’s attention has died aged 88 the vatican announced on monday a charismatic communicator with a friendly demeanour francis succeeded in broadening catholicism’s appeal at a time of growing disenchantment towards the church an institution embroiled in financial and sexual scandals throughout his papacy from 2013 to 2025 the pope stripped the vatican of some layers of opacity and connected with the concerns of common people he highlighted the plight of the poor and that of prisoners francis condemned the church’s abuse of power while engaging with other faiths francis’s tone marked a radical departure from his predecessor benedict xvi who believed that nurturing the church’s most ardent believers was the way to strengthen the institution but francis’s shift never translated into fundamental changes to the church’s doctrine on contentious issues in most instances he remained in line with previous papacies staunchly opposing gay marriage women becoming priests and priests marrying advertisement still his steps to open up the church drew the ire of traditionalists while the lack of radical change under his watch drew criticism from progressives religious pluralism and inequality francis was born jorge mario bergoglio in 1936 in the argentinian capital buenos aires to immigrant parents who fled italy’s fascist dictatorship of benito mussolini he trained as a chemical technician worked in the food processing industry and for a brief time was a bouncer in a nightclub in cordoba before becoming a priest in 1969 he liked to dance tango although he preferred milonga francis said in a 2010 interview referring to the fasterpaced music that preceded tango his upbringing in buenos aires exposed him to religious pluralism and socioeconomic inequalities – two factors that experts believe explain his commitment to interfaith dialogue and pointed criticism of capitalism and consumerism at just 36 years of age he became the head of argentina’s jesuits a roman catholic order of priests back then he was a stern disciplinarian experts and biographers say at the time liberation theology a leftwing interpretation of the gospel that centred on concern for the poor and oppressed groups was popular among jesuits in latin america but francis did not subscribe to the ideology advertisement dirty war francis’s tenure then coincided with the years of argentina’s dirty war which lasted from 1976 to 1983 – seven years of brutal military dictatorship tens of thousands of people were tortured killed and disappeared the role of argentina’s church in those years remains contentious with francis never openly denouncing the regime as archbishop of buenos aires a position he assumed in 1998 he said he was not aware of the scale of what was happening in the late 1970s – a position refuted by critics and associates who argue that there was no way he could not have known at the time “let us pray … for the complicit silence of most of society and of the church” he said during a ceremony in 1999 a quote some read as an admission of complacency during his time as archbishop he would become an outspoken critic of social injustice and economic inequality “the church can’t just sit sucking its finger when faced with a frivolous cold and calculating market economy” he once said during a sermon breaking with tradition in 2013 the catholic world was shocked when the thenpope benedict xvi resigned breaking a centuriesold tradition of holding papal duties until death francis who by then had been elected cardinal rushed to the vatican to vote for a new pope in what was a tight race francis who had already been a runnerup in the previous papal conclave in 2005 was elected advertisement with him the church chose its first noneuropean pontiff in 1282 years – the last one was gregory iii elected in 731 from syria – and also its first leader since then from the global south which today is home to the majority of christians worldwide francis set the tone of his papacy immediately when he stood on the large balcony and faced the huge crowd in saint peter’s square after being elected he broke with the tradition of blessing the crowd asking people instead to pray for him he refused to move to the grand papal apartment on the top floor of the vatican palace opting to stay in the more modest domus sanctae marthae residence he preferred to be driven around in a fiat rather than a mercedesbenz “be shepherds with the smell of sheep” he told a crowd of priests in 2013 urging a departure from the pomp and splendour often associated with the clergy’s top hierarchy on his first trip outside rome as pope he travelled to lampedusa an italian island and key point of entry for migrants and refugees trying to reach europe he threw a crown of flowers into the sea to commemorate the people who died in the mediterranean sea while risking their lives to come to europe francis criticised thenus president donald trump’s plan in 2017 to build a wall along the mexican border and his speeches targeting muslims “in pope francis the message that ‘everybody is brothers and sisters’ is very strong along with insisting that god pushes for religious pluralism” said marco politi a vatican expert and author of the book pope francis among the wolves the inside story of a revolution advertisement such pluralism translated into a more inclusive approach towards other religions politi said putting an end to the “culture war of previous papacies” from the vatican to the arabian peninsula ties between the church and muslims around the world had soured when francis’s predecessor benedict xvi made a speech in september 2006 that was perceived as linking islam to violence francis became the first pontiff ever to travel to the arabian peninsula in february 2019 he landed in the united arab emirates where he met ahmed eltayeb the grand imam of cairo’s alazhar mosque together they signed a document rejecting religious fundamentalism exhorting people to see in the other a “brother to support and love” the pope had also met eltayeb previously in 2016 at the vatican in another first francis in 2015 published the encyclical laudato si’ praise be to you in which he urged the world to address the threat of climate change while also stressing the need to rethink the economic balance between the industrialised and developing worlds response to sexual abuse in the church the issue of sexual abuses perpetrated by church officials dominated the tenure of benedict xvi whose papacy saw a wave of scandals francis began addressing the issue of abuse in 2019 by abolishing the rule of “pontifical secrecy” on cases related to sexual violence this meant that testimonies collected in the canonical process were finally made available to legal authorities that same year after the pope himself admitted to having dismissed valid claims of sexual abuse in chile he introduced a law outlining clear rules for reporting child sexual abuse committed by church officials and attempts to cover it up advertisement four years later that rule was updated and strengthened to widen the category of victims to vulnerable adults while laypeople working for the church could also now face punishment but victims’ advocates and critics say francis did not go far enough to ensure justice ‘who am i to judge’ francis drastically changed the tone of the church towards homosexuality ending the vatican’s long demonisation of gay people “who am i to judge” he famously said in 2013 his words a stark contrast to those of pope john paul ii who more than 10 years earlier called a gay rights march in rome “an offence to christian values” more recently on his way back from a trip to south sudan francis said being gay was not a crime he expressed support for samesex civil unions in 2023 he hinted that he was open to reviewing the practice of celibacy in december 2023 the vatican in a landmark ruling decided that catholic priests would be able to administer blessings to samesex couples provided these were not given in the context of civil unions or weddings or church liturgies at the same time the pontiff remained opposed to gay marriage and abortion and while he included women in the vatican’s government he always ruled out their becoming priests throughout his papacy francis often found himself under attack from both conservative and progressive camps advertisement those following the traditional doctrine saw him as too much of a reformer and a socialist while those seeking deeper changes within the church did not consider him bold enough politi the vatican expert argues that francis’s decision not to make changes that were too radical stemmed from an understanding that this would have torn apart an already muchdivided church instead he says francis opted “to trigger processes of transformation in its mentality through gestures and words”",
    "summary": "The pope, who pushed for a less opaque Vatican and connected to common and marginalised people’s concerns, died aged 88.\nPope Francis, the Argentinian pontiff who brought the plight of the world’s most marginalised back to the centre of the Roman Catholic Church’s attention, has died aged 88, the Vatican announced on Monday.\nIn most instances, he remained in line with previous papacies, staunchly opposing gay marriage, women becoming priests and priests marrying.\nFrancis, who by then had been elected cardinal, rushed to the Vatican to vote for a new pope.\n“In Pope Francis, the message that ‘everybody is brothers and sisters’ is very strong, along with insisting that God pushes for religious pluralism,” said Marco Politi, a Vatican expert and author of the book Pope Francis Among the Wolves: The Inside Story of a Revolution.",
    "keywords": [
      "xvi",
      "didnt",
      "francis",
      "pope",
      "abuse",
      "priests",
      "sexual",
      "break",
      "pontiff",
      "pushed",
      "vatican",
      "church",
      "gay",
      "boundaries"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/2023-06-15T115115Z_891922835_RC29E1AZW0XJ_RTRMADP_3_POPE-BENEDICT-GAENSWEIN-1689342398-1745231666.jpg?resize=1200%2C630&quality=80",
    "t": 21
  },
  "https://www.aljazeera.com/news/2025/4/16/ukraine-renews-martial-law": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/16/ukraine-renews-martial-law",
    "date": "2025-04-16",
    "time": "00:00:00",
    "title": "Ukraine prolongs martial law amid Russian air attacks, heavy ground battles",
    "body": "The measure enables Ukraine to further delay elections, despite pressure for a presidential vote from the US and Russia.\n\nUkraine’s parliament has voted to extend martial law and military mobilisation for another three months, prolonging the wartime measures until at least August 6.\n\nLawmaker Yaroslav Zheleznyak said the extension of martial law passed by a 357-1 vote, while a measure to maintain troop mobilisation was approved 356-1.\n\nUnder Ukraine’s constitution, elections cannot be held during martial law – a provision that remains in effect despite external calls, including from Russia and the United States, for a timeline on a future vote.\n\nRussia’s President Vladimir Putin has repeatedly questioned the legitimacy of his Ukrainian counterpart, Volodymyr Zelenskyy, whose five-year term was originally due to end in May last year, and even raised the prospect of a temporary United Nations-backed government to lead Ukraine to elections.\n\nReacting to the martial law extension, Kremlin spokesman Dmitry Peskov accused Kyiv of trying to “preserve its unstable structure”.\n\nIn February, US President Donald Trump described Zelenskyy as a “dictator without elections”, prompting Ukrainians to rally around their leader and boosting his approval ratings.\n\nAdvertisement\n\nAs peace talks led by the Trump administration created hopes for a potential ceasefire and eventual elections, some Ukrainian opposition politicians have grown more vocal in their criticism of Zelenskyy. Still, there is broad support for maintaining martial law.\n\nPetro Poroshenko, a former president and leader of the country’s largest opposition party, said there was no doubt martial law should be prolonged, but accused Zelenskyy of attempting to use the measure to shore up his powers.\n\n“I want to stress that we should recognise the obvious – the government has started to abuse martial law, using it not only to defend the country, but to build an authoritarian regime,” Poroshenko said during parliamentary debates on Tuesday.\n\nUncertainty over energy strike moratorium\n\nThe martial law vote came as heavy fighting and air attacks continued between Russia and Ukraine, now in the 38th month of gruelling war.\n\nAn overnight Russian drone attack on the Black Sea port city of Odesa injured three people and damaged homes, while various morning air and artillery attacks killed at least one person in the southern city of Kherson, according to Ukrainian officials.\n\nMeanwhile, the Russian military said its forces captured the eastern Ukrainian village of Kalynove, another small claimed advance in the embattled Donetsk region.\n\nThe Russian Ministry of Defence also accused Ukraine of carrying out six attacks on the country’s energy infrastructure, despite a mutually-agreed 30-day moratorium on such strikes.\n\nAdvertisement\n\nIt is unclear if the pause on attacks on energy infrastructure, due to expire on Wednesday, will be extended.\n\n“We’ll keep you informed. I am not yet ready to tell you what decision has been made,” Peskov told reporters when asked about whether Russia would extend the moratorium.",
    "clean_body": "the measure enables ukraine to further delay elections despite pressure for a presidential vote from the us and russia ukraine’s parliament has voted to extend martial law and military mobilisation for another three months prolonging the wartime measures until at least august 6 lawmaker yaroslav zheleznyak said the extension of martial law passed by a 3571 vote while a measure to maintain troop mobilisation was approved 3561 under ukraine’s constitution elections cannot be held during martial law – a provision that remains in effect despite external calls including from russia and the united states for a timeline on a future vote russia’s president vladimir putin has repeatedly questioned the legitimacy of his ukrainian counterpart volodymyr zelenskyy whose fiveyear term was originally due to end in may last year and even raised the prospect of a temporary united nationsbacked government to lead ukraine to elections reacting to the martial law extension kremlin spokesman dmitry peskov accused kyiv of trying to “preserve its unstable structure” in february us president donald trump described zelenskyy as a “dictator without elections” prompting ukrainians to rally around their leader and boosting his approval ratings advertisement as peace talks led by the trump administration created hopes for a potential ceasefire and eventual elections some ukrainian opposition politicians have grown more vocal in their criticism of zelenskyy still there is broad support for maintaining martial law petro poroshenko a former president and leader of the country’s largest opposition party said there was no doubt martial law should be prolonged but accused zelenskyy of attempting to use the measure to shore up his powers “i want to stress that we should recognise the obvious – the government has started to abuse martial law using it not only to defend the country but to build an authoritarian regime” poroshenko said during parliamentary debates on tuesday uncertainty over energy strike moratorium the martial law vote came as heavy fighting and air attacks continued between russia and ukraine now in the 38th month of gruelling war an overnight russian drone attack on the black sea port city of odesa injured three people and damaged homes while various morning air and artillery attacks killed at least one person in the southern city of kherson according to ukrainian officials meanwhile the russian military said its forces captured the eastern ukrainian village of kalynove another small claimed advance in the embattled donetsk region the russian ministry of defence also accused ukraine of carrying out six attacks on the country’s energy infrastructure despite a mutuallyagreed 30day moratorium on such strikes advertisement it is unclear if the pause on attacks on energy infrastructure due to expire on wednesday will be extended “we’ll keep you informed i am not yet ready to tell you what decision has been made” peskov told reporters when asked about whether russia would extend the moratorium",
    "summary": "Ukraine’s parliament has voted to extend martial law and military mobilisation for another three months, prolonging the wartime measures until at least August 6.\nLawmaker Yaroslav Zheleznyak said the extension of martial law passed by a 357-1 vote, while a measure to maintain troop mobilisation was approved 356-1.\nReacting to the martial law extension, Kremlin spokesman Dmitry Peskov accused Kyiv of trying to “preserve its unstable structure”.\nStill, there is broad support for maintaining martial law.\nUncertainty over energy strike moratoriumThe martial law vote came as heavy fighting and air attacks continued between Russia and Ukraine, now in the 38th month of gruelling war.",
    "keywords": [
      "heavy",
      "prolongs",
      "martial",
      "amid",
      "russia",
      "vote",
      "law",
      "russian",
      "battles",
      "ukrainian",
      "elections",
      "ukraine",
      "ground",
      "attacks",
      "zelenskyy"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20240823__36EQ4BK__v1__HighRes__UkraineRussiaConflictWar-1744806522.jpg?resize=1920%2C1440",
    "t": 26
  },
  "https://www.aljazeera.com/news/2025/4/29/australia-opens-mushroom-murder-trial": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/29/australia-opens-mushroom-murder-trial",
    "date": "2025-04-29",
    "time": "00:00:00",
    "title": "Australia opens mushroom murder trial",
    "body": "The case of Erin Patterson, accused of killing three with toxic Beef Wellington, has gripped the nation.\n\nThe trial of a woman accused of murdering three elderly people after serving them poisonous mushrooms for lunch has begun in Australia.\n\nErin Patterson, 50, faces trial by jury at Latrobe Valley Magistrates’ Court in the state of Victoria in southeastern Australia, after she allegedly served up Beef Wellington laced with toxic mushrooms to four guests – including her estranged in-laws – in 2023.\n\nThree of the quartet did not survive and Patterson is charged with the murders of her mother-in-law Gail Patterson, father-in-law Donald Patterson, and Gail’s sister Heather Wilkinson.\n\nProsecutors have dropped charges regarding the attempted murder of Ian Wilkinson, Heather’s husband, who recovered after nearly two months in hospital in Leongatha, a town of about 6,000 people some 135km (85 miles) from Melbourne.\n\nPatterson has pleaded not guilty on all counts.\n\nJury selection began at the court on Tuesday. Opening arguments in the case, which has gripped Australia and made headlines across the world, are expected to begin on Wednesday morning.\n\nAdvertisement\n\nThe case has generated a string of podcasts and even a television documentary series on Australian streaming service Stan.\n\nSix seats in the courtroom reserved for media are being allocated in a daily ballot. Dozens more are expected to watch proceedings in an overflow room set up at the court.\n\nWhile the court is open to the public, the case will not be televised. The trial is expected to run for five to six weeks.\n\nVictoria’s Supreme Court has imposed strict guidelines on reporting about the case to ensure a fair trial.",
    "clean_body": "the case of erin patterson accused of killing three with toxic beef wellington has gripped the nation the trial of a woman accused of murdering three elderly people after serving them poisonous mushrooms for lunch has begun in australia erin patterson 50 faces trial by jury at latrobe valley magistrates’ court in the state of victoria in southeastern australia after she allegedly served up beef wellington laced with toxic mushrooms to four guests – including her estranged inlaws – in 2023 three of the quartet did not survive and patterson is charged with the murders of her motherinlaw gail patterson fatherinlaw donald patterson and gail’s sister heather wilkinson prosecutors have dropped charges regarding the attempted murder of ian wilkinson heather’s husband who recovered after nearly two months in hospital in leongatha a town of about 6000 people some 135km 85 miles from melbourne patterson has pleaded not guilty on all counts jury selection began at the court on tuesday opening arguments in the case which has gripped australia and made headlines across the world are expected to begin on wednesday morning advertisement the case has generated a string of podcasts and even a television documentary series on australian streaming service stan six seats in the courtroom reserved for media are being allocated in a daily ballot dozens more are expected to watch proceedings in an overflow room set up at the court while the court is open to the public the case will not be televised the trial is expected to run for five to six weeks victoria’s supreme court has imposed strict guidelines on reporting about the case to ensure a fair trial",
    "summary": "The case of Erin Patterson, accused of killing three with toxic Beef Wellington, has gripped the nation.\nThe trial of a woman accused of murdering three elderly people after serving them poisonous mushrooms for lunch has begun in Australia.\nOpening arguments in the case, which has gripped Australia and made headlines across the world, are expected to begin on Wednesday morning.\nThe trial is expected to run for five to six weeks.\nVictoria’s Supreme Court has imposed strict guidelines on reporting about the case to ensure a fair trial.",
    "keywords": [
      "trial",
      "expected",
      "murder",
      "gripped",
      "australia",
      "case",
      "mushrooms",
      "mushroom",
      "wellington",
      "patterson",
      "court",
      "beef",
      "opens",
      "toxic"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2023/08/9742MU-highres-1691649841.jpg?resize=1920%2C1440",
    "t": 13
  },
  "https://www.aljazeera.com/news/2025/4/22/putin-hints-at-direct-talks-with-ukraine": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/22/putin-hints-at-direct-talks-with-ukraine",
    "date": "2025-04-22",
    "time": "00:00:00",
    "title": "Putin hints at direct talks with Ukraine; Zelenskyy says only after truce",
    "body": "Russian President Vladimir Putin has indicated he is open to the prospect of direct talks with Kyiv, but his Ukrainian counterpart, Volodymyr Zelenskyy, says that will happen only after a ceasefire.\n\nPutin told Russian state TV on Monday that he had a “positive attitude towards any peace initiatives” and he hoped Kyiv would “feel the same way”. However, his spokesman stressed on Tuesday that there are currently no concrete plans for talks between Russia and Ukraine.\n\nZelenskyy countered this later at a briefing on Tuesday, a day before key talks in London seeking a potential settlement in the Russia-Ukraine war. “After the ceasefire, we are ready to sit down in any format,” he said.\n\nMoscow and Kyiv have held no bilateral talks since the immediate aftermath of Russia’s February 2022 invasion of its neighbour. However, the United States has been raising the pressure on them to agree to a ceasefire.\n\nPutin’s comments, which a spokesman said on Monday meant that he was open to direct talks, followed the expiration of a Russian-declared, 30-hour Easter truce, which each side accused the other of violating.\n\nAdvertisement\n\nZelenskyy did not respond directly to Putin’s comments, but he signalled in a nightly video address that Ukraine was “ready for any conversation” about a ceasefire that would stop attacks on civilians.\n\nNow, after Easter, the whole world can clearly see the real issue — the real reason why the hostilities continue. Russia is the source of this war. It is from Moscow that a real order must come for the Russian army to cease fire. And if there is no such firm Russian order for… pic.twitter.com/jS9cTiRQqd — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) April 21, 2025\n\nOn Sunday, Zelenskyy had proposed a follow-up to the Easter truce that would “cease any strikes using long-range drones and missiles on civilian infrastructure for a period of at least 30 days”.\n\nPutin said on Monday that Russia would “analyse everything and take the corresponding decisions” but questioned how it would work as he accused Ukraine of using civilian buildings such as restaurants and universities for military purposes.\n\nZelenskyy pressed Putin further, saying Ukraine stood by its offer – “at the very least, not to strike civilian infrastructure” – and that he expected a “clear answer” from Moscow.\n\n‘Nuances’\n\nThe hint of the possibility of direct talks comes after US President Donald Trump threatened to walk away from efforts to broker a ceasefire unless progress is made. At the same time, the US leader continued on Monday to express hope that a deal is close and could even be reached this week.\n\nAdvertisement\n\nHowever, Kremlin spokesman Dmitry Peskov appeared to be seeking to backpedal on Tuesday as he clarified that no bilateral talks are currently planned and told reporters that, while Russia is ready to consider Zelenskyy’s proposal, the issue is complex.\n\n“The president explained the complexity of this topic. … If we talk about civilian infrastructure facilities, we need to clearly differentiate in what situations these facilities can be a military target and in what situations they cannot,” he said.\n\nPeskov added that if Ukraine wanted to talk, then it should take steps to “legally clear the obstacles to such contacts”, an apparent reference to a 2022 Zelenskyy decree barring negotiations with Putin, which he issued after Russia declared the annexation of four Ukrainian regions that its forces partly control.\n\nUkraine and its European allies have told Washington it should not be fooled into believing Russian claims that it is ready to discuss a ceasefire, insisting that Moscow is using delaying tactics.\n\nNegotiators from the US, Ukraine, the United Kingdom and France are due to meet in London on Wednesday for another round of talks on ending the war, Zelenskyy said.\n\nThe discussions are a follow-up to a similar meeting in Paris last week.\n\nAt that meeting, Europe expressed its red lines over Ukraine to the US, French Foreign Minister Jean-Noel Barrot said on Tuesday.\n\nHe also suggested in an interview with France Info radio that the Easter truce had been a marketing operation designed by Putin and aimed at defusing Trump’s growing impatience over Russia’s failure to agree to a ceasefire.\n\nAdvertisement\n\nRussian state media, meanwhile, quoted Kremlin aide Yuri Ushakov as saying US presidential envoy Steve Witkoff was expected in Moscow this week on what would be his fourth trip since Trump took office on January 20.\n\nAmid the push for an end to the fighting, in which Trump appears ready to accept many of Moscow’s demands and gains, Russia is eager to press home its military advantage on the battlefield.\n\nUkraine’s air force reported another overnight barrage of missiles and drones on Tuesday, saying Russia launched 54 drones.\n\nMeanwhile, Russian media said the military had retaken the Gornal St Nicholas Belogorsky Monastery, one of the last positions held by Ukrainian troops in Russia’s Kursk region.",
    "clean_body": "russian president vladimir putin has indicated he is open to the prospect of direct talks with kyiv but his ukrainian counterpart volodymyr zelenskyy says that will happen only after a ceasefire putin told russian state tv on monday that he had a “positive attitude towards any peace initiatives” and he hoped kyiv would “feel the same way” however his spokesman stressed on tuesday that there are currently no concrete plans for talks between russia and ukraine zelenskyy countered this later at a briefing on tuesday a day before key talks in london seeking a potential settlement in the russiaukraine war “after the ceasefire we are ready to sit down in any format” he said moscow and kyiv have held no bilateral talks since the immediate aftermath of russia’s february 2022 invasion of its neighbour however the united states has been raising the pressure on them to agree to a ceasefire putin’s comments which a spokesman said on monday meant that he was open to direct talks followed the expiration of a russiandeclared 30hour easter truce which each side accused the other of violating advertisement zelenskyy did not respond directly to putin’s comments but he signalled in a nightly video address that ukraine was “ready for any conversation” about a ceasefire that would stop attacks on civilians now after easter the whole world can clearly see the real issue — the real reason why the hostilities continue russia is the source of this war it is from moscow that a real order must come for the russian army to cease fire and if there is no such firm russian order for… pictwittercomjs9ctirqqd — volodymyr zelenskyy володимир зеленський zelenskyyua april 21 2025 on sunday zelenskyy had proposed a followup to the easter truce that would “cease any strikes using longrange drones and missiles on civilian infrastructure for a period of at least 30 days” putin said on monday that russia would “analyse everything and take the corresponding decisions” but questioned how it would work as he accused ukraine of using civilian buildings such as restaurants and universities for military purposes zelenskyy pressed putin further saying ukraine stood by its offer – “at the very least not to strike civilian infrastructure” – and that he expected a “clear answer” from moscow ‘nuances’ the hint of the possibility of direct talks comes after us president donald trump threatened to walk away from efforts to broker a ceasefire unless progress is made at the same time the us leader continued on monday to express hope that a deal is close and could even be reached this week advertisement however kremlin spokesman dmitry peskov appeared to be seeking to backpedal on tuesday as he clarified that no bilateral talks are currently planned and told reporters that while russia is ready to consider zelenskyy’s proposal the issue is complex “the president explained the complexity of this topic … if we talk about civilian infrastructure facilities we need to clearly differentiate in what situations these facilities can be a military target and in what situations they cannot” he said peskov added that if ukraine wanted to talk then it should take steps to “legally clear the obstacles to such contacts” an apparent reference to a 2022 zelenskyy decree barring negotiations with putin which he issued after russia declared the annexation of four ukrainian regions that its forces partly control ukraine and its european allies have told washington it should not be fooled into believing russian claims that it is ready to discuss a ceasefire insisting that moscow is using delaying tactics negotiators from the us ukraine the united kingdom and france are due to meet in london on wednesday for another round of talks on ending the war zelenskyy said the discussions are a followup to a similar meeting in paris last week at that meeting europe expressed its red lines over ukraine to the us french foreign minister jeannoel barrot said on tuesday he also suggested in an interview with france info radio that the easter truce had been a marketing operation designed by putin and aimed at defusing trump’s growing impatience over russia’s failure to agree to a ceasefire advertisement russian state media meanwhile quoted kremlin aide yuri ushakov as saying us presidential envoy steve witkoff was expected in moscow this week on what would be his fourth trip since trump took office on january 20 amid the push for an end to the fighting in which trump appears ready to accept many of moscow’s demands and gains russia is eager to press home its military advantage on the battlefield ukraine’s air force reported another overnight barrage of missiles and drones on tuesday saying russia launched 54 drones meanwhile russian media said the military had retaken the gornal st nicholas belogorsky monastery one of the last positions held by ukrainian troops in russia’s kursk region",
    "summary": "Russian President Vladimir Putin has indicated he is open to the prospect of direct talks with Kyiv, but his Ukrainian counterpart, Volodymyr Zelenskyy, says that will happen only after a ceasefire.\nHowever, his spokesman stressed on Tuesday that there are currently no concrete plans for talks between Russia and Ukraine.\nZelenskyy countered this later at a briefing on Tuesday, a day before key talks in London seeking a potential settlement in the Russia-Ukraine war.\nMoscow and Kyiv have held no bilateral talks since the immediate aftermath of Russia’s February 2022 invasion of its neighbour.\nZelenskyy pressed Putin further, saying Ukraine stood by its offer – “at the very least, not to strike civilian infrastructure” – and that he expected a “clear answer” from Moscow.",
    "keywords": [
      "easter",
      "ready",
      "military",
      "truce",
      "russia",
      "talks",
      "russian",
      "putin",
      "ukraine",
      "hints",
      "civilian",
      "direct",
      "zelenskyy"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/2025-04-21T144621Z_1603641418_RC2E2EASRDW4_RTRMADP_3_RUSSIA-PUTIN-1745299701.jpg?resize=1920%2C1440",
    "t": 20
  },
  "https://www.aljazeera.com/news/2025/4/16/msf-says-gaza-is-a-mass-grave": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/16/msf-says-gaza-is-a-mass-grave",
    "date": "2025-04-16",
    "time": "00:00:00",
    "title": "Gaza ‘mass grave’ for Palestinians and those helping them: MSF",
    "body": "Palestinian lives are being systematically destroyed as Israel’s continued bombardment of the Gaza Strip shows a “blatant disregard” for the safety of humanitarian workers, according to medical aid agency Doctors Without Borders (MSF).\n\nAmande Bazerolle, MSF’s emergency coordinator in the enclave, said in a statement on Wednesday, “Gaza has been turned into a mass grave of Palestinians and those coming to their assistance.”\n\nLast month, Israeli forces opened fire on ambulances in Gaza, killing 15 medics and rescuers in an incident that prompted international condemnation.\n\n“We are witnessing in real time the destruction and forced displacement of the entire population in Gaza,” she said.\n\nMedical facilities are not exempt from attacks and evacuation orders by Israeli forces. MSF teams have had to leave many facilities, while others continue operating with staff and patients trapped inside, unable to leave safely for hours at a time, the charity said.\n\n“With nowhere safe for Palestinians or those trying to help them, the humanitarian response is severely struggling under the weight of insecurity and critical supply shortages, leaving people with few, if any, options for accessing care,” Bazerolle said.\n\nAdvertisement\n\nIsrael resumed aerial bombardment and ground operations in the Palestinian territory in March after it reneged on a two-month-old ceasefire. Thousands of people have since been killed, with many more displaced. Israel has also blocked humanitarian aid from entering Gaza since March 2.\n\nMedical supplies, fuel, water and other essentials are in short supply, the United Nations says.\n\nIsraeli forces to ‘remain in the security zones’\n\nOn Wednesday, Defence Minister Israel Katz said Israel’s “policy is clear and no humanitarian aid will be allowed into Gaza” as it is “one of the main pressure tools” against Hamas.\n\n“In the current reality, no one is going to allow any humanitarian aid into Gaza, and no preparations are being made to allow any aid of this kind,” he said.\n\nIsraeli forces “will remain in the security zones as a buffer between the enemy and [Israeli] communities in any temporary or permanent situation in Gaza”, he said.\n\nAl Jazeera’s Nour Odeh, reporting from Jordan’s capital, Amman, said the ongoing mediated efforts to get Israel and Hamas to agree on a new ceasefire seem to have reached “a dead end”.\n\n“Israel is trying to extort a temporary ceasefire deal in exchange for allowing critically needed aid back to Gaza. Israel will also only promise to discuss ending its genocidal war on Gaza if Hamas agrees to disarm and exile up to 200 of its members from the Strip,” she said.\n\n“Hamas has shown flexibility on many issues, but the movement says laying down its arms without ending the occupation is a red line. But Hamas is running out of options. Gaza is in ruins. People are running out of hope and patience,” Odeh added.\n\nIsraeli forces have taken over large areas of Gaza in recent weeks. Together with the blockade, continued fighting has worsened the already catastrophic humanitarian situation in Gaza.\n\nAdvertisement\n\nAt least 51,000 people, most of them children and women, have been killed in Israeli attacks since October 2023.",
    "clean_body": "palestinian lives are being systematically destroyed as israel’s continued bombardment of the gaza strip shows a “blatant disregard” for the safety of humanitarian workers according to medical aid agency doctors without borders msf amande bazerolle msf’s emergency coordinator in the enclave said in a statement on wednesday “gaza has been turned into a mass grave of palestinians and those coming to their assistance” last month israeli forces opened fire on ambulances in gaza killing 15 medics and rescuers in an incident that prompted international condemnation “we are witnessing in real time the destruction and forced displacement of the entire population in gaza” she said medical facilities are not exempt from attacks and evacuation orders by israeli forces msf teams have had to leave many facilities while others continue operating with staff and patients trapped inside unable to leave safely for hours at a time the charity said “with nowhere safe for palestinians or those trying to help them the humanitarian response is severely struggling under the weight of insecurity and critical supply shortages leaving people with few if any options for accessing care” bazerolle said advertisement israel resumed aerial bombardment and ground operations in the palestinian territory in march after it reneged on a twomonthold ceasefire thousands of people have since been killed with many more displaced israel has also blocked humanitarian aid from entering gaza since march 2 medical supplies fuel water and other essentials are in short supply the united nations says israeli forces to ‘remain in the security zones’ on wednesday defence minister israel katz said israel’s “policy is clear and no humanitarian aid will be allowed into gaza” as it is “one of the main pressure tools” against hamas “in the current reality no one is going to allow any humanitarian aid into gaza and no preparations are being made to allow any aid of this kind” he said israeli forces “will remain in the security zones as a buffer between the enemy and israeli communities in any temporary or permanent situation in gaza” he said al jazeera’s nour odeh reporting from jordan’s capital amman said the ongoing mediated efforts to get israel and hamas to agree on a new ceasefire seem to have reached “a dead end” “israel is trying to extort a temporary ceasefire deal in exchange for allowing critically needed aid back to gaza israel will also only promise to discuss ending its genocidal war on gaza if hamas agrees to disarm and exile up to 200 of its members from the strip” she said “hamas has shown flexibility on many issues but the movement says laying down its arms without ending the occupation is a red line but hamas is running out of options gaza is in ruins people are running out of hope and patience” odeh added israeli forces have taken over large areas of gaza in recent weeks together with the blockade continued fighting has worsened the already catastrophic humanitarian situation in gaza advertisement at least 51000 people most of them children and women have been killed in israeli attacks since october 2023",
    "summary": "Medical facilities are not exempt from attacks and evacuation orders by Israeli forces.\nIsrael has also blocked humanitarian aid from entering Gaza since March 2.\n“In the current reality, no one is going to allow any humanitarian aid into Gaza, and no preparations are being made to allow any aid of this kind,” he said.\n“Israel is trying to extort a temporary ceasefire deal in exchange for allowing critically needed aid back to Gaza.\nIsraeli forces have taken over large areas of Gaza in recent weeks.",
    "keywords": [
      "mass",
      "hamas",
      "grave",
      "msf",
      "gaza",
      "palestinians",
      "israel",
      "ceasefire",
      "trying",
      "helping",
      "israeli",
      "humanitarian",
      "aid",
      "temporary",
      "forces"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AP25106342238362-1744796703.jpg?resize=1920%2C1440",
    "t": 26
  },
  "https://www.aljazeera.com/news/2025/4/12/trump-exempts-smartphones-computers-from-reciprocal-tariffs": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/12/trump-exempts-smartphones-computers-from-reciprocal-tariffs",
    "date": "2025-04-12",
    "time": "00:00:00",
    "title": "Trump exempts smartphones, computers from ‘reciprocal’ tariffs",
    "body": "The latest exemptions cover imports from China, in first sign of possible softening of US trade war against Beijing.\n\nSmartphones, laptops and a host of other tech components will be spared from the Trump administration’s so-called “reciprocal tariffs”, including steep 125 percent duties on imports from China, according to a notice issued by US Customs and Border Protection.\n\nThe US CBP on Friday listed 20 product categories, including the very broad 8471 code for all computers, laptops, disc drives and automatic data processing. It also included semiconductor devices, equipment, memory chips and flat panel displays.\n\nThe exclusions provide welcome relief to major US technology firms, including Apple and many other importers, which rely on Chinese manufacturing.\n\nThere was no immediate comment from the White House on the exemptions.\n\nBut the exemptions suggest an increasing awareness within the Trump administration of the pain that his tariffs had in store for US consumers, especially on popular products such as smartphones, laptops and other electronics.\n\nDaniel Ives, senior equity analyst at Wedbush Securities, called the US exemptions “the best news possible for tech investors”.\n\nAdvertisement\n\n“US tariff exclusions will apply to computers, smartphones, and chip-making equipment which takes [away] a huge black cloud overhang for now over the tech sector,” he said in a note cited by the AFP news agency.\n\nWithout these exemptions, he said, “the US Tech industry would be taken back a decade and the AI Revolution thesis would have been slowed significantly.”\n\nThe move came as retaliatory Chinese import tariffs of 125 percent on US goods took effect on Saturday, with Beijing standing defiant against its primary trade competitor.\n\nEarlier in the week, Trump officials announced a 90-day reprieve on “reciprocal” tariffs for most countries, introducing instead a flat 10-percent rate, though China remained excluded from the revised scheme.",
    "clean_body": "the latest exemptions cover imports from china in first sign of possible softening of us trade war against beijing smartphones laptops and a host of other tech components will be spared from the trump administration’s socalled “reciprocal tariffs” including steep 125 percent duties on imports from china according to a notice issued by us customs and border protection the us cbp on friday listed 20 product categories including the very broad 8471 code for all computers laptops disc drives and automatic data processing it also included semiconductor devices equipment memory chips and flat panel displays the exclusions provide welcome relief to major us technology firms including apple and many other importers which rely on chinese manufacturing there was no immediate comment from the white house on the exemptions but the exemptions suggest an increasing awareness within the trump administration of the pain that his tariffs had in store for us consumers especially on popular products such as smartphones laptops and other electronics daniel ives senior equity analyst at wedbush securities called the us exemptions “the best news possible for tech investors” advertisement “us tariff exclusions will apply to computers smartphones and chipmaking equipment which takes away a huge black cloud overhang for now over the tech sector” he said in a note cited by the afp news agency without these exemptions he said “the us tech industry would be taken back a decade and the ai revolution thesis would have been slowed significantly” the move came as retaliatory chinese import tariffs of 125 percent on us goods took effect on saturday with beijing standing defiant against its primary trade competitor earlier in the week trump officials announced a 90day reprieve on “reciprocal” tariffs for most countries introducing instead a flat 10percent rate though china remained excluded from the revised scheme",
    "summary": "The latest exemptions cover imports from China, in first sign of possible softening of US trade war against Beijing.\nSmartphones, laptops and a host of other tech components will be spared from the Trump administration’s so-called “reciprocal tariffs”, including steep 125 percent duties on imports from China, according to a notice issued by US Customs and Border Protection.\nThe US CBP on Friday listed 20 product categories, including the very broad 8471 code for all computers, laptops, disc drives and automatic data processing.\nBut the exemptions suggest an increasing awareness within the Trump administration of the pain that his tariffs had in store for US consumers, especially on popular products such as smartphones, laptops and other electronics.\nEarlier in the week, Trump officials announced a 90-day reprieve on “reciprocal” tariffs for most countries, introducing instead a flat 10-percent rate, though China remained excluded from the revised scheme.",
    "keywords": [
      "including",
      "trade",
      "tariffs",
      "laptops",
      "computers",
      "exempts",
      "reciprocal",
      "exemptions",
      "trump",
      "china",
      "smartphones",
      "tech"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/ap_67fa7dd9e2bfe-1744469465.jpg?resize=1920%2C1440",
    "t": 30
  },
  "https://www.aljazeera.com/news/2025/4/30/russia-north-korea-begin-building-first-road": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/30/russia-north-korea-begin-building-first-road",
    "date": "2025-04-30",
    "time": "00:00:00",
    "title": "‘Milestone’: Russia, North Korea begin first road bridge construction",
    "body": "Moscow says the project will boost trade and highlight the two countries’ strong alliance.\n\nRussia and North Korea have begun construction of their first-ever road bridge on the Tumen River, which forms the natural border between the allied countries, describing it as a symbol of their deepening partnership.\n\nAnnouncing the project on Wednesday, Russia’s Prime Minister Mikhail Mishustin said it would reduce transport costs, facilitate trade and promote tourism.\n\n“This is truly a milestone for Russian-Korean relations,” Mishustin said during a video meeting with Pak Thae-song, chairman of North Korea’s Supreme People’s Assembly.\n\n“The significance goes far beyond just an engineering task … it symbolises our common desire to strengthen friendly, good-neighbourly relations and increase interregional cooperation,” he added.\n\nThere is already a rusting, Soviet-era rail bridge across the Tumen River.\n\n“Another road will allow entrepreneurs to significantly increase the volume of transport [goods] and reduce transport costs – and, of course, open up good prospects for tourism,” said Mishustin.\n\nAdvertisement\n\nRussia’s Kommersant newspaper said the bridge will be ready by mid-2026.\n\n‘Eternal historical monument’\n\nRussian state TV aired footage from the site, showing North Koreans dressed in suits, standing in line during a ceremony marking the start of construction.\n\n“It will become an eternal historical memorial structure symbolising the unbreakable Korean-Russian friendly relations,” North Korea’s Pak Thae-song said, according to a Russian translation.\n\nThe governor of Russia’s Primorye region, Oleg Kozhemyako, who attended the ceremony, said he hoped it would boost contact between the countries.\n\n“There are many sportspeople and children going there,” he said, without elaborating.\n\nNorth Korea and Russia, two of the most sanctioned countries in the world, have leaned into their alliance during Russia’s war in Ukraine.\n\nPyongyang has repeatedly voiced strong support for Russia’s invasion and even sent thousands of its own troops to fight alongside the Russians.\n\nAbout 600 North Korean soldiers have died in the war, South Korean lawmakers said Wednesday, citing intelligence officials.\n\nNorth Korea is also accused by Kyiv of supplying Russia with heavy weapons it has used in battle, including a missile that killed a dozen people in Kyiv last week.\n\nRussia’s President Vladimir Putin signed a strategic partnership with Pyongyang last year that committed both countries to providing immediate military assistance to each other using “all means” necessary if either faces “aggression”.\n\nAdvertisement\n\nPutin has since hailed the North Korean troops fighting Ukraine, with the Kremlin even considering them parading on Red Square during World War II commemorations on May 9.",
    "clean_body": "moscow says the project will boost trade and highlight the two countries’ strong alliance russia and north korea have begun construction of their firstever road bridge on the tumen river which forms the natural border between the allied countries describing it as a symbol of their deepening partnership announcing the project on wednesday russia’s prime minister mikhail mishustin said it would reduce transport costs facilitate trade and promote tourism “this is truly a milestone for russiankorean relations” mishustin said during a video meeting with pak thaesong chairman of north korea’s supreme people’s assembly “the significance goes far beyond just an engineering task … it symbolises our common desire to strengthen friendly goodneighbourly relations and increase interregional cooperation” he added there is already a rusting sovietera rail bridge across the tumen river “another road will allow entrepreneurs to significantly increase the volume of transport goods and reduce transport costs – and of course open up good prospects for tourism” said mishustin advertisement russia’s kommersant newspaper said the bridge will be ready by mid2026 ‘eternal historical monument’ russian state tv aired footage from the site showing north koreans dressed in suits standing in line during a ceremony marking the start of construction “it will become an eternal historical memorial structure symbolising the unbreakable koreanrussian friendly relations” north korea’s pak thaesong said according to a russian translation the governor of russia’s primorye region oleg kozhemyako who attended the ceremony said he hoped it would boost contact between the countries “there are many sportspeople and children going there” he said without elaborating north korea and russia two of the most sanctioned countries in the world have leaned into their alliance during russia’s war in ukraine pyongyang has repeatedly voiced strong support for russia’s invasion and even sent thousands of its own troops to fight alongside the russians about 600 north korean soldiers have died in the war south korean lawmakers said wednesday citing intelligence officials north korea is also accused by kyiv of supplying russia with heavy weapons it has used in battle including a missile that killed a dozen people in kyiv last week russia’s president vladimir putin signed a strategic partnership with pyongyang last year that committed both countries to providing immediate military assistance to each other using “all means” necessary if either faces “aggression” advertisement putin has since hailed the north korean troops fighting ukraine with the kremlin even considering them parading on red square during world war ii commemorations on may 9",
    "summary": "Russia and North Korea have begun construction of their first-ever road bridge on the Tumen River, which forms the natural border between the allied countries, describing it as a symbol of their deepening partnership.\n“It will become an eternal historical memorial structure symbolising the unbreakable Korean-Russian friendly relations,” North Korea’s Pak Thae-song said, according to a Russian translation.\nNorth Korea and Russia, two of the most sanctioned countries in the world, have leaned into their alliance during Russia’s war in Ukraine.\nAbout 600 North Korean soldiers have died in the war, South Korean lawmakers said Wednesday, citing intelligence officials.\nNorth Korea is also accused by Kyiv of supplying Russia with heavy weapons it has used in battle, including a missile that killed a dozen people in Kyiv last week.",
    "keywords": [
      "bridge",
      "road",
      "milestone",
      "russias",
      "war",
      "relations",
      "construction",
      "korean",
      "russia",
      "countries",
      "begin",
      "world",
      "korea",
      "north",
      "transport"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/2025-04-30T090147Z_347779685_RC288EADU1D9_RTRMADP_3_RUSSIA-NORTHKOREA-BRIDGE-1746019406.jpg?resize=1920%2C1440",
    "t": 12
  },
  "https://www.aljazeera.com/news/2025/4/24/hamas-condemns-abbass-remarks-over-gaza-hostages": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/24/hamas-condemns-abbass-remarks-over-gaza-hostages",
    "date": "2025-04-24",
    "time": "00:00:00",
    "title": "‘Insulting’: Hamas condemns Abbas’s remarks on Gaza captives",
    "body": "Palestinian leader Mahmoud Abbas says keeping the captives provides Israel with justification for its attacks on Gaza.\n\nHamas has condemned remarks made by Palestinian Authority (PA) President Mahmoud Abbas, who urged the Palestinian group ruling Gaza to release Israeli captives and lay down arms.\n\nSenior Hamas official Basem Naim said on Thursday that Abbas’s remarks made a day earlier were “insulting”.\n\n“Abbas repeatedly and suspiciously lays the blame for the crimes of the occupation and its ongoing aggression on our people,” he said.\n\nAbbas on Wednesday urged Hamas to free all captives, saying keeping them provided Israel with “excuses” to attack Gaza.\n\n“Hamas has given the criminal occupation excuses to commit its crimes in the Gaza Strip, the most prominent being the holding of hostages,” Abbas said at a meeting in Ramallah, the PA’s seat in the Israeli-occupied West Bank.\n\n“I’m the one paying the price, our people are paying the price, not Israel. My brother, just hand them over.”\n\n“Every day there are deaths,” Abbas said. “You sons of dogs, hand over what you have and get us out of this” ordeal, he added, levelling a harsh Arabic epithet at Hamas.\n\nAdvertisement\n\nLong rift\n\nThere have been deep political and ideological divisions between Abbas’s Fatah party and Hamas for nearly 20 years.\n\nAbbas and the PA have often accused Hamas of undermining Palestinian unity, while Hamas has criticised the former for collaborating with Israel and cracking down on West Bank dissent.\n\nThe Palestinian Mujahideen Movement, which split from Abbas’s Fatah in the 2000s, issued a statement on Telegram on Wednesday condemning Abbas’s remarks.\n\n“We strongly condemn the offensive statements made by President Abbas during the Central Council meeting regarding the resistance and our people’s resistance fighters, disregarding the sacrifices and struggle of our people and ignoring the suffering and ongoing sacrifices of the prisoners,” read the statement.\n\n“We condemn the PA leadership’s continued pursuit of this discourse, which criminalizes the resistance and absolves the occupation of its ongoing crimes against our people for decades, especially the genocidal war against Gaza, the annexation and Judaization of the West Bank and Jerusalem, and the severe suffering endured by our valiant prisoners.”\n\nThe movement also called on Abbas to issue an apology for his remarks.\n\n“We call on the President of the Palestinian Authority to apologize for this offensive speech and reverse all steps that reinforce division and align with Zionist will. We call on him to return to the embrace of the people and their choices and to cease pursuing the absurd path of surrender and compromise.”\n\nAdvertisement\n\nSince Israel’s campaign in Gaza resumed on March 18, at least 1,928 people have been killed in Gaza, bringing the total death toll since the war erupted to at least 51,305, according to the enclave’s Ministry of Health.\n\nTalks on a new ceasefire have so far been fruitless, and a Hamas delegation is in Cairo for renewed negotiations with Egyptian and Qatari mediators.",
    "clean_body": "palestinian leader mahmoud abbas says keeping the captives provides israel with justification for its attacks on gaza hamas has condemned remarks made by palestinian authority pa president mahmoud abbas who urged the palestinian group ruling gaza to release israeli captives and lay down arms senior hamas official basem naim said on thursday that abbas’s remarks made a day earlier were “insulting” “abbas repeatedly and suspiciously lays the blame for the crimes of the occupation and its ongoing aggression on our people” he said abbas on wednesday urged hamas to free all captives saying keeping them provided israel with “excuses” to attack gaza “hamas has given the criminal occupation excuses to commit its crimes in the gaza strip the most prominent being the holding of hostages” abbas said at a meeting in ramallah the pa’s seat in the israelioccupied west bank “i’m the one paying the price our people are paying the price not israel my brother just hand them over” “every day there are deaths” abbas said “you sons of dogs hand over what you have and get us out of this” ordeal he added levelling a harsh arabic epithet at hamas advertisement long rift there have been deep political and ideological divisions between abbas’s fatah party and hamas for nearly 20 years abbas and the pa have often accused hamas of undermining palestinian unity while hamas has criticised the former for collaborating with israel and cracking down on west bank dissent the palestinian mujahideen movement which split from abbas’s fatah in the 2000s issued a statement on telegram on wednesday condemning abbas’s remarks “we strongly condemn the offensive statements made by president abbas during the central council meeting regarding the resistance and our people’s resistance fighters disregarding the sacrifices and struggle of our people and ignoring the suffering and ongoing sacrifices of the prisoners” read the statement “we condemn the pa leadership’s continued pursuit of this discourse which criminalizes the resistance and absolves the occupation of its ongoing crimes against our people for decades especially the genocidal war against gaza the annexation and judaization of the west bank and jerusalem and the severe suffering endured by our valiant prisoners” the movement also called on abbas to issue an apology for his remarks “we call on the president of the palestinian authority to apologize for this offensive speech and reverse all steps that reinforce division and align with zionist will we call on him to return to the embrace of the people and their choices and to cease pursuing the absurd path of surrender and compromise” advertisement since israel’s campaign in gaza resumed on march 18 at least 1928 people have been killed in gaza bringing the total death toll since the war erupted to at least 51305 according to the enclave’s ministry of health talks on a new ceasefire have so far been fruitless and a hamas delegation is in cairo for renewed negotiations with egyptian and qatari mediators",
    "summary": "Palestinian leader Mahmoud Abbas says keeping the captives provides Israel with justification for its attacks on Gaza.\nHamas has condemned remarks made by Palestinian Authority (PA) President Mahmoud Abbas, who urged the Palestinian group ruling Gaza to release Israeli captives and lay down arms.\nSenior Hamas official Basem Naim said on Thursday that Abbas’s remarks made a day earlier were “insulting”.\nAbbas on Wednesday urged Hamas to free all captives, saying keeping them provided Israel with “excuses” to attack Gaza.\nThe Palestinian Mujahideen Movement, which split from Abbas’s Fatah in the 2000s, issued a statement on Telegram on Wednesday condemning Abbas’s remarks.",
    "keywords": [
      "abbas",
      "hamas",
      "condemns",
      "remarks",
      "gaza",
      "israel",
      "resistance",
      "west",
      "insulting",
      "captives",
      "abbass",
      "pa",
      "palestinian",
      "president"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250423__43897ED__v1__HighRes__PalestinianIsraelConflictPoliticsPlo-1745484338.jpg?resize=1920%2C1363",
    "t": 18
  },
  "https://www.aljazeera.com/news/2025/4/14/hungary-approves-constitutional-change-banning-lgbtq-events": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/14/hungary-approves-constitutional-change-banning-lgbtq-events",
    "date": "2025-04-14",
    "time": "00:00:00",
    "title": "Hungary approves constitutional change banning LGBTQ+ events",
    "body": "Rights activists and some legal scholars condemn the law, arguing that it effectively criminalises LGBTQ+ expression.\n\nHungary’s parliament has approved a constitutional amendment allowing the government to ban all public events organised by LGBTQ+ groups.\n\nPassed on Monday, the amendment formalises a law introduced earlier this year that bans such gatherings, including Budapest’s annual Pride March.\n\nIt’s seen by critics as another authoritarian lurch by Hungarian Prime Minister Viktor Orban’s right-wing government.\n\nHuman rights activists and some legal scholars have condemned the law, arguing that it effectively criminalises LGBTQ+ expression in public spaces.\n\nOrban’s government has consistently argued that the legislation defends traditional family values and protects children.\n\nThe amendment passed with 140 votes in favour and 21 against, backed exclusively by MPs from Orban’s ruling Fidesz-KDNP coalition. It required a two-thirds majority to become law.\n\nAhead of the legislative session, opposition lawmakers and demonstrators attempted to prevent access to parliament’s parking area. Protesters, who had bound themselves with zip ties, were forcibly removed by police.\n\nAdvertisement\n\nThe revised constitutional text asserts that a child’s right to moral, physical, and spiritual development takes precedence over all rights except the right to life. Critics say this phrasing is aimed at limiting freedom of assembly.\n\nThe new amendment enshrines into the constitution “child protection” legislation, which prohibits the “depiction or promotion” of homosexuality to minors.\n\nIt also states that the constitution recognises two sexes, male and female, adding to an earlier amendment that prohibits same-sex adoption by insisting that a mother is a woman and a father is a man.\n\nBy giving this law constitutional status, the government strengthens its legal footing and potentially shields it from future legal challenges, including those from European Union institutions.\n\nBudapest Pride, which has drawn thousands in recent years, now faces uncertainty under the new framework. Organisers have not yet commented on whether the 2025 event will proceed.",
    "clean_body": "rights activists and some legal scholars condemn the law arguing that it effectively criminalises lgbtq expression hungary’s parliament has approved a constitutional amendment allowing the government to ban all public events organised by lgbtq groups passed on monday the amendment formalises a law introduced earlier this year that bans such gatherings including budapest’s annual pride march it’s seen by critics as another authoritarian lurch by hungarian prime minister viktor orban’s rightwing government human rights activists and some legal scholars have condemned the law arguing that it effectively criminalises lgbtq expression in public spaces orban’s government has consistently argued that the legislation defends traditional family values and protects children the amendment passed with 140 votes in favour and 21 against backed exclusively by mps from orban’s ruling fideszkdnp coalition it required a twothirds majority to become law ahead of the legislative session opposition lawmakers and demonstrators attempted to prevent access to parliament’s parking area protesters who had bound themselves with zip ties were forcibly removed by police advertisement the revised constitutional text asserts that a child’s right to moral physical and spiritual development takes precedence over all rights except the right to life critics say this phrasing is aimed at limiting freedom of assembly the new amendment enshrines into the constitution “child protection” legislation which prohibits the “depiction or promotion” of homosexuality to minors it also states that the constitution recognises two sexes male and female adding to an earlier amendment that prohibits samesex adoption by insisting that a mother is a woman and a father is a man by giving this law constitutional status the government strengthens its legal footing and potentially shields it from future legal challenges including those from european union institutions budapest pride which has drawn thousands in recent years now faces uncertainty under the new framework organisers have not yet commented on whether the 2025 event will proceed",
    "summary": "Rights activists and some legal scholars condemn the law, arguing that it effectively criminalises LGBTQ+ expression.\nHungary’s parliament has approved a constitutional amendment allowing the government to ban all public events organised by LGBTQ+ groups.\nPassed on Monday, the amendment formalises a law introduced earlier this year that bans such gatherings, including Budapest’s annual Pride March.\nHuman rights activists and some legal scholars have condemned the law, arguing that it effectively criminalises LGBTQ+ expression in public spaces.\nBy giving this law constitutional status, the government strengthens its legal footing and potentially shields it from future legal challenges, including those from European Union institutions.",
    "keywords": [
      "prohibits",
      "lgbtq",
      "constitutional",
      "right",
      "legal",
      "scholars",
      "change",
      "law",
      "public",
      "hungary",
      "banning",
      "events",
      "amendment",
      "rights",
      "approves"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2021/07/2021-07-21T093031Z_1107675389_RC2XOO91AGOE_RTRMADP_3_HUNGARY-LGBT-ORBAN-REFERENDUM.jpg?resize=1920%2C1440",
    "t": 28
  },
  "https://www.aljazeera.com/news/2025/4/29/at-least-three-killed-in-sweden-shooting-police": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/29/at-least-three-killed-in-sweden-shooting-police",
    "date": "2025-04-29",
    "time": "00:00:00",
    "title": "At least three killed in Sweden shooting: Police",
    "body": "Police say a murder investigation has been launched after a deadly shooting in the Swedish city of Uppsala.\n\nAt least three people have been killed in a shooting in the Swedish city of Uppsala, police say.\n\nIn a statement on Tuesday, police said they had received calls from members of the public who heard noises that sounded like gunshots being fired near Vaksala Square in the centre of the city, about 60km (37 miles) north of the capital Stockholm.\n\nEmergency services were on the scene and a murder investigation has been launched, police added.\n\nSweden’s public television station SVT said the suspect had fled on a scooter.\n\nSwedish Justice Minister Gunnar Strommer said his ministry was in close contact with police and was closely monitoring developments in the case.\n\n“A brutal act of violence has occurred in central Uppsala … This is at the same time as the whole of Uppsala has begun Walpurgis Night,” Strommer said in a statement, referring to a traditional holiday celebrated on April 30 in northern Europe and Scandinavia.\n\n“What has happened is extremely serious,” he added.\n\nThe circumstances surrounding the shooting remain unclear, and there was no immediate indication of motive.\n\nAdvertisement\n\nPolice also did not provide any details about the alleged perpetrator.\n\nAl Jazeera’s Paul Rhys, reporting from Uppsala, said the residential neighbourhood was crowded due to the festivities when between five to eight shots were fired, according to witnesses.\n\nThe shooting happened at a hair salon, which may indicate a targeted killing, Rhys said.\n\nThe Nordic country has suffered from a wave of gang-related violence for more than a decade that has included an epidemic of gun violence.\n\nA right-wing minority government came to power in 2022 on a promise to tackle gang-related violence.\n\nIn February, 10 people were killed in the city of Orebro in Sweden’s deadliest ever mass shooting, which saw a 35-year-old unemployed loner open fire on students and teachers at an adult education centre.\n\nUppsala is the fourth-largest city in Sweden with a population of about 230,000 people.",
    "clean_body": "police say a murder investigation has been launched after a deadly shooting in the swedish city of uppsala at least three people have been killed in a shooting in the swedish city of uppsala police say in a statement on tuesday police said they had received calls from members of the public who heard noises that sounded like gunshots being fired near vaksala square in the centre of the city about 60km 37 miles north of the capital stockholm emergency services were on the scene and a murder investigation has been launched police added sweden’s public television station svt said the suspect had fled on a scooter swedish justice minister gunnar strommer said his ministry was in close contact with police and was closely monitoring developments in the case “a brutal act of violence has occurred in central uppsala … this is at the same time as the whole of uppsala has begun walpurgis night” strommer said in a statement referring to a traditional holiday celebrated on april 30 in northern europe and scandinavia “what has happened is extremely serious” he added the circumstances surrounding the shooting remain unclear and there was no immediate indication of motive advertisement police also did not provide any details about the alleged perpetrator al jazeera’s paul rhys reporting from uppsala said the residential neighbourhood was crowded due to the festivities when between five to eight shots were fired according to witnesses the shooting happened at a hair salon which may indicate a targeted killing rhys said the nordic country has suffered from a wave of gangrelated violence for more than a decade that has included an epidemic of gun violence a rightwing minority government came to power in 2022 on a promise to tackle gangrelated violence in february 10 people were killed in the city of orebro in sweden’s deadliest ever mass shooting which saw a 35yearold unemployed loner open fire on students and teachers at an adult education centre uppsala is the fourthlargest city in sweden with a population of about 230000 people",
    "summary": "Police say a murder investigation has been launched after a deadly shooting in the Swedish city of Uppsala.\nAt least three people have been killed in a shooting in the Swedish city of Uppsala, police say.\nThe shooting happened at a hair salon, which may indicate a targeted killing, Rhys said.\nIn February, 10 people were killed in the city of Orebro in Sweden’s deadliest ever mass shooting, which saw a 35-year-old unemployed loner open fire on students and teachers at an adult education centre.\nUppsala is the fourth-largest city in Sweden with a population of about 230,000 people.",
    "keywords": [
      "murder",
      "killed",
      "uppsala",
      "public",
      "sweden",
      "shooting",
      "statement",
      "city",
      "violence",
      "swedish",
      "rhys",
      "strommer"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/2025-04-29T171617Z_601861377_RC2S7EATDC7N_RTRMADP_3_SWEDEN-SHOOTING-1745950054.jpg?resize=1920%2C1440",
    "t": 13
  },
  "https://www.aljazeera.com/news/2025/4/14/ecuadors-noboa-wins-presidential-runoff-rival-demands-recount": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/14/ecuadors-noboa-wins-presidential-runoff-rival-demands-recount",
    "date": "2025-04-14",
    "time": "00:00:00",
    "title": "Ecuador’s Noboa wins presidential run-off, rival demands recount",
    "body": "Right-wing incumbent has four-year term to implement promises to clamp down on crime and improve economy.\n\nEcuador’s right-wing President Daniel Noboa has been re-elected in a second-round election run-off.\n\nThe National Electoral Council declared late on Sunday that the incumbent, who has promised to boost the flagging economy and continue a crackdown on cartel violence, had won by a wide margin.\n\nWith more than 90 percent of ballots counted, the 37-year-old Noboa was reported to have taken 55.8 percent of the vote. That gave him a twelve-point lead over left-wing opponent Luisa Gonzalez.\n\nHowever, his rival, whose support polls had suggested was running close to the incumbent’s, has demanded a recount, claiming the vote was fraudulent.\n\nNoboa, who was elected in snap elections in 2023, now has a full four-year mandate in which to continue his divisive “mano dura” (tough) crackdown on violence tied to the trafficking of cocaine produced in neighbouring Colombia and Peru. The smuggling and associated criminality has blighted Ecuador since 2021.\n\n“Ecuadorians have spoken. From tomorrow morning, we will go to work,” Noboa told supporters during a brief speech in his hometown of Olon. He also criticised his opponent’s fraud allegations.\n\nAdvertisement\n\nGonzalez, who may have been penalised at the polls for her close ties to populist firebrand ex-President Rafael Correa, told chanting supporters that the result was “the worst and most grotesque electoral fraud in the history of Ecuador”.\n\nThe results came as a surprise to many after the first round in February, in which Noboa finished just 16,746 votes ahead of Gonzalez. The latter candidate had the backing of Leonidas Iza, a powerful Indigenous leader who secured more than half a million votes in the first round.\n\nBut voters were heavily concerned about the spike in drug-related violence. The once-peaceful nation averaged a killing every hour at the start of the year, as cartels vied for control over cocaine routes that pass through Ecuador’s ports.\n\nRampant bloodshed has spooked investors and tourists alike, fueling economic malaise and swelling the ranks of Ecuador’s poor to 28 percent of the population.\n\nNoboa, heir to a family fortune built on the banana trade, had staked his political fortunes on tough security policies since he came to power 16 months ago, deploying the military to the streets, capturing drug lords and inviting the United States to send in special forces.",
    "clean_body": "rightwing incumbent has fouryear term to implement promises to clamp down on crime and improve economy ecuador’s rightwing president daniel noboa has been reelected in a secondround election runoff the national electoral council declared late on sunday that the incumbent who has promised to boost the flagging economy and continue a crackdown on cartel violence had won by a wide margin with more than 90 percent of ballots counted the 37yearold noboa was reported to have taken 558 percent of the vote that gave him a twelvepoint lead over leftwing opponent luisa gonzalez however his rival whose support polls had suggested was running close to the incumbent’s has demanded a recount claiming the vote was fraudulent noboa who was elected in snap elections in 2023 now has a full fouryear mandate in which to continue his divisive “mano dura” tough crackdown on violence tied to the trafficking of cocaine produced in neighbouring colombia and peru the smuggling and associated criminality has blighted ecuador since 2021 “ecuadorians have spoken from tomorrow morning we will go to work” noboa told supporters during a brief speech in his hometown of olon he also criticised his opponent’s fraud allegations advertisement gonzalez who may have been penalised at the polls for her close ties to populist firebrand expresident rafael correa told chanting supporters that the result was “the worst and most grotesque electoral fraud in the history of ecuador” the results came as a surprise to many after the first round in february in which noboa finished just 16746 votes ahead of gonzalez the latter candidate had the backing of leonidas iza a powerful indigenous leader who secured more than half a million votes in the first round but voters were heavily concerned about the spike in drugrelated violence the oncepeaceful nation averaged a killing every hour at the start of the year as cartels vied for control over cocaine routes that pass through ecuador’s ports rampant bloodshed has spooked investors and tourists alike fueling economic malaise and swelling the ranks of ecuador’s poor to 28 percent of the population noboa heir to a family fortune built on the banana trade had staked his political fortunes on tough security policies since he came to power 16 months ago deploying the military to the streets capturing drug lords and inviting the united states to send in special forces",
    "summary": "Right-wing incumbent has four-year term to implement promises to clamp down on crime and improve economy.\nEcuador’s right-wing President Daniel Noboa has been re-elected in a second-round election run-off.\nWith more than 90 percent of ballots counted, the 37-year-old Noboa was reported to have taken 55.8 percent of the vote.\nHowever, his rival, whose support polls had suggested was running close to the incumbent’s, has demanded a recount, claiming the vote was fraudulent.\nFrom tomorrow morning, we will go to work,” Noboa told supporters during a brief speech in his hometown of Olon.",
    "keywords": [
      "polls",
      "demands",
      "supporters",
      "recount",
      "runoff",
      "presidential",
      "incumbent",
      "vote",
      "told",
      "wins",
      "noboa",
      "violence",
      "tough",
      "rightwing",
      "ecuadors",
      "rival",
      "votes"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250414__42948GL__v2__HighRes__EcuadorElectionRunoffVoteNoboa-1744608542.jpg?resize=1920%2C1440",
    "t": 28
  },
  "https://www.aljazeera.com/news/2025/4/23/yemens-houthis-launch-rare-attack-on-northern-israel": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/23/yemens-houthis-launch-rare-attack-on-northern-israel",
    "date": "2025-04-23",
    "time": "00:00:00",
    "title": "Yemen’s Houthis launch rare missile attack on northern Israel",
    "body": "Israel says the ballistic missile has been intercepted without causing any injuries.\n\nYemen’s Houthi rebels have launched a ballistic missile towards northern Israel, according to the Israeli military, which claimed to have shot down the projectile without causing any injuries.\n\nShortly after 4am local time (01:00 GMT) on Wednesday, the Israeli army said that the missile triggered air raid sirens in Haifa, Krayot and other areas west of the Sea of Galilee.\n\nThis area is a rare target for the Iran-backed Houthi rebels, who continue to be the target of an intense United States air strike campaign.\n\nSince the war in Gaza broke out in October 2023, the Houthis have repeatedly fired missiles and drones at Israel in what they say is a show of solidarity with the Palestinians.\n\nThe rebel group controls swaths of Yemen, and Israel has struck Houthi targets several times inside the country, including in the capital, Sanaa.\n\nThe Houthis claimed responsibility for the attack several hours later, with military spokesman Yahya Saree saying the group had carried out the attack on “a vital Zionist enemy target in the occupied area of Haifa”.\n\nAdvertisement\n\n“The missile reached its target… and interception systems failed to intercept it, causing fear and panic,” he added.\n\nUS attacks\n\nMeanwhile, US air strikes, part of an almost daily campaign that began on March 15, continued targeting the Houthis on Wednesday morning. The Houthis reported US strikes on the Hodeidah, Marib and Saada governorates.\n\nIn Marib, the Houthis described a strike hitting telecommunications equipment, which had previously been a US target.\n\nThe Houthis, in response, have stepped up their targeting of US drones flying over the country. Houthi military spokesman Brigadier General Yahya Saree said late on Tuesday that the rebels had shot down an MQ-9 Reaper drone over Yemen’s northwest Hajjah governorate.\n\nMQ-9 Reaper drones, which cost about $30m apiece, can fly at altitudes of more than 40,000 feet (12,100 metres) and remain in the air for more than 30 hours.\n\nThe US military and CIA have flown them for years over Afghanistan, Iraq, and now Yemen.\n\nThe Houthis claim to have downed 26 MQ-9s over the past decade of the Yemen war.\n\nThe US military acknowledged the report of the drone being downed but said it could not comment further.\n\nThe US military says it is targeting Houthi “terrorists” to stop attacks on international shipping in the Red Sea, a crucial global trade route, and Israel.",
    "clean_body": "israel says the ballistic missile has been intercepted without causing any injuries yemen’s houthi rebels have launched a ballistic missile towards northern israel according to the israeli military which claimed to have shot down the projectile without causing any injuries shortly after 4am local time 0100 gmt on wednesday the israeli army said that the missile triggered air raid sirens in haifa krayot and other areas west of the sea of galilee this area is a rare target for the iranbacked houthi rebels who continue to be the target of an intense united states air strike campaign since the war in gaza broke out in october 2023 the houthis have repeatedly fired missiles and drones at israel in what they say is a show of solidarity with the palestinians the rebel group controls swaths of yemen and israel has struck houthi targets several times inside the country including in the capital sanaa the houthis claimed responsibility for the attack several hours later with military spokesman yahya saree saying the group had carried out the attack on “a vital zionist enemy target in the occupied area of haifa” advertisement “the missile reached its target… and interception systems failed to intercept it causing fear and panic” he added us attacks meanwhile us air strikes part of an almost daily campaign that began on march 15 continued targeting the houthis on wednesday morning the houthis reported us strikes on the hodeidah marib and saada governorates in marib the houthis described a strike hitting telecommunications equipment which had previously been a us target the houthis in response have stepped up their targeting of us drones flying over the country houthi military spokesman brigadier general yahya saree said late on tuesday that the rebels had shot down an mq9 reaper drone over yemen’s northwest hajjah governorate mq9 reaper drones which cost about 30m apiece can fly at altitudes of more than 40000 feet 12100 metres and remain in the air for more than 30 hours the us military and cia have flown them for years over afghanistan iraq and now yemen the houthis claim to have downed 26 mq9s over the past decade of the yemen war the us military acknowledged the report of the drone being downed but said it could not comment further the us military says it is targeting houthi “terrorists” to stop attacks on international shipping in the red sea a crucial global trade route and israel",
    "summary": "Israel says the ballistic missile has been intercepted without causing any injuries.\nYemen’s Houthi rebels have launched a ballistic missile towards northern Israel, according to the Israeli military, which claimed to have shot down the projectile without causing any injuries.\nThis area is a rare target for the Iran-backed Houthi rebels, who continue to be the target of an intense United States air strike campaign.\nHouthi military spokesman Brigadier General Yahya Saree said late on Tuesday that the rebels had shot down an MQ-9 Reaper drone over Yemen’s northwest Hajjah governorate.\nThe US military says it is targeting Houthi “terrorists” to stop attacks on international shipping in the Red Sea, a crucial global trade route, and Israel.",
    "keywords": [
      "attack",
      "rebels",
      "military",
      "target",
      "israel",
      "air",
      "houthis",
      "rare",
      "targeting",
      "drones",
      "yemens",
      "missile",
      "houthi",
      "launch",
      "northern"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AP25099333149076-1745393637.jpg?resize=1920%2C1440",
    "t": 19
  },
  "https://www.aljazeera.com/news/2025/4/22/cardinals-meet-decide-funeral-plans-for-pope-francis": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/22/cardinals-meet-decide-funeral-plans-for-pope-francis",
    "date": "2025-04-22",
    "time": "00:00:00",
    "title": "Vatican schedules funeral of Pope Francis for Saturday",
    "body": "The pontiff’s death has set in motion ancient Vatican rites before a new papal election.\n\nThe funeral of Pope Francis will be held on Saturday, the Vatican has announced.\n\nThe funeral ceremony will take place on Saturday at 10:00am (08:00 GMT) it was announced on Tuesday, shortly after cardinals began a meeting to prepare the next steps. World leaders are expected to attend the ceremony in advance of a conclave to elect the next head of the Catholic Church.\n\nAll cardinals currently in Rome were summoned to the meeting to outline the funeral arrangements and start preparations for the succession.\n\nThe funeral ceremony will take place in front of St Peter’s Basilica, with the dean of the College of Cardinals, Giovanni Battista Re, leading the service. The pope’s body will then be taken to the Basilica of St Mary Major in Rome and laid to rest.\n\nAs well as agreeing the timing of the funeral, the cardinals decreed that the body of the pontiff will be taken to St Peter’s Basilica on Wednesday morning at 07:00 GMT for public viewing. Francis is currently laid out in a coffin in the chapel of the Santa Marta residence where he lived during his 12-year papacy.\n\nAdvertisement\n\nThe Vatican said in a statement that Cardinal Kevin Joseph Farrell, the camerlengo of the Holy Roman Church, will preside over a prayer, after which the coffin will undertake a short itinerary that will culminate with entering the Basilica through its central door.\n\nThe camerlengo will then preside over a liturgy at the altar, at the end of which it will be possible for the public to begin paying their respects to Pope Francis’s body.\n\nFrancis died aged 88 on Monday following a stroke and cardiac arrest, the Vatican said, bringing an end to a 12-year papacy defined by advocacy for the marginalised and at times clashes with traditionalist forces in the Church.\n\nHaving spent five weeks in hospital earlier this year with double pneumonia, the pope had returned to his modest Casa Santa Marta residence nearly a month ago and appeared to be on the mend. He had even addressed worshippers in St Peter’s Square on Easter Sunday.\n\nHis passing has triggered time-honoured Vatican protocols, including the ceremonial destruction of the Fisherman’s Ring and papal seal, which symbolises the end of his papal authority.\n\nWorld leaders and royals, including United States President Donald Trump and President Javier Milei of Argentina, the pontiff’s native country, are preparing to attend the funeral ceremony.\n\nBreaking with tradition, Francis wished to be buried at the Basilica of Saint Mary Major, which is outside the Vatican and home to his favourite icon of the Virgin Mary, rather than at St Peter’s Basilica.\n\nAs the announcements regarding the funeral and public viewing of the body were made, the Vatican also published photos and a video of Pope Francis in his open coffin, dressed in a red robe with the papal mitre on his head and a rosary in his hand.\n\nThe Church is now preparing for a conclave, expected to begin after May 6, where 135 cardinal electors, nearly 80 percent of whom were appointed by Francis, will vote in secret to choose his successor.\n\nAdvertisement\n\nWith no clear favourite emerging, cardinals will use General Congregations in the coming days to reflect on the Church’s future direction.",
    "clean_body": "the pontiff’s death has set in motion ancient vatican rites before a new papal election the funeral of pope francis will be held on saturday the vatican has announced the funeral ceremony will take place on saturday at 1000am 0800 gmt it was announced on tuesday shortly after cardinals began a meeting to prepare the next steps world leaders are expected to attend the ceremony in advance of a conclave to elect the next head of the catholic church all cardinals currently in rome were summoned to the meeting to outline the funeral arrangements and start preparations for the succession the funeral ceremony will take place in front of st peter’s basilica with the dean of the college of cardinals giovanni battista re leading the service the pope’s body will then be taken to the basilica of st mary major in rome and laid to rest as well as agreeing the timing of the funeral the cardinals decreed that the body of the pontiff will be taken to st peter’s basilica on wednesday morning at 0700 gmt for public viewing francis is currently laid out in a coffin in the chapel of the santa marta residence where he lived during his 12year papacy advertisement the vatican said in a statement that cardinal kevin joseph farrell the camerlengo of the holy roman church will preside over a prayer after which the coffin will undertake a short itinerary that will culminate with entering the basilica through its central door the camerlengo will then preside over a liturgy at the altar at the end of which it will be possible for the public to begin paying their respects to pope francis’s body francis died aged 88 on monday following a stroke and cardiac arrest the vatican said bringing an end to a 12year papacy defined by advocacy for the marginalised and at times clashes with traditionalist forces in the church having spent five weeks in hospital earlier this year with double pneumonia the pope had returned to his modest casa santa marta residence nearly a month ago and appeared to be on the mend he had even addressed worshippers in st peter’s square on easter sunday his passing has triggered timehonoured vatican protocols including the ceremonial destruction of the fisherman’s ring and papal seal which symbolises the end of his papal authority world leaders and royals including united states president donald trump and president javier milei of argentina the pontiff’s native country are preparing to attend the funeral ceremony breaking with tradition francis wished to be buried at the basilica of saint mary major which is outside the vatican and home to his favourite icon of the virgin mary rather than at st peter’s basilica as the announcements regarding the funeral and public viewing of the body were made the vatican also published photos and a video of pope francis in his open coffin dressed in a red robe with the papal mitre on his head and a rosary in his hand the church is now preparing for a conclave expected to begin after may 6 where 135 cardinal electors nearly 80 percent of whom were appointed by francis will vote in secret to choose his successor advertisement with no clear favourite emerging cardinals will use general congregations in the coming days to reflect on the church’s future direction",
    "summary": "The funeral of Pope Francis will be held on Saturday, the Vatican has announced.\nAll cardinals currently in Rome were summoned to the meeting to outline the funeral arrangements and start preparations for the succession.\nThe funeral ceremony will take place in front of St Peter’s Basilica, with the dean of the College of Cardinals, Giovanni Battista Re, leading the service.\nHe had even addressed worshippers in St Peter’s Square on Easter Sunday.\nBreaking with tradition, Francis wished to be buried at the Basilica of Saint Mary Major, which is outside the Vatican and home to his favourite icon of the Virgin Mary, rather than at St Peter’s Basilica.",
    "keywords": [
      "francis",
      "pope",
      "papal",
      "schedules",
      "peters",
      "basilica",
      "public",
      "vatican",
      "st",
      "funeral",
      "cardinals"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/12966256-1745304270.jpg?resize=1920%2C1440",
    "t": 20
  },
  "https://www.aljazeera.com/news/2025/4/28/trump-china-tariff-war-whos-winning-so-far": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/28/trump-china-tariff-war-whos-winning-so-far",
    "date": "2025-04-28",
    "time": "00:00:00",
    "title": "Trump-China tariff war: Who’s winning so far?",
    "body": "It’s early days, but the warning signs are flashing red for the US.\n\nAfter United States President Donald Trump suspended his “reciprocal tariffs” on major US trading partners on April 9, he ramped them up on China’s goods. US trade levies on most imports from China have climbed to 145 percent. Beijing retaliated with duties of its own, at 125 percent on US goods.\n\nTrump has long accused China of exploiting the US on trade, casting his tariffs as necessary to revive domestic manufacturing and reshore jobs back to the US. He also wants to use tariffs to finance tax cuts. Most economists remain sceptical Trump will achieve his aims.\n\nFor now, the US and China are locked in a high-stakes game of chicken. The world is waiting to see which country will yield and which will stay the course. As Trump nears his first 100 days in office for the second time, here’s where the tariff war with China stands:\n\nWhat’s happening with negotiations?\n\nTrump recently played up the possibility of securing a trade deal with China. Last week, the US president said his tariffs on China will “come down substantially” in the near future.\n\nAdvertisement\n\n“We’re going to have a fair deal with China,” Trump told reporters on April 23, stirring hopes of a de-escalation. He also said his administration was “actively” negotiating with the Chinese side without elaborating.\n\nOn April 24, however, China’s Ministry of Commerce rebuffed president Trump’s remarks, saying there were no talks taking place between the two countries.\n\n“Any claims about the progress of China-US economic and trade negotiations are groundless and have no factual basis,” ministry spokesman He Yadong said.\n\nWhile he insisted that Beijing won’t duck any economic blows from Washington, he also said the door was “wide open” for talks.\n\nLast week, the Reuters news agency reported that China was evaluating exemptions for select US imports – a list of up to 131 products.\n\nBeijing has not made any public statement on the issue.\n\nHas the tariff war impacted US exports?\n\nTrump introduced his sweeping tariffs on China less than three weeks ago. The fallout for US businesses won’t be fully felt until later this year. Still, the warning signals are already flashing red.\n\nData from the US Department of Agriculture shows that exports of soya beans – the biggest US farm export – fell dramatically for the period April 11-17, the first full week of reporting since Trump’s China tariff announcement.\n\nBy April 17, net sales of US soya beans dropped by 50 percent compared with the previous week. That was driven by a 67 percent fall in weekly soya bean exports to China, which, until recently, was America’s biggest export destination for the legume.\n\nAdvertisement\n\nAccording to Piergiuseppe Fortunato, an adjunct professor of economics at the University of Neuchatel in Switzerland, “China’s retaliatory tariffs will hit US farmers hard. Some may go out of business.” He added that all sectors with exposure to China would come under strain.\n\nIn 2023, the US exported roughly $15bn of oil, gas and coal to China. Losing that market would hit US energy firms.\n\nAre imports to the US going to take a hit?\n\nSince the start of Trump’s tariff war, cargo shipments have plummeted. According to Linerlytica, a shipping data provider, Chinese freight bookings bound for the US fell by 30 to 60 percent in April.\n\nThe drastic reduction in shipping from America’s third largest trading partner – after Canada and Mexico – has not yet been felt. In May, however, thousands of companies will need to restock their inventories.\n\nAccording to Bloomberg News, retail giants Walmart and Target told Trump in a meeting last week that shoppers are likely to see empty shelves and higher prices from next month. They also warned that supply shocks could roll out to Christmas.\n\nElectronic appliances, such as TV sets and washing machines, made up 46.4 percent of US imports from China in 2022. The US also imports a lot of its clothing and pharmaceutical product ingredients from China. The price of these goods will begin to rise from next month.\n\nOn April 22, the International Monetary Fund raised its US inflation forecast to 3 percent in 2025, owing to tariffs – a full 1 percentage point higher than in January. The lender also lowered its US economic growth forecast and raised its expectation that the US will tip into recession this year.\n\nAdvertisement\n\nHow will China’s economy be affected?\n\nDespite growing tensions between the US and China, Washington and Beijing remain major trading partners.\n\nAccording to the Office of the US Trade Representative, the US imported $438.9bn in Chinese goods last year.\n\nThat amounts to roughly 3 percent of China’s total economic output, which remains heavily reliant on exports.\n\nIn a report shared with its clients this month, Goldman Sachs said it expects Trump’s tariffs to drag down China’s gross domestic product (GDP) by as much as 2.4 percentage points.\n\nFor their part, China’s top officials said the country can do without American farm and energy imports and promised to achieve a 5 percent GDP growth target for this year.\n\nZhao Chenxin, vice chairman of the National Development and Reform Commission, said that together with non-US imports, domestic farm and energy production would be enough to satisfy demand.\n\n“Even if we do not purchase feed grains and oilseeds from the United States, it will not have much impact on our country’s grain supply,” Zhao said on Monday.\n\nHe also noted there would be limited impact on China’s energy supplies if companies stopped importing US fossil fuels.\n\nIn some ways, experts said, China has been preparing for this crisis.\n\nFortunato told Al Jazeera: “The US is one of China’s biggest export markets, so tariffs will slow GDP growth. But Beijing has played this smartly as it began diversifying its imports away from the US during the first Trump trade war” in 2018.\n\nHe also pointed out that “the US depends on China for up to 60 percent of its critical mineral imports, used in everything from clean energy to military technology. The opposite flow simply isn’t there, so the US is more vulnerable.”\n\nAdvertisement\n\nCould the US lose its geopolitical standing?\n\nTrump has made little secret of his wish to conscript US allies into a trade war. The administration said it aims to strike free trade deals with the European Union, Great Britain and Japan.\n\nMore generally, reports suggest that Washington is asking trade partners to loosen their economic ties with China as a pre-condition for securing relief from Trump’s “reciprocal” tariffs.\n\nNevertheless, US allies seem largely opposed to any economic showdown with China. Last week, the European Commission said it has no intention of “decoupling” from China.\n\nElsewhere, UK Chancellor of the Exchequer Rachel Reeves recently told the Daily Telegraph newspaper: “China is the second biggest economy in the world, and it would be, I think, very foolish to not engage.”\n\nMany countries are not in a position to abandon their trade ties with Beijing. The EU, in particular, has a huge trade deficit with China. Cutting off access to Chinese goods – both consumer products and inputs for industry – would bruise its already sluggish economy.\n\nAcross the developing world, China’s trade role is equally as crucial. Roughly a quarter of Bangladesh’s and Cambodia’s imports come from China. Nigeria and Saudi Arabia are similarly dependent on Beijing for their goods imports.\n\n“It’s hard to see why countries would want to undermine their own business interests to try and reduce America’s trade deficit with China,” Fortunato said. “On this point, I think Trump has been short-sighted and may be forced to blink first on lowering tariffs with China.”\n\nAdvertisement\n\nIs Trump losing his grip on Republican voters?\n\nThe Chinese Communist Party doesn’t need to worry about its next election cycle. Trump’s Republican Party does, so Beijing has the political upper hand in Trump’s trade war. Simply put, it has more time on its side.\n\nFor Trump’s party, his sabre rattling already looks politically costly. A new Economist-YouGov poll shows Americans reporting Trump’s economic actions have hurt them personally more than they’ve helped by a 30-point margin.\n\nAnd public approval of the president’s economic management has been low for a while: It had fallen to 37 percent in a Reuters-Ipsos poll published on March 31, his lowest score ever in that survey.\n\nIf Trump stays the course, it is likely that his approval ratings might fall still lower, jeopardising the Republican Party’s fragile grip on the US House of Representatives – and possibly the Senate, experts said.\n\n“For these reasons”, Fortunato said, “China does not feel compelled to rush to the negotiating table to secure a trade deal. That will probably fall to Trump.”",
    "clean_body": "it’s early days but the warning signs are flashing red for the us after united states president donald trump suspended his “reciprocal tariffs” on major us trading partners on april 9 he ramped them up on china’s goods us trade levies on most imports from china have climbed to 145 percent beijing retaliated with duties of its own at 125 percent on us goods trump has long accused china of exploiting the us on trade casting his tariffs as necessary to revive domestic manufacturing and reshore jobs back to the us he also wants to use tariffs to finance tax cuts most economists remain sceptical trump will achieve his aims for now the us and china are locked in a highstakes game of chicken the world is waiting to see which country will yield and which will stay the course as trump nears his first 100 days in office for the second time here’s where the tariff war with china stands what’s happening with negotiations trump recently played up the possibility of securing a trade deal with china last week the us president said his tariffs on china will “come down substantially” in the near future advertisement “we’re going to have a fair deal with china” trump told reporters on april 23 stirring hopes of a deescalation he also said his administration was “actively” negotiating with the chinese side without elaborating on april 24 however china’s ministry of commerce rebuffed president trump’s remarks saying there were no talks taking place between the two countries “any claims about the progress of chinaus economic and trade negotiations are groundless and have no factual basis” ministry spokesman he yadong said while he insisted that beijing won’t duck any economic blows from washington he also said the door was “wide open” for talks last week the reuters news agency reported that china was evaluating exemptions for select us imports – a list of up to 131 products beijing has not made any public statement on the issue has the tariff war impacted us exports trump introduced his sweeping tariffs on china less than three weeks ago the fallout for us businesses won’t be fully felt until later this year still the warning signals are already flashing red data from the us department of agriculture shows that exports of soya beans – the biggest us farm export – fell dramatically for the period april 1117 the first full week of reporting since trump’s china tariff announcement by april 17 net sales of us soya beans dropped by 50 percent compared with the previous week that was driven by a 67 percent fall in weekly soya bean exports to china which until recently was america’s biggest export destination for the legume advertisement according to piergiuseppe fortunato an adjunct professor of economics at the university of neuchatel in switzerland “china’s retaliatory tariffs will hit us farmers hard some may go out of business” he added that all sectors with exposure to china would come under strain in 2023 the us exported roughly 15bn of oil gas and coal to china losing that market would hit us energy firms are imports to the us going to take a hit since the start of trump’s tariff war cargo shipments have plummeted according to linerlytica a shipping data provider chinese freight bookings bound for the us fell by 30 to 60 percent in april the drastic reduction in shipping from america’s third largest trading partner – after canada and mexico – has not yet been felt in may however thousands of companies will need to restock their inventories according to bloomberg news retail giants walmart and target told trump in a meeting last week that shoppers are likely to see empty shelves and higher prices from next month they also warned that supply shocks could roll out to christmas electronic appliances such as tv sets and washing machines made up 464 percent of us imports from china in 2022 the us also imports a lot of its clothing and pharmaceutical product ingredients from china the price of these goods will begin to rise from next month on april 22 the international monetary fund raised its us inflation forecast to 3 percent in 2025 owing to tariffs – a full 1 percentage point higher than in january the lender also lowered its us economic growth forecast and raised its expectation that the us will tip into recession this year advertisement how will china’s economy be affected despite growing tensions between the us and china washington and beijing remain major trading partners according to the office of the us trade representative the us imported 4389bn in chinese goods last year that amounts to roughly 3 percent of china’s total economic output which remains heavily reliant on exports in a report shared with its clients this month goldman sachs said it expects trump’s tariffs to drag down china’s gross domestic product gdp by as much as 24 percentage points for their part china’s top officials said the country can do without american farm and energy imports and promised to achieve a 5 percent gdp growth target for this year zhao chenxin vice chairman of the national development and reform commission said that together with nonus imports domestic farm and energy production would be enough to satisfy demand “even if we do not purchase feed grains and oilseeds from the united states it will not have much impact on our country’s grain supply” zhao said on monday he also noted there would be limited impact on china’s energy supplies if companies stopped importing us fossil fuels in some ways experts said china has been preparing for this crisis fortunato told al jazeera “the us is one of china’s biggest export markets so tariffs will slow gdp growth but beijing has played this smartly as it began diversifying its imports away from the us during the first trump trade war” in 2018 he also pointed out that “the us depends on china for up to 60 percent of its critical mineral imports used in everything from clean energy to military technology the opposite flow simply isn’t there so the us is more vulnerable” advertisement could the us lose its geopolitical standing trump has made little secret of his wish to conscript us allies into a trade war the administration said it aims to strike free trade deals with the european union great britain and japan more generally reports suggest that washington is asking trade partners to loosen their economic ties with china as a precondition for securing relief from trump’s “reciprocal” tariffs nevertheless us allies seem largely opposed to any economic showdown with china last week the european commission said it has no intention of “decoupling” from china elsewhere uk chancellor of the exchequer rachel reeves recently told the daily telegraph newspaper “china is the second biggest economy in the world and it would be i think very foolish to not engage” many countries are not in a position to abandon their trade ties with beijing the eu in particular has a huge trade deficit with china cutting off access to chinese goods – both consumer products and inputs for industry – would bruise its already sluggish economy across the developing world china’s trade role is equally as crucial roughly a quarter of bangladesh’s and cambodia’s imports come from china nigeria and saudi arabia are similarly dependent on beijing for their goods imports “it’s hard to see why countries would want to undermine their own business interests to try and reduce america’s trade deficit with china” fortunato said “on this point i think trump has been shortsighted and may be forced to blink first on lowering tariffs with china” advertisement is trump losing his grip on republican voters the chinese communist party doesn’t need to worry about its next election cycle trump’s republican party does so beijing has the political upper hand in trump’s trade war simply put it has more time on its side for trump’s party his sabre rattling already looks politically costly a new economistyougov poll shows americans reporting trump’s economic actions have hurt them personally more than they’ve helped by a 30point margin and public approval of the president’s economic management has been low for a while it had fallen to 37 percent in a reutersipsos poll published on march 31 his lowest score ever in that survey if trump stays the course it is likely that his approval ratings might fall still lower jeopardising the republican party’s fragile grip on the us house of representatives – and possibly the senate experts said “for these reasons” fortunato said “china does not feel compelled to rush to the negotiating table to secure a trade deal that will probably fall to trump”",
    "summary": "Advertisement“We’re going to have a fair deal with China,” Trump told reporters on April 23, stirring hopes of a de-escalation.\nBut Beijing has played this smartly as it began diversifying its imports away from the US during the first Trump trade war” in 2018.\nAcross the developing world, China’s trade role is equally as crucial.\nTrump’s Republican Party does, so Beijing has the political upper hand in Trump’s trade war.\nA new Economist-YouGov poll shows Americans reporting Trump’s economic actions have hurt them personally more than they’ve helped by a 30-point margin.",
    "keywords": [
      "trump",
      "war",
      "week",
      "tariff",
      "imports",
      "trade",
      "tariffs",
      "economic",
      "far",
      "chinas",
      "whos",
      "trumps",
      "winning",
      "beijing",
      "china",
      "trumpchina"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20240801__1434592790__v2__HighRes__DroughtInMississippiRiverBasinSlowsDownVital-1744197660.jpg?resize=1920%2C1440",
    "t": 14
  },
  "https://www.aljazeera.com/news/2025/4/23/powerful-6-2-magnitude-earthquake-shakes-turkiyes-istanbul": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/23/powerful-6-2-magnitude-earthquake-shakes-turkiyes-istanbul",
    "date": "2025-04-23",
    "time": "00:00:00",
    "title": "Magnitude 6.2 earthquake jolts Turkiye’s Istanbul",
    "body": "One person is reportedly injured from jumping off a balcony during the 6.2 magnitude quake.\n\nA strong earthquake has hit Turkiye, causing buildings in the city of Istanbul to shake.\n\nThe quake, taking place at 12:49 [09:49 GMT] on Wednesday in the Marmara Sea off the coast of Istanbul’s Silvri area, registered a preliminary 6.2 magnitude, reports Turkiye’s Disaster and Emergency Authority (AFAD).\n\nIt was at a depth of 10km (6.21 miles), according to the German Research Centre for Geosciences (GFZ).\n\nThe quake was felt in several neighbouring provinces and in the city of Izmir, some 550 kilometres (340 miles) south of Istanbul. The initial quake was followed by eight others with magnitudes of 3.5 to 5.9.\n\nAs buildings shook in the city located on the European and Asian shores of the Bosphorus strait, people rushed onto the streets where crowds of worried-looking people stared at their mobile phones for information or made calls, an AFP correspondent said.\n\n“I just felt earthquake, I’ve got to get out,” said a shaken-looking decorator rushing out of a fourth floor apartment where he was working near the city’s Galata Tower, who did not want to give his name.\n\nAdvertisement\n\nTurkey’s Interior Minister Ali Yerlikaya told national TV network HaberTurk that authorities had not received reports of collapsed buildings, but that there had been reports of damage to buildings. Transport Minister Abdulkadir Uraloglu said initial inspections did not reveal any damage or adverse conditions on highways, airports, trains or subways.\n\nBroadcaster TGRT reported that one person had been injured as a result of jumping off a balcony during the quake, which occurred during a public holiday in Turkiye, forcing authorities in Istanbul to cancel scheduled events.\n\nKemal Cebi, the mayor of Kucukcekmece district in western Istanbul, told local broadcaster NTV that there were “no negative developments yet”, but said that there were traffic jams and that many buildings were already at risk due to the density of the area.\n\nIn a post on X, Yerlikaya said emergency authorities have begun “field assessments” and offered well wishes to those affected.\n\nAFAD warned people in the region against entering damaged buildings.\n\nThe tremors could be felt as far away as Bulgaria, according to the AFP news agency in the capital Sofia.\n\nPresident Tayyip Erdogan said on X he was monitoring the situation and his office issued advice on what people should do in the case of further quakes.\n\nPrevious deadly quake\n\nTurkey is crossed by two significant fault lines, and earthquakes are frequent.\n\nThe last tremor to be felt in Istanbul was in mid-November, when a quake caused brief panic but no damage or injuries.\n\nAdvertisement\n\nA magnitude 7.8 earthquake on February 6, 2023, and a second powerful tremor that came hours later, destroyed or damaged hundreds of thousands of buildings in 11 southern and southeastern Turkish provinces, leaving more than 53,000 people dead.\n\nAnother 6,000 people were killed in the northern parts of neighbouring Syria.\n\nWhile Istanbul was not impacted by that earthquake, the devastation heightened fears of a similar quake with experts citing the city’s proximity to fault lines.\n\nIn a bid to prevent damage from any future quake, both the national government and local administrations started urban reconstruction projects to fortify buildings at risk and started campaigns of demolishing buildings at risk of collapse.",
    "clean_body": "one person is reportedly injured from jumping off a balcony during the 62 magnitude quake a strong earthquake has hit turkiye causing buildings in the city of istanbul to shake the quake taking place at 1249 0949 gmt on wednesday in the marmara sea off the coast of istanbul’s silvri area registered a preliminary 62 magnitude reports turkiye’s disaster and emergency authority afad it was at a depth of 10km 621 miles according to the german research centre for geosciences gfz the quake was felt in several neighbouring provinces and in the city of izmir some 550 kilometres 340 miles south of istanbul the initial quake was followed by eight others with magnitudes of 35 to 59 as buildings shook in the city located on the european and asian shores of the bosphorus strait people rushed onto the streets where crowds of worriedlooking people stared at their mobile phones for information or made calls an afp correspondent said “i just felt earthquake i’ve got to get out” said a shakenlooking decorator rushing out of a fourth floor apartment where he was working near the city’s galata tower who did not want to give his name advertisement turkey’s interior minister ali yerlikaya told national tv network haberturk that authorities had not received reports of collapsed buildings but that there had been reports of damage to buildings transport minister abdulkadir uraloglu said initial inspections did not reveal any damage or adverse conditions on highways airports trains or subways broadcaster tgrt reported that one person had been injured as a result of jumping off a balcony during the quake which occurred during a public holiday in turkiye forcing authorities in istanbul to cancel scheduled events kemal cebi the mayor of kucukcekmece district in western istanbul told local broadcaster ntv that there were “no negative developments yet” but said that there were traffic jams and that many buildings were already at risk due to the density of the area in a post on x yerlikaya said emergency authorities have begun “field assessments” and offered well wishes to those affected afad warned people in the region against entering damaged buildings the tremors could be felt as far away as bulgaria according to the afp news agency in the capital sofia president tayyip erdogan said on x he was monitoring the situation and his office issued advice on what people should do in the case of further quakes previous deadly quake turkey is crossed by two significant fault lines and earthquakes are frequent the last tremor to be felt in istanbul was in midnovember when a quake caused brief panic but no damage or injuries advertisement a magnitude 78 earthquake on february 6 2023 and a second powerful tremor that came hours later destroyed or damaged hundreds of thousands of buildings in 11 southern and southeastern turkish provinces leaving more than 53000 people dead another 6000 people were killed in the northern parts of neighbouring syria while istanbul was not impacted by that earthquake the devastation heightened fears of a similar quake with experts citing the city’s proximity to fault lines in a bid to prevent damage from any future quake both the national government and local administrations started urban reconstruction projects to fortify buildings at risk and started campaigns of demolishing buildings at risk of collapse",
    "summary": "One person is reportedly injured from jumping off a balcony during the 6.2 magnitude quake.\nA strong earthquake has hit Turkiye, causing buildings in the city of Istanbul to shake.\nThe quake, taking place at 12:49 [09:49 GMT] on Wednesday in the Marmara Sea off the coast of Istanbul’s Silvri area, registered a preliminary 6.2 magnitude, reports Turkiye’s Disaster and Emergency Authority (AFAD).\nThe quake was felt in several neighbouring provinces and in the city of Izmir, some 550 kilometres (340 miles) south of Istanbul.\nWhile Istanbul was not impacted by that earthquake, the devastation heightened fears of a similar quake with experts citing the city’s proximity to fault lines.",
    "keywords": [
      "earthquake",
      "damage",
      "reports",
      "jolts",
      "risk",
      "quake",
      "city",
      "istanbul",
      "62",
      "magnitude",
      "buildings",
      "turkiyes",
      "felt"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AA-20250423-37722490-37722481-62_MAGNITUDE_EARTHQUAKE_JOLTS_TURKIYE_EPICENTER_ISTANBULS_SILIVRI_DISTRICT_DISASTER_AGENCY_AFAD-1745403747.jpg?resize=1920%2C1440",
    "t": 19
  },
  "https://www.aljazeera.com/news/2025/4/26/have-scientists-discovered-a-new-colour-called-olo": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/26/have-scientists-discovered-a-new-colour-called-olo",
    "date": "2025-04-26",
    "time": "00:00:00",
    "title": "Have scientists discovered a new colour called ‘olo’?",
    "body": "Described as a ‘deeply saturated teal’ colour, humans can only see it with the help of laser technology.\n\nA team of scientists claims to have discovered a new colour that humans cannot see without the help of technology.\n\nThe researchers based in the United States said they were able to “experience” the colour, which they named “olo”, by firing laser pulses into their eyes using a device named after the Wizard of Oz.\n\nOlo cannot be seen with the naked eye, but the five people who have seen it describe it as being similar to teal.\n\nWhat has the study found?\n\nProfessors from the University of California, Berkeley and the University of Washington School of Medicine published an article in the journal, Science Advances, on April 18 in which they put forth their discovery of a hue beyond the gamut of human vision.\n\nThey explained that they had devised a technique called Oz, which can “trick” the human eye into seeing olo. The technique is named after the Wizard of Oz.\n\nIn the Wonderful Wizard of Oz, published in 1900, Frank Baum wrote about a man who uses tricks to fool the residents of the fictional land of Oz into thinking he’s a wizard. For instance, it is believed that the Emerald City, the capital of Oz, is so bright and vibrant that visitors have to wear special glasses to protect their eyes. The glasses are one of the wizard’s tricks, since they make the city appear greener and grander.\n\nHow do humans perceive colour?\n\nThe human eye perceives colour via three types of photoreceptor or “cone cells” in the retina. S cones pick up shorter, blue wavelengths of light; M cones detect medium, green wavelengths; and L cones detect longer, red wavelengths.\n\nAdvertisement\n\n“The signals from these cones are then sent through a complex series of cells in the retina that act to clean up and integrate the signal before passing it down the optic nerve through parts of the brain,” Francis Windram, a research associate at the department of life sciences at Imperial College London, told Al Jazeera.\n\nThe part of the brain that the visual information is passed to is the visual cortex.\n\nHow did scientists find the ‘new’ colour?\n\nIn normal vision, the function of M cones overlaps with the neighbouring S and L cones, so any light that stimulates M cones also activates the other two cones. The M cones don’t function alone.\n\n“There’s no wavelength in the world that can stimulate only the M cone,” Ren Ng, a professor of electrical engineering and computer sciences at UC Berkeley, explained in an article published on its website.\n\n“I began wondering what it would look like if you could just stimulate all the M cone cells. Would it be like the greenest green you’ve ever seen?”\n\nSo Ng teamed up with Austin Roorda, one of the creators of the Oz technology and a professor of optometry and vision science at UC Berkeley.\n\nOz, which Roorda described as “a microscope for looking at the retina”, uses tiny microdoses of laser light to target individual photoreceptors in the eye. The equipment, which must be highly stabilised during use, is already being used to study eye disease.\n\nThe work using Oz began in 2018 by James Carl Fong, a doctoral student in electrical engineering and computer sciences at UC Berkeley. Hannah Doyle, another doctoral student at Berkeley, ran the experiments through which human subjects were able to see the new colour, olo.\n\nAdvertisement\n\nIs olo really a new colour?\n\nThe shade of olo has always existed, it just falls beyond the spectrum of shades visible to the human eye. There are other such shades that we cannot see. Hence, olo is not a new colour that has come into existence, from a physical or scientific perspective.\n\nHowever, “from a sociolinguistic perspective, if people give new names to colours which previously were indistinguishable thanks to this technology, then maybe! It all depends on how you say it,” Windram said.\n\nHow many people have seen olo?\n\nFive people have seen the “new” colour – four men and one woman. All had normal colour vision.\n\nThree of the subjects, including Roorda and Ng, are the co-authors of the research paper while the other two are members of the participating lab at the University of Washington and were unaware of the purpose of the study before they took part.\n\nWhat does olo look like?\n\nThose who have seen olo describe it as a teal or green-blue colour – but one they had never seen before.\n\nIn the article by UC Berkeley, it is described as a “blue-green colour of unparalleled saturation”.\n\n“It was like a profoundly saturated teal … the most saturated natural colour was just pale by comparison,” Roorda said.\n\n“I wasn’t a subject for this paper, but I’ve seen olo since, and it’s very striking. You know you’re looking at something very blue-green,” Doyle said.\n\nThe researchers said an image of a teal square is the closest colour match to olo. However, this square is not an olo-coloured square. The naked human eye simply cannot see the shade.\n\nAdvertisement\n\n“If you start with the colour in that picture, and imagine dialling up the saturation further you would get to the teal of real peacock feathers, further still would be a laser in the teal wavelength, and far beyond that is olo, outside the natural space of human colors,” Ng told Al Jazeera.\n\n“We’re not going to see olo on any smartphone displays or any TVs any time soon. And this is very, very far beyond VR headset technology,” Ng said, according to a report in the UK’s Guardian newspaper.\n\nCould this technology help people with colour blindness?\n\nBerkeley researchers are exploring whether the Oz technology could help people with colour blindness.\n\n“We are now studying the science of boosting the colour dimensionality of signals going from the eye to the brain,” Ng said. “If it proves possible for a colour blind person to see full colour, the next question is whether a person with full colour could be boosted to yet a higher dimension of colour called tetrachromacy.”\n\nThis could contain colours beyond the rainbow that would need new names. Ng said that this is part of an ongoing scientific inquiry.\n\nWindram said success would depend on the cause of colourblindness in individuals. Deuteranomaly, which causes decreased sensitivity to green light, is the most common form of colour blindness.\n\n“In this case, a miniaturised version of this technology could theoretically be used to correct this by directly stimulating the cones when the correct colour of light hits them,” Windram said.\n\nAdvertisement\n\nWindram pointed out that publicity materials for the research show images of the Oz experiment on a highly stabilised table.\n\n“This would require a lot of work to miniaturise the technology, and is likely a long way off. Given that the laser must stably hit the correct cones in order to stimulate them, this may not really be feasible as a form of vision correction technologically,” he said.\n\nHow do we know how people ‘see’ colour?\n\nThe concept of a colour has three main components, Windram explained: The physical, which has to do with the wavelengths of light that meet the eye; the neurological, which refers to how humans biologically process these light signals; and the societal or linguistic component, which pertains to how colours are named.\n\n“In the end I may see a colour and call it ‘red’, someone else may call it ‘rot’ or ‘rouge’ … but also another may look at it a bit more closely and say ‘well it’s claret’ or ‘crimson’.”\n\nTo test this, neuroscience and AI researcher Patrick Mineault developed a website for entertainment purposes in September 2024, on which users can take a test to see how their colour perception compares to others.\n\nHumans can also perceive colour differently due to differences in factors such as “temperature” of light. This was demonstrated when a photo of a dress went viral in 2015, dividing social media users over whether the dress was white and gold, or blue and black.\n\nWindram explained that people who were deciding what colours the dress was were drawing on preconceived notions of whether the photograph of the dress was taken in warm lighting or cool lighting.\n\nAdvertisement\n\nDo animals see colour differently from humans?\n\nYes, different species can experience colours differently.\n\nFor example, humans process three wavelengths corresponding to red, blue and green light, while the mantis shrimp, a tiny crustacean, can visually perceive 12 channels of colour instead of three. An article by the Australian Academy of Science explains that the mantis shrimp can also detect ultraviolet and polarised light, which humans cannot see.\n\nHowever, while the human eye can mix two colours and perceive an in-between shade – such as purple as a mix of red and blue – the mantis shrimp’s eyes cannot mix colour receptors.\n\nMeanwhile, dogs only have two types of cones and can mostly only see shades of yellow and blue.",
    "clean_body": "described as a ‘deeply saturated teal’ colour humans can only see it with the help of laser technology a team of scientists claims to have discovered a new colour that humans cannot see without the help of technology the researchers based in the united states said they were able to “experience” the colour which they named “olo” by firing laser pulses into their eyes using a device named after the wizard of oz olo cannot be seen with the naked eye but the five people who have seen it describe it as being similar to teal what has the study found professors from the university of california berkeley and the university of washington school of medicine published an article in the journal science advances on april 18 in which they put forth their discovery of a hue beyond the gamut of human vision they explained that they had devised a technique called oz which can “trick” the human eye into seeing olo the technique is named after the wizard of oz in the wonderful wizard of oz published in 1900 frank baum wrote about a man who uses tricks to fool the residents of the fictional land of oz into thinking he’s a wizard for instance it is believed that the emerald city the capital of oz is so bright and vibrant that visitors have to wear special glasses to protect their eyes the glasses are one of the wizard’s tricks since they make the city appear greener and grander how do humans perceive colour the human eye perceives colour via three types of photoreceptor or “cone cells” in the retina s cones pick up shorter blue wavelengths of light m cones detect medium green wavelengths and l cones detect longer red wavelengths advertisement “the signals from these cones are then sent through a complex series of cells in the retina that act to clean up and integrate the signal before passing it down the optic nerve through parts of the brain” francis windram a research associate at the department of life sciences at imperial college london told al jazeera the part of the brain that the visual information is passed to is the visual cortex how did scientists find the ‘new’ colour in normal vision the function of m cones overlaps with the neighbouring s and l cones so any light that stimulates m cones also activates the other two cones the m cones don’t function alone “there’s no wavelength in the world that can stimulate only the m cone” ren ng a professor of electrical engineering and computer sciences at uc berkeley explained in an article published on its website “i began wondering what it would look like if you could just stimulate all the m cone cells would it be like the greenest green you’ve ever seen” so ng teamed up with austin roorda one of the creators of the oz technology and a professor of optometry and vision science at uc berkeley oz which roorda described as “a microscope for looking at the retina” uses tiny microdoses of laser light to target individual photoreceptors in the eye the equipment which must be highly stabilised during use is already being used to study eye disease the work using oz began in 2018 by james carl fong a doctoral student in electrical engineering and computer sciences at uc berkeley hannah doyle another doctoral student at berkeley ran the experiments through which human subjects were able to see the new colour olo advertisement is olo really a new colour the shade of olo has always existed it just falls beyond the spectrum of shades visible to the human eye there are other such shades that we cannot see hence olo is not a new colour that has come into existence from a physical or scientific perspective however “from a sociolinguistic perspective if people give new names to colours which previously were indistinguishable thanks to this technology then maybe it all depends on how you say it” windram said how many people have seen olo five people have seen the “new” colour – four men and one woman all had normal colour vision three of the subjects including roorda and ng are the coauthors of the research paper while the other two are members of the participating lab at the university of washington and were unaware of the purpose of the study before they took part what does olo look like those who have seen olo describe it as a teal or greenblue colour – but one they had never seen before in the article by uc berkeley it is described as a “bluegreen colour of unparalleled saturation” “it was like a profoundly saturated teal … the most saturated natural colour was just pale by comparison” roorda said “i wasn’t a subject for this paper but i’ve seen olo since and it’s very striking you know you’re looking at something very bluegreen” doyle said the researchers said an image of a teal square is the closest colour match to olo however this square is not an olocoloured square the naked human eye simply cannot see the shade advertisement “if you start with the colour in that picture and imagine dialling up the saturation further you would get to the teal of real peacock feathers further still would be a laser in the teal wavelength and far beyond that is olo outside the natural space of human colors” ng told al jazeera “we’re not going to see olo on any smartphone displays or any tvs any time soon and this is very very far beyond vr headset technology” ng said according to a report in the uk’s guardian newspaper could this technology help people with colour blindness berkeley researchers are exploring whether the oz technology could help people with colour blindness “we are now studying the science of boosting the colour dimensionality of signals going from the eye to the brain” ng said “if it proves possible for a colour blind person to see full colour the next question is whether a person with full colour could be boosted to yet a higher dimension of colour called tetrachromacy” this could contain colours beyond the rainbow that would need new names ng said that this is part of an ongoing scientific inquiry windram said success would depend on the cause of colourblindness in individuals deuteranomaly which causes decreased sensitivity to green light is the most common form of colour blindness “in this case a miniaturised version of this technology could theoretically be used to correct this by directly stimulating the cones when the correct colour of light hits them” windram said advertisement windram pointed out that publicity materials for the research show images of the oz experiment on a highly stabilised table “this would require a lot of work to miniaturise the technology and is likely a long way off given that the laser must stably hit the correct cones in order to stimulate them this may not really be feasible as a form of vision correction technologically” he said how do we know how people ‘see’ colour the concept of a colour has three main components windram explained the physical which has to do with the wavelengths of light that meet the eye the neurological which refers to how humans biologically process these light signals and the societal or linguistic component which pertains to how colours are named “in the end i may see a colour and call it ‘red’ someone else may call it ‘rot’ or ‘rouge’ … but also another may look at it a bit more closely and say ‘well it’s claret’ or ‘crimson’” to test this neuroscience and ai researcher patrick mineault developed a website for entertainment purposes in september 2024 on which users can take a test to see how their colour perception compares to others humans can also perceive colour differently due to differences in factors such as “temperature” of light this was demonstrated when a photo of a dress went viral in 2015 dividing social media users over whether the dress was white and gold or blue and black windram explained that people who were deciding what colours the dress was were drawing on preconceived notions of whether the photograph of the dress was taken in warm lighting or cool lighting advertisement do animals see colour differently from humans yes different species can experience colours differently for example humans process three wavelengths corresponding to red blue and green light while the mantis shrimp a tiny crustacean can visually perceive 12 channels of colour instead of three an article by the australian academy of science explains that the mantis shrimp can also detect ultraviolet and polarised light which humans cannot see however while the human eye can mix two colours and perceive an inbetween shade – such as purple as a mix of red and blue – the mantis shrimp’s eyes cannot mix colour receptors meanwhile dogs only have two types of cones and can mostly only see shades of yellow and blue",
    "summary": "A team of scientists claims to have discovered a new colour that humans cannot see without the help of technology.\nThey explained that they had devised a technique called Oz, which can “trick” the human eye into seeing olo.\nThe human eye perceives colour via three types of photoreceptor or “cone cells” in the retina.\nHannah Doyle, another doctoral student at Berkeley, ran the experiments through which human subjects were able to see the new colour, olo.\nThose who have seen olo describe it as a teal or green-blue colour – but one they had never seen before.",
    "keywords": [
      "called",
      "teal",
      "oz",
      "cones",
      "human",
      "technology",
      "scientists",
      "seen",
      "olo",
      "eye",
      "discovered",
      "light",
      "colour"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/PXL_20250417_173048812-1746021042.jpg?resize=1920%2C1440",
    "t": 16
  },
  "https://www.aljazeera.com/news/2025/4/30/somalia-bans-entry-of-taiwanese-citizens-says-taipei": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/30/somalia-bans-entry-of-taiwanese-citizens-says-taipei",
    "date": "2025-04-30",
    "time": "00:00:00",
    "title": "Somalia bans entry of Taiwan citizens in bid to please China: Taipei",
    "body": "Somalia’s ban on transit and entry of all Taiwanese passport holders has taken effect, according to Taiwan’s Ministry of Foreign Affairs, which accused China of pressuring the East African country into introducing the measures.\n\nThe ministry of the self-ruled island, claimed by China, said on Tuesday evening that Somalia’s civil aviation authority informed it last week of the new policy that came into force on Wednesday.\n\n“The Ministry of Foreign Affairs has strongly protested Somalia’s action made under the instigation of China to restrict the travel freedom and safety of Taiwanese nationals and has demanded that the Somali government immediately revoke the notice,” it said.\n\nThe ministry also said Somalia cited United Nations Resolution 2758, which in 1971 called for member states to restore Beijing as the “only lawful representatives of China” to the body, and invoked the “one China” principle.\n\nIt “firmly rejected and strongly condemned” Somalia’s “misinterpretation” of the UN resolution, accusing Mogadishu of using it to “create the false impression that Taiwan is part of the People’s Republic of China”.\n\nAdvertisement\n\nThe move comes amid deepening ties between Taiwan and Somaliland, a breakaway region that declared independence from Somalia in 1991 but remains unrecognised by most of the world.\n\nIn 2020, the two self-governed territories opened de facto embassies in each other’s capitals, prompting anger in Mogadishu.\n\nChina’s Ministry of Foreign Affairs spokesman Guo Jiakun said the decision was a legitimate step to protect Somalia’s interests and demonstrates “that Somalia firmly abides by the one China principle”. Beijing “highly appreciates” the move and pledges its support for Mogadishu’s claim to Somaliland, he added.\n\nHe said China also opposes “any form of official exchange” between Taiwan and Somaliland.\n\nLimited recognition\n\nTaiwan, under its official name the Republic of China, lost its UN seat to China in 1971, a year before it was evicted from the World Health Organization.\n\nWhile only 11 countries and the Vatican formally recognise Taiwan as a state, many – including the United States – maintain close unofficial ties.\n\nChina views Taiwan as part of its territory and has not ruled out the use of force to bring the island under its control.\n\nTaiwan’s state news agency Focus Taiwan said the Somalia travel restriction is unlikely to have much practical effect, noting that Taiwanese nationals rarely visit the country.\n\nCiting government data, it said only 16 trips were made to Somalia by Taiwanese citizens between 2016 and February this year.",
    "clean_body": "somalia’s ban on transit and entry of all taiwanese passport holders has taken effect according to taiwan’s ministry of foreign affairs which accused china of pressuring the east african country into introducing the measures the ministry of the selfruled island claimed by china said on tuesday evening that somalia’s civil aviation authority informed it last week of the new policy that came into force on wednesday “the ministry of foreign affairs has strongly protested somalia’s action made under the instigation of china to restrict the travel freedom and safety of taiwanese nationals and has demanded that the somali government immediately revoke the notice” it said the ministry also said somalia cited united nations resolution 2758 which in 1971 called for member states to restore beijing as the “only lawful representatives of china” to the body and invoked the “one china” principle it “firmly rejected and strongly condemned” somalia’s “misinterpretation” of the un resolution accusing mogadishu of using it to “create the false impression that taiwan is part of the people’s republic of china” advertisement the move comes amid deepening ties between taiwan and somaliland a breakaway region that declared independence from somalia in 1991 but remains unrecognised by most of the world in 2020 the two selfgoverned territories opened de facto embassies in each other’s capitals prompting anger in mogadishu china’s ministry of foreign affairs spokesman guo jiakun said the decision was a legitimate step to protect somalia’s interests and demonstrates “that somalia firmly abides by the one china principle” beijing “highly appreciates” the move and pledges its support for mogadishu’s claim to somaliland he added he said china also opposes “any form of official exchange” between taiwan and somaliland limited recognition taiwan under its official name the republic of china lost its un seat to china in 1971 a year before it was evicted from the world health organization while only 11 countries and the vatican formally recognise taiwan as a state many – including the united states – maintain close unofficial ties china views taiwan as part of its territory and has not ruled out the use of force to bring the island under its control taiwan’s state news agency focus taiwan said the somalia travel restriction is unlikely to have much practical effect noting that taiwanese nationals rarely visit the country citing government data it said only 16 trips were made to somalia by taiwanese citizens between 2016 and february this year",
    "summary": "China’s Ministry of Foreign Affairs spokesman Guo Jiakun said the decision was a legitimate step to protect Somalia’s interests and demonstrates “that Somalia firmly abides by the one China principle”.\nHe said China also opposes “any form of official exchange” between Taiwan and Somaliland.\nChina views Taiwan as part of its territory and has not ruled out the use of force to bring the island under its control.\nTaiwan’s state news agency Focus Taiwan said the Somalia travel restriction is unlikely to have much practical effect, noting that Taiwanese nationals rarely visit the country.\nCiting government data, it said only 16 trips were made to Somalia by Taiwanese citizens between 2016 and February this year.",
    "keywords": [
      "united",
      "ministry",
      "bid",
      "affairs",
      "bans",
      "taiwanese",
      "foreign",
      "taipei",
      "entry",
      "somalias",
      "somalia",
      "citizens",
      "china",
      "taiwan",
      "travel"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/2020-04-03T000000Z_547677312_RC2VWF9IBNAH_RTRMADP_3_HEALTH-CORONAVIRUS-TAIWAN-CHINA-1746001994.jpg?resize=1920%2C1440",
    "t": 12
  },
  "https://www.aljazeera.com/news/2025/4/15/russian-spy-chief-threatens-poland-and-baltic-states": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/15/russian-spy-chief-threatens-poland-and-baltic-states",
    "date": "2025-04-15",
    "time": "00:00:00",
    "title": "Russian spy chief threatens Poland and Baltic States",
    "body": "Sergey Naryshkin’s comments likely to stoke concern that Russia could threaten other European states after Ukraine.\n\nRussia’s foreign intelligence chief has threatened that Poland and the Baltic States will be targeted in the event of NATO “aggression”.\n\nSergey Naryshkin said in an interview published on Tuesday that Russia would inflict “damage” on the entire military alliance if NATO threatens it or Belarus, but that Poland, Lithuania, Latvia and Estonia would be “the first to suffer”.\n\nHis comments to state news agency RIA Novosti will offer support to claims that Moscow would turn its eye on Europe’s former members of the Eastern Bloc should its invasion of Ukraine fulfil its goals.\n\nThe spy chief blamed an increase in NATO military activity near the borders of Russia and Belarus for “the current major, very dangerous crisis on the European continent”.\n\n“Poland and the Baltic republics are particularly aggressive, at least in words, they are constantly rattling their weapons,” he said.\n\n“They should understand, although they do not yet understand, that in the event of aggression from the North Atlantic Alliance against the Union State, damage will certainly be inflicted on the entire NATO bloc, but to a greater extent the first to suffer will be the bearers of such ideas among the political circles of Poland and the Baltic countries,” he noted.\n\nAdvertisement\n\nNaryskin noted in particular what he called Poland’s recent announcement that it is seeking access to nuclear weapons.\n\nPresident Emmanuel Macron suggested last month that France could extend its nuclear umbrella to cover European allies. Polish President Andrzej Duda responded by saying such a move would be “beneficial for Polish security”.\n\nThe Russian spy chief also claimed Poland plans to “install about two million antitank mines along the borders of Belarus and the Kaliningrad region”.\n\nPoland and the Baltic States announced last month that, fearing the resurgence of Russian aggression, they were withdrawing from the Ottawa Convention, an international treaty banning the use of landmines.\n\nNaryshkin restated Russia’s strategic goals in peace talks, saying the Kremlin did not want Ukraine to possess nuclear weapons and that it was seeking “demilitarisation and denazification” of the country.\n\nCritics worry that, as the United States attempts to broker a ceasefire in Ukraine, it is set to reward Moscow with territorial and security concessions.\n\nThat, they assert, will encourage Russia’s expansionist ambitions, and enable it to re-arm, re-deploy, and bite further into Europe.",
    "clean_body": "sergey naryshkin’s comments likely to stoke concern that russia could threaten other european states after ukraine russia’s foreign intelligence chief has threatened that poland and the baltic states will be targeted in the event of nato “aggression” sergey naryshkin said in an interview published on tuesday that russia would inflict “damage” on the entire military alliance if nato threatens it or belarus but that poland lithuania latvia and estonia would be “the first to suffer” his comments to state news agency ria novosti will offer support to claims that moscow would turn its eye on europe’s former members of the eastern bloc should its invasion of ukraine fulfil its goals the spy chief blamed an increase in nato military activity near the borders of russia and belarus for “the current major very dangerous crisis on the european continent” “poland and the baltic republics are particularly aggressive at least in words they are constantly rattling their weapons” he said “they should understand although they do not yet understand that in the event of aggression from the north atlantic alliance against the union state damage will certainly be inflicted on the entire nato bloc but to a greater extent the first to suffer will be the bearers of such ideas among the political circles of poland and the baltic countries” he noted advertisement naryskin noted in particular what he called poland’s recent announcement that it is seeking access to nuclear weapons president emmanuel macron suggested last month that france could extend its nuclear umbrella to cover european allies polish president andrzej duda responded by saying such a move would be “beneficial for polish security” the russian spy chief also claimed poland plans to “install about two million antitank mines along the borders of belarus and the kaliningrad region” poland and the baltic states announced last month that fearing the resurgence of russian aggression they were withdrawing from the ottawa convention an international treaty banning the use of landmines naryshkin restated russia’s strategic goals in peace talks saying the kremlin did not want ukraine to possess nuclear weapons and that it was seeking “demilitarisation and denazification” of the country critics worry that as the united states attempts to broker a ceasefire in ukraine it is set to reward moscow with territorial and security concessions that they assert will encourage russia’s expansionist ambitions and enable it to rearm redeploy and bite further into europe",
    "summary": "Sergey Naryshkin’s comments likely to stoke concern that Russia could threaten other European states after Ukraine.\nRussia’s foreign intelligence chief has threatened that Poland and the Baltic States will be targeted in the event of NATO “aggression”.\n“Poland and the Baltic republics are particularly aggressive, at least in words, they are constantly rattling their weapons,” he said.\nThe Russian spy chief also claimed Poland plans to “install about two million antitank mines along the borders of Belarus and the Kaliningrad region”.\nPoland and the Baltic States announced last month that, fearing the resurgence of Russian aggression, they were withdrawing from the Ottawa Convention, an international treaty banning the use of landmines.",
    "keywords": [
      "russia",
      "european",
      "russian",
      "chief",
      "threatens",
      "nuclear",
      "ukraine",
      "poland",
      "nato",
      "spy",
      "belarus",
      "baltic",
      "states"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AP24269676844339-1744712305.jpg?resize=1200%2C675",
    "t": 27
  },
  "https://www.aljazeera.com/news/2025/4/14/peru-mourns-death-of-literary-giant-mario-vargas-llosa": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/14/peru-mourns-death-of-literary-giant-mario-vargas-llosa",
    "date": "2025-04-14",
    "time": "00:00:00",
    "title": "Peru mourns death of literary giant Mario Vargas Llosa",
    "body": "The writer was a leading light in the 20th-century Latin American literature boom and has won a Nobel Prize.\n\nPeru has declared a national day of mourning with flags flying at half-mast on government premises in memory of writer and Nobel laureate Mario Vargas Llosa.\n\nVargas Llosa died at the age of 89 on Sunday in the Peruvian capital, Lima, surrounded by his family. His body will be cremated and “no public ceremony will take place”, in accordance with his wishes and instructions, his family said.\n\n“His departure will sadden his relatives, his friends and his readers around the world, but we hope that they will find comfort, as we do, in the fact that he enjoyed a long, adventurous and fruitful life, and leaves behind him a body of work that will outlive him,” his eldest son Alvaro wrote in a message on X, also signed by his siblings Gonzalo and Morgana Vargas Llosa, on Sunday.\n\nIt is with deep sorrow that we announce that our father, Mario Vargas LLosa, passed away peacefully in Lima today, surrounded by his family.@morganavll pic.twitter.com/c6HgEfyaIe — Álvaro Vargas Llosa (@AlvaroVargasLl) April 14, 2025\n\nAdvertisement\n\nVargas Llosa was a leading light in the 20th-century Latin American literature boom, which also included Colombian Gabriel Garcia Marquez, and won the Nobel Prize for literature in 2010 for works like Aunt Julia and the Scriptwriter, Death in the Andes, and The War of the End of the World.\n\nBorn to middle-class parents in Arequipa, Peru, on March 28, 1936, Vargas Llosa frequently drew from personal experience and his family, at times inserting characters based on his own life into his tales.\n\nHis acclaimed debut novel, The Time of the Hero (1963), was loosely based on his teenage life as a cadet at a military academy in Lima, while his 1993 memoir, A Fish in the Water, focused on his 1990 presidential run.\n\nOther works expressed deep concern for his country. The Storyteller (1987) deals with the clash of Indigenous and European cultures in Peru, while Death in the Andes (1993) recounts the haunting and bloody years of the Shining Path hardline movement.\n\n“An author’s work is fed by his own experience and, over the years, becomes richer,” Vargas Llosa told the Reuters news agency in an interview in Madrid in 2001.\n\nThe Nobel Committee said in 2010 it was awarding him “for his cartography of structures of power and his trenchant images of the individual’s resistance, revolt, and defeat”.\n\nPaying tribute to his colleague, fellow Peruvian writer Alfredo Bryce Echenique hailed Vargas Llosa’s “enormity”. He told Peruvian radio RPP his friend’s death was “a sorrow for Peru”.\n\nIn a post on X, Peru’s President Dina Boluarte called him the “most illustrious Peruvian of all time”.\n\nAdvertisement\n\n“His intellectual genius and vast body of work will remain an everlasting legacy for future generations,” she added.\n\nVargas Llosa’s works were also translated into some 30 languages.\n\nUS Deputy State Secretary State Christopher Landau said, “To label him as just Peruvian would be a disservice because his themes and interests were timeless and universal.”\n\n“He will live on in my bookshelves and many others in Latin America and around the world,” Landau wrote on X.\n\nPolitical forays and denouncing Castro\n\nBesides authoring books, Vargas Llosa was also outspoken on political issues.\n\nAlthough an early supporter of the Cuban revolution led by Fidel Castro, he later grew disillusioned and denounced Castro’s Cuba. By 1980, he said he no longer believed in socialism as a solution for developing nations.\n\nIn 1990, Vargas Llosa ran for president of Peru, saying he wanted to save his country from economic chaos and a Marxist armed rebellion.\n\nHe, however, lost in the run-off to Alberto Fujimori, a then-unknown agronomist and university professor who defeated the armed rebels but was later jailed for human rights crimes and corruption.\n\nFrustrated by his loss, the writer moved to Spain but remained influential in Latin America, harshly criticising a new wave of strident left-wing leaders led by then-Venezuelan President Hugo Chavez.\n\n“In reality, I never had a political career,” Vargas Llosa once said.\n\n“I took part in politics under very special circumstances … and I always said that whether I won or lost the elections, I was going back to my literary, intellectual job, not politics.”",
    "clean_body": "the writer was a leading light in the 20thcentury latin american literature boom and has won a nobel prize peru has declared a national day of mourning with flags flying at halfmast on government premises in memory of writer and nobel laureate mario vargas llosa vargas llosa died at the age of 89 on sunday in the peruvian capital lima surrounded by his family his body will be cremated and “no public ceremony will take place” in accordance with his wishes and instructions his family said “his departure will sadden his relatives his friends and his readers around the world but we hope that they will find comfort as we do in the fact that he enjoyed a long adventurous and fruitful life and leaves behind him a body of work that will outlive him” his eldest son alvaro wrote in a message on x also signed by his siblings gonzalo and morgana vargas llosa on sunday it is with deep sorrow that we announce that our father mario vargas llosa passed away peacefully in lima today surrounded by his familymorganavll pictwittercomc6hgefyaie — álvaro vargas llosa alvarovargasll april 14 2025 advertisement vargas llosa was a leading light in the 20thcentury latin american literature boom which also included colombian gabriel garcia marquez and won the nobel prize for literature in 2010 for works like aunt julia and the scriptwriter death in the andes and the war of the end of the world born to middleclass parents in arequipa peru on march 28 1936 vargas llosa frequently drew from personal experience and his family at times inserting characters based on his own life into his tales his acclaimed debut novel the time of the hero 1963 was loosely based on his teenage life as a cadet at a military academy in lima while his 1993 memoir a fish in the water focused on his 1990 presidential run other works expressed deep concern for his country the storyteller 1987 deals with the clash of indigenous and european cultures in peru while death in the andes 1993 recounts the haunting and bloody years of the shining path hardline movement “an author’s work is fed by his own experience and over the years becomes richer” vargas llosa told the reuters news agency in an interview in madrid in 2001 the nobel committee said in 2010 it was awarding him “for his cartography of structures of power and his trenchant images of the individual’s resistance revolt and defeat” paying tribute to his colleague fellow peruvian writer alfredo bryce echenique hailed vargas llosa’s “enormity” he told peruvian radio rpp his friend’s death was “a sorrow for peru” in a post on x peru’s president dina boluarte called him the “most illustrious peruvian of all time” advertisement “his intellectual genius and vast body of work will remain an everlasting legacy for future generations” she added vargas llosa’s works were also translated into some 30 languages us deputy state secretary state christopher landau said “to label him as just peruvian would be a disservice because his themes and interests were timeless and universal” “he will live on in my bookshelves and many others in latin america and around the world” landau wrote on x political forays and denouncing castro besides authoring books vargas llosa was also outspoken on political issues although an early supporter of the cuban revolution led by fidel castro he later grew disillusioned and denounced castro’s cuba by 1980 he said he no longer believed in socialism as a solution for developing nations in 1990 vargas llosa ran for president of peru saying he wanted to save his country from economic chaos and a marxist armed rebellion he however lost in the runoff to alberto fujimori a thenunknown agronomist and university professor who defeated the armed rebels but was later jailed for human rights crimes and corruption frustrated by his loss the writer moved to spain but remained influential in latin america harshly criticising a new wave of strident leftwing leaders led by thenvenezuelan president hugo chavez “in reality i never had a political career” vargas llosa once said “i took part in politics under very special circumstances … and i always said that whether i won or lost the elections i was going back to my literary intellectual job not politics”",
    "summary": "Peru has declared a national day of mourning with flags flying at half-mast on government premises in memory of writer and Nobel laureate Mario Vargas Llosa.\nVargas Llosa died at the age of 89 on Sunday in the Peruvian capital, Lima, surrounded by his family.\nIt is with deep sorrow that we announce that our father, Mario Vargas LLosa, passed away peacefully in Lima today, surrounded by his family.\nPolitical forays and denouncing CastroBesides authoring books, Vargas Llosa was also outspoken on political issues.\n“In reality, I never had a political career,” Vargas Llosa once said.",
    "keywords": [
      "mario",
      "nobel",
      "latin",
      "death",
      "works",
      "literary",
      "won",
      "peru",
      "giant",
      "vargas",
      "work",
      "writer",
      "mourns",
      "peruvian",
      "president",
      "llosa"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250414__42964NT__v1__HighRes__FilesPeruLiteratureVargasLlosaObit-1744628937.jpg?resize=1767%2C1080",
    "t": 28
  },
  "https://www.aljazeera.com/news/2025/4/21/bitter-easter-truth-why-has-chocolate-become-so-expensive": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/21/bitter-easter-truth-why-has-chocolate-become-so-expensive",
    "date": "2025-04-21",
    "time": "00:00:00",
    "title": "Bitter truth: Why has chocolate become so expensive?",
    "body": "Cocoa prices surged almost 300 percent last year, making chocolate bars, Easter eggs and cocoa powder much more expensive this year than last.\n\nIn the United States, retail chocolate prices were one-fifth higher this Valentine’s Day compared with last year, according to Wells Fargo Bank. The price of a king-size US-sold Reese’s Hearts chocolate bar was 13 percent higher in February 2024 than in the same month the year before.\n\nIn the United Kingdom, meanwhile, a Twix white chocolate Easter egg rose in price from 5 to 6 pounds ($6.63 to $7.96) at Tesco supermarkets in the run-up to Easter (year-on-year) and was reduced in size from 316g (11oz) to 258g (9oz). In all, the unit price rose by a whopping 47 percent.\n\nWhile the price of cocoa – the key ingredient in chocolate made from roasted raw cacao beans – has fallen back by about 20 percent since its all-time high in December 2024, consumers are still paying record prices for chocolate.\n\nThe spike in the price of cocoa can be chalked up to several factors. Chief among them is extreme weather, which has hit cocoa producers in West Africa, from where most of the world imports cocoa.\n\nAdvertisement\n\nAccording to Amber Sawyer, an analyst at the environmental think tank Energy and Climate Intelligence Unit (ECIU), expensive chocolate should not come as a surprise.\n\n“Chocolate is just one of the many foods being made more expensive by climate change-driven extreme weather,” she said. “These extremes will keep getting worse.”\n\nAnd so might the prices.\n\nWhat has happened to the price of cocoa?\n\nBenchmark New York futures contracts, used to exchange cocoa at a specified future date and price, hit a high of $12,565 per metric tonne in December 2024.\n\nLast year’s meagre cocoa harvest led to record supply shortfalls, as poor weather and disease devastated crops in Ghana and the Ivory Coast, where two-thirds of the world’s cocoa beans are grown.\n\nCrop shortages were also observed in Nigeria and Indonesia, the third- and fourth-largest cocoa producers.\n\nIn all, there was a 500,000-tonne deficit of cocoa in global markets in 2024, which is continuing to keep prices high.\n\nThe latest cocoa harvest – which ran from October 2024 to March 2025 – did get off to a bright start, with 33 percent more beans arriving at Ivory Coast ports compared with last year, Commerzbank analyst Carsten Fritsch said in a note to clients.\n\nBut while the New York cocoa futures price is currently hovering at about $8,350 per tonne – a significant drop from December – concerns are growing that the same dry weather that wrecked last year’s crop will take a similarly devastating toll this year, Fritsch said.\n\nThe uncertainty is taking a toll on chocolate producers. Swiss chocolate maker Barry Callebaut slashed its annual sales forecasts on April 11 due to what it called “unprecedented volatility” in cocoa prices, sending its shares falling almost 20 percent – its biggest ever one-day drop.\n\nWhat is causing the rise in prices?\n\nAdvertisement\n\nWeather\n\nVolatile weather is one major factor. West Africa experienced extreme rainfall in 2023, with total precipitation more than double the 30-year average in some places, while 2024 saw extreme heat and drought.\n\nMany climate scientists point to the El Nino weather phenomenon, which produces warmer-than-average sea surface temperatures in the central and eastern tropical Pacific Ocean, as the primary driver for volatile weather patterns. However, they also expect a transition to the La Nina pattern – the cooling of ocean surface temperatures in the central and east-central equatorial Pacific every three to five years – to revive cocoa yields at least temporarily.\n\nIndeed, the International Cocoa Organization in February forecast a global cocoa surplus of 142,000 megatonnes for 2024-25, the first surplus in four years. That partly explains the recent fall in price.\n\nBut according to Felipe Pohlmann Gonzaga, a Switzerland-based commodity trader, the larger picture of “climate change is only going to make supply concerns worse” in the longer term.\n\nScientists at the research group Climate Central published a paper this year showing that climate change compromised cacao trees during the harvest season in Ivory Coast and Ghana.\n\nLaws against deforestation\n\nBesides changing weather patterns, several other issues are also driving recent price hikes in cocoa.\n\nAcross West Africa, new deforestation laws have prevented farmers from expanding cocoa plantations, keeping a lid on supply.\n\nWest Africa is also grappling with an ageing tree stock. “Older trees are not being replaced,” Pohlmann Gonzaga told Al Jazeera. “There has been under-investment in the industry.”\n\nAdvertisement\n\nDisease\n\nAt the same time, the spread of the cocoa swollen shoot virus (CSSV) has hit harvests. Tropical Research Services, a market research group, recently found that Ivory Coast cocoa production could halve due to the spread of CSSV.\n\nIllegal gold mining\n\nMeanwhile, Ghanaian cocoa farmers are abandoning beans for gold in an illegal mining boom that has hit Ghana’s cocoa production and helped drive up prices.\n\nIn recent months, investors have been buying up the precious metal to shield themselves from the financial market turmoil unleashed by United States President Donald Trump’s trade tariffs. On April 16, gold reached $3,357 per ounce for the first time.\n\nAs a result, many farmers are selling their holdings to illegal miners who have decimated swaths of land in pursuit of gold. Ghana is Africa’s leading producer of gold – and the sixth-largest globally.\n\nWill cocoa prices continue to rise?\n\n“Tariffs have had an impact on the value of commodities, and cocoa is no exception,” says Pohlmann Gonzaga. “At first, you’d think trade levies would reduce demand for cocoa in the US, which is a big consumer.” The US consumes the most chocolate in the world, though the Swiss take that tag for the most per-capita consumption.\n\n“But if US consumption persists, that could raise prices. And of course, Trump may drop tariffs [on West African cocoa exporters] in the future, which would probably lead to higher demand.”\n\nAdvertisement\n\nPohlmann Gonzaga cited the growing demand for chocolate in East Asia. “We may be seeing a similar trend as with coffee,” he said. China’s coffee consumption, for instance, increased by more than 60 percent between 2019 and 2024.\n\nIn the near term, Pohlmann Gonzaga said prices are likely to “trend sideways … as these factors can cancel each other out. Volatility will be the word of order for this year”.\n\nHow have chocolate manufacturers responded?\n\nSo far, producers have responded in one of two ways – by passing the higher cost to consumers, or by promoting products with less cocoa or with substitute ingredients.\n\nLast year, food giant Nestle introduced a hazelnut flavour to its British Aero line of chocolate bars, which, at 36g (1.3oz), are about one-third the weight of competing chocolate bars.\n\nIn 2024, agri-food giant Cargill partnered with US chocolate alternatives producer Voyage Foods – which creates cocoa-free bars from grape seeds, sunflower flour and other flavourings – to be its business-to-business distributor.\n\nIn addition to big companies, startups like Nukoko and Planet A are exploring microbial fermentation techniques to enhance and mimic the aromas and flavours of chocolate.\n\nElsewhere, Dubai chocolate was founded in 2022. Its products are filled with pistachio and tahini and are inspired by kunafa, the chessy, saccharine dessert that is a staple across the Middle East and North Africa. Since coming to market, it has become a social media sensation.\n\nIf cocoa prices continue rising, “I’d expect to see more and more cocoa substitutes on supermarket shelves. The interesting question is whether consumer tastes will change”, said Pohlmann Gonzaga.",
    "clean_body": "cocoa prices surged almost 300 percent last year making chocolate bars easter eggs and cocoa powder much more expensive this year than last in the united states retail chocolate prices were onefifth higher this valentine’s day compared with last year according to wells fargo bank the price of a kingsize ussold reese’s hearts chocolate bar was 13 percent higher in february 2024 than in the same month the year before in the united kingdom meanwhile a twix white chocolate easter egg rose in price from 5 to 6 pounds 663 to 796 at tesco supermarkets in the runup to easter yearonyear and was reduced in size from 316g 11oz to 258g 9oz in all the unit price rose by a whopping 47 percent while the price of cocoa – the key ingredient in chocolate made from roasted raw cacao beans – has fallen back by about 20 percent since its alltime high in december 2024 consumers are still paying record prices for chocolate the spike in the price of cocoa can be chalked up to several factors chief among them is extreme weather which has hit cocoa producers in west africa from where most of the world imports cocoa advertisement according to amber sawyer an analyst at the environmental think tank energy and climate intelligence unit eciu expensive chocolate should not come as a surprise “chocolate is just one of the many foods being made more expensive by climate changedriven extreme weather” she said “these extremes will keep getting worse” and so might the prices what has happened to the price of cocoa benchmark new york futures contracts used to exchange cocoa at a specified future date and price hit a high of 12565 per metric tonne in december 2024 last year’s meagre cocoa harvest led to record supply shortfalls as poor weather and disease devastated crops in ghana and the ivory coast where twothirds of the world’s cocoa beans are grown crop shortages were also observed in nigeria and indonesia the third and fourthlargest cocoa producers in all there was a 500000tonne deficit of cocoa in global markets in 2024 which is continuing to keep prices high the latest cocoa harvest – which ran from october 2024 to march 2025 – did get off to a bright start with 33 percent more beans arriving at ivory coast ports compared with last year commerzbank analyst carsten fritsch said in a note to clients but while the new york cocoa futures price is currently hovering at about 8350 per tonne – a significant drop from december – concerns are growing that the same dry weather that wrecked last year’s crop will take a similarly devastating toll this year fritsch said the uncertainty is taking a toll on chocolate producers swiss chocolate maker barry callebaut slashed its annual sales forecasts on april 11 due to what it called “unprecedented volatility” in cocoa prices sending its shares falling almost 20 percent – its biggest ever oneday drop what is causing the rise in prices advertisement weather volatile weather is one major factor west africa experienced extreme rainfall in 2023 with total precipitation more than double the 30year average in some places while 2024 saw extreme heat and drought many climate scientists point to the el nino weather phenomenon which produces warmerthanaverage sea surface temperatures in the central and eastern tropical pacific ocean as the primary driver for volatile weather patterns however they also expect a transition to the la nina pattern – the cooling of ocean surface temperatures in the central and eastcentral equatorial pacific every three to five years – to revive cocoa yields at least temporarily indeed the international cocoa organization in february forecast a global cocoa surplus of 142000 megatonnes for 202425 the first surplus in four years that partly explains the recent fall in price but according to felipe pohlmann gonzaga a switzerlandbased commodity trader the larger picture of “climate change is only going to make supply concerns worse” in the longer term scientists at the research group climate central published a paper this year showing that climate change compromised cacao trees during the harvest season in ivory coast and ghana laws against deforestation besides changing weather patterns several other issues are also driving recent price hikes in cocoa across west africa new deforestation laws have prevented farmers from expanding cocoa plantations keeping a lid on supply west africa is also grappling with an ageing tree stock “older trees are not being replaced” pohlmann gonzaga told al jazeera “there has been underinvestment in the industry” advertisement disease at the same time the spread of the cocoa swollen shoot virus cssv has hit harvests tropical research services a market research group recently found that ivory coast cocoa production could halve due to the spread of cssv illegal gold mining meanwhile ghanaian cocoa farmers are abandoning beans for gold in an illegal mining boom that has hit ghana’s cocoa production and helped drive up prices in recent months investors have been buying up the precious metal to shield themselves from the financial market turmoil unleashed by united states president donald trump’s trade tariffs on april 16 gold reached 3357 per ounce for the first time as a result many farmers are selling their holdings to illegal miners who have decimated swaths of land in pursuit of gold ghana is africa’s leading producer of gold – and the sixthlargest globally will cocoa prices continue to rise “tariffs have had an impact on the value of commodities and cocoa is no exception” says pohlmann gonzaga “at first you’d think trade levies would reduce demand for cocoa in the us which is a big consumer” the us consumes the most chocolate in the world though the swiss take that tag for the most percapita consumption “but if us consumption persists that could raise prices and of course trump may drop tariffs on west african cocoa exporters in the future which would probably lead to higher demand” advertisement pohlmann gonzaga cited the growing demand for chocolate in east asia “we may be seeing a similar trend as with coffee” he said china’s coffee consumption for instance increased by more than 60 percent between 2019 and 2024 in the near term pohlmann gonzaga said prices are likely to “trend sideways … as these factors can cancel each other out volatility will be the word of order for this year” how have chocolate manufacturers responded so far producers have responded in one of two ways – by passing the higher cost to consumers or by promoting products with less cocoa or with substitute ingredients last year food giant nestle introduced a hazelnut flavour to its british aero line of chocolate bars which at 36g 13oz are about onethird the weight of competing chocolate bars in 2024 agrifood giant cargill partnered with us chocolate alternatives producer voyage foods – which creates cocoafree bars from grape seeds sunflower flour and other flavourings – to be its businesstobusiness distributor in addition to big companies startups like nukoko and planet a are exploring microbial fermentation techniques to enhance and mimic the aromas and flavours of chocolate elsewhere dubai chocolate was founded in 2022 its products are filled with pistachio and tahini and are inspired by kunafa the chessy saccharine dessert that is a staple across the middle east and north africa since coming to market it has become a social media sensation if cocoa prices continue rising “i’d expect to see more and more cocoa substitutes on supermarket shelves the interesting question is whether consumer tastes will change” said pohlmann gonzaga",
    "summary": "Cocoa prices surged almost 300 percent last year, making chocolate bars, Easter eggs and cocoa powder much more expensive this year than last.\nIn the United States, retail chocolate prices were one-fifth higher this Valentine’s Day compared with last year, according to Wells Fargo Bank.\nAdvertisementAccording to Amber Sawyer, an analyst at the environmental think tank Energy and Climate Intelligence Unit (ECIU), expensive chocolate should not come as a surprise.\n“Chocolate is just one of the many foods being made more expensive by climate change-driven extreme weather,” she said.\nIf cocoa prices continue rising, “I’d expect to see more and more cocoa substitutes on supermarket shelves.",
    "keywords": [
      "truth",
      "pohlmann",
      "cocoa",
      "price",
      "gonzaga",
      "prices",
      "2024",
      "bitter",
      "gold",
      "weather",
      "chocolate",
      "climate",
      "expensive"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/2025-04-14T202907Z_661827142_RC2VL7APCN6T_RTRMADP_3_BRAZIL-COCOA-1-1745236667.jpg?resize=1920%2C1440",
    "t": 21
  },
  "https://www.aljazeera.com/news/2025/4/18/the-russian-military-is-not-this-unstoppable-machine-historian": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/18/the-russian-military-is-not-this-unstoppable-machine-historian",
    "date": "2025-04-18",
    "time": "00:00:00",
    "title": "‘The Russian military is not this unstoppable machine’: Historian",
    "body": "Europe has the industrial and financial might to help Ukraine without the US, says distinguished historian, Phillips O’Brien.\n\nUkraine is at the most difficult point in its existential war since the full-scale Russian invasion began in February, 2022.\n\nThe United States has backed out of the alliance supporting Kyiv, reneging on a multiyear strategic agreement it signed with Ukraine last year.\n\nUkraine has been in a defensive posture for a year, and Russian attacks on Ukrainian soil are increasing.\n\nNow, the US is forcing Ukraine to negotiate for peace from a position of weakness, while demanding payback for $135.7bn in military and financial aid.\n\nWorse could yet come, warns Phillips O’Brien, head of the School of International Relations at St Andrews University and a leading analyst and commentator on Ukraine. The US could drop its sanctions against Russia and back out of NATO.\n\nAl Jazeera spoke with him about why, despite these gloomy prospects, he believes Europe still has the capacity to keep Ukraine fighting, and could ultimately do much more to determine the outcome of this war – for the sake of its own security.\n\nAdvertisement\n\nAl Jazeera: Can Europe, plus a few other nations like Japan and Australia, save Ukraine from a bad deal with US President Trump and Russian leader Vladimir Putin?\n\nPhillips O’Brien: They can certainly keep Ukraine in the fight. A lot of it depends on what the US does. We have to be careful about that. If the US actually moves to fully backing Russia and provides Russia with a significant amount of intelligence and support, that will be really a problem for Ukraine and Europe.\n\nBut assuming, say, the US just pulls out and washes its hands of it, Europe has the resources to keep Ukraine going. It would require mobilisation, effort, a significant amount of commitment on Europe’s part. So far, they’ve not, I think, shown the united will to do that, but they certainly could do it if they wanted to. They have the money. They have the technological know-how. They even have the military equipment to make a significant difference.\n\nAl Jazeera: So you believe that – intelligence aside – Europe and Ukraine can quite quickly develop the defence industrial base needed?\n\nO’Brien: Ukraine’s already developing a lot of it, so what [Europeans] could do is help supercharge what the Ukrainians are doing in, say, UAV [unmanned aerial vehicle] production. The Russian military is not this unstoppable machine. I think we have to realise it is still a deeply flawed institution.\n\nIt’s been protected by the US in many ways throughout this war in the way that the US has aided Ukraine not to attack the Russian military machine in Russia, and that’s been a conscious choice of the US. Europe could actually change, if it wanted to, the way it helped Ukraine to free up Ukraine, to provide it more aid to attack Russian production or Russian military facilities in Russia.\n\nUkrainian President Volodymyr Zelenskyy says he aims to make 30,000 long-range drones this year and 3,000 cruise missiles.\n\nAdvertisement\n\nThat would be very impressive if they could get that money up and running, and that would, I think, put Russian logistics and military production under significant pressure.\n\nAl Jazeera: What would be the potential consequences of crossing the United States and Russia if Ukraine and Europe really banded together and did all these things, given what you said before about the US not necessarily remaining a neutral party?\n\nO’Brien: If these tariffs [Trump announced on April 2] come into effect, it’s already going to be an economic war with Europe. One of the things it could fully do – I think in many ways it’s already done it de facto – is to say, ‘The US will have no role defending Europe under NATO Article 5’.\n\nThey could basically cut Europe off of the transatlantic alliance. I think the most dangerous thing for Europe in the immediate term is to end the nuclear guarantees, basically saying to Russia, ‘We’re not protecting Europe,’ which means Europe’s nuclear guarantee goes completely down to a very small number of French and British submarines.\n\nAl Jazeera: But Putin has already made nuclear threats. He did it when he dropped the Oreshnik ballistic missile on Dnipro last November …\n\nO’Brien: I don’t think anyone in Europe took [previous threats] seriously as a threat against Europe because of the US nuclear shield.\n\nAl Jazeera: Is there a European deficit in intelligence capabilities?\n\nO’Brien: Basically, much of European intelligence has been integrated with the US, and they had been provided a lot of information from the US, and the US has technological capabilities that they don’t have.\n\nSo right away, you’d have to rely on less good, less developed systems.\n\n[Starlink] is just part of it. [There’s] US eyes in the sky, US listening, US intelligence sharing – they do have the kind of surveillance that Europe does not have at this point. It will leave you far worse off immediately, and Europe will have to build up a new system in its place.\n\nAdvertisement\n\nAl Jazeera: Would you, in this scenario of confrontation, expect pushback from within the United States or US forces in Europe?\n\nO’Brien: Congress could try and force back at any time. The issue is the president’s commander-in-chief, and right now, the Republicans have no desire to stand up to him.\n\nAl Jazeera: Why is it important for Europe to make that stand?\n\nO’Brien: Because with the US out of the game, Ukraine becomes incredibly important to the future of European security.\n\nIf you take the US out, the state of Ukraine is absolutely, without a doubt, central to European security, because Ukraine is the difference, as Putin understands, between Russia being a threat to the continent or not.\n\nIf they can take Ukraine and rebuild in possession of Ukraine’s resources, one assumes subsuming Belarus as well, then they’re in a much better position. Who knows what happens with the populists in France or with the populists in other European countries. It’s a very, very dangerous situation.\n\nEurope is torn between those that want action and those who still can’t believe what they’re looking at. It’s deeply frustrating because you [could see] a year ago that [a Trump presidency] was coming down the pike. There was a significant chance Europe had to plan on the US going home, the US walking back from NATO, and they just didn’t want to do it. There was a wilful inability to plan for a likely event, and that is a failure of leadership of historic proportions.",
    "clean_body": "europe has the industrial and financial might to help ukraine without the us says distinguished historian phillips o’brien ukraine is at the most difficult point in its existential war since the fullscale russian invasion began in february 2022 the united states has backed out of the alliance supporting kyiv reneging on a multiyear strategic agreement it signed with ukraine last year ukraine has been in a defensive posture for a year and russian attacks on ukrainian soil are increasing now the us is forcing ukraine to negotiate for peace from a position of weakness while demanding payback for 1357bn in military and financial aid worse could yet come warns phillips o’brien head of the school of international relations at st andrews university and a leading analyst and commentator on ukraine the us could drop its sanctions against russia and back out of nato al jazeera spoke with him about why despite these gloomy prospects he believes europe still has the capacity to keep ukraine fighting and could ultimately do much more to determine the outcome of this war – for the sake of its own security advertisement al jazeera can europe plus a few other nations like japan and australia save ukraine from a bad deal with us president trump and russian leader vladimir putin phillips o’brien they can certainly keep ukraine in the fight a lot of it depends on what the us does we have to be careful about that if the us actually moves to fully backing russia and provides russia with a significant amount of intelligence and support that will be really a problem for ukraine and europe but assuming say the us just pulls out and washes its hands of it europe has the resources to keep ukraine going it would require mobilisation effort a significant amount of commitment on europe’s part so far they’ve not i think shown the united will to do that but they certainly could do it if they wanted to they have the money they have the technological knowhow they even have the military equipment to make a significant difference al jazeera so you believe that – intelligence aside – europe and ukraine can quite quickly develop the defence industrial base needed o’brien ukraine’s already developing a lot of it so what europeans could do is help supercharge what the ukrainians are doing in say uav unmanned aerial vehicle production the russian military is not this unstoppable machine i think we have to realise it is still a deeply flawed institution it’s been protected by the us in many ways throughout this war in the way that the us has aided ukraine not to attack the russian military machine in russia and that’s been a conscious choice of the us europe could actually change if it wanted to the way it helped ukraine to free up ukraine to provide it more aid to attack russian production or russian military facilities in russia ukrainian president volodymyr zelenskyy says he aims to make 30000 longrange drones this year and 3000 cruise missiles advertisement that would be very impressive if they could get that money up and running and that would i think put russian logistics and military production under significant pressure al jazeera what would be the potential consequences of crossing the united states and russia if ukraine and europe really banded together and did all these things given what you said before about the us not necessarily remaining a neutral party o’brien if these tariffs trump announced on april 2 come into effect it’s already going to be an economic war with europe one of the things it could fully do – i think in many ways it’s already done it de facto – is to say ‘the us will have no role defending europe under nato article 5’ they could basically cut europe off of the transatlantic alliance i think the most dangerous thing for europe in the immediate term is to end the nuclear guarantees basically saying to russia ‘we’re not protecting europe’ which means europe’s nuclear guarantee goes completely down to a very small number of french and british submarines al jazeera but putin has already made nuclear threats he did it when he dropped the oreshnik ballistic missile on dnipro last november … o’brien i don’t think anyone in europe took previous threats seriously as a threat against europe because of the us nuclear shield al jazeera is there a european deficit in intelligence capabilities o’brien basically much of european intelligence has been integrated with the us and they had been provided a lot of information from the us and the us has technological capabilities that they don’t have so right away you’d have to rely on less good less developed systems starlink is just part of it there’s us eyes in the sky us listening us intelligence sharing – they do have the kind of surveillance that europe does not have at this point it will leave you far worse off immediately and europe will have to build up a new system in its place advertisement al jazeera would you in this scenario of confrontation expect pushback from within the united states or us forces in europe o’brien congress could try and force back at any time the issue is the president’s commanderinchief and right now the republicans have no desire to stand up to him al jazeera why is it important for europe to make that stand o’brien because with the us out of the game ukraine becomes incredibly important to the future of european security if you take the us out the state of ukraine is absolutely without a doubt central to european security because ukraine is the difference as putin understands between russia being a threat to the continent or not if they can take ukraine and rebuild in possession of ukraine’s resources one assumes subsuming belarus as well then they’re in a much better position who knows what happens with the populists in france or with the populists in other european countries it’s a very very dangerous situation europe is torn between those that want action and those who still can’t believe what they’re looking at it’s deeply frustrating because you could see a year ago that a trump presidency was coming down the pike there was a significant chance europe had to plan on the us going home the us walking back from nato and they just didn’t want to do it there was a wilful inability to plan for a likely event and that is a failure of leadership of historic proportions",
    "summary": "Ukraine is at the most difficult point in its existential war since the full-scale Russian invasion began in February, 2022.\nThe Russian military is not this unstoppable machine.\nIt’s been protected by the US in many ways throughout this war in the way that the US has aided Ukraine not to attack the Russian military machine in Russia, and that’s been a conscious choice of the US.\nEurope could actually change, if it wanted to, the way it helped Ukraine to free up Ukraine, to provide it more aid to attack Russian production or Russian military facilities in Russia.\nAdvertisementThat would be very impressive if they could get that money up and running, and that would, I think, put Russian logistics and military production under significant pressure.",
    "keywords": [
      "europe",
      "military",
      "intelligence",
      "russia",
      "russian",
      "jazeera",
      "ukraine",
      "european",
      "unstoppable",
      "historian",
      "machine",
      "think",
      "significant"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/2025-04-15T174214Z_179291085_RC2FYDAP9S3D_RTRMADP_3_UKRAINE-CRISIS-1744927627.jpg?resize=1920%2C1440",
    "t": 24
  },
  "https://www.aljazeera.com/news/2025/4/14/greek-police-probing-guerrilla-group-claims-on-bombing-attacks": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/14/greek-police-probing-guerrilla-group-claims-on-bombing-attacks",
    "date": "2025-04-14",
    "time": "00:00:00",
    "title": "Greek police probe hardline group claims on bombing attacks",
    "body": "Greek police say they are investigating claims by an unknown hardline group that it was responsible for a couple of bomb blasts that rocked Athens over the past year.\n\nA police spokeswoman told Greek media on Monday that the authorities were examining a statement issued by Revolutionary Class Struggle that it was behind an explosion on Friday near the offices of railway operator Hellenic Train last week, as well as an attack at the Ministry of Labour last year.\n\nThe group posted a statement on the website Athens.indymedia.org on Sunday, which dedicated both the attacks to “the Palestinian people and their heroic resistance”.\n\n“The claim is being examined with great attention by the relevant officers so that they can gather information,” police spokeswoman Constantina Dimoglidou told Action 24 TV.\n\nShe said it was too early to draw conclusions about the group’s identity but police were investigating possible links with other cases in the past.\n\nThe Revolutionary Class Struggle statement blamed Hellenic Train, a unit of Italy’s Ferrovie dello Stato, for a rail accident in 2023 near the Greek village of Tempi.\n\nAdvertisement\n\nThe crash, which killed 57 people, has led to numerous protests over deficiencies in the railway system and claims of government corruption.\n\nThe group’s statement branded them demonstrations against “state capitalist crime”, and sought to link them to Palestine and the war in Gaza “since they took place within a country with an active role in the American-Zionist genocidal war”.\n\nThe statement also said the group was behind a 2024 attack on the Labour Ministry. Neither attack resulted in any injuries as warnings were sent in advance.\n\nHellenic Train, the operator of passenger and cargo train services, was once a subsidiary of state-owned Hellenic Railways.\n\nIn February, Greece’s Air and Rail Accident Investigation Authority (HARSIA) said the 2023 accident was due to chronic safety gaps and that they still needed to be addressed to prevent a repeat.\n\nChristos Papadimitriou, the head of HARSIA, resigned on Wednesday, a move expected to further stall efforts to shed light on the country’s worst rail disaster.\n\nA judicial investigation is expected to conclude this year.",
    "clean_body": "greek police say they are investigating claims by an unknown hardline group that it was responsible for a couple of bomb blasts that rocked athens over the past year a police spokeswoman told greek media on monday that the authorities were examining a statement issued by revolutionary class struggle that it was behind an explosion on friday near the offices of railway operator hellenic train last week as well as an attack at the ministry of labour last year the group posted a statement on the website athensindymediaorg on sunday which dedicated both the attacks to “the palestinian people and their heroic resistance” “the claim is being examined with great attention by the relevant officers so that they can gather information” police spokeswoman constantina dimoglidou told action 24 tv she said it was too early to draw conclusions about the group’s identity but police were investigating possible links with other cases in the past the revolutionary class struggle statement blamed hellenic train a unit of italy’s ferrovie dello stato for a rail accident in 2023 near the greek village of tempi advertisement the crash which killed 57 people has led to numerous protests over deficiencies in the railway system and claims of government corruption the group’s statement branded them demonstrations against “state capitalist crime” and sought to link them to palestine and the war in gaza “since they took place within a country with an active role in the americanzionist genocidal war” the statement also said the group was behind a 2024 attack on the labour ministry neither attack resulted in any injuries as warnings were sent in advance hellenic train the operator of passenger and cargo train services was once a subsidiary of stateowned hellenic railways in february greece’s air and rail accident investigation authority harsia said the 2023 accident was due to chronic safety gaps and that they still needed to be addressed to prevent a repeat christos papadimitriou the head of harsia resigned on wednesday a move expected to further stall efforts to shed light on the country’s worst rail disaster a judicial investigation is expected to conclude this year",
    "summary": "Greek police say they are investigating claims by an unknown hardline group that it was responsible for a couple of bomb blasts that rocked Athens over the past year.\nThe group posted a statement on the website Athens.indymedia.org on Sunday, which dedicated both the attacks to “the Palestinian people and their heroic resistance”.\nThe Revolutionary Class Struggle statement blamed Hellenic Train, a unit of Italy’s Ferrovie dello Stato, for a rail accident in 2023 near the Greek village of Tempi.\nHellenic Train, the operator of passenger and cargo train services, was once a subsidiary of state-owned Hellenic Railways.\nIn February, Greece’s Air and Rail Accident Investigation Authority (HARSIA) said the 2023 accident was due to chronic safety gaps and that they still needed to be addressed to prevent a repeat.",
    "keywords": [
      "attack",
      "hardline",
      "train",
      "hellenic",
      "bombing",
      "rail",
      "told",
      "probe",
      "statement",
      "struggle",
      "accident",
      "attacks",
      "greek",
      "claims",
      "group"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AP25102269011836-1744626631.jpg?resize=1200%2C675",
    "t": 28
  },
  "https://www.aljazeera.com/news/2025/4/11/italy-sends-40-asylum-seekers-awaiting-deportation-to-albania": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/11/italy-sends-40-asylum-seekers-awaiting-deportation-to-albania",
    "date": "2025-04-11",
    "time": "00:00:00",
    "title": "Italy sends 40 asylum seekers awaiting deportation to Albania",
    "body": "Forty men of various nationalities arrive onboard an Italian navy ship in the northern port of Shengjin in Albania.\n\nItaly has sent 40 asylum seekers awaiting deportation to Albania, where they will be held in Italian-run detention centres until they are repatriated to their home countries.\n\nThe two facilities were opened last October as processing centres for potential asylum seekers intercepted at sea, in an experimental scheme closely watched by the rest of the European Union.\n\nBut in an attempt to salvage a costly programme beset by legal challenges, the Italian government decided in late March that they would now primarily serve as repatriation facilities to hold migrants due to be sent back to their home countries.\n\nOn Friday, 40 men of various nationalities arrived on board an Italian navy ship in the northern port of Shengjin, according to Italian media.\n\nFrom there, they will be transferred to a nearby centre in Gjader, a former military base surrounded by a high fence under camera surveillance.\n\nIt is not clear how long they will remain in Albania. Under Italian law, asylum seekers whose residence claims have not been successful can be detained for up to 18 months while awaiting deportation.\n\nAdvertisement\n\nItalian Prime Minister Giorgia Meloni had signed a deal with her Albanian counterpart Edi Rama to open the two Italian-run centres in Albania in November 2023.\n\nBut the Albania deportation scheme had been put on hold after Italian courts repeatedly annulled the transfer of sea migrants, forcing the government to bring them to Italy to assess their legal situation.\n\nFacing criticism from the opposition over the legal confusion, Meloni’s conservative coalition last month decided to use Albania instead as a staging post for people whose asylum bids have already been turned down. Stopping the boats was also a promise of Meloni and her far-right Brothers of Italy party when they came first in a 2022 election.\n\nItaly has a poor record on the repatriation of irregular immigrants. In 2023, just more than 4,000 were forcibly sent home, roughly a third of the number returned by France and Germany, official data show.\n\nMany more simply ignored their expulsion orders, either staying in Italy or heading to another European country.\n\nMeloni originally hoped that the two Albanian camps would be able to process some 36,000 male asylum applicants per year from a government list of safe countries, with the idea of swiftly repatriating them after the likely rejection of their requests.\n\nThe government still hopes to revert to its original plan and is waiting on a ruling from the European Union’s Court of Justice, which could compel Italian judges to process new asylum seekers sent to Albania.",
    "clean_body": "forty men of various nationalities arrive onboard an italian navy ship in the northern port of shengjin in albania italy has sent 40 asylum seekers awaiting deportation to albania where they will be held in italianrun detention centres until they are repatriated to their home countries the two facilities were opened last october as processing centres for potential asylum seekers intercepted at sea in an experimental scheme closely watched by the rest of the european union but in an attempt to salvage a costly programme beset by legal challenges the italian government decided in late march that they would now primarily serve as repatriation facilities to hold migrants due to be sent back to their home countries on friday 40 men of various nationalities arrived on board an italian navy ship in the northern port of shengjin according to italian media from there they will be transferred to a nearby centre in gjader a former military base surrounded by a high fence under camera surveillance it is not clear how long they will remain in albania under italian law asylum seekers whose residence claims have not been successful can be detained for up to 18 months while awaiting deportation advertisement italian prime minister giorgia meloni had signed a deal with her albanian counterpart edi rama to open the two italianrun centres in albania in november 2023 but the albania deportation scheme had been put on hold after italian courts repeatedly annulled the transfer of sea migrants forcing the government to bring them to italy to assess their legal situation facing criticism from the opposition over the legal confusion meloni’s conservative coalition last month decided to use albania instead as a staging post for people whose asylum bids have already been turned down stopping the boats was also a promise of meloni and her farright brothers of italy party when they came first in a 2022 election italy has a poor record on the repatriation of irregular immigrants in 2023 just more than 4000 were forcibly sent home roughly a third of the number returned by france and germany official data show many more simply ignored their expulsion orders either staying in italy or heading to another european country meloni originally hoped that the two albanian camps would be able to process some 36000 male asylum applicants per year from a government list of safe countries with the idea of swiftly repatriating them after the likely rejection of their requests the government still hopes to revert to its original plan and is waiting on a ruling from the european union’s court of justice which could compel italian judges to process new asylum seekers sent to albania",
    "summary": "Forty men of various nationalities arrive onboard an Italian navy ship in the northern port of Shengjin in Albania.\nItaly has sent 40 asylum seekers awaiting deportation to Albania, where they will be held in Italian-run detention centres until they are repatriated to their home countries.\nThe two facilities were opened last October as processing centres for potential asylum seekers intercepted at sea, in an experimental scheme closely watched by the rest of the European Union.\nUnder Italian law, asylum seekers whose residence claims have not been successful can be detained for up to 18 months while awaiting deportation.\nThe government still hopes to revert to its original plan and is waiting on a ruling from the European Union’s Court of Justice, which could compel Italian judges to process new asylum seekers sent to Albania.",
    "keywords": [
      "various",
      "40",
      "awaiting",
      "asylum",
      "seekers",
      "sent",
      "european",
      "sends",
      "legal",
      "albania",
      "italian",
      "deportation",
      "centres",
      "italy"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250411__39ZY4FC__v1__HighRes__AlbaniaItalyEuPoliticsMigration-1744392944.jpg?resize=1920%2C1440",
    "t": 31
  },
  "https://www.aljazeera.com/news/2025/4/26/palestinian-president-mahmoud-abbas-appoints-aide-as-plo-deputy": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/26/palestinian-president-mahmoud-abbas-appoints-aide-as-plo-deputy",
    "date": "2025-04-26",
    "time": "00:00:00",
    "title": "Palestinian President Mahmoud Abbas appoints aide as PLO deputy",
    "body": "Palestinian President Mahmoud Abbas has appointed a close aide as vice president, the Palestine Liberation Organization (PLO) said.\n\nHussein al-Sheikh was named “deputy [vice president] of the PLO leadership,” Wasel Abu Yousef, a member of the PLO’s Executive Committee, said on Saturday.\n\nAbbas, 89, created the vice presidency position during the 32nd session of the Palestinian Central Council in Ramallah earlier this week.\n\nDuring the session, Abbas reaffirmed his commitment to initiating a “comprehensive national dialogue”, which aims to engage “all Palestinian factions to achieve reconciliation and reinforce national unity,” the official Palestinian news agency WAFA reported.\n\nAbbas also informed the committee on “upcoming political efforts aimed at halting the ongoing Israeli aggression and war of genocide in the Gaza Strip”.\n\nThese include ensuring the rapid entry of humanitarian and medical aid, full Palestinian governance over Gaza and pushing for a total Israeli withdrawal from the enclave as “a step towards launching a political process to end the occupation and realize an independent Palestinian state with East Jerusalem as its capital”, according to WAFA.\n\nAdvertisement\n\nThe appointment follows years of international pressure to reform the PLO and comes as Arab and Western powers envision an expanded role for the Palestinian Authority (PA) in the Gaza Strip’s post-war governance.\n\nFounded in 1964, the PLO is tasked with negotiating and signing international treaties on the Palestinian people’s behalf, while the PA is responsible for governance in limited parts of the occupied Palestinian territory.\n\nThe PLO is an umbrella organisation comprising several Palestinian factions, but not the Hamas and Islamic Jihad groups.\n\nSheikh, 64, is a veteran leader of Abbas’s Fatah movement, which dominates the PA, and is considered close to the president.\n\nMarwan Bishara, Al Jazeera’s senior political analyst, said Sheikh’s role in the PA has included being “in charge of security coordination with the Israeli occupation”.\n\nSheikh has been “groomed for the past 18 years in this relationship between Mahmoud Abbas, the Palestinian Authority and Israel”, Bishara added.\n\n“Israel knows and trusts him more than they know and trust Abbas himself. And Abbas, as we all know, has been the ultimate pragmatic/moderate leader within the Palestinian Authority, much to the liking of the United States and European Union, even if he’s not to the liking of [Israeli Prime Minister Benjamin] Netanyahu and his ilk.”\n\nAnalyst Aref Jaffal said the new role was created to pave the way for someone to take the reins from Abbas, “as there are many things the Palestinian situation requires”.\n\nAdvertisement\n\n“The Palestinian political system is already miserable, so I believe that all these arrangements are a prelude to creating a successor to Abbas,” Jaffal, director of the Al-Marsad Election Monitoring Center, told AFP.\n\nThe PLO Executive Committee is set to hold another meeting next Saturday to appoint a new secretary-general.",
    "clean_body": "palestinian president mahmoud abbas has appointed a close aide as vice president the palestine liberation organization plo said hussein alsheikh was named “deputy vice president of the plo leadership” wasel abu yousef a member of the plo’s executive committee said on saturday abbas 89 created the vice presidency position during the 32nd session of the palestinian central council in ramallah earlier this week during the session abbas reaffirmed his commitment to initiating a “comprehensive national dialogue” which aims to engage “all palestinian factions to achieve reconciliation and reinforce national unity” the official palestinian news agency wafa reported abbas also informed the committee on “upcoming political efforts aimed at halting the ongoing israeli aggression and war of genocide in the gaza strip” these include ensuring the rapid entry of humanitarian and medical aid full palestinian governance over gaza and pushing for a total israeli withdrawal from the enclave as “a step towards launching a political process to end the occupation and realize an independent palestinian state with east jerusalem as its capital” according to wafa advertisement the appointment follows years of international pressure to reform the plo and comes as arab and western powers envision an expanded role for the palestinian authority pa in the gaza strip’s postwar governance founded in 1964 the plo is tasked with negotiating and signing international treaties on the palestinian people’s behalf while the pa is responsible for governance in limited parts of the occupied palestinian territory the plo is an umbrella organisation comprising several palestinian factions but not the hamas and islamic jihad groups sheikh 64 is a veteran leader of abbas’s fatah movement which dominates the pa and is considered close to the president marwan bishara al jazeera’s senior political analyst said sheikh’s role in the pa has included being “in charge of security coordination with the israeli occupation” sheikh has been “groomed for the past 18 years in this relationship between mahmoud abbas the palestinian authority and israel” bishara added “israel knows and trusts him more than they know and trust abbas himself and abbas as we all know has been the ultimate pragmaticmoderate leader within the palestinian authority much to the liking of the united states and european union even if he’s not to the liking of israeli prime minister benjamin netanyahu and his ilk” analyst aref jaffal said the new role was created to pave the way for someone to take the reins from abbas “as there are many things the palestinian situation requires” advertisement “the palestinian political system is already miserable so i believe that all these arrangements are a prelude to creating a successor to abbas” jaffal director of the almarsad election monitoring center told afp the plo executive committee is set to hold another meeting next saturday to appoint a new secretarygeneral",
    "summary": "Palestinian President Mahmoud Abbas has appointed a close aide as vice president, the Palestine Liberation Organization (PLO) said.\nHussein al-Sheikh was named “deputy [vice president] of the PLO leadership,” Wasel Abu Yousef, a member of the PLO’s Executive Committee, said on Saturday.\nAbbas, 89, created the vice presidency position during the 32nd session of the Palestinian Central Council in Ramallah earlier this week.\nSheikh has been “groomed for the past 18 years in this relationship between Mahmoud Abbas, the Palestinian Authority and Israel”, Bishara added.\nAdvertisement“The Palestinian political system is already miserable, so I believe that all these arrangements are a prelude to creating a successor to Abbas,” Jaffal, director of the Al-Marsad Election Monitoring Center, told AFP.",
    "keywords": [
      "political",
      "abbas",
      "role",
      "gaza",
      "mahmoud",
      "aide",
      "plo",
      "pa",
      "israeli",
      "vice",
      "deputy",
      "palestinian",
      "appoints",
      "president"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AFP__20250426__43LN6CQ__v2__HighRes__TopshotPalestinianIsraelConflictPoliticsPlo-1745690597.jpg?resize=1920%2C1440",
    "t": 16
  },
  "https://www.aljazeera.com/news/2025/4/13/russia-ukraine-war-list-of-key-events-day-1144": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/13/russia-ukraine-war-list-of-key-events-day-1144",
    "date": "2025-04-13",
    "time": "00:00:00",
    "title": "Russia-Ukraine war: List of key events, day 1,144",
    "body": "Here is where things stand on Sunday, April 12:\n\nThe acting mayor of the northern Ukrainian city of Sumy said at least 31 people were killed in a Russian missile attack. Ukraine’s President Volodymyr Zelenskyy called for a global response to the attack. “Talks have never stopped ballistic missiles and aerial bombs. What’s needed is an attitude toward Russia that a terrorist deserves,” he said.\n\nUkraine’s air defence units have intercepted and destroyed 43 drones out of 55 launched by Russia overnight targeting northern, southern and central areas of Ukraine, the air force said. But it did not say what happened to the drones that escaped destruction.\n\nA Ukrainian F-16 pilot was killed in combat, according to the military, in the second such incident since the delivery of the precious United States-made fighters to Ukraine to help fight Russia’s invasion.\n\nA Russian-guided bomb struck a house in the northeastern Ukrainian town of Kupiansk, injuring four people and possibly trapping three more under rubble, Kharkiv regional Governor Oleh Syniehubov said.\n\nRussia’s air defence units destroyed 12 Ukrainian drones over the Rostov region and one over the region of Belgorod, its Ministry of Defence said on social media.\n\nUkraine is seeking solutions to repair the damage caused by a Russian drone attack on the confinement vessel at the stricken Chornobyl nuclear power plant, Environment Minister Svitlana Hrynchuk said.",
    "clean_body": "here is where things stand on sunday april 12 the acting mayor of the northern ukrainian city of sumy said at least 31 people were killed in a russian missile attack ukraine’s president volodymyr zelenskyy called for a global response to the attack “talks have never stopped ballistic missiles and aerial bombs what’s needed is an attitude toward russia that a terrorist deserves” he said ukraine’s air defence units have intercepted and destroyed 43 drones out of 55 launched by russia overnight targeting northern southern and central areas of ukraine the air force said but it did not say what happened to the drones that escaped destruction a ukrainian f16 pilot was killed in combat according to the military in the second such incident since the delivery of the precious united statesmade fighters to ukraine to help fight russia’s invasion a russianguided bomb struck a house in the northeastern ukrainian town of kupiansk injuring four people and possibly trapping three more under rubble kharkiv regional governor oleh syniehubov said russia’s air defence units destroyed 12 ukrainian drones over the rostov region and one over the region of belgorod its ministry of defence said on social media ukraine is seeking solutions to repair the damage caused by a russian drone attack on the confinement vessel at the stricken chornobyl nuclear power plant environment minister svitlana hrynchuk said",
    "summary": "Here is where things stand on Sunday, April 12:The acting mayor of the northern Ukrainian city of Sumy said at least 31 people were killed in a Russian missile attack.\nUkraine’s President Volodymyr Zelenskyy called for a global response to the attack.\nUkraine’s air defence units have intercepted and destroyed 43 drones out of 55 launched by Russia overnight targeting northern, southern and central areas of Ukraine, the air force said.\nRussia’s air defence units destroyed 12 Ukrainian drones over the Rostov region and one over the region of Belgorod, its Ministry of Defence said on social media.\nUkraine is seeking solutions to repair the damage caused by a Russian drone attack on the confinement vessel at the stricken Chornobyl nuclear power plant, Environment Minister Svitlana Hrynchuk said.",
    "keywords": [
      "attack",
      "war",
      "1144",
      "air",
      "russia",
      "units",
      "drones",
      "day",
      "russian",
      "defence",
      "events",
      "ukraine",
      "region",
      "ukrainian",
      "list",
      "key",
      "russiaukraine"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/AP25102309373036-1744523361.jpg?resize=1920%2C1440",
    "t": 29
  },
  "https://www.aljazeera.com/news/2025/4/29/what-we-know-about-power-outage-in-spain-portugal": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/29/what-we-know-about-power-outage-in-spain-portugal",
    "date": "2025-04-29",
    "time": "00:00:00",
    "title": "What we know about power outage in Spain, Portugal",
    "body": "Authorities are still working to find out what caused one of Europe’s worst blackouts.\n\nSpain and Portugal have regained access to electricity after one of Europe’s worst blackouts paralysed transport systems, disrupted mobile communications and postponed medical procedures.\n\nFor almost a day from Monday to early on Tuesday, tens of millions of people were plunged into darkness. In major cities like Barcelona, Madrid and Lisbon, people were trapped in lifts, stuck on trains and unable to access the internet.\n\nMeanwhile, queues snaked outside the few supermarkets running on backup generators as people stocked up on dried goods, water and battery-powered flashlights.\n\nThe Spanish and Portuguese governments quickly convened emergency meetings after the outage, which hit Spain and Portugal about 12:30 (10:30 GMT) on Monday and also briefly affected southern France.\n\nAlmost no one in the Iberian Peninsula, which has a population of almost 60 million people, escaped the blackout. Madrid was forced to declare a state of emergency.\n\nAlthough power has been largely restored, transport remains in dire straits, with trains and flights reporting delays. No firm cause for the shutdown has yet emerged.\n\nAdvertisement\n\nWith the power back on, attention is turning to what caused such a widespread failure of the region’s networks.\n\nWhat caused the power outage?\n\nPortugal’s electricity provider, Redes Energeticas Nacionais (REN), said a “rare atmospheric phenomenon” had caused a severe imbalance in temperatures that led to the widespread shutdowns.\n\nREN said: “Due to extreme temperature variations in the interior of Spain, there were anomalous oscillations in the very high voltage lines (400 kV), a phenomenon known as ‘induced atmospheric vibration’.”\n\nThe Portuguese prime minister, Luis Montenegro, also said the issue originated in Spain.\n\nHowever, in a statement on Tuesday, Spain’s national meteorological office, Aemet, appeared to rule out the weather as a culprit.\n\n“During the day of 28 April, no unusual meteorological or atmospheric phenomena were detected, and nor were there sudden variations in the temperature in our network of meteorological stations,” Aemet said.\n\nThe Spanish government said the cause of the power cut is still unknown and warned against speculation.\n\n“My gut feeling is that multiple factors were behind the blackout,” Kang Li, smart energy systems chairman at the University of Leeds, told Al Jazeera.\n\n“It usually takes several months for forensic grid data to be properly analysed,” he added, “though an interim report could be done in several weeks.”\n\nBloomberg News reported that Spain has seen a record number of hours with negative power prices in recent months as more wind and solar energy supplies the grid. Until now, however, oversupply hadn’t led to blackouts.\n\nAdvertisement\n\nIn 2024, renewable energy sources accounted for 56 percent of all electricity used in Spain, a record high. By 2030, that proportion is expected to reach 81 percent.\n\nAccording to Li, “it’s harder to manage energy output when infrastructure is changing so quickly. A higher penetration of renewables with existing systems creates more fluctuation in the operating system.”\n\nFor his part, Spanish Prime Minister Pedro Sanchez said, “We have never had a complete collapse of the system,” explaining how Spain’s power grid lost 15 gigawatts, the equivalent of 60 percent of its national demand, in just five seconds.\n\nWhile there’s no evidence yet of a cyberattack, Sanchez said he isn’t ruling anything out. He warned against speculation but said “no cause can be discredited at this point”.\n\nCould a cyberattack have caused the blackout?\n\nAlthough investigations into the cause of the outage are ongoing, Portugal’s National Cybersecurity Centre threw cold water on the idea of foul play, saying there was no sign that the outage resulted from a cyberattack.\n\nPortuguese Prime Minister Luis Montenegro also said there was “no indication” of a cyberattack.\n\nSpeaking to reporters in Brussels, Teresa Ribera, an executive vice president of the European Commission, also ruled out sabotage. Nonetheless, the outage “is one of the most serious episodes recorded in Europe in recent times”, she said.\n\nFor now, the Spanish government said it is waiting for more information on the cause of the blackout. State officials said they hope in the coming days to know what the cause was.\n\nAdvertisement\n\nWhich countries were affected?\n\nSpain and Portugal were the worst affected, but outages occurred elsewhere too:\n\nSpain: Urban centres such as Avila, Madrid, Murcia, Galicia, Alicante, Zaragoza, Barcelona and Seville reported widespread disruptions. The Canary and Balearic islands were not affected.\n\nPortugal: Lisbon and Porto experienced comparable challenges.\n\nSouthern France: Parts of the French Basque Country saw brief power outages. But officials from the French electricity transmission network said the interruptions lasted only a few minutes.\n\nMorocco: Some reports suggested internet providers in Morocco struggled briefly to keep their services running because of network connections with France and the outages there.\n\nGreenland: Remote regions of Greenland lost access to key satellite services, including internet and telephones. Authorities said they own satellite equipment in Spain although a direct cause has not yet been established.\n\nHas power been restored?\n\nBy mid-afternoon on Monday, Spain’s electricity operator, Red Electrica (REE), said it had started to recover voltage in the north, south and west of the country.\n\nThe recovery process was carried out gradually to avoid overloading the grid as generators linked up. Power also returned to Portugal bit by bit. By Monday night, REN said 85 of its 89 power substations were back online.\n\nBy Tuesday morning, power had almost fully returned to Spain and Portugal.\n\nAt 6:30am (04:30 GMT) more than 99 percent of energy demand in Spain had been restored, REE said. Elsewhere, power was restored overnight to 6.2 million of Portugal’s 6.5 million households.\n\nAdvertisement\n\nAt the city level, Madrid’s metro system said service was restored on all but one line by 8am (06:00 GMT), meaning that 80 percent of trains were operating during Tuesday morning’s rush hour.\n\nHas Europe suffered from blackouts of this scale before?\n\nWhile outages are not unheard of in Europe, the scale of Iberia’s power failure was one of the largest in recent history.\n\nIn 2019, England and Wales suffered regional blackouts amid lightning strikes at a gas-fired power plant in Bedfordshire and an offshore wind farm off the east coast of England.\n\nA 2006 German power overload caused outages as far away as Portugal and Morocco. In 2003, a problem with a hydroelectric power line between Italy and Switzerland caused an outage across Italy for about 12 hours.\n\n“Interconnection between countries has positive benefits as it can improve efficiency and reduce costs. … It’s always sunny or raining somewhere in Europe,” Li said.\n\n“But”, he added “interconnected systems mean that local faults in one location can have domino effects elsewhere. Transmission lines can become overloaded.”\n\nLi also pointed out that climate change and rising temperatures pose “increasing risks” for Spain-and-Portugal-style blackouts.\n\n“Heat, excessive rain and wildfires all increase the risk of transmission failures. We can address this by investing more in clean energy generation to increase energy system flexibility.”",
    "clean_body": "authorities are still working to find out what caused one of europe’s worst blackouts spain and portugal have regained access to electricity after one of europe’s worst blackouts paralysed transport systems disrupted mobile communications and postponed medical procedures for almost a day from monday to early on tuesday tens of millions of people were plunged into darkness in major cities like barcelona madrid and lisbon people were trapped in lifts stuck on trains and unable to access the internet meanwhile queues snaked outside the few supermarkets running on backup generators as people stocked up on dried goods water and batterypowered flashlights the spanish and portuguese governments quickly convened emergency meetings after the outage which hit spain and portugal about 1230 1030 gmt on monday and also briefly affected southern france almost no one in the iberian peninsula which has a population of almost 60 million people escaped the blackout madrid was forced to declare a state of emergency although power has been largely restored transport remains in dire straits with trains and flights reporting delays no firm cause for the shutdown has yet emerged advertisement with the power back on attention is turning to what caused such a widespread failure of the region’s networks what caused the power outage portugal’s electricity provider redes energeticas nacionais ren said a “rare atmospheric phenomenon” had caused a severe imbalance in temperatures that led to the widespread shutdowns ren said “due to extreme temperature variations in the interior of spain there were anomalous oscillations in the very high voltage lines 400 kv a phenomenon known as ‘induced atmospheric vibration’” the portuguese prime minister luis montenegro also said the issue originated in spain however in a statement on tuesday spain’s national meteorological office aemet appeared to rule out the weather as a culprit “during the day of 28 april no unusual meteorological or atmospheric phenomena were detected and nor were there sudden variations in the temperature in our network of meteorological stations” aemet said the spanish government said the cause of the power cut is still unknown and warned against speculation “my gut feeling is that multiple factors were behind the blackout” kang li smart energy systems chairman at the university of leeds told al jazeera “it usually takes several months for forensic grid data to be properly analysed” he added “though an interim report could be done in several weeks” bloomberg news reported that spain has seen a record number of hours with negative power prices in recent months as more wind and solar energy supplies the grid until now however oversupply hadn’t led to blackouts advertisement in 2024 renewable energy sources accounted for 56 percent of all electricity used in spain a record high by 2030 that proportion is expected to reach 81 percent according to li “it’s harder to manage energy output when infrastructure is changing so quickly a higher penetration of renewables with existing systems creates more fluctuation in the operating system” for his part spanish prime minister pedro sanchez said “we have never had a complete collapse of the system” explaining how spain’s power grid lost 15 gigawatts the equivalent of 60 percent of its national demand in just five seconds while there’s no evidence yet of a cyberattack sanchez said he isn’t ruling anything out he warned against speculation but said “no cause can be discredited at this point” could a cyberattack have caused the blackout although investigations into the cause of the outage are ongoing portugal’s national cybersecurity centre threw cold water on the idea of foul play saying there was no sign that the outage resulted from a cyberattack portuguese prime minister luis montenegro also said there was “no indication” of a cyberattack speaking to reporters in brussels teresa ribera an executive vice president of the european commission also ruled out sabotage nonetheless the outage “is one of the most serious episodes recorded in europe in recent times” she said for now the spanish government said it is waiting for more information on the cause of the blackout state officials said they hope in the coming days to know what the cause was advertisement which countries were affected spain and portugal were the worst affected but outages occurred elsewhere too spain urban centres such as avila madrid murcia galicia alicante zaragoza barcelona and seville reported widespread disruptions the canary and balearic islands were not affected portugal lisbon and porto experienced comparable challenges southern france parts of the french basque country saw brief power outages but officials from the french electricity transmission network said the interruptions lasted only a few minutes morocco some reports suggested internet providers in morocco struggled briefly to keep their services running because of network connections with france and the outages there greenland remote regions of greenland lost access to key satellite services including internet and telephones authorities said they own satellite equipment in spain although a direct cause has not yet been established has power been restored by midafternoon on monday spain’s electricity operator red electrica ree said it had started to recover voltage in the north south and west of the country the recovery process was carried out gradually to avoid overloading the grid as generators linked up power also returned to portugal bit by bit by monday night ren said 85 of its 89 power substations were back online by tuesday morning power had almost fully returned to spain and portugal at 630am 0430 gmt more than 99 percent of energy demand in spain had been restored ree said elsewhere power was restored overnight to 62 million of portugal’s 65 million households advertisement at the city level madrid’s metro system said service was restored on all but one line by 8am 0600 gmt meaning that 80 percent of trains were operating during tuesday morning’s rush hour has europe suffered from blackouts of this scale before while outages are not unheard of in europe the scale of iberia’s power failure was one of the largest in recent history in 2019 england and wales suffered regional blackouts amid lightning strikes at a gasfired power plant in bedfordshire and an offshore wind farm off the east coast of england a 2006 german power overload caused outages as far away as portugal and morocco in 2003 a problem with a hydroelectric power line between italy and switzerland caused an outage across italy for about 12 hours “interconnection between countries has positive benefits as it can improve efficiency and reduce costs … it’s always sunny or raining somewhere in europe” li said “but” he added “interconnected systems mean that local faults in one location can have domino effects elsewhere transmission lines can become overloaded” li also pointed out that climate change and rising temperatures pose “increasing risks” for spainandportugalstyle blackouts “heat excessive rain and wildfires all increase the risk of transmission failures we can address this by investing more in clean energy generation to increase energy system flexibility”",
    "summary": "What caused the power outage?\nSouthern France: Parts of the French Basque Country saw brief power outages.\nBy Tuesday morning, power had almost fully returned to Spain and Portugal.\nA 2006 German power overload caused outages as far away as Portugal and Morocco.\nIn 2003, a problem with a hydroelectric power line between Italy and Switzerland caused an outage across Italy for about 12 hours.",
    "keywords": [
      "caused",
      "outages",
      "spain",
      "systems",
      "energy",
      "outage",
      "electricity",
      "portugal",
      "know",
      "power",
      "cause"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/2025-04-28T122343Z_1491613001_UP1EL4S0YFHUH_RTRMADP_3_SPAIN-ENERGY-OUTAGES-1745848870.jpg?resize=1920%2C1440",
    "t": 13
  },
  "https://www.aljazeera.com/news/2025/4/29/jordan-forcibly-evicted-palestinians-from-informal-refugee-camp-hrw": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/4/29/jordan-forcibly-evicted-palestinians-from-informal-refugee-camp-hrw",
    "date": "2025-04-29",
    "time": "00:00:00",
    "title": "Jordan ‘forcibly evicted’ Palestinians from informal refugee camp: HRW",
    "body": "Jordanian authorities have “forcibly evicted” about 100 people from an informal refugee camp hosting displaced Palestinians, according to an NGO.\n\nHuman Rights Watch (HRW) reported on Tuesday that the Greater Amman Municipality (GAM) demolished 25 homes housing at least 101 people, as well as shops, in the capital’s al-Mahatta camp in November and December last year.\n\nThe humanitarian organisation said the evicted people were not given adequate consultation, notice, compensation, or relocation assistance as the authorities cleared the way for a town planning project.\n\n‘Encroached upon’\n\n“Displacing families and disrupting their livelihoods without adequate safeguards and fair compensation leaves dozens of people with few places to seek help,” said Adam Coogle, HRW’s deputy Middle East director.\n\nThe al-Mahatta camp, which is said to house approximately 8,000 people from Palestinian families displaced by the 1948 Nakba, is not recognised as a refugee camp by the Jordanian government.\n\nThe city’s authorities said in December that GAM’s four-year “Strategic Plan” for the city running to 2026 includes traffic improvements, increasing green space, and reducing population density in informal settlements.\n\nAdvertisement\n\nThe demolition operations also aim to reclaim lands owned by the Amman Municipality that have been “encroached upon” and on which buildings have been erected, the city said, according to the Alghad outlet.\n\nDonation\n\nDozens of residents now displaced claim to have been left in the lurch, saying they were given only “two weeks to a month’s notice” to leave their homes and “vague verbal promises of compensation of 80 Jordanian dinars [$113] per square metre, with limited transparency regarding the process or timeline”, HRW reports.\n\nThe NGO quoted Amman Mayor Yousef al-Shawarbeh as saying that the displaced Palestinians were not entitled to compensation as they were “encroaching on state property”, explaining that they had been instead offered a “donation”.\n\nThe demolition of homes and shops at al-Mahatta was conducted despite an official pledge from former Prime Minister Omar Razzaz in 2019 to safeguard residents’ homes after a previous attempt to evict them in 2017.",
    "clean_body": "jordanian authorities have “forcibly evicted” about 100 people from an informal refugee camp hosting displaced palestinians according to an ngo human rights watch hrw reported on tuesday that the greater amman municipality gam demolished 25 homes housing at least 101 people as well as shops in the capital’s almahatta camp in november and december last year the humanitarian organisation said the evicted people were not given adequate consultation notice compensation or relocation assistance as the authorities cleared the way for a town planning project ‘encroached upon’ “displacing families and disrupting their livelihoods without adequate safeguards and fair compensation leaves dozens of people with few places to seek help” said adam coogle hrw’s deputy middle east director the almahatta camp which is said to house approximately 8000 people from palestinian families displaced by the 1948 nakba is not recognised as a refugee camp by the jordanian government the city’s authorities said in december that gam’s fouryear “strategic plan” for the city running to 2026 includes traffic improvements increasing green space and reducing population density in informal settlements advertisement the demolition operations also aim to reclaim lands owned by the amman municipality that have been “encroached upon” and on which buildings have been erected the city said according to the alghad outlet donation dozens of residents now displaced claim to have been left in the lurch saying they were given only “two weeks to a month’s notice” to leave their homes and “vague verbal promises of compensation of 80 jordanian dinars 113 per square metre with limited transparency regarding the process or timeline” hrw reports the ngo quoted amman mayor yousef alshawarbeh as saying that the displaced palestinians were not entitled to compensation as they were “encroaching on state property” explaining that they had been instead offered a “donation” the demolition of homes and shops at almahatta was conducted despite an official pledge from former prime minister omar razzaz in 2019 to safeguard residents’ homes after a previous attempt to evict them in 2017",
    "summary": "Jordanian authorities have “forcibly evicted” about 100 people from an informal refugee camp hosting displaced Palestinians, according to an NGO.\nHuman Rights Watch (HRW) reported on Tuesday that the Greater Amman Municipality (GAM) demolished 25 homes housing at least 101 people, as well as shops, in the capital’s al-Mahatta camp in November and December last year.\nThe humanitarian organisation said the evicted people were not given adequate consultation, notice, compensation, or relocation assistance as the authorities cleared the way for a town planning project.\nThe al-Mahatta camp, which is said to house approximately 8,000 people from Palestinian families displaced by the 1948 Nakba, is not recognised as a refugee camp by the Jordanian government.\nThe demolition of homes and shops at al-Mahatta was conducted despite an official pledge from former Prime Minister Omar Razzaz in 2019 to safeguard residents’ homes after a previous attempt to evict them in 2017.",
    "keywords": [
      "refugee",
      "authorities",
      "amman",
      "forcibly",
      "shops",
      "displaced",
      "palestinians",
      "hrw",
      "evicted",
      "jordanian",
      "saying",
      "camp",
      "informal",
      "jordan",
      "compensation",
      "homes",
      "almahatta"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/04/7883059-1745913207.jpg?resize=1920%2C1440",
    "t": 13
  }
}