{
  "https://www.aljazeera.com/news/2025/1/13/austrian-woman-kidnapped-by-unknown-assailants-in-niger": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/1/13/austrian-woman-kidnapped-by-unknown-assailants-in-niger",
    "date": "2025-01-13",
    "time": "00:00:00",
    "title": "Austrian woman kidnapped by unknown gunmen in Niger",
    "body": "Residents and local media report that the victim is a 73-year-old who was taken in the city of Agadez.\n\nAn Austrian woman has been kidnapped in Niger, the first time a European citizen has been seized in the country since the military took power in 2023.\n\nAustria’s Federal Ministry for European and International Affairs said on Sunday that its embassy in Algeria, which is also responsible for Niger, had been informed of the kidnap of an Austrian woman in Agadez and was in contact with authorities on the ground.\n\nA Nigerien security source told the Reuters news agency that the woman was bundled into a four-wheel drive by unknown assailants in the Fada district of Agadez, which lies on the edge of the Sahara Desert.\n\nResidents and local media group Air-Info Agadez named the victim as Eva Gretzmacher, who has lived in Agadez – 900km (560 miles) from the capital city of Niamey – for 28 years.\n\nAccording to information gathered by Air-Info, armed kidnappers showed up at Gretzmacher’s home on Saturday evening, forcing her security guard to open the door at gunpoint before forcing Gretzmacher into a vehicle.\n\nAdvertisement\n\n“[She] is well known for her social commitment [and] created a skills centre in 2010 that initiated various projects, notably in the fields of education, women’s empowerment,” Air-Info reported.\n\nGretzmacher, 73, supported education programmes and provided assistance to local nongovernmental organisations across various sectors, including ecology and art.\n\nAustria’s Foreign Ministry is seeking assistance from its counterpart in Niger. It is also in contact with regional authorities.\n\nSo far, Niger’s Ministry of Interior has not issued a statement about the incident.\n\nNo group has yet claimed responsibility for the abduction.\n\nRising security threats\n\nFor years, Niger has been battling armed groups linked to al-Qaeda and ISIL (ISIS). Security threats ramped up after the military toppled the country’s democratically elected government in July 2023.\n\nAfter seizing power, the military expelled French and United States forces from the country, turning to Russian mercenaries in an effort to maintain stability.\n\nDespite its promise to restore peace, however, the military’s capacity to improve Niger’s security has been questioned amid increasing attacks by armed groups.\n\nNiger is one of several West African countries battling armed rebellions that have spread from Mali and Burkina Faso over the past 12 years, killing thousands of people and uprooting millions.\n\nBefore last year’s coup, Niger was seen as one of the last democratic countries in Africa’s Sahel region that Western nations could partner with to beat back the rebellion.",
    "clean_body": "residents and local media report that the victim is a 73yearold who was taken in the city of agadez an austrian woman has been kidnapped in niger the first time a european citizen has been seized in the country since the military took power in 2023 austria’s federal ministry for european and international affairs said on sunday that its embassy in algeria which is also responsible for niger had been informed of the kidnap of an austrian woman in agadez and was in contact with authorities on the ground a nigerien security source told the reuters news agency that the woman was bundled into a fourwheel drive by unknown assailants in the fada district of agadez which lies on the edge of the sahara desert residents and local media group airinfo agadez named the victim as eva gretzmacher who has lived in agadez – 900km 560 miles from the capital city of niamey – for 28 years according to information gathered by airinfo armed kidnappers showed up at gretzmacher’s home on saturday evening forcing her security guard to open the door at gunpoint before forcing gretzmacher into a vehicle advertisement “she is well known for her social commitment and created a skills centre in 2010 that initiated various projects notably in the fields of education women’s empowerment” airinfo reported gretzmacher 73 supported education programmes and provided assistance to local nongovernmental organisations across various sectors including ecology and art austria’s foreign ministry is seeking assistance from its counterpart in niger it is also in contact with regional authorities so far niger’s ministry of interior has not issued a statement about the incident no group has yet claimed responsibility for the abduction rising security threats for years niger has been battling armed groups linked to alqaeda and isil isis security threats ramped up after the military toppled the country’s democratically elected government in july 2023 after seizing power the military expelled french and united states forces from the country turning to russian mercenaries in an effort to maintain stability despite its promise to restore peace however the military’s capacity to improve niger’s security has been questioned amid increasing attacks by armed groups niger is one of several west african countries battling armed rebellions that have spread from mali and burkina faso over the past 12 years killing thousands of people and uprooting millions before last year’s coup niger was seen as one of the last democratic countries in africa’s sahel region that western nations could partner with to beat back the rebellion",
    "summary": "Residents and local media report that the victim is a 73-year-old who was taken in the city of Agadez.\nAn Austrian woman has been kidnapped in Niger, the first time a European citizen has been seized in the country since the military took power in 2023.\nResidents and local media group Air-Info Agadez named the victim as Eva Gretzmacher, who has lived in Agadez – 900km (560 miles) from the capital city of Niamey – for 28 years.\nAccording to information gathered by Air-Info, armed kidnappers showed up at Gretzmacher’s home on Saturday evening, forcing her security guard to open the door at gunpoint before forcing Gretzmacher into a vehicle.\nRising security threatsFor years, Niger has been battling armed groups linked to al-Qaeda and ISIL (ISIS).",
    "keywords": [
      "unknown",
      "victim",
      "ministry",
      "gunmen",
      "security",
      "niger",
      "agadez",
      "airinfo",
      "kidnapped",
      "austrian",
      "armed",
      "local",
      "military",
      "woman"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/01/RC2C8CACENKX-1736750054.jpg?resize=1920%2C1440",
    "t": 119
  }
}