{
  "https://www.aljazeera.com/news/2025/2/25/ukrainian-parliament-affirms-zelenskyys-legitimacy": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/2/25/ukrainian-parliament-affirms-zelenskyys-legitimacy",
    "date": "2025-02-25",
    "time": "00:00:00",
    "title": "Ukrainian parliament affirms Zelenskyy’s legitimacy",
    "body": "The 268 parliament members present on Tuesday voted unanimously in support of the Ukrainian president.\n\nUkraine’s parliament has overwhelmingly approved a resolution affirming the legitimacy of President Volodymyr Zelenskyy’s stay in office, asserting the constitutionality of deferring the presidential election while the country is at war.\n\nThe 268 parliament members present on Tuesday voted unanimously to approve the resolution, while 12 other MPs were not present during the session.\n\nThe resolution was designed by the parliamentary leadership as a symbolic show of support for Zelenskyy, whose regular term in office ended in May.\n\nLast week, US President Donald Trump had accused Zelenskyy of being a “dictator” since he has not held elections in recent years, echoing claims previously made by Russian President Vladimir Putin.\n\nHowever, under Ukrainian law, elections cannot be held as long as a state of martial law persists across the country. Martial law was declared following the Russian invasion in February 2022.\n\n“The Verkhovna Rada once again recalls that the President of Ukraine Volodymyr Zelenskyy was elected in free, transparent, democratic elections. His mandate is not called into question by the Ukrainian people or the Verkhovna Rada,” the resolution read.\n\nAdvertisement\n\nThe document also referred to Article 108 of the Ukrainian constitution, according to which the incumbent head of state remains in power until the next elected president takes office.\n\nUkrainian Parliament unanimously votes to affirm President Zelensky's legitimacy and the constitutionally mandated requirement that prevents elections during martial law. 268 YES\n\n0 NO\n\n12 NOT PRESENT pic.twitter.com/WHUMH3XLx7 — SPRAVDI — Stratcom Centre (@StratcomCentre) February 25, 2025\n\nTrump had also claimed that the Ukrainian leader had only a 4 percent “approval rating” in polls, repeating reports from Russian media.\n\nBut according to a survey carried out this month by the Kyiv International Institute of Sociology, Zelenskyy has a 57 percent approval rating.\n\nEven if this is down from the 90 percent peak just after Russia’s invasion this is a sign that Zelenskyy is “maintaining his legitimacy”, the institute said.\n\nTuesday’s vote in the Ukrainian parliament was a reversal from a day earlier, during which the resolution received 218 votes, falling eight votes shy of the threshold 226 votes needed to pass.\n\nZelenskyy has so far been able to rely on shifting majorities in parliament to pass legislation, as enough members of parliament from his own party are not always present.\n\nWithout parliamentary support, international agreements such as a prospective peace treaty with Russia or a proposed raw materials agreement with the US cannot be ratified and come into force.",
    "clean_body": "the 268 parliament members present on tuesday voted unanimously in support of the ukrainian president ukraine’s parliament has overwhelmingly approved a resolution affirming the legitimacy of president volodymyr zelenskyy’s stay in office asserting the constitutionality of deferring the presidential election while the country is at war the 268 parliament members present on tuesday voted unanimously to approve the resolution while 12 other mps were not present during the session the resolution was designed by the parliamentary leadership as a symbolic show of support for zelenskyy whose regular term in office ended in may last week us president donald trump had accused zelenskyy of being a “dictator” since he has not held elections in recent years echoing claims previously made by russian president vladimir putin however under ukrainian law elections cannot be held as long as a state of martial law persists across the country martial law was declared following the russian invasion in february 2022 “the verkhovna rada once again recalls that the president of ukraine volodymyr zelenskyy was elected in free transparent democratic elections his mandate is not called into question by the ukrainian people or the verkhovna rada” the resolution read advertisement the document also referred to article 108 of the ukrainian constitution according to which the incumbent head of state remains in power until the next elected president takes office ukrainian parliament unanimously votes to affirm president zelenskys legitimacy and the constitutionally mandated requirement that prevents elections during martial law 268 yes 0 no 12 not present pictwittercomwhumh3xlx7 — spravdi — stratcom centre stratcomcentre february 25 2025 trump had also claimed that the ukrainian leader had only a 4 percent “approval rating” in polls repeating reports from russian media but according to a survey carried out this month by the kyiv international institute of sociology zelenskyy has a 57 percent approval rating even if this is down from the 90 percent peak just after russia’s invasion this is a sign that zelenskyy is “maintaining his legitimacy” the institute said tuesday’s vote in the ukrainian parliament was a reversal from a day earlier during which the resolution received 218 votes falling eight votes shy of the threshold 226 votes needed to pass zelenskyy has so far been able to rely on shifting majorities in parliament to pass legislation as enough members of parliament from his own party are not always present without parliamentary support international agreements such as a prospective peace treaty with russia or a proposed raw materials agreement with the us cannot be ratified and come into force",
    "summary": "The 268 parliament members present on Tuesday voted unanimously in support of the Ukrainian president.\nUkraine’s parliament has overwhelmingly approved a resolution affirming the legitimacy of President Volodymyr Zelenskyy’s stay in office, asserting the constitutionality of deferring the presidential election while the country is at war.\nThe 268 parliament members present on Tuesday voted unanimously to approve the resolution, while 12 other MPs were not present during the session.\nHowever, under Ukrainian law, elections cannot be held as long as a state of martial law persists across the country.\nUkrainian Parliament unanimously votes to affirm President Zelensky's legitimacy and the constitutionally mandated requirement that prevents elections during martial law.",
    "keywords": [
      "ukrainian",
      "present",
      "president",
      "zelenskyys",
      "legitimacy",
      "unanimously",
      "elections",
      "resolution",
      "zelenskyy",
      "law",
      "votes",
      "parliament",
      "affirms"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/02/12845884-1740487227.jpg?resize=1200%2C675",
    "t": 76
  },
  "https://www.aljazeera.com/news/2025/2/14/why-is-donald-trump-discontinuing-the-penny": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/2/14/why-is-donald-trump-discontinuing-the-penny",
    "date": "2025-02-14",
    "time": "00:00:00",
    "title": "Why is Donald Trump discontinuing the penny?",
    "body": "The one cent coin costs more to produce than its value and is nearly obsolete in retail. But it has its supporters.\n\nUnited States President Donald Trump has ordered the Treasury to stop minting new pennies, reviving an old debate about the value of the one cent coin.\n\nThe penny, Trump argued in a post on his Truth Social platform on February 9, is “wasteful” because the cost to make it far exceeds its currency value.\n\n“Let’s rip the waste out of our great nation’s budget, even if it’s a penny at a time,” he wrote.\n\nWhy the push to retire the coin?\n\nDespite being worth only one cent, each penny costs nearly four cents to produce, according to the US Mint. That’s due to the cost of the raw material – mostly zinc – and the moulding process.\n\nSome 3.2 billion pennies were minted in 2024, meaning a production cost of $12.8bn.\n\nCenturies of inflation have also made the penny, first minted in 1793, virtually obsolete. It has become so insignificant that it’s no longer even practical for the cheapest retail items—such as a gumball or a single piece of candy.\n\n“People don’t want them. They don’t use them,” Larry Jackson, a 65-year-old coin dealer in Atlanta told the Reuters news agency. “They sock them away in cans and drawers and jars … Even a 30-pound bag won’t fetch you $50.”\n\nAdvertisement\n\nIn addition, the use of the penny tends to clog up retail transactions. If cashiers can skip counting pennies, they’d save 2.5 seconds per check-out, according to a 2006 study by the National Association of Convenience Stores.\n\nIs there an argument to keep it?\n\nYes. Some penny advocates contend that the currency helps keep prices in check.\n\nBusinesses, they argue, will be more likely to round off prices upwards than downwards without the penny. That could have a marginal inflationary impact.\n\nAdditionally, they argue, pennies serve as a valuable source of funding for charities: Each individual contribution might be tiny, but it all adds up.\n\nOthers point out that scrapping the coin may force the government to churn out more nickels, an even bigger financial burden. Worth five cents, the nickel costs 13 cents apiece to produce.\n\nUltimately, however, most economists say losing the penny would have a negligible effect on consumers. That’s because the vast majority of transactions are already cashless.\n\n“I think at some point in history cancelling the penny would have been a bigger deal, but now people don’t even carry them in their pockets,” said economist Sean Snaith. “They’re largely not in circulation.”\n\nHave other countries tried scrapping the penny?\n\nYes, countries like Canada, New Zealand, Australia and the Netherlands have all phased out their smallest-denomination coins.\n\nAdvertisement\n\nWhen Canada stopped minting the penny in 2013, it saved an estimated $11m annually, according to the Canadian government. Many retailers began rounding cash purchases to the nearest five-cent mark, while the government collected and recycled the pennies for their copper and zinc content.\n\nUS lawmakers have long advocated for similar measures. Starting in 1989, the late Arizona Congressman Jim Kolbe started a decades-long bid to eliminate the penny, introducing several failed bills to scrap it. “The penny has been a nuisance for years,” he said back in 2006.\n\nIs it legal for Trump to stop penny production on his own?\n\nIt’s unclear.\n\nCongress, which oversees the US Mint’s operations, would likely need to pass a law to permanently retire the coin. But some legal experts say Trump could simply direct the treasury secretary to stop producing them.\n\nLegal scholar Laurence H Tribe pointed out that the secretary has the authority to mint coins in whatever amounts deemed necessary – potentially zero for the penny.\n\n“Unlike a lot of what the new administration [of President Trump] has been doing pursuant to the flood of executive orders since January 20, this action seems to me entirely lawful and fully constitutional,” said Tribe.\n\nRobert Triest, an economist professor at Northeastern University, says “the process of discontinuing the penny in the US is a little unclear”.\n\n“It would likely require an act of Congress, but the secretary of the Treasury might be able to simply stop the minting of new pennies,” Triest was quoted by Northeastern Global News as saying in a January news article. Phasing out the penny, he added, would raise questions about how to round cash transactions and the use of people’s existing collections of pennies.",
    "clean_body": "the one cent coin costs more to produce than its value and is nearly obsolete in retail but it has its supporters united states president donald trump has ordered the treasury to stop minting new pennies reviving an old debate about the value of the one cent coin the penny trump argued in a post on his truth social platform on february 9 is “wasteful” because the cost to make it far exceeds its currency value “let’s rip the waste out of our great nation’s budget even if it’s a penny at a time” he wrote why the push to retire the coin despite being worth only one cent each penny costs nearly four cents to produce according to the us mint that’s due to the cost of the raw material – mostly zinc – and the moulding process some 32 billion pennies were minted in 2024 meaning a production cost of 128bn centuries of inflation have also made the penny first minted in 1793 virtually obsolete it has become so insignificant that it’s no longer even practical for the cheapest retail items—such as a gumball or a single piece of candy “people don’t want them they don’t use them” larry jackson a 65yearold coin dealer in atlanta told the reuters news agency “they sock them away in cans and drawers and jars … even a 30pound bag won’t fetch you 50” advertisement in addition the use of the penny tends to clog up retail transactions if cashiers can skip counting pennies they’d save 25 seconds per checkout according to a 2006 study by the national association of convenience stores is there an argument to keep it yes some penny advocates contend that the currency helps keep prices in check businesses they argue will be more likely to round off prices upwards than downwards without the penny that could have a marginal inflationary impact additionally they argue pennies serve as a valuable source of funding for charities each individual contribution might be tiny but it all adds up others point out that scrapping the coin may force the government to churn out more nickels an even bigger financial burden worth five cents the nickel costs 13 cents apiece to produce ultimately however most economists say losing the penny would have a negligible effect on consumers that’s because the vast majority of transactions are already cashless “i think at some point in history cancelling the penny would have been a bigger deal but now people don’t even carry them in their pockets” said economist sean snaith “they’re largely not in circulation” have other countries tried scrapping the penny yes countries like canada new zealand australia and the netherlands have all phased out their smallestdenomination coins advertisement when canada stopped minting the penny in 2013 it saved an estimated 11m annually according to the canadian government many retailers began rounding cash purchases to the nearest fivecent mark while the government collected and recycled the pennies for their copper and zinc content us lawmakers have long advocated for similar measures starting in 1989 the late arizona congressman jim kolbe started a decadeslong bid to eliminate the penny introducing several failed bills to scrap it “the penny has been a nuisance for years” he said back in 2006 is it legal for trump to stop penny production on his own it’s unclear congress which oversees the us mint’s operations would likely need to pass a law to permanently retire the coin but some legal experts say trump could simply direct the treasury secretary to stop producing them legal scholar laurence h tribe pointed out that the secretary has the authority to mint coins in whatever amounts deemed necessary – potentially zero for the penny “unlike a lot of what the new administration of president trump has been doing pursuant to the flood of executive orders since january 20 this action seems to me entirely lawful and fully constitutional” said tribe robert triest an economist professor at northeastern university says “the process of discontinuing the penny in the us is a little unclear” “it would likely require an act of congress but the secretary of the treasury might be able to simply stop the minting of new pennies” triest was quoted by northeastern global news as saying in a january news article phasing out the penny he added would raise questions about how to round cash transactions and the use of people’s existing collections of pennies",
    "summary": "United States President Donald Trump has ordered the Treasury to stop minting new pennies, reviving an old debate about the value of the one cent coin.\nThe penny, Trump argued in a post on his Truth Social platform on February 9, is “wasteful” because the cost to make it far exceeds its currency value.\nIs it legal for Trump to stop penny production on his own?\nBut some legal experts say Trump could simply direct the treasury secretary to stop producing them.\nRobert Triest, an economist professor at Northeastern University, says “the process of discontinuing the penny in the US is a little unclear”.",
    "keywords": [
      "treasury",
      "transactions",
      "penny",
      "secretary",
      "discontinuing",
      "trump",
      "donald",
      "pennies",
      "coin",
      "minting",
      "retail",
      "stop"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/02/AFP__20250211__2198716690__v3__HighRes__PresidentTrumpOrdersDepartmentOfTreasuryToSt-1739451994.jpg?resize=1920%2C1440",
    "t": 87
  },
  "https://www.aljazeera.com/news/2025/2/3/russia-accelerating-executions-of-ukrainian-pows-un": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/2/3/russia-accelerating-executions-of-ukrainian-pows-un",
    "date": "2025-02-03",
    "time": "00:00:00",
    "title": "Russia accelerating executions of Ukrainian POWs: UN",
    "body": "A report finds that Russian troops committed 79 executions in the last six months or so.\n\nThe United Nations has expressed “alarm” over a sharp rise in reported executions of Ukrainian soldiers captured by Russian armed forces.\n\nAccording to a report published on Monday by the UN Human Rights Monitoring Mission in Ukraine, 79 executions took place in 24 separate incidents since August 2024.\n\n“Many Ukrainian soldiers who surrendered or were in physical custody of the Russian armed forces were shot dead on the spot,” the report said.\n\nThe mission obtained footage and photographs published by both Ukrainian and Russian sources documenting the dead bodies. Interviews with witnesses were also conducted, and incidents were geolocated and matched to areas where Russian forces were operating.\n\nThe UN mission also documented the execution of a “wounded and incapacitated” Russian soldier by the Ukrainian troops.\n\n‘War crimes’\n\nRussia and Ukraine have traded accusations of committing war crimes, including the killing of captured personnel, since Russia launched its full-scale invasion of Ukraine in 2022.\n\nAdvertisement\n\nDanielle Bell, head of the UN mission, said such incidents do not “occur in a vacuum”, noting that public figures in Russia had previously publicly called for “inhumane treatment and even execution” of Ukrainian soldiers.\n\n“Combined with broad amnesty laws, such statements have the potential to incite or encourage unlawful behaviour,” Bell added.\n\nThe report emphasises that under international humanitarian law, calls for “no survivors” after the war are prohibited, with no mercy orders being a “serious violation” of international humanitarian law and a “war crime”.\n\n“All allegations of execution of captured Ukrainian military personnel and public statements calling for, or condoning, such actions must be investigated,” said Bell.\n\nLast month, Ukraine’s Prosecutor General’s Office opened a criminal case against Russia after footage emerged of Russian soldiers executing six Ukrainian soldiers in Donetsk.\n\n“The shooting of prisoners of war is a serious violation of the Geneva Convention on the Treatment of Prisoners of War and is classified as a grave international crime,” the statement read. “Investigative actions are currently being conducted to establish all the circumstances of the crime and the persons involved in its commission.”",
    "clean_body": "a report finds that russian troops committed 79 executions in the last six months or so the united nations has expressed “alarm” over a sharp rise in reported executions of ukrainian soldiers captured by russian armed forces according to a report published on monday by the un human rights monitoring mission in ukraine 79 executions took place in 24 separate incidents since august 2024 “many ukrainian soldiers who surrendered or were in physical custody of the russian armed forces were shot dead on the spot” the report said the mission obtained footage and photographs published by both ukrainian and russian sources documenting the dead bodies interviews with witnesses were also conducted and incidents were geolocated and matched to areas where russian forces were operating the un mission also documented the execution of a “wounded and incapacitated” russian soldier by the ukrainian troops ‘war crimes’ russia and ukraine have traded accusations of committing war crimes including the killing of captured personnel since russia launched its fullscale invasion of ukraine in 2022 advertisement danielle bell head of the un mission said such incidents do not “occur in a vacuum” noting that public figures in russia had previously publicly called for “inhumane treatment and even execution” of ukrainian soldiers “combined with broad amnesty laws such statements have the potential to incite or encourage unlawful behaviour” bell added the report emphasises that under international humanitarian law calls for “no survivors” after the war are prohibited with no mercy orders being a “serious violation” of international humanitarian law and a “war crime” “all allegations of execution of captured ukrainian military personnel and public statements calling for or condoning such actions must be investigated” said bell last month ukraine’s prosecutor general’s office opened a criminal case against russia after footage emerged of russian soldiers executing six ukrainian soldiers in donetsk “the shooting of prisoners of war is a serious violation of the geneva convention on the treatment of prisoners of war and is classified as a grave international crime” the statement read “investigative actions are currently being conducted to establish all the circumstances of the crime and the persons involved in its commission”",
    "summary": "A report finds that Russian troops committed 79 executions in the last six months or so.\nThe United Nations has expressed “alarm” over a sharp rise in reported executions of Ukrainian soldiers captured by Russian armed forces.\n“Many Ukrainian soldiers who surrendered or were in physical custody of the Russian armed forces were shot dead on the spot,” the report said.\nThe mission obtained footage and photographs published by both Ukrainian and Russian sources documenting the dead bodies.\nLast month, Ukraine’s Prosecutor General’s Office opened a criminal case against Russia after footage emerged of Russian soldiers executing six Ukrainian soldiers in Donetsk.",
    "keywords": [
      "ukrainian",
      "accelerating",
      "soldiers",
      "mission",
      "russian",
      "war",
      "report",
      "pows",
      "international",
      "executions",
      "ukraine",
      "russia",
      "incidents"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/02/AA-20250131-36920707-36920704-SPECIAL_BATTALION_ALCATRAZ_OF_THE_93RD_BRIGADE_HOW_EXCONVICTS_TRAIN_NEAR_POKROVSK-1738595978.jpg?resize=1920%2C1440",
    "t": 98
  },
  "https://www.aljazeera.com/news/2025/2/17/afghanistans-taliban-makes-debut-diplomatic-trip-to-japan": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/2/17/afghanistans-taliban-makes-debut-diplomatic-trip-to-japan",
    "date": "2025-02-17",
    "time": "00:00:00",
    "title": "Afghanistan’s Taliban makes debut diplomatic trip to Japan",
    "body": "Delegation says Taliban seeks ‘dignified’ global interaction as it builds ‘strong’ and ‘developed’ Afghanistan.\n\nA Taliban delegation has arrived in Japan on what is the first visit by the group that rules Afghanistan, according to media in the East Asian country.\n\nThe delegation, consisting of foreign affairs, education, economy and health officials, arrived on Sunday for a weeklong visit, the Asahi Shimbun newspaper reported. The visit is a rarity for the Taliban, whose diplomatic trips have previously remained close to Afghanistan since regaining power in 2021.\n\nThe Taliban representatives are expected to seek humanitarian support and potentially discuss diplomatic ties with Japanese officials.\n\nLatif Nazari, a deputy minister at the Taliban’s economy ministry, described the visit as part of the group’s efforts to become an “active member of the international community”.\n\n“We seek dignified interaction with the world for a strong, united, advanced, prosperous, developed Afghanistan and to be an active member of the international community,” Nazari, who is part of the delegation, wrote in a post on X on Saturday.\n\nAdvertisement\n\nCiting Afghan diplomatic sources, Japan’s public broadcaster NHK said the Taliban representatives plan to “exchange views with Japanese government officials”.\n\nRare trip outside the region\n\nWhile the Taliban government makes regular visits to neighbouring and regional countries, including Central Asia, Russia and China, it rarely travels outside the region. It has officially visited Europe only for diplomacy summits in Norway in 2022 and 2023.\n\nJapan’s embassy in Kabul temporarily relocated to Qatar after the fall of the previous foreign-backed government and the takeover by the Taliban in 2021. But it has since reopened and resumed diplomatic and humanitarian activities in the country.\n\nThe Taliban’s visit to Japan comes just days after ISIL (ISIS) claimed responsibility for a deadly suicide bombing outside the Ministry of Urban Development and Housing in Kabul, the latest in a series of attacks by the group.\n\nJapan’s embassy condemned the attack, posting on X on Sunday that “these attacks of terror must cease immediately”.",
    "clean_body": "delegation says taliban seeks ‘dignified’ global interaction as it builds ‘strong’ and ‘developed’ afghanistan a taliban delegation has arrived in japan on what is the first visit by the group that rules afghanistan according to media in the east asian country the delegation consisting of foreign affairs education economy and health officials arrived on sunday for a weeklong visit the asahi shimbun newspaper reported the visit is a rarity for the taliban whose diplomatic trips have previously remained close to afghanistan since regaining power in 2021 the taliban representatives are expected to seek humanitarian support and potentially discuss diplomatic ties with japanese officials latif nazari a deputy minister at the taliban’s economy ministry described the visit as part of the group’s efforts to become an “active member of the international community” “we seek dignified interaction with the world for a strong united advanced prosperous developed afghanistan and to be an active member of the international community” nazari who is part of the delegation wrote in a post on x on saturday advertisement citing afghan diplomatic sources japan’s public broadcaster nhk said the taliban representatives plan to “exchange views with japanese government officials” rare trip outside the region while the taliban government makes regular visits to neighbouring and regional countries including central asia russia and china it rarely travels outside the region it has officially visited europe only for diplomacy summits in norway in 2022 and 2023 japan’s embassy in kabul temporarily relocated to qatar after the fall of the previous foreignbacked government and the takeover by the taliban in 2021 but it has since reopened and resumed diplomatic and humanitarian activities in the country the taliban’s visit to japan comes just days after isil isis claimed responsibility for a deadly suicide bombing outside the ministry of urban development and housing in kabul the latest in a series of attacks by the group japan’s embassy condemned the attack posting on x on sunday that “these attacks of terror must cease immediately”",
    "summary": "Delegation says Taliban seeks ‘dignified’ global interaction as it builds ‘strong’ and ‘developed’ Afghanistan.\nA Taliban delegation has arrived in Japan on what is the first visit by the group that rules Afghanistan, according to media in the East Asian country.\nThe visit is a rarity for the Taliban, whose diplomatic trips have previously remained close to Afghanistan since regaining power in 2021.\nThe Taliban representatives are expected to seek humanitarian support and potentially discuss diplomatic ties with Japanese officials.\nAdvertisementCiting Afghan diplomatic sources, Japan’s public broadcaster NHK said the Taliban representatives plan to “exchange views with Japanese government officials”.",
    "keywords": [
      "afghanistans",
      "makes",
      "trip",
      "delegation",
      "afghanistan",
      "seek",
      "talibans",
      "x",
      "diplomatic",
      "japan",
      "debut",
      "visit",
      "strong",
      "outside",
      "taliban"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/02/AFP__20240911__36G34C6__v1__HighRes__TurkmenistanAfghanistanPakistanIndiaEnergy-1739776816.jpg?resize=1920%2C1440",
    "t": 84
  },
  "https://www.aljazeera.com/news/2025/2/10/dozens-killed-in-guatemala-bus-crash-rescuers-say": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/2/10/dozens-killed-in-guatemala-bus-crash-rescuers-say",
    "date": "2025-02-10",
    "time": "00:00:00",
    "title": "At least 51 people killed in Guatemala bus crash",
    "body": "Officials say rescue efforts under way to save people trapped in the wreckage.\n\nAt least 51 people have died and others have been injured when a bus plunged into a polluted ravine outside Guatemala City, according to Guatemalan officials.\n\nMynor Ruano, a spokesman for the city’s fire service, told reporters on Monday that efforts were under way “to save other people who are trapped” in the wreckage. The bodies of 36 men and 15 women have been sent to a provincial morgue.\n\nThe bus was moving on a busy route in and out of Guatemala’s capital on Monday when it fell from Puente Belice, a highway bridge that crosses over a road and creek.\n\nFootage shared by the fire department on social media showed rescue workers pulling victims out of the contaminated ravine. Images showed the bus upside down.\n\nBernardo Arevalo, the president of Guatemala, declared three days of national mourning and deployed the army and disaster agency to help with response efforts.\n\n“I stand in solidarity with the families of the victims who today woke up to heartbreaking news,” he said. “Their pain is my pain.”\n\nAdvertisement\n\nThe President of Guatemala’s Congress also released a statement on social media lamenting the “tragic accident” where “more than four dozen Guatemalans lost their lives in search of daily sustenance”.\n\nGuatemala City Mayor Ricardo Quinonez said on social media that emergency services had been deployed while traffic police worked on establishing alternate routes in the affected area.\n\nThe National Civil Police said that they were supporting search and rescue efforts and would give “all the necessary support”.",
    "clean_body": "officials say rescue efforts under way to save people trapped in the wreckage at least 51 people have died and others have been injured when a bus plunged into a polluted ravine outside guatemala city according to guatemalan officials mynor ruano a spokesman for the city’s fire service told reporters on monday that efforts were under way “to save other people who are trapped” in the wreckage the bodies of 36 men and 15 women have been sent to a provincial morgue the bus was moving on a busy route in and out of guatemala’s capital on monday when it fell from puente belice a highway bridge that crosses over a road and creek footage shared by the fire department on social media showed rescue workers pulling victims out of the contaminated ravine images showed the bus upside down bernardo arevalo the president of guatemala declared three days of national mourning and deployed the army and disaster agency to help with response efforts “i stand in solidarity with the families of the victims who today woke up to heartbreaking news” he said “their pain is my pain” advertisement the president of guatemala’s congress also released a statement on social media lamenting the “tragic accident” where “more than four dozen guatemalans lost their lives in search of daily sustenance” guatemala city mayor ricardo quinonez said on social media that emergency services had been deployed while traffic police worked on establishing alternate routes in the affected area the national civil police said that they were supporting search and rescue efforts and would give “all the necessary support”",
    "summary": "Officials say rescue efforts under way to save people trapped in the wreckage.\nAt least 51 people have died and others have been injured when a bus plunged into a polluted ravine outside Guatemala City, according to Guatemalan officials.\nFootage shared by the fire department on social media showed rescue workers pulling victims out of the contaminated ravine.\nGuatemala City Mayor Ricardo Quinonez said on social media that emergency services had been deployed while traffic police worked on establishing alternate routes in the affected area.\nThe National Civil Police said that they were supporting search and rescue efforts and would give “all the necessary support”.",
    "keywords": [
      "way",
      "rescue",
      "bus",
      "51",
      "crash",
      "efforts",
      "showed",
      "search",
      "media",
      "victims",
      "trapped",
      "killed",
      "social",
      "guatemala"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/02/AP25041523887579-1739199350.jpg?resize=1920%2C1440",
    "t": 91
  },
  "https://www.aljazeera.com/news/2025/2/15/despite-ceasefire-israel-still-destroying-homes-in-gaza": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/2/15/despite-ceasefire-israel-still-destroying-homes-in-gaza",
    "date": "2025-02-15",
    "time": "00:00:00",
    "title": "Despite ceasefire, Israel still destroying homes in Gaza",
    "body": "Analysis of satellite images shows Israel has destroyed dozens of homes in possible breach of the ceasefire terms.\n\nIsrael has destroyed dozens of homes in Rafah, southern Gaza, despite the ceasefire between Israel and Hamas, satellite imagery analysis conducted by Al Jazeera’s fact-checking agency, Sanad, has revealed.\n\nThe crossing between Egypt and Gaza at Rafah, which has served as a critical lifeline into the enclave for decades, was closed by Israel in May 2024.\n\nSince seizing control of the border area, in breach of its 1979 peace agreement with Egypt, Israel has been digging in in the Philadelphi Corridor, a 14-km (8.7-mile) strip of land along the boundary between Egypt and Gaza.\n\nIsraeli Prime Minister Benjamin Netanyahu has emphasised the importance of remaining in the corridor, despite the illegality.\n\nAccording to Sanad, the images, taken between January 19 and 21, show the Israeli army to have built sand fortifications across the Rafah crossing.\n\nAdditionally, the agency said, a new military outpost has been established just to the north of the crossing.\n\nThe army has also constructed a 1.7 km (1.1-mile) road surrounding the crossing, running parallel to the sand fortifications.\n\nAdvertisement\n\nIsraeli forces have also kept thousands of Rafah residents from their homes, Israeli military vehicles shooting at dozens of people trying to go home, injuring and killing them.\n\nIsrael, in essence, is constructing “a buffer zone that allows you to push any kind of fighters or, in technical terms, any hostile within an otherwise friendly environment away from you”, Palestinian defence analyst Hamze Attar said.\n\nAs part of the ceasefire, which began on January 19, Israel agreed to reduce its forces in the area before completely withdrawing its troops by the 50th day of the agreement.\n\nHowever, analysis carried out on satellite images taken between January 19 and February 1 shows the Israeli army has continued construction in the area, demolishing and bulldozing 64 buildings within the city of Rafah, specifically in the as-Salam, Idari, and Tel Zaarab neighbourhoods.\n\nThe demolitions occurred only 700 metres (766 yards) from the Egyptian border. At the same time, Sanad also identified at least six homes razed in Tal as-Sultan, west of Rafah, a little more than 750 metres (820 yards) from the Egyptian border.\n\n“This is a war crime because they are destroying residential houses,” Attar said, referring to the fourth Geneva Convention, which prohibits the destruction of private property.\n\nMeanwhile, Munir al-Bursh, director-general of the Ministry of Health in Gaza, said on Tuesday that Israeli attacks, unexploded ordnance, or fatal injuries sustained earlier have killed 118 people since the ceasefire agreement took effect.\n\nAdvertisement\n\nIn addition to military breaches of the ceasefire, Israel has not allowed in sufficient amounts of essential humanitarian aid, such as food, fuel, tents, and emergency shelters.\n\nRafah Mayor Ahmed al-Sufi said most of the city’s residents remain displaced, with an estimated 200,000 people sheltering in the al-Mawasi Khan Younis area and other locations across Gaza, unable to come home.\n\nAccording to him, initial estimates indicate that 90 percent of Rafah’s homes have been damaged, with approximately 52,000 units suffering various degrees of destruction.",
    "clean_body": "analysis of satellite images shows israel has destroyed dozens of homes in possible breach of the ceasefire terms israel has destroyed dozens of homes in rafah southern gaza despite the ceasefire between israel and hamas satellite imagery analysis conducted by al jazeera’s factchecking agency sanad has revealed the crossing between egypt and gaza at rafah which has served as a critical lifeline into the enclave for decades was closed by israel in may 2024 since seizing control of the border area in breach of its 1979 peace agreement with egypt israel has been digging in in the philadelphi corridor a 14km 87mile strip of land along the boundary between egypt and gaza israeli prime minister benjamin netanyahu has emphasised the importance of remaining in the corridor despite the illegality according to sanad the images taken between january 19 and 21 show the israeli army to have built sand fortifications across the rafah crossing additionally the agency said a new military outpost has been established just to the north of the crossing the army has also constructed a 17 km 11mile road surrounding the crossing running parallel to the sand fortifications advertisement israeli forces have also kept thousands of rafah residents from their homes israeli military vehicles shooting at dozens of people trying to go home injuring and killing them israel in essence is constructing “a buffer zone that allows you to push any kind of fighters or in technical terms any hostile within an otherwise friendly environment away from you” palestinian defence analyst hamze attar said as part of the ceasefire which began on january 19 israel agreed to reduce its forces in the area before completely withdrawing its troops by the 50th day of the agreement however analysis carried out on satellite images taken between january 19 and february 1 shows the israeli army has continued construction in the area demolishing and bulldozing 64 buildings within the city of rafah specifically in the assalam idari and tel zaarab neighbourhoods the demolitions occurred only 700 metres 766 yards from the egyptian border at the same time sanad also identified at least six homes razed in tal assultan west of rafah a little more than 750 metres 820 yards from the egyptian border “this is a war crime because they are destroying residential houses” attar said referring to the fourth geneva convention which prohibits the destruction of private property meanwhile munir albursh directorgeneral of the ministry of health in gaza said on tuesday that israeli attacks unexploded ordnance or fatal injuries sustained earlier have killed 118 people since the ceasefire agreement took effect advertisement in addition to military breaches of the ceasefire israel has not allowed in sufficient amounts of essential humanitarian aid such as food fuel tents and emergency shelters rafah mayor ahmed alsufi said most of the city’s residents remain displaced with an estimated 200000 people sheltering in the almawasi khan younis area and other locations across gaza unable to come home according to him initial estimates indicate that 90 percent of rafah’s homes have been damaged with approximately 52000 units suffering various degrees of destruction",
    "summary": "Analysis of satellite images shows Israel has destroyed dozens of homes in possible breach of the ceasefire terms.\nIsrael has destroyed dozens of homes in Rafah, southern Gaza, despite the ceasefire between Israel and Hamas, satellite imagery analysis conducted by Al Jazeera’s fact-checking agency, Sanad, has revealed.\nThe crossing between Egypt and Gaza at Rafah, which has served as a critical lifeline into the enclave for decades, was closed by Israel in May 2024.\nAdvertisementIsraeli forces have also kept thousands of Rafah residents from their homes, Israeli military vehicles shooting at dozens of people trying to go home, injuring and killing them.\nAdvertisementIn addition to military breaches of the ceasefire, Israel has not allowed in sufficient amounts of essential humanitarian aid, such as food, fuel, tents, and emergency shelters.",
    "keywords": [
      "gaza",
      "satellite",
      "area",
      "israel",
      "israeli",
      "despite",
      "rafah",
      "military",
      "homes",
      "sanad",
      "ceasefire",
      "destroying"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/02/INTERACTIVE-Israel-destroys-homes-during-ceasefire-1739431157.png?resize=1200%2C675",
    "t": 86
  },
  "https://www.aljazeera.com/news/2025/2/5/four-examples-of-trumps-neverending-support-for-israel": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/2/5/four-examples-of-trumps-neverending-support-for-israel",
    "date": "2025-02-05",
    "time": "00:00:00",
    "title": "Four examples of Trump’s neverending support for Israel",
    "body": "Trump’s pronouncement on Gaza isn’t the first time he has voiced his wholehearted support of Israel.\n\nThe return of US President Donald Trump has been hailed by parts of the Israeli public who see his second term as a return of uncritical support of Israel.\n\nTrump’s predecessor, Joe Biden, supported Israel in its war on Gaza, as well as its invasion of Lebanon, but his administration’s occasional misgivings about Israel’s genocide in Gaza, which is now thought to have killed close to 62,000 people, made parts of the Israeli public unhappy.\n\nTrump’s involvement in a ceasefire that led to the release of some Israeli captives from Gaza and his enthusiastic suggestions of ethnically cleansing Gaza have raised Israeli hopes that his second term will be as pro-Israeli as his first.\n\nHere’s how he has helped prop Israel up.\n\nDiplomacy\n\nTrump’s diplomatic moves and appointments reflect his unwavering support for Israel.\n\nHe wants the US ambassador to Israel to be Arkansas Governor Mike Huckabee, who opposes the two-state solution that would give Palestine a state and has even questioned whether “such a thing as a Palestinian exists”.\n\nAdvertisement\n\nTrump’s previous ambassador to Israel was the hardline, pro-settlement, David Friedman.\n\nTrump also nominated Elise Stefanik as US ambassador to the United Nations. Stefanik says Israel has a “biblical right” to the West Bank.\n\nIn 2017, Trump said all of Jerusalem was the capital of Israel, despite Palestinian plans to declare occupied East Jerusalem as the capital of Palestine.\n\nHe also moved the US embassy from Tel Aviv to Jerusalem.\n\nUnder Trump, the US cut all funding for the UN’s Palestinian refugee agency, UNRWA, in 2018.\n\nOne of the principles UNRWA was founded on was the Palestinian right to return to their homes they were ethnically cleansed from by Israel as it occupied Palestinian lands.\n\nIn November 2019, citing anti-Israel bias, the US was the only country to vote with Israel against all eight of the UN 4th committee resolutions aimed at supporting Palestinian rights, condemning Israeli settlements, upholding refugee protections, ensuring the supply of humanitarian aid, and reinforcing existing international law\n\nIn 2020, Trump pushed for the Abraham Accords, normalising relations between Israel and the UAE, Bahrain, Sudan, and Morocco. This incentivised economic ties and security cooperation with Israel in return for US aid, or diplomatic support.\n\nSupport of Israeli territorial expansion\n\nIsrael’s illegal settlements on Palestinian land and other moves to expand its territory were also staunchly supported by Trump.\n\nIn May 2019, Trump reversed decades of US policy and said the occupied Golan Heights were Israeli territory.\n\nAdvertisement\n\nThen, in November 2019, US Secretary of State Mike Pompeo overruled his department’s 1978 legal opinion that settlements were illegal, saying the “establishment of Israeli civilian settlements in the West Bank is not, per se, inconsistent with international law”. International law is clear on the illegality.\n\nThe following year, Pompeo said the decision on whether to annex the Palestinian territory of the West Bank was an Israeli one.\n\nThe Trump administration was then silent on construction to expand the illegal settlement at Givat Hamatos near Jerusalem, which cut off parts of the city claimed by Palestinians.\n\nThe US was also silent when construction of new settlements at the flashpoint city of Hebron began in December 2019, and planners cited changed US policy as the reason to proceed.\n\nIn 2020, Trump presented the “Peace to Prosperity Plan”, ostensibly a peace plan.\n\nTrump’s plan placed Jerusalem as Israel’s capital, dismissing Palestinian claims to occupied East Jerusalem.\n\nIt also envisioned Israel annexing large portions of the West Bank, legitimising many of the Israeli settlements deemed illegal under international law.\n\nWhat little of the Palestinian state that was allowed within the “plan” was fragmented, with limited sovereignty and subject to Israeli security control.\n\nThe proposals also required Palestinians to meet stringent conditions before statehood was conferred upon them, including disarming Hamas, recognising Israel as a Jewish state and renouncing resistance to Israeli occupation in return for economic investment but no sovereignty.\n\nAdvertisement\n\nThe plan was overwhelmingly rejected by Palestinians.\n\nAttacking international courts\n\nIn 2019, the ICC announced that there was a reasonable basis to investigate potential war crimes by Israel in the occupied West Bank, occupied East Jerusalem, and Gaza.\n\nThe Trump administration strongly opposed this, defending Israel and taking steps to undermine the court.\n\nThe following year, in the face of strident international opposition, it imposed sanctions on ICC officials, including Chief Prosecutor Fatou Bensouda, restricting their visas and freezing their assets.\n\nConfrontations with Israel’s regional rivals\n\nDuring its first four years, the Trump administration was particularly focused on confronting many of Israel’s regional rivals.\n\nEarly in its existence, the Trump administration pushed through increased sanctions on the Lebanese group Hezbollah, targeting its global financial network, and threatening sanctions and account closures against anyone who finances the group.\n\nHezbollah has confronted Israel on numerous occasions.\n\nIn 2018, following campaigning by Israeli Prime Minister Benjamin Netanyahu, Trump withdrew from the 2015 Iran Nuclear Deal (JCPOA), reimposing strict economic sanctions on Iran in a bid to economically cripple Israel’s regional nemesis.\n\nIn April 2019, the US designated Iran’s elite Islamic Revolutionary Guard Corps (IRGC) a “terror group”, hoping to isolate it internationally and increase the costs on Iran “for its support of terrorist activity”.\n\nAdvertisement\n\nThe following year, the US went a step further, assassinating IRGC commander Qassem Soleimani, weakening Iran’s regional influence and ability to hold military positions in other countries in the region, such as Iraq and Syria, from where Israel felt itself under threat.",
    "clean_body": "trump’s pronouncement on gaza isn’t the first time he has voiced his wholehearted support of israel the return of us president donald trump has been hailed by parts of the israeli public who see his second term as a return of uncritical support of israel trump’s predecessor joe biden supported israel in its war on gaza as well as its invasion of lebanon but his administration’s occasional misgivings about israel’s genocide in gaza which is now thought to have killed close to 62000 people made parts of the israeli public unhappy trump’s involvement in a ceasefire that led to the release of some israeli captives from gaza and his enthusiastic suggestions of ethnically cleansing gaza have raised israeli hopes that his second term will be as proisraeli as his first here’s how he has helped prop israel up diplomacy trump’s diplomatic moves and appointments reflect his unwavering support for israel he wants the us ambassador to israel to be arkansas governor mike huckabee who opposes the twostate solution that would give palestine a state and has even questioned whether “such a thing as a palestinian exists” advertisement trump’s previous ambassador to israel was the hardline prosettlement david friedman trump also nominated elise stefanik as us ambassador to the united nations stefanik says israel has a “biblical right” to the west bank in 2017 trump said all of jerusalem was the capital of israel despite palestinian plans to declare occupied east jerusalem as the capital of palestine he also moved the us embassy from tel aviv to jerusalem under trump the us cut all funding for the un’s palestinian refugee agency unrwa in 2018 one of the principles unrwa was founded on was the palestinian right to return to their homes they were ethnically cleansed from by israel as it occupied palestinian lands in november 2019 citing antiisrael bias the us was the only country to vote with israel against all eight of the un 4th committee resolutions aimed at supporting palestinian rights condemning israeli settlements upholding refugee protections ensuring the supply of humanitarian aid and reinforcing existing international law in 2020 trump pushed for the abraham accords normalising relations between israel and the uae bahrain sudan and morocco this incentivised economic ties and security cooperation with israel in return for us aid or diplomatic support support of israeli territorial expansion israel’s illegal settlements on palestinian land and other moves to expand its territory were also staunchly supported by trump in may 2019 trump reversed decades of us policy and said the occupied golan heights were israeli territory advertisement then in november 2019 us secretary of state mike pompeo overruled his department’s 1978 legal opinion that settlements were illegal saying the “establishment of israeli civilian settlements in the west bank is not per se inconsistent with international law” international law is clear on the illegality the following year pompeo said the decision on whether to annex the palestinian territory of the west bank was an israeli one the trump administration was then silent on construction to expand the illegal settlement at givat hamatos near jerusalem which cut off parts of the city claimed by palestinians the us was also silent when construction of new settlements at the flashpoint city of hebron began in december 2019 and planners cited changed us policy as the reason to proceed in 2020 trump presented the “peace to prosperity plan” ostensibly a peace plan trump’s plan placed jerusalem as israel’s capital dismissing palestinian claims to occupied east jerusalem it also envisioned israel annexing large portions of the west bank legitimising many of the israeli settlements deemed illegal under international law what little of the palestinian state that was allowed within the “plan” was fragmented with limited sovereignty and subject to israeli security control the proposals also required palestinians to meet stringent conditions before statehood was conferred upon them including disarming hamas recognising israel as a jewish state and renouncing resistance to israeli occupation in return for economic investment but no sovereignty advertisement the plan was overwhelmingly rejected by palestinians attacking international courts in 2019 the icc announced that there was a reasonable basis to investigate potential war crimes by israel in the occupied west bank occupied east jerusalem and gaza the trump administration strongly opposed this defending israel and taking steps to undermine the court the following year in the face of strident international opposition it imposed sanctions on icc officials including chief prosecutor fatou bensouda restricting their visas and freezing their assets confrontations with israel’s regional rivals during its first four years the trump administration was particularly focused on confronting many of israel’s regional rivals early in its existence the trump administration pushed through increased sanctions on the lebanese group hezbollah targeting its global financial network and threatening sanctions and account closures against anyone who finances the group hezbollah has confronted israel on numerous occasions in 2018 following campaigning by israeli prime minister benjamin netanyahu trump withdrew from the 2015 iran nuclear deal jcpoa reimposing strict economic sanctions on iran in a bid to economically cripple israel’s regional nemesis in april 2019 the us designated iran’s elite islamic revolutionary guard corps irgc a “terror group” hoping to isolate it internationally and increase the costs on iran “for its support of terrorist activity” advertisement the following year the us went a step further assassinating irgc commander qassem soleimani weakening iran’s regional influence and ability to hold military positions in other countries in the region such as iraq and syria from where israel felt itself under threat",
    "summary": "Trump’s pronouncement on Gaza isn’t the first time he has voiced his wholehearted support of Israel.\nThe return of US President Donald Trump has been hailed by parts of the Israeli public who see his second term as a return of uncritical support of Israel.\nThis incentivised economic ties and security cooperation with Israel in return for US aid, or diplomatic support.\nIn May 2019, Trump reversed decades of US policy and said the occupied Golan Heights were Israeli territory.\nIt also envisioned Israel annexing large portions of the West Bank, legitimising many of the Israeli settlements deemed illegal under international law.",
    "keywords": [
      "palestinian",
      "israel",
      "examples",
      "west",
      "israeli",
      "trumps",
      "trump",
      "2019",
      "neverending",
      "international",
      "support",
      "occupied",
      "settlements",
      "return"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/02/AFP__20250204__36X79ZR__v2__HighRes__TopshotUsIsraelDiplomacyNetanyahuTrump-1738717799.jpg?resize=1920%2C1440",
    "t": 96
  }
}