{
  "https://www.aljazeera.com/news/2025/3/28/powerful-earthquake-shakes-myanmar-thailand": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/28/powerful-earthquake-shakes-myanmar-thailand",
    "date": "2025-03-28",
    "time": "00:00:00",
    "title": "Earthquake death toll in Myanmar, Thailand surpasses 150",
    "body": "A powerful earthquake has hit Myanmar and neighbouring Thailand, destroying buildings, damaging infrastructure and killing more than 150 people.\n\nThe head of Myanmar’s military government, Senior General Min Aung Hlaing, said that at least 144 people were killed and 730 others were injured in his country. The quake also hit Thailand, where at least 10 people were killed in the capital, Bangkok, according to city authorities.\n\nA magnitude 7.7 quake struck just outside Myanmar’s ancient capital Mandalay at 12.50pm (06:20 GMT). The initial tremor was followed minutes later by a magnitude 6.4 aftershock, according to the United States Geological Survey (USGS).\n\nPhotos from Myanmar’s current capital, Naypyidaw, showed multiple buildings used to house civil servants destroyed by the quake and rescue crews pulling victims from the rubble.\n\nGeneral Min Aung Hlaing, the head of Myanmar’s military government said the death toll was expected to rise and invited “any country” to provide help and donations.\n\n“I’ve been in earthquakes in this region before, and I’ve never felt anything as strong as that,” said Al Jazeera’s Tony Cheng, who was outside Myanmar’s Defence Services Museum in Naypyidaw when the earthquake hit.\n\nAdvertisement\n\nCheng and others sought shelter under a doorway as large roofing and side panels crashed down. The tremors began gently but quickly intensified, causing concrete panels to break off the building, he said.\n\nIn the Thai capital, a 33-storey building that was under construction near Chatuchak Market crumpled into a cloud of dust with onlookers seen screaming and running in a video posted on social media.\n\nAt least eight people were killed in the building collapse, Interior Minister Anutin Charnvirakul was quoted as saying by news agency AFP. He said that 90 to 110 people remained unaccounted for.\n\nAl Jazeera’s Imran Khan, who was in Bangkok when the quake hit, said: “People are out on the streets here. None of the trains are moving. … Traffic is absolutely gridlocked. The buildings have been shuttered in the centre of the city.”\n\nState of emergency\n\nMyanmar’s military government declared a state of emergency in six regions and states, including Naypyidaw and Mandalay.\n\nMajor General Zaw Min Tun, a government spokesperson, told MRTV that blood was in high demand in the hospitals in earthquake-hit areas, especially Mandalay, Sagaing and Naypyidaw.\n\nIn Mandalay, Myanmar’s second largest city, located in the country’s Buddhist heartland, the earthquake reportedly brought down multiple buildings, including the Ma Soe Yane Monastery, one of the largest in the city, and damaged the former royal palace.\n\nA video posted online showed robed monks in the street shooting video of the multistorey monastery before it suddenly collapsed. It was not immediately clear whether anyone was harmed.\n\nIn the Sagaing region just west of the city, a 90-year-old bridge collapsed, and some sections of the highway connecting Mandalay and Myanmar’s largest city, Yangon, were also damaged.\n\nAdvertisement\n\nThe Red Cross said downed power lines added to challenges for their teams trying to reach several hard-hit areas.\n\nAt least three people were killed in the town of Taungoo, south of Naypyidaw, when a mosque partially collapsed, according to witnesses who spoke to news agency Reuters.\n\n“We were saying prayers when the shaking started. … Three died on the spot,” one of the witnesses said.\n\nLocal media reported at least two people died and 20 were injured when a hotel collapsed in Aung Ban.\n\nA major hospital in Naypyidaw was declared a “mass casualty area”, an official at the facility told the AFP news agency.\n\nRows of wounded were treated outside the emergency department of the 1,000-bed general hospital, some writhing in pain, others lying still as relatives sought to comfort them.\n\nThai Prime Minister Paetongtarn Shinawatra announced a state of emergency in her country. Meanwhile, Bangkok has been declared a disaster area, the capital’s city hall said on Friday.\n\nUrban rail systems in Bangkok were temporarily closed but were expected to resume services on Saturday.\n\nTremors were also felt in the Yunnan and Sichuan provinces in China. They caused injuries and damage to houses in the city of Ruili on the border with northern Myanmar, according to Chinese media reports.\n\nVideos that one outlet said it had received from a person in Ruili in Yunnan showed building debris littering a street and a person being wheeled on a stretcher towards an ambulance.\n\nAdvertisement\n\nCambodia, Bangladesh and India also reported tremors.\n\nHumanitarian response\n\nJulie Mehigan, head of Asia, the Middle East and Europe for Christian Aid, said the earthquake would have left many people “devastated” in war-torn Myanmar, which is already experiencing a significant humanitarian crisis.\n\n“Myanmar is one of the least developed countries in the world. Even before this heartbreaking earthquake, we know conflict and displacement has left countless people in real need,” she said.\n\nWorld Health Organization spokeswoman Margaret Harris said at a media briefing that the earthquake was a “very, very big threat to life and health”.\n\n“We’ve activated our logistics hub to look particularly for trauma supplies and things like external fixators because we expect that there will be many, many injuries that need to be dealt with,” she said.\n\nMarie Manrique, programme coordinator for the International Federation of the Red Cross, told reporters in Geneva via videolink from Yangon that the organisation anticipates the impact to be “quite large”.\n\n“Public infrastructure has been damaged, including roads, bridges and public buildings. We currently have concerns for large-scale dams that people are watching to see the conditions of them,” she said.\n\nPrevious quakes in Myanmar\n\nEarthquakes are relatively common in Myanmar, where six strong quakes of magnitude 7 or higher struck from 1930 to 1956 near the Sagaing Fault, which runs north to south through the centre of the country, according to the USGS.\n\nAdvertisement\n\nA magnitude 6.8 earthquake in the ancient capital Bagan in central Myanmar killed three people in 2016, toppling spires and crumbling temple walls at the tourist destination.\n\nThe impoverished Southeast Asian nation has a strained medical system, especially in its rural states.\n\nMoreover, Cheng said it is important to remember that Myanmar is a country in the grips of a bitter civil war.\n\n“A lot of the people have moved from the countryside into the cities to try and escape,” he noted. “That has meant it is densely overcrowded and the building standards are not particularly strong.”",
    "clean_body": "a powerful earthquake has hit myanmar and neighbouring thailand destroying buildings damaging infrastructure and killing more than 150 people the head of myanmar’s military government senior general min aung hlaing said that at least 144 people were killed and 730 others were injured in his country the quake also hit thailand where at least 10 people were killed in the capital bangkok according to city authorities a magnitude 77 quake struck just outside myanmar’s ancient capital mandalay at 1250pm 0620 gmt the initial tremor was followed minutes later by a magnitude 64 aftershock according to the united states geological survey usgs photos from myanmar’s current capital naypyidaw showed multiple buildings used to house civil servants destroyed by the quake and rescue crews pulling victims from the rubble general min aung hlaing the head of myanmar’s military government said the death toll was expected to rise and invited “any country” to provide help and donations “i’ve been in earthquakes in this region before and i’ve never felt anything as strong as that” said al jazeera’s tony cheng who was outside myanmar’s defence services museum in naypyidaw when the earthquake hit advertisement cheng and others sought shelter under a doorway as large roofing and side panels crashed down the tremors began gently but quickly intensified causing concrete panels to break off the building he said in the thai capital a 33storey building that was under construction near chatuchak market crumpled into a cloud of dust with onlookers seen screaming and running in a video posted on social media at least eight people were killed in the building collapse interior minister anutin charnvirakul was quoted as saying by news agency afp he said that 90 to 110 people remained unaccounted for al jazeera’s imran khan who was in bangkok when the quake hit said “people are out on the streets here none of the trains are moving … traffic is absolutely gridlocked the buildings have been shuttered in the centre of the city” state of emergency myanmar’s military government declared a state of emergency in six regions and states including naypyidaw and mandalay major general zaw min tun a government spokesperson told mrtv that blood was in high demand in the hospitals in earthquakehit areas especially mandalay sagaing and naypyidaw in mandalay myanmar’s second largest city located in the country’s buddhist heartland the earthquake reportedly brought down multiple buildings including the ma soe yane monastery one of the largest in the city and damaged the former royal palace a video posted online showed robed monks in the street shooting video of the multistorey monastery before it suddenly collapsed it was not immediately clear whether anyone was harmed in the sagaing region just west of the city a 90yearold bridge collapsed and some sections of the highway connecting mandalay and myanmar’s largest city yangon were also damaged advertisement the red cross said downed power lines added to challenges for their teams trying to reach several hardhit areas at least three people were killed in the town of taungoo south of naypyidaw when a mosque partially collapsed according to witnesses who spoke to news agency reuters “we were saying prayers when the shaking started … three died on the spot” one of the witnesses said local media reported at least two people died and 20 were injured when a hotel collapsed in aung ban a major hospital in naypyidaw was declared a “mass casualty area” an official at the facility told the afp news agency rows of wounded were treated outside the emergency department of the 1000bed general hospital some writhing in pain others lying still as relatives sought to comfort them thai prime minister paetongtarn shinawatra announced a state of emergency in her country meanwhile bangkok has been declared a disaster area the capital’s city hall said on friday urban rail systems in bangkok were temporarily closed but were expected to resume services on saturday tremors were also felt in the yunnan and sichuan provinces in china they caused injuries and damage to houses in the city of ruili on the border with northern myanmar according to chinese media reports videos that one outlet said it had received from a person in ruili in yunnan showed building debris littering a street and a person being wheeled on a stretcher towards an ambulance advertisement cambodia bangladesh and india also reported tremors humanitarian response julie mehigan head of asia the middle east and europe for christian aid said the earthquake would have left many people “devastated” in wartorn myanmar which is already experiencing a significant humanitarian crisis “myanmar is one of the least developed countries in the world even before this heartbreaking earthquake we know conflict and displacement has left countless people in real need” she said world health organization spokeswoman margaret harris said at a media briefing that the earthquake was a “very very big threat to life and health” “we’ve activated our logistics hub to look particularly for trauma supplies and things like external fixators because we expect that there will be many many injuries that need to be dealt with” she said marie manrique programme coordinator for the international federation of the red cross told reporters in geneva via videolink from yangon that the organisation anticipates the impact to be “quite large” “public infrastructure has been damaged including roads bridges and public buildings we currently have concerns for largescale dams that people are watching to see the conditions of them” she said previous quakes in myanmar earthquakes are relatively common in myanmar where six strong quakes of magnitude 7 or higher struck from 1930 to 1956 near the sagaing fault which runs north to south through the centre of the country according to the usgs advertisement a magnitude 68 earthquake in the ancient capital bagan in central myanmar killed three people in 2016 toppling spires and crumbling temple walls at the tourist destination the impoverished southeast asian nation has a strained medical system especially in its rural states moreover cheng said it is important to remember that myanmar is a country in the grips of a bitter civil war “a lot of the people have moved from the countryside into the cities to try and escape” he noted “that has meant it is densely overcrowded and the building standards are not particularly strong”",
    "summary": "A powerful earthquake has hit Myanmar and neighbouring Thailand, destroying buildings, damaging infrastructure and killing more than 150 people.\nThe quake also hit Thailand, where at least 10 people were killed in the capital, Bangkok, according to city authorities.\nPhotos from Myanmar’s current capital, Naypyidaw, showed multiple buildings used to house civil servants destroyed by the quake and rescue crews pulling victims from the rubble.\nAdvertisementA magnitude 6.8 earthquake in the ancient capital Bagan in central Myanmar killed three people in 2016, toppling spires and crumbling temple walls at the tourist destination.\nMoreover, Cheng said it is important to remember that Myanmar is a country in the grips of a bitter civil war.",
    "keywords": [
      "myanmar",
      "150",
      "capital",
      "death",
      "myanmars",
      "city",
      "building",
      "country",
      "surpasses",
      "killed",
      "earthquake",
      "buildings",
      "toll",
      "thailand",
      "naypyidaw"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/03/AFP__20250328__388P6ZA__v1__HighRes__MyanmarThailandQuake-1743159147.jpg?resize=1920%2C1440",
    "t": 45
  },
  "https://www.aljazeera.com/news/2025/3/10/mob-faked-attack-on-australian-synagogue-police": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/10/mob-faked-attack-on-australian-synagogue-police",
    "date": "2025-03-10",
    "time": "00:00:00",
    "title": "Mob faked attack on Australian synagogue: Police",
    "body": "An organised crime network fabricated a plot to attack a synagogue in Australia to divert law enforcement resources, according to police.\n\nThe Australian Federal Police (AFP) said on Monday that the discovery of explosives in a caravan parked in Sydney was part of a “criminal con job”. The country has previously said it suspected there were criminal links to a surge in anti-Semitic crime since the start of the Gaza war.\n\nThe authorities found the caravan, which contained enough explosives to create a blast wave of 40 metres (130 feet), in January. The police now say they quickly realised that the cache was fabricated by an organised crime network.\n\nThe caravan had been easily located, the AFP said, adding that the explosives were clearly visible and no detonator was present, suggesting there was never any intent to attack Jewish targets.\n\n“The caravan was never going to cause a mass casualty event but instead was concocted by criminals who wanted to cause fear for personal benefit,” Krissy Barrett, AFP’s deputy commissioner for national security, told a news conference.\n\nAdvertisement\n\n“Almost immediately, experienced investigators … believed that the caravan was part of a fabricated terrorism plot – essentially a criminal con job.”\n\n‘Chilling effect’\n\nIn a statement on Monday, the AFP said its investigation, named Operation Kissinger, has identified a number of people involved in the fake terrorism plot and is working with local and overseas law enforcement to bring them to justice.\n\nIt was decided to release the information to the public to provide comfort to Sydney’s Jewish community, New South Wales Police Deputy Commissioner Dave Hudson told a news conference.\n\n“[The plot] was about causing chaos within the community, causing threat, causing angst, diverting police resources away from their day jobs, to have them focus on matters that would allow them to get up to or engage in other criminal activity,” he said.\n\nThe country’s counterterrorism unit had considered releasing information to the public earlier but it had been receiving tip-offs about other related “terror plots”.\n\nHowever, “we are now confident that all these tip-offs were fabricated, and the caravan plot was an elaborate scheme contrived by organised criminals domestically and from offshore“, the AFP statement said.\n\nAustralia has suffered a spate of anti-Semitic attacks in recent months, with homes, schools, synagogues and vehicles targeted by vandalism and arson, drawing the ire of the country’s traditional ally Israel.\n\nBarrett said, in this atmosphere, the fake caravan plot had had a “chilling effect” on the Jewish community.\n\nAdvertisement\n\n“What organised crime has done to the Jewish community is reprehensible, and it won’t go without consequence. There was also unwarranted suspicion directed at other communities – and that is also reprehensible.”",
    "clean_body": "an organised crime network fabricated a plot to attack a synagogue in australia to divert law enforcement resources according to police the australian federal police afp said on monday that the discovery of explosives in a caravan parked in sydney was part of a “criminal con job” the country has previously said it suspected there were criminal links to a surge in antisemitic crime since the start of the gaza war the authorities found the caravan which contained enough explosives to create a blast wave of 40 metres 130 feet in january the police now say they quickly realised that the cache was fabricated by an organised crime network the caravan had been easily located the afp said adding that the explosives were clearly visible and no detonator was present suggesting there was never any intent to attack jewish targets “the caravan was never going to cause a mass casualty event but instead was concocted by criminals who wanted to cause fear for personal benefit” krissy barrett afp’s deputy commissioner for national security told a news conference advertisement “almost immediately experienced investigators … believed that the caravan was part of a fabricated terrorism plot – essentially a criminal con job” ‘chilling effect’ in a statement on monday the afp said its investigation named operation kissinger has identified a number of people involved in the fake terrorism plot and is working with local and overseas law enforcement to bring them to justice it was decided to release the information to the public to provide comfort to sydney’s jewish community new south wales police deputy commissioner dave hudson told a news conference “the plot was about causing chaos within the community causing threat causing angst diverting police resources away from their day jobs to have them focus on matters that would allow them to get up to or engage in other criminal activity” he said the country’s counterterrorism unit had considered releasing information to the public earlier but it had been receiving tipoffs about other related “terror plots” however “we are now confident that all these tipoffs were fabricated and the caravan plot was an elaborate scheme contrived by organised criminals domestically and from offshore“ the afp statement said australia has suffered a spate of antisemitic attacks in recent months with homes schools synagogues and vehicles targeted by vandalism and arson drawing the ire of the country’s traditional ally israel barrett said in this atmosphere the fake caravan plot had had a “chilling effect” on the jewish community advertisement “what organised crime has done to the jewish community is reprehensible and it won’t go without consequence there was also unwarranted suspicion directed at other communities – and that is also reprehensible”",
    "summary": "An organised crime network fabricated a plot to attack a synagogue in Australia to divert law enforcement resources, according to police.\nThe police now say they quickly realised that the cache was fabricated by an organised crime network.\nIt was decided to release the information to the public to provide comfort to Sydney’s Jewish community, New South Wales Police Deputy Commissioner Dave Hudson told a news conference.\nBarrett said, in this atmosphere, the fake caravan plot had had a “chilling effect” on the Jewish community.\nAdvertisement“What organised crime has done to the Jewish community is reprehensible, and it won’t go without consequence.",
    "keywords": [
      "caravan",
      "jewish",
      "fabricated",
      "organised",
      "afp",
      "mob",
      "synagogue",
      "plot",
      "attack",
      "australian",
      "faked",
      "crime",
      "explosives",
      "criminal",
      "community"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/03/12733796-1741592564.jpg?resize=1920%2C1440",
    "t": 63
  },
  "https://www.aljazeera.com/news/2025/3/3/israel-launches-air-attacks-near-syrias-tartous": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/3/israel-launches-air-attacks-near-syrias-tartous",
    "date": "2025-03-03",
    "time": "00:00:00",
    "title": "Israel launches air attacks near Syria’s Tartous",
    "body": "Israel has carried out hundreds of strikes in Syria since former President Bashar al-Assad was toppled in December.\n\nIsrael has carried out air strikes near Syria’s Mediterranean port city of Tartous, Syrian state media has reported.\n\nAn Israeli army statement on Monday said that its forces “struck a military site where weapons belonging to the previous Syrian regime were stored in the area of Qardaha”, the hometown of deposed Syrian President Bashar al-Assad, some 60km (37 miles) north of the Tartous port.\n\nSyrian state news agency SANA reported “air strikes carried out by Israeli occupation aircraft on the surroundings of Tartous city, without recording human losses so far”, adding that “civil defence and specialised teams are working to confirm the location of the targets”.\n\nIn the wake of the lightning opposition offensive last December that toppled Syria’s longtime leader al-Assad, Israel has carried out hundreds of air strikes on Syrian military assets in what it said was a bid to prevent them from falling into hostile hands.\n\nLast Tuesday, the Israeli army said it carried out air strikes targeting military sites containing weapons in southern Syria, just days after Israeli Prime Minister Benjamin Netanyahu called for demilitarising the area.\n\nAdvertisement\n\nIsrael has moved forces into a United Nations-monitored demilitarised zone within Syria after al-Assad’s removal, a move that violated the 1974 disengagement agreement with Syria. Israel has also taken control of areas outside of the buffer zone, including Mount Hermon, and has conducted repeated bombing raids on military sites.\n\nLast week at Syria’s national dialogue conference participants affirmed their rejection of “provocative” statements by Netanyahu and urged the international community to pressure Israel to stop any “aggression and violations”, condemning “the Israeli incursion into Syrian territory”.\n\nThe conference also opposed Israel’s attempts to stoke sectarian tensions by indicating it was willing to protect Syria’s minority Druze community, many of whom live in the south of the country.",
    "clean_body": "israel has carried out hundreds of strikes in syria since former president bashar alassad was toppled in december israel has carried out air strikes near syria’s mediterranean port city of tartous syrian state media has reported an israeli army statement on monday said that its forces “struck a military site where weapons belonging to the previous syrian regime were stored in the area of qardaha” the hometown of deposed syrian president bashar alassad some 60km 37 miles north of the tartous port syrian state news agency sana reported “air strikes carried out by israeli occupation aircraft on the surroundings of tartous city without recording human losses so far” adding that “civil defence and specialised teams are working to confirm the location of the targets” in the wake of the lightning opposition offensive last december that toppled syria’s longtime leader alassad israel has carried out hundreds of air strikes on syrian military assets in what it said was a bid to prevent them from falling into hostile hands last tuesday the israeli army said it carried out air strikes targeting military sites containing weapons in southern syria just days after israeli prime minister benjamin netanyahu called for demilitarising the area advertisement israel has moved forces into a united nationsmonitored demilitarised zone within syria after alassad’s removal a move that violated the 1974 disengagement agreement with syria israel has also taken control of areas outside of the buffer zone including mount hermon and has conducted repeated bombing raids on military sites last week at syria’s national dialogue conference participants affirmed their rejection of “provocative” statements by netanyahu and urged the international community to pressure israel to stop any “aggression and violations” condemning “the israeli incursion into syrian territory” the conference also opposed israel’s attempts to stoke sectarian tensions by indicating it was willing to protect syria’s minority druze community many of whom live in the south of the country",
    "summary": "Israel has carried out hundreds of strikes in Syria since former President Bashar al-Assad was toppled in December.\nIsrael has carried out air strikes near Syria’s Mediterranean port city of Tartous, Syrian state media has reported.\nIn the wake of the lightning opposition offensive last December that toppled Syria’s longtime leader al-Assad, Israel has carried out hundreds of air strikes on Syrian military assets in what it said was a bid to prevent them from falling into hostile hands.\nLast Tuesday, the Israeli army said it carried out air strikes targeting military sites containing weapons in southern Syria, just days after Israeli Prime Minister Benjamin Netanyahu called for demilitarising the area.\nIsrael has also taken control of areas outside of the buffer zone, including Mount Hermon, and has conducted repeated bombing raids on military sites.",
    "keywords": [
      "tartous",
      "launches",
      "israel",
      "attacks",
      "israeli",
      "carried",
      "syrian",
      "near",
      "syria",
      "air",
      "syrias",
      "strikes",
      "military"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/03/GettyImages-2192609030-1741028546.jpg?resize=1600%2C1080",
    "t": 70
  },
  "https://www.aljazeera.com/news/2025/3/17/heres-a-look-at-turkiyes-booming-defence-industry": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/17/heres-a-look-at-turkiyes-booming-defence-industry",
    "date": "2025-03-17",
    "time": "00:00:00",
    "title": "Turkiye’s booming defence industry – a quick look",
    "body": "With advances made via land, sea and air, Turkiye forges an independent path.\n\nTurkiye has always placed a premium on its defence, initially buying then developing its own weapons.\n\nThe owner of NATO’s second-largest standing army has also emerged as a notable weapons exporter, with some iconic products on the international market.\n\nTurkiye’s exports increased year on year to reach $7.1bn in 2024 – from $1.9bn a decade prior – with customers across Europe and the Middle East.\n\nWhat’s behind this growth? What are Turkiye’s capabilities? And why is it important? Here’s what we know:\n\nWhen did Turkiye move to domestic production?\n\nTurkiye has sought military self-sufficiency for a while, a gradual process that saw it establish the Defence Industry Development and Support Administration Office (SAGEB) in 1985.\n\nFor years, SAGEB focused on international collaboration in research and development. But as Turkiye came up against restrictions on what weapons it could purchase and how it could use them, that switched to local production.\n\nIn the 2010s, it switched focus to domestic design, resulting in a huge increase in domestic defence production.\n\nAdvertisement\n\nToday, thousands of Turkish defence manufacturers span land, air, and naval capabilities, which is being increasingly recognised internationally.\n\nHave you heard about Turkish drones?\n\nPerhaps the most famous Turkish unmanned aerial vehicle (UAV) is the iconic Bayraktar TB2, first deployed in 2014, one of the most widely purchased Turkish defence products.\n\nThere are several others, however, including the medium-altitude long-endurance Anka-S, which has a payload of 200kg (441lb), and the Vestel Karayel tactical UAV with a 70kg (154lb) payload.\n\nThe country is also working on its “Steel Dome” (Celik Kubbe), described as a system that, augmented by AI, can identify and intercept any airborne threat.\n\nAdditionally, work is ongoing on the first domestic fifth-generation fighter, the Turkish KAAN, which aims to replace aging American F-16s in the Turkish Air Force.\n\nWhat else is in Turkiye’s catalogue?\n\nOn the ground, Turkiye’s armoured vehicle production is spearheaded by the Altay main battle tank, designed to rival Western models such as the German Leopard or the US Abrams.\n\nThe army also has a mine-resistant vehicle, the Kirpi (Hedgehog), widely used in counterinsurgency operations, as well as modern infantry fighting vehicles like the FNSS Defence Systems’ Kaplan and the Pars.\n\nThere’s also naval production, with MILGEM (Milli Gemi Projesi, or the National Ship Project), which was set up in 2004 to produce the next generation of Turkish naval class ships.\n\nAdvertisement\n\nMILGEM has produced state-of-the-art Ada-class corvettes and Istanbul-class frigates, with plans for more advanced warships and submarines.\n\nMost remarkable is the amphibious drone-carrying assault ship, the TCG Anadolu, the largest ship in the Turkish navy, which was deployed in 2023.\n\nFinally, there’s a long list of smart munitions, air defence systems, and missiles, such as the Bora short-range ballistic missile and the long-range Atmaca (Hawk) missiles.\n\nWhy the interest in arms manufacturing?\n\nTurkiye’s push to develop military hardware can be said to be as much a result of outside forces as internal drivers.\n\nIn the mid-1970s, the United States put an arms embargo on Turkiye over its military intervention in Cyprus.\n\nIn the early 1990s, Germany instituted an export ban on arms to Turkiye, saying armoured cars it sold to Turkiye had been used domestically when the contract had specified they could only be used against an attack by a non-NATO state.\n\nThen in 2020, the US sanctioned Turkiye over its purchase of the Russian S-400 air defence system, by which time Turkiye was already established as an arms manufacturer.\n\nToday, there are about 3,000 weapons companies in Turkiye.\n\nSo how much is Turkiye exporting?\n\nExports have increased so they now comprise 1.7 percent of global arms exports, putting the country in 11th place for the period from 2020 to 2024 in the ranking of the world’s defence exporters, according to the Stockholm International Peace Research Institute (SIPRI).\n\nAdvertisement\n\nAccording to monitors, during the last year, Turkiye’s exports reached 178 countries, marking a 103 percent increase compared with 2015-2019.\n\nIts main customers in the 202-2024 period were the United Arab Emirates, Pakistan and Qatar, according to SIPRI.\n\nAs for its most famous export, the Bayraktar medium-altitude long-endurance drone has reportedly been exported to at least 31 countries, including Iraq, Ukraine, Kenya, Bangladesh and Japan.\n\nLast year, its manufacturer Baykar announced the investment of $300m in developing its own jet engines, aiming to take on more component production and avoid international supply chain challenges.\n\nIt aims to develop an in-house engine for its Akinci drone, then a turbofan engine for Kizilelma, an unmanned air-to-air combat vehicle that is under development. So far, both use Ukrainian engines.",
    "clean_body": "with advances made via land sea and air turkiye forges an independent path turkiye has always placed a premium on its defence initially buying then developing its own weapons the owner of nato’s secondlargest standing army has also emerged as a notable weapons exporter with some iconic products on the international market turkiye’s exports increased year on year to reach 71bn in 2024 – from 19bn a decade prior – with customers across europe and the middle east what’s behind this growth what are turkiye’s capabilities and why is it important here’s what we know when did turkiye move to domestic production turkiye has sought military selfsufficiency for a while a gradual process that saw it establish the defence industry development and support administration office sageb in 1985 for years sageb focused on international collaboration in research and development but as turkiye came up against restrictions on what weapons it could purchase and how it could use them that switched to local production in the 2010s it switched focus to domestic design resulting in a huge increase in domestic defence production advertisement today thousands of turkish defence manufacturers span land air and naval capabilities which is being increasingly recognised internationally have you heard about turkish drones perhaps the most famous turkish unmanned aerial vehicle uav is the iconic bayraktar tb2 first deployed in 2014 one of the most widely purchased turkish defence products there are several others however including the mediumaltitude longendurance ankas which has a payload of 200kg 441lb and the vestel karayel tactical uav with a 70kg 154lb payload the country is also working on its “steel dome” celik kubbe described as a system that augmented by ai can identify and intercept any airborne threat additionally work is ongoing on the first domestic fifthgeneration fighter the turkish kaan which aims to replace aging american f16s in the turkish air force what else is in turkiye’s catalogue on the ground turkiye’s armoured vehicle production is spearheaded by the altay main battle tank designed to rival western models such as the german leopard or the us abrams the army also has a mineresistant vehicle the kirpi hedgehog widely used in counterinsurgency operations as well as modern infantry fighting vehicles like the fnss defence systems’ kaplan and the pars there’s also naval production with milgem milli gemi projesi or the national ship project which was set up in 2004 to produce the next generation of turkish naval class ships advertisement milgem has produced stateoftheart adaclass corvettes and istanbulclass frigates with plans for more advanced warships and submarines most remarkable is the amphibious dronecarrying assault ship the tcg anadolu the largest ship in the turkish navy which was deployed in 2023 finally there’s a long list of smart munitions air defence systems and missiles such as the bora shortrange ballistic missile and the longrange atmaca hawk missiles why the interest in arms manufacturing turkiye’s push to develop military hardware can be said to be as much a result of outside forces as internal drivers in the mid1970s the united states put an arms embargo on turkiye over its military intervention in cyprus in the early 1990s germany instituted an export ban on arms to turkiye saying armoured cars it sold to turkiye had been used domestically when the contract had specified they could only be used against an attack by a nonnato state then in 2020 the us sanctioned turkiye over its purchase of the russian s400 air defence system by which time turkiye was already established as an arms manufacturer today there are about 3000 weapons companies in turkiye so how much is turkiye exporting exports have increased so they now comprise 17 percent of global arms exports putting the country in 11th place for the period from 2020 to 2024 in the ranking of the world’s defence exporters according to the stockholm international peace research institute sipri advertisement according to monitors during the last year turkiye’s exports reached 178 countries marking a 103 percent increase compared with 20152019 its main customers in the 2022024 period were the united arab emirates pakistan and qatar according to sipri as for its most famous export the bayraktar mediumaltitude longendurance drone has reportedly been exported to at least 31 countries including iraq ukraine kenya bangladesh and japan last year its manufacturer baykar announced the investment of 300m in developing its own jet engines aiming to take on more component production and avoid international supply chain challenges it aims to develop an inhouse engine for its akinci drone then a turbofan engine for kizilelma an unmanned airtoair combat vehicle that is under development so far both use ukrainian engines",
    "summary": "With advances made via land, sea and air, Turkiye forges an independent path.\nIn the 2010s, it switched focus to domestic design, resulting in a huge increase in domestic defence production.\nAdvertisementToday, thousands of Turkish defence manufacturers span land, air, and naval capabilities, which is being increasingly recognised internationally.\nPerhaps the most famous Turkish unmanned aerial vehicle (UAV) is the iconic Bayraktar TB2, first deployed in 2014, one of the most widely purchased Turkish defence products.\nFinally, there’s a long list of smart munitions, air defence systems, and missiles, such as the Bora short-range ballistic missile and the long-range Atmaca (Hawk) missiles.",
    "keywords": [
      "weapons",
      "quick",
      "arms",
      "turkish",
      "air",
      "booming",
      "domestic",
      "turkiye",
      "turkiyes",
      "international",
      "look",
      "industry",
      "defence",
      "vehicle"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/03/GettyImages-2197197776-1741945366.jpg?resize=1920%2C1440",
    "t": 56
  },
  "https://www.aljazeera.com/news/2025/3/12/can-house-republicans-cut-880bn-without-slashing-medicaid": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/12/can-house-republicans-cut-880bn-without-slashing-medicaid",
    "date": "2025-03-12",
    "time": "00:00:00",
    "title": "Can US House Republicans cut $880bn without slashing Medicaid?",
    "body": "The prospect of deep cuts to Medicaid, the United States government programme to provide healthcare to low-income people, has become a flashpoint in Congress as leaders of both parties accuse their counterparts of lying.\n\nHakeem Jeffries, the Democratic Party leader in the House of Representatives, said on February 27 that a Republican budget measure would “set in motion the largest cut to Medicaid in American history” and Republicans are hiding the consequences.\n\n“The Republicans are lying to the American people about Medicaid,” Jeffries said. “I can’t say it any other way. Republicans are lying. Prove me wrong.”\n\nRepublicans said Democrats were distorting the Republican budget. Congressman Steve Scalise said: “The word Medicaid is not even in this bill.”\n\nHouse Speaker Mike Johnson said on CNN that Republicans don’t want to cut Medicaid “and the Democrats have been lying about it.”\n\nRepublicans are looking for massive budget savings to meet their goal of fully extending President Donald Trump’s 2017 tax cuts. This is a separate process from Congress’s need to pass a continuing resolution to keep the government running by Friday or else face a federal government shutdown.\n\nAdvertisement\n\nHere’s what we know so far about potential Medicaid cuts.\n\nHouse Republican budget plan seeks $880bn in cuts\n\nMedicaid serves about one in five Americans. The healthcare programme is paid for by the federal government and partly by states. Louisiana, home to Johnson and Scalise, has one of the highest state proportions of Medicaid enrollees.\n\nThe House Republican budget plan adopted on February 25 opens the door to slashing Medicaid even though it doesn’t name the programme.\n\nThe plan directs the House Energy and Commerce Committee to find ways to cut the deficit by at least $880bn over the next decade.\n\nThe committee has jurisdiction over Medicaid, Medicare and the Children’s Health Insurance Program (CHIP) in addition to much smaller programmes. CHIP offers low-cost health coverage to children in families that earn too much money to qualify for Medicaid.\n\nRepublicans ruled out cuts to Medicare, the health insurance programme for senior citizens, which leaders cut at their political peril. Medicare is about 15 percent of the federal budget, and Medicaid is about 8.6 percent.\n\nWhen Medicare is set aside, Medicaid accounts for 93 percent of the funding under the committee’s jurisdiction, the nonpartisan Congressional Budget Office found in a March 5 analysis. That means it is impossible for the committee to find enough cuts that don’t affect Medicaid.\n\n“It’s a fantasy to imply that federal Medicaid assistance won’t be cut very deeply,” said Allison Orris, an expert on Medicaid policy at the Center on Budget and Policy Priorities, a left-leaning think tank.\n\nAdvertisement\n\nAfter Medicaid, the next largest programme under the committee’s jurisdiction is CHIP. Lawmakers don’t appear to be planning to wipe out CHIP, but even if they did, they would be only a “fraction of the way there”, said Joan Alker, an expert on Medicaid and CHIP at Georgetown University in Washington, DC.\n\nIf Medicare cuts are off the table, the only way to achieve $880bn in savings is through big Medicaid cuts, said Larry Levitt, executive vice president for health policy at KFF, a health policy organisation.\n\nAndy Schneider, a professor at Georgetown who served in former President Barack Obama’s administration as a senior adviser at the Centers for Medicare & Medicaid Services, said even if the committee eliminated all other programmes entirely, it could achieve only $381bn in savings – about 43 percent of the target.\n\n“In short, if they don’t want to cut Medicaid [or CHIP], and they don’t want to cut Medicare, the goal of cutting $880bn is impossible,” Schneider said.\n\nThe $880bn cut is not a done deal. House Republicans were able to pass their budget package, but Senate Republicans are taking a different approach and haven’t proposed such significant cuts.\n\nAny finalised budget blueprint would need Senate Republicans’ buy-in. Senator Josh Hawley is among Republicans who have spoken against potential cuts. He told the HuffPost: “I would not do severe cuts to Medicaid.”\n\nThe numbers are starting points that may lead to negotiation among at least Republicans, Joe Antos, a healthcare expert at the conservative American Enterprise Institute, said. “We are a long way from final legislation, so it’s not possible to predict how much any programme will be cut,” he said.\n\nAdvertisement\n\n“If the bill also includes extending the [Trump 2017] tax cuts, we are probably months away from seeing real language,” Antos said.\n\nOnce the House and Senate reach an agreement on language and the resolution passes both chambers, the committees would work on detailed cuts. To enact such cuts, both chambers would need to approve a separate bill and receive Trump’s signature.\n\nWhy eliminating fraud doesn’t solve the problem\n\nRepublican leaders have deflected concerns about Medicaid cuts by talking about a different target: Medicaid fraud.\n\n“I’m not going to touch Social Security, Medicare, Medicaid. Now, we’re going to get fraud out of there,” Trump said in an interview on the Fox News channel on Sunday in keeping with his campaign rhetoric that he would protect those programmes.\n\nAt the same time, Trump praised the House resolution that would make cuts highly likely: “The House Resolution implements my FULL America First Agenda, EVERYTHING, not just parts of it!” he said in a social media post.\n\nWould eliminating fraud solve the Medicaid problem? No.\n\nOn CNN, Johnson said cutting fraud, waste and abuse would result in “part of the savings to accomplish this mission”. He said the government loses $50bn a year in Medicaid payments “just in fraud alone”.\n\nBut Johnson conflated “fraud” with “improper payments”. The Government Accountability Office, the nonpartisan investigative arm that examines the use of public funds, found about $50bn in improper payments in Medicaid and the same amount in Medicare in 2023.\n\nAdvertisement\n\nThose improper payments were made in an incorrect amount (overpayment or underpayment), should not have been made at all, or had missing or insufficient documentation. But that doesn’t mean there was $50bn in Medicaid fraud, which would involve obtaining something through wilful misrepresentation.\n\nThe system used to identify improper payments is not designed to measure fraud, so we don’t know what percentage of improper payments were losses due to fraud, Schneider said.\n\nPlus, it’s a drop in the overall bucket of the potential $880bn in cuts.",
    "clean_body": "the prospect of deep cuts to medicaid the united states government programme to provide healthcare to lowincome people has become a flashpoint in congress as leaders of both parties accuse their counterparts of lying hakeem jeffries the democratic party leader in the house of representatives said on february 27 that a republican budget measure would “set in motion the largest cut to medicaid in american history” and republicans are hiding the consequences “the republicans are lying to the american people about medicaid” jeffries said “i can’t say it any other way republicans are lying prove me wrong” republicans said democrats were distorting the republican budget congressman steve scalise said “the word medicaid is not even in this bill” house speaker mike johnson said on cnn that republicans don’t want to cut medicaid “and the democrats have been lying about it” republicans are looking for massive budget savings to meet their goal of fully extending president donald trump’s 2017 tax cuts this is a separate process from congress’s need to pass a continuing resolution to keep the government running by friday or else face a federal government shutdown advertisement here’s what we know so far about potential medicaid cuts house republican budget plan seeks 880bn in cuts medicaid serves about one in five americans the healthcare programme is paid for by the federal government and partly by states louisiana home to johnson and scalise has one of the highest state proportions of medicaid enrollees the house republican budget plan adopted on february 25 opens the door to slashing medicaid even though it doesn’t name the programme the plan directs the house energy and commerce committee to find ways to cut the deficit by at least 880bn over the next decade the committee has jurisdiction over medicaid medicare and the children’s health insurance program chip in addition to much smaller programmes chip offers lowcost health coverage to children in families that earn too much money to qualify for medicaid republicans ruled out cuts to medicare the health insurance programme for senior citizens which leaders cut at their political peril medicare is about 15 percent of the federal budget and medicaid is about 86 percent when medicare is set aside medicaid accounts for 93 percent of the funding under the committee’s jurisdiction the nonpartisan congressional budget office found in a march 5 analysis that means it is impossible for the committee to find enough cuts that don’t affect medicaid “it’s a fantasy to imply that federal medicaid assistance won’t be cut very deeply” said allison orris an expert on medicaid policy at the center on budget and policy priorities a leftleaning think tank advertisement after medicaid the next largest programme under the committee’s jurisdiction is chip lawmakers don’t appear to be planning to wipe out chip but even if they did they would be only a “fraction of the way there” said joan alker an expert on medicaid and chip at georgetown university in washington dc if medicare cuts are off the table the only way to achieve 880bn in savings is through big medicaid cuts said larry levitt executive vice president for health policy at kff a health policy organisation andy schneider a professor at georgetown who served in former president barack obama’s administration as a senior adviser at the centers for medicare medicaid services said even if the committee eliminated all other programmes entirely it could achieve only 381bn in savings – about 43 percent of the target “in short if they don’t want to cut medicaid or chip and they don’t want to cut medicare the goal of cutting 880bn is impossible” schneider said the 880bn cut is not a done deal house republicans were able to pass their budget package but senate republicans are taking a different approach and haven’t proposed such significant cuts any finalised budget blueprint would need senate republicans’ buyin senator josh hawley is among republicans who have spoken against potential cuts he told the huffpost “i would not do severe cuts to medicaid” the numbers are starting points that may lead to negotiation among at least republicans joe antos a healthcare expert at the conservative american enterprise institute said “we are a long way from final legislation so it’s not possible to predict how much any programme will be cut” he said advertisement “if the bill also includes extending the trump 2017 tax cuts we are probably months away from seeing real language” antos said once the house and senate reach an agreement on language and the resolution passes both chambers the committees would work on detailed cuts to enact such cuts both chambers would need to approve a separate bill and receive trump’s signature why eliminating fraud doesn’t solve the problem republican leaders have deflected concerns about medicaid cuts by talking about a different target medicaid fraud “i’m not going to touch social security medicare medicaid now we’re going to get fraud out of there” trump said in an interview on the fox news channel on sunday in keeping with his campaign rhetoric that he would protect those programmes at the same time trump praised the house resolution that would make cuts highly likely “the house resolution implements my full america first agenda everything not just parts of it” he said in a social media post would eliminating fraud solve the medicaid problem no on cnn johnson said cutting fraud waste and abuse would result in “part of the savings to accomplish this mission” he said the government loses 50bn a year in medicaid payments “just in fraud alone” but johnson conflated “fraud” with “improper payments” the government accountability office the nonpartisan investigative arm that examines the use of public funds found about 50bn in improper payments in medicaid and the same amount in medicare in 2023 advertisement those improper payments were made in an incorrect amount overpayment or underpayment should not have been made at all or had missing or insufficient documentation but that doesn’t mean there was 50bn in medicaid fraud which would involve obtaining something through wilful misrepresentation the system used to identify improper payments is not designed to measure fraud so we don’t know what percentage of improper payments were losses due to fraud schneider said plus it’s a drop in the overall bucket of the potential 880bn in cuts",
    "summary": "The committee has jurisdiction over Medicaid, Medicare and the Children’s Health Insurance Program (CHIP) in addition to much smaller programmes.\n“In short, if they don’t want to cut Medicaid [or CHIP], and they don’t want to cut Medicare, the goal of cutting $880bn is impossible,” Schneider said.\nHouse Republicans were able to pass their budget package, but Senate Republicans are taking a different approach and haven’t proposed such significant cuts.\nWhy eliminating fraud doesn’t solve the problemRepublican leaders have deflected concerns about Medicaid cuts by talking about a different target: Medicaid fraud.\nBut that doesn’t mean there was $50bn in Medicaid fraud, which would involve obtaining something through wilful misrepresentation.",
    "keywords": [
      "budget",
      "house",
      "republicans",
      "dont",
      "cuts",
      "medicaid",
      "880bn",
      "fraud",
      "slashing",
      "cut",
      "payments",
      "medicare"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/03/AP25056687382351-1741283048.jpg?resize=1920%2C1440",
    "t": 61
  },
  "https://www.aljazeera.com/news/2025/3/8/cyclone-alfred-weakens-but-dangerous-winds-flooding-continue": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/8/cyclone-alfred-weakens-but-dangerous-winds-flooding-continue",
    "date": "2025-03-08",
    "time": "00:00:00",
    "title": "Cyclone Alfred weakens in Australia but dangerous winds, flooding continue",
    "body": "Officials warn residents to stay vigilant as ex-cyclone Alfred leaves more than 330,000 homes and businesses without power.\n\nTropical Cyclone Alfred has weakened into a tropical low weather system but officials warned that the storm can still bring severe winds and flooding to the eastern coast of Australia.\n\nThe cyclone, which weakened early on Saturday, crossed the islands off the coast of Queensland state overnight and is now heading towards the mainland, the Bureau of Meteorology said.\n\n“Heavy-to-locally intense rainfall leading to flash and riverine flooding now becomes the major concern as the ex-Tropical Cyclone Alfred moves inland,” Bureau of Meteorology manager Matt Collopy said.\n\nAlfred has blacked out more than a quarter of a million homes and businesses while prompting evacuation orders for thousands of people. No deaths have been reported so far but authorities have urged residents to stay indoors.\n\n“The impacts are already being felt, and there is worse to come in the hours ahead,” Prime Minister Anthony Albanese said in a news conference from the National Situation Room in Canberra.\n\nAdvertisement\n\nIt had been expected to become the first cyclone to cross the east Australian coast near the Queensland state capital of Brisbane since 1974.\n\nCyclones are common in Queensland’s tropical north but rare in the state’s temperate and densely populated southeast corner that borders New South Wales state.\n\nThousands without power\n\nBrisbane Airport remains shut and the city has suspended public transport. More than 1,000 schools in southeast Queensland and 280 in northern New South Wales (NSW) have been closed.\n\nMore than 330,000 homes and businesses lost power on both sides of the border between NSW and Queensland, a large proportion of them in Gold Coast, which recorded the strongest gusts of 107km/h (66mph) on Friday night.\n\nOf those, 291,000 premises were in Queensland, including 131,000 at Gold Coast, officials said. Another 45,000 were without power in New South Wales.\n\nPower lines, homes and cars were damaged by falling trees across the region over Friday night.\n\nOne man was still missing after his four-wheel drive vehicle was swept off a bridge into a rain-swollen river the previous day in northern New South Wales.\n\n“While it has been downgraded, very serious risks remain so it is important that people do not take this downgrading as a reason for complacency,” PM Albanese said.",
    "clean_body": "officials warn residents to stay vigilant as excyclone alfred leaves more than 330000 homes and businesses without power tropical cyclone alfred has weakened into a tropical low weather system but officials warned that the storm can still bring severe winds and flooding to the eastern coast of australia the cyclone which weakened early on saturday crossed the islands off the coast of queensland state overnight and is now heading towards the mainland the bureau of meteorology said “heavytolocally intense rainfall leading to flash and riverine flooding now becomes the major concern as the extropical cyclone alfred moves inland” bureau of meteorology manager matt collopy said alfred has blacked out more than a quarter of a million homes and businesses while prompting evacuation orders for thousands of people no deaths have been reported so far but authorities have urged residents to stay indoors “the impacts are already being felt and there is worse to come in the hours ahead” prime minister anthony albanese said in a news conference from the national situation room in canberra advertisement it had been expected to become the first cyclone to cross the east australian coast near the queensland state capital of brisbane since 1974 cyclones are common in queensland’s tropical north but rare in the state’s temperate and densely populated southeast corner that borders new south wales state thousands without power brisbane airport remains shut and the city has suspended public transport more than 1000 schools in southeast queensland and 280 in northern new south wales nsw have been closed more than 330000 homes and businesses lost power on both sides of the border between nsw and queensland a large proportion of them in gold coast which recorded the strongest gusts of 107kmh 66mph on friday night of those 291000 premises were in queensland including 131000 at gold coast officials said another 45000 were without power in new south wales power lines homes and cars were damaged by falling trees across the region over friday night one man was still missing after his fourwheel drive vehicle was swept off a bridge into a rainswollen river the previous day in northern new south wales “while it has been downgraded very serious risks remain so it is important that people do not take this downgrading as a reason for complacency” pm albanese said",
    "summary": "Tropical Cyclone Alfred has weakened into a tropical low weather system but officials warned that the storm can still bring severe winds and flooding to the eastern coast of Australia.\n“Heavy-to-locally intense rainfall leading to flash and riverine flooding now becomes the major concern as the ex-Tropical Cyclone Alfred moves inland,” Bureau of Meteorology manager Matt Collopy said.\nCyclones are common in Queensland’s tropical north but rare in the state’s temperate and densely populated southeast corner that borders New South Wales state.\nMore than 1,000 schools in southeast Queensland and 280 in northern New South Wales (NSW) have been closed.\nOne man was still missing after his four-wheel drive vehicle was swept off a bridge into a rain-swollen river the previous day in northern New South Wales.",
    "keywords": [
      "weakens",
      "flooding",
      "cyclone",
      "australia",
      "coast",
      "wales",
      "weakened",
      "dangerous",
      "continue",
      "south",
      "alfred",
      "homes",
      "officials",
      "businesses",
      "winds",
      "queensland"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/03/AFP__20250308__36ZK6KB__v1__HighRes__AustraliaWeatherCyclone-1741415251.jpg?resize=1920%2C1440",
    "t": 65
  },
  "https://www.aljazeera.com/news/2025/3/4/us-designates-yemens-houthis-as-foreign-terrorist-organisation": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/4/us-designates-yemens-houthis-as-foreign-terrorist-organisation",
    "date": "2025-03-04",
    "time": "00:00:00",
    "title": "US designates Yemen’s Houthis as ‘foreign terrorist’ organisation",
    "body": "The US has designated Yemen’s Houthi movement, known formally as Ansar Allah, as a “foreign terrorist” organisation, the US Department of State has said.\n\nUS Secretary of State Marco Rubio announced the department had restored the designation, which carries with it sanctions and penalties for anyone providing “material support” for the group.\n\n“The Houthis’ activities threaten the security of American civilians and personnel in the Middle East, the safety of our closest regional partners, and the stability of global maritime trade,” he said in a statement on Tuesday.\n\n“The United States will not tolerate any country engaging with terrorist organizations like the Houthis in the name of practising legitimate international business,” he added.\n\nUS President Donald Trump had set the process in motion in January, the White House said at the time.\n\nTrump had also listed the Yemeni group as a “foreign terrorist” organisation and “Specially Designated Global Terrorist” (SDGT) entity during the final days of his first term.\n\nAdvertisement\n\nFormer US President Joe Biden’s administration, however, reversed Trump’s designations weeks after coming into office, with former Secretary of State Antony Blinken citing “recognition of the dire humanitarian situation in Yemen”.\n\nThe White House said in its statement in January that Biden’s “weak policy” had resulted in the Houthis firing on US Navy warships dozens of times, targeting commercial vessels more than 100 times and attacking civilian infrastructure in partner nations.\n\n“Under President Trump, it is now the policy of the United States to cooperate with its regional partners to eliminate the Houthis’ capabilities and operations, deprive them of resources, and thereby end their attacks on US personnel and civilians, US partners, and maritime shipping in the Red Sea,” the White House said.",
    "clean_body": "the us has designated yemen’s houthi movement known formally as ansar allah as a “foreign terrorist” organisation the us department of state has said us secretary of state marco rubio announced the department had restored the designation which carries with it sanctions and penalties for anyone providing “material support” for the group “the houthis’ activities threaten the security of american civilians and personnel in the middle east the safety of our closest regional partners and the stability of global maritime trade” he said in a statement on tuesday “the united states will not tolerate any country engaging with terrorist organizations like the houthis in the name of practising legitimate international business” he added us president donald trump had set the process in motion in january the white house said at the time trump had also listed the yemeni group as a “foreign terrorist” organisation and “specially designated global terrorist” sdgt entity during the final days of his first term advertisement former us president joe biden’s administration however reversed trump’s designations weeks after coming into office with former secretary of state antony blinken citing “recognition of the dire humanitarian situation in yemen” the white house said in its statement in january that biden’s “weak policy” had resulted in the houthis firing on us navy warships dozens of times targeting commercial vessels more than 100 times and attacking civilian infrastructure in partner nations “under president trump it is now the policy of the united states to cooperate with its regional partners to eliminate the houthis’ capabilities and operations deprive them of resources and thereby end their attacks on us personnel and civilians us partners and maritime shipping in the red sea” the white house said",
    "summary": "The US has designated Yemen’s Houthi movement, known formally as Ansar Allah, as a “foreign terrorist” organisation, the US Department of State has said.\nUS Secretary of State Marco Rubio announced the department had restored the designation, which carries with it sanctions and penalties for anyone providing “material support” for the group.\n“The United States will not tolerate any country engaging with terrorist organizations like the Houthis in the name of practising legitimate international business,” he added.\nUS President Donald Trump had set the process in motion in January, the White House said at the time.\nTrump had also listed the Yemeni group as a “foreign terrorist” organisation and “Specially Designated Global Terrorist” (SDGT) entity during the final days of his first term.",
    "keywords": [
      "designates",
      "president",
      "organisation",
      "state",
      "house",
      "times",
      "houthis",
      "foreign",
      "trump",
      "yemens",
      "partners",
      "white",
      "united",
      "terrorist"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2024/02/2024-02-04T080842Z_1636458874_RC2KV5ALOEK1_RTRMADP_3_ISRAEL-PALESTINIANS-YEMEN-HOUTHIS-1709033488.jpg?resize=1920%2C1440",
    "t": 69
  },
  "https://www.aljazeera.com/news/2025/3/3/can-europe-guarantee-ukraines-security-without-the-us": {
    "source": "Al Jazeera",
    "url": "https://www.aljazeera.com/news/2025/3/3/can-europe-guarantee-ukraines-security-without-the-us",
    "date": "2025-03-03",
    "time": "00:00:00",
    "title": "Can Europe guarantee Ukraine’s security without the US?",
    "body": "European nations are working on security guarantees for Ukraine against Russia with, Trump making clear that the US won’t. But can they?\n\nHuddling in London over the weekend, European leaders declared that they would work to pull together a plan to end the war in Ukraine, but with security guarantees for the country that has been the victim of a full-scale Russian invasion since February 2022.\n\nThe meeting in the United Kingdom followed close on the heels of a disastrous visit to the White House by Ukrainian President Volodymyr Zelenskyy, during which he was publicly berated by United States President Donald Trump and Vice President JD Vance for resisting their plans for an unconditional peace plan with Russia.\n\nTrump has made it clear that the US will not provide security guarantees for Ukraine, urging Europe’s military forces to take charge instead.\n\nIn meetings with Trump in Washington, DC last week, French President Emmanuel Macron and British Prime Minister Keir Starmer both indicated a willingness to send troops to Ukraine as peacekeepers if a deal to end Russia’s war is reached.\n\nBut can Europe meaningfully provide a security cover to Ukraine, without the US backing it? What are Europe’s true security capabilities? How dependent is the region on US support? And what threat does Russia pose?\n\nAdvertisement\n\nWhat role does the US play in European security?\n\nThe US has been central to European security since the end of World War II, when it helped create the North Atlantic Treaty Organization (NATO) and deployed hundreds of thousands of soldiers to Europe to challenge Soviet influence. It has maintained this security leadership ever since, while also expanding its global superpower status.\n\nAs of July 2024, the US had about 65,000 active-duty soldiers permanently stationed across Europe, along with extensive weaponry, defence systems and other assets vital to NATO, according to the US government’s Defense Manpower Data Center.\n\nThis includes six pre-positioned weapons stockpiles in Europe, equipped with tanks and armoured vehicles, eight air squadrons, four navy destroyers and an estimated 100 nuclear bombs. Additionally, the US has some 10,000 soldiers on rotational deployment in Poland – a key part of NATO’s eastern flank with Russia.\n\nTo fund its military muscle, the US relies on a mammoth defence budget, which stood at $860bn in 2024. That is more than double that of all other combined members of NATO, who are bound to defend each other in the event of an attack.\n\nAt the same time, the US has provided the majority of direct military aid to Ukraine since Russia invaded it in 2022, sending approximately $65bn, according to the US Department of State. When accounting for other types of assistance, the US had allocated approximately $183bn to the Ukraine response as of September 30, 2024, according to Ukraine Oversight, a website created by the US government to record aid sent to Ukraine. The European Union, for its part, has sent a total of $141bn in aid to Ukraine, including $51bn in military assistance, according to the European Commission.\n\nAdvertisement\n\nHowever, Trump has said it is now time for the US to step back militarily from Europe and wants its allies in the continent to do more heavy lifting.\n\n“Stark strategic realities prevent the United States of America from being primarily focused on the security of Europe,” declared Trump’s Defense Secretary Pete Hegseth at a meeting of NATO allies on February 12. “European allies must lead from the front.”\n\nHow strong are NATO’s European allies?\n\nNATO’s European members have a combined two million active-duty soldiers, a small section of whom are assigned directly to serve under the alliance’s command. Turkiye and Poland have the most soldiers, with 481,000 and 216,000 respectively, according to NATO’s latest estimates.\n\nFrance and Germany follow, with 205,000 and 186,000 soldiers. The UK, which has offered to send peacekeeping forces to Ukraine under a potential peace deal, has 138,000 soldiers. NATO itself has a force of about 40,000 throughout its eastern flank – spanning Estonia, Latvia, Poland, Slovakia, Hungary, Romania and Bulgaria.\n\nTogether, NATO’s European allies have some 7,000 aircraft, 6,800 tanks, 2,170 military ships and six aircraft carriers, according to the Global Firepower defence index.\n\nHow would NATO fare if the US scales down?\n\nDespite its significant military assets, NATO still heavily depends on the US to deter threats in Europe. In the event of a major attack on one of their own, such as by Russia, NATO would likely expect the US to rush hundreds of thousands of additional troops to Europe, according to economic think tank Bruegel.\n\nAdvertisement\n\nIf Europe can no longer rely on this support, enhanced by Washington’s advanced military technology and infrastructure, Bruegel estimates the continent would need to create 50 new brigades, each consisting of thousands of soldiers, to fill the gap.\n\nConcerned, European states are feeling the pressure to increase their defence spending.\n\nLast week, the UK announced it would increase defence spending to 2.5 percent of the gross domestic product (GDP) by 2027. British Prime Minister Keir Starmer said this would add some $16bn every year to the defence budget, which currently stands at $68bn. “This government will begin the biggest sustained increase in defence spending since the end of the Cold War,” Starmer told Parliament.\n\nGermany had announced a special fund of more than $100bn to upgrade and strengthen its military in the wake of the Russian invasion of Ukraine in 2022, adding to its annual defence budget of some $52bn. Last year, the country’s defence budget hit 2 percent of GDP for the first time since the end of the Cold War as part of a NATO target set in 2014 following Russia’s annexation of Ukraine’s Crimea. Germany’s presumptive next chancellor, Friedrich Merz, in a December speech, stressed that the military would need “at least $84bn a year” in the future.\n\nFollowing Russia’s 2022 invasion of Ukraine, NATO allies across Europe and Canada increased their spending by an unprecedented 18 percent. Currently, 22 of 30 European NATO members spend at least 2 percent of their GDP on defence, as per their 2023 pledge.\n\nAdvertisement\n\nHowever, Trump has argued that is not nearly enough, calling for the states to boost defence spending to at least 5 percent of GDP.\n\nNATO Secretary-General Mark Rutte has acknowledged Europe’s need to invest more. “We have not paid enough over the last 40 years, particularly since the Berlin Wall came down,” Rutte told Politico on the sidelines of the Munich Security Conference on February 15. “The US is rightly asking for a rebalancing of that. It’s totally logical.”\n\nHow does Russia view NATO?\n\nRussia has cited NATO’s expansion as one of its justifications for invading Ukraine. Since its founding in 1949, NATO has grown from 12 to 32 members, steadily moving eastward towards Russia’s borders. Currently, six NATO members – four of which joined since the turn of the millennium – border Russia, including Finland, Latvia, Estonia and Lithuania.\n\nTo keep the Western military alliance at bay, Moscow has demanded that Ukraine, which has long sought NATO membership, be kept out of the grouping.\n\n“Otherwise, this problem will continue to poison the atmosphere on the European continent,” said Russia’s Ministry of Foreign Affairs spokeswoman Maria Zakharova on February 18. Trump’s administration, pushing for a quick end to the war, has said NATO membership is not “realistic” for Ukraine.\n\nBut Western European states view Russia’s aggression as a reason to strengthen the bloc. Since the end of the Cold War, Russia, the world’s largest nuclear power, has invaded or occupied parts of several nearby countries – Moldova, Georgia, and most recently Ukraine.\n\nAdvertisement\n\nRussia’s direct military intervention in Moldova in the early 1990s helped Russian-aligned separatists gain de facto control of the breakaway region of Transnistria. Russia’s blistering invasion of Georgia in 2008 dealt a heavy blow to Tbilisi and complicated its ties with the West.\n\nSince the 2022 invasion of Ukraine, NATO has grown. Previously neutral Finland and Sweden have joined the alliance over the past two years.\n\nHow strong is Russia’s military?\n\nCurrently, Russia has at least 1.32 million active-duty soldiers, hundreds of thousands of whom are fighting in Ukraine. Moscow had previously stationed about 12,000 soldiers in Kaliningrad, its westernmost enclave, sandwiched between NATO members Poland and Lithuania. However, most of these forces were reportedly redeployed to Ukraine earlier in the conflict.\n\nRussia also operates dozens of overseas military facilities, most located in former Soviet states. As of 2024, this includes at least two major bases in Belarus, two in Kazakhstan, two in Armenia, two in the disputed Georgian territories of South Ossetia and Abkhazia, and one base each in Kyrgyzstan, Tajikistan, Kazakhstan and Moldova’s breakaway region of Transnistria, according to the Georgian Foundation for Strategic and International Studies. The largest of these facilities is the 201st military base in Dushanbe, Tajikistan, which, as of 2022, had an estimated 7,000 Russian soldiers.\n\nIn terms of military assets, Russia has 4,292 aircraft, 5,750 tanks, 449 ships and one aircraft carrier, according to Global Firepower.\n\nAdvertisement\n\nWhile this capacity does not match NATO’s combined strength, it would present a tougher test if the US were to step back, as Trump has called for.\n\n“Europeans need to wake up,” said EU foreign policy chief Kaja Kallas at a conference of the European Defence Agency on January 22. The continent’s “failure to invest in military capabilities”, she said, “sends a dangerous signal to the aggressor. Weakness invites them in.”",
    "clean_body": "european nations are working on security guarantees for ukraine against russia with trump making clear that the us won’t but can they huddling in london over the weekend european leaders declared that they would work to pull together a plan to end the war in ukraine but with security guarantees for the country that has been the victim of a fullscale russian invasion since february 2022 the meeting in the united kingdom followed close on the heels of a disastrous visit to the white house by ukrainian president volodymyr zelenskyy during which he was publicly berated by united states president donald trump and vice president jd vance for resisting their plans for an unconditional peace plan with russia trump has made it clear that the us will not provide security guarantees for ukraine urging europe’s military forces to take charge instead in meetings with trump in washington dc last week french president emmanuel macron and british prime minister keir starmer both indicated a willingness to send troops to ukraine as peacekeepers if a deal to end russia’s war is reached but can europe meaningfully provide a security cover to ukraine without the us backing it what are europe’s true security capabilities how dependent is the region on us support and what threat does russia pose advertisement what role does the us play in european security the us has been central to european security since the end of world war ii when it helped create the north atlantic treaty organization nato and deployed hundreds of thousands of soldiers to europe to challenge soviet influence it has maintained this security leadership ever since while also expanding its global superpower status as of july 2024 the us had about 65000 activeduty soldiers permanently stationed across europe along with extensive weaponry defence systems and other assets vital to nato according to the us government’s defense manpower data center this includes six prepositioned weapons stockpiles in europe equipped with tanks and armoured vehicles eight air squadrons four navy destroyers and an estimated 100 nuclear bombs additionally the us has some 10000 soldiers on rotational deployment in poland – a key part of nato’s eastern flank with russia to fund its military muscle the us relies on a mammoth defence budget which stood at 860bn in 2024 that is more than double that of all other combined members of nato who are bound to defend each other in the event of an attack at the same time the us has provided the majority of direct military aid to ukraine since russia invaded it in 2022 sending approximately 65bn according to the us department of state when accounting for other types of assistance the us had allocated approximately 183bn to the ukraine response as of september 30 2024 according to ukraine oversight a website created by the us government to record aid sent to ukraine the european union for its part has sent a total of 141bn in aid to ukraine including 51bn in military assistance according to the european commission advertisement however trump has said it is now time for the us to step back militarily from europe and wants its allies in the continent to do more heavy lifting “stark strategic realities prevent the united states of america from being primarily focused on the security of europe” declared trump’s defense secretary pete hegseth at a meeting of nato allies on february 12 “european allies must lead from the front” how strong are nato’s european allies nato’s european members have a combined two million activeduty soldiers a small section of whom are assigned directly to serve under the alliance’s command turkiye and poland have the most soldiers with 481000 and 216000 respectively according to nato’s latest estimates france and germany follow with 205000 and 186000 soldiers the uk which has offered to send peacekeeping forces to ukraine under a potential peace deal has 138000 soldiers nato itself has a force of about 40000 throughout its eastern flank – spanning estonia latvia poland slovakia hungary romania and bulgaria together nato’s european allies have some 7000 aircraft 6800 tanks 2170 military ships and six aircraft carriers according to the global firepower defence index how would nato fare if the us scales down despite its significant military assets nato still heavily depends on the us to deter threats in europe in the event of a major attack on one of their own such as by russia nato would likely expect the us to rush hundreds of thousands of additional troops to europe according to economic think tank bruegel advertisement if europe can no longer rely on this support enhanced by washington’s advanced military technology and infrastructure bruegel estimates the continent would need to create 50 new brigades each consisting of thousands of soldiers to fill the gap concerned european states are feeling the pressure to increase their defence spending last week the uk announced it would increase defence spending to 25 percent of the gross domestic product gdp by 2027 british prime minister keir starmer said this would add some 16bn every year to the defence budget which currently stands at 68bn “this government will begin the biggest sustained increase in defence spending since the end of the cold war” starmer told parliament germany had announced a special fund of more than 100bn to upgrade and strengthen its military in the wake of the russian invasion of ukraine in 2022 adding to its annual defence budget of some 52bn last year the country’s defence budget hit 2 percent of gdp for the first time since the end of the cold war as part of a nato target set in 2014 following russia’s annexation of ukraine’s crimea germany’s presumptive next chancellor friedrich merz in a december speech stressed that the military would need “at least 84bn a year” in the future following russia’s 2022 invasion of ukraine nato allies across europe and canada increased their spending by an unprecedented 18 percent currently 22 of 30 european nato members spend at least 2 percent of their gdp on defence as per their 2023 pledge advertisement however trump has argued that is not nearly enough calling for the states to boost defence spending to at least 5 percent of gdp nato secretarygeneral mark rutte has acknowledged europe’s need to invest more “we have not paid enough over the last 40 years particularly since the berlin wall came down” rutte told politico on the sidelines of the munich security conference on february 15 “the us is rightly asking for a rebalancing of that it’s totally logical” how does russia view nato russia has cited nato’s expansion as one of its justifications for invading ukraine since its founding in 1949 nato has grown from 12 to 32 members steadily moving eastward towards russia’s borders currently six nato members – four of which joined since the turn of the millennium – border russia including finland latvia estonia and lithuania to keep the western military alliance at bay moscow has demanded that ukraine which has long sought nato membership be kept out of the grouping “otherwise this problem will continue to poison the atmosphere on the european continent” said russia’s ministry of foreign affairs spokeswoman maria zakharova on february 18 trump’s administration pushing for a quick end to the war has said nato membership is not “realistic” for ukraine but western european states view russia’s aggression as a reason to strengthen the bloc since the end of the cold war russia the world’s largest nuclear power has invaded or occupied parts of several nearby countries – moldova georgia and most recently ukraine advertisement russia’s direct military intervention in moldova in the early 1990s helped russianaligned separatists gain de facto control of the breakaway region of transnistria russia’s blistering invasion of georgia in 2008 dealt a heavy blow to tbilisi and complicated its ties with the west since the 2022 invasion of ukraine nato has grown previously neutral finland and sweden have joined the alliance over the past two years how strong is russia’s military currently russia has at least 132 million activeduty soldiers hundreds of thousands of whom are fighting in ukraine moscow had previously stationed about 12000 soldiers in kaliningrad its westernmost enclave sandwiched between nato members poland and lithuania however most of these forces were reportedly redeployed to ukraine earlier in the conflict russia also operates dozens of overseas military facilities most located in former soviet states as of 2024 this includes at least two major bases in belarus two in kazakhstan two in armenia two in the disputed georgian territories of south ossetia and abkhazia and one base each in kyrgyzstan tajikistan kazakhstan and moldova’s breakaway region of transnistria according to the georgian foundation for strategic and international studies the largest of these facilities is the 201st military base in dushanbe tajikistan which as of 2022 had an estimated 7000 russian soldiers in terms of military assets russia has 4292 aircraft 5750 tanks 449 ships and one aircraft carrier according to global firepower advertisement while this capacity does not match nato’s combined strength it would present a tougher test if the us were to step back as trump has called for “europeans need to wake up” said eu foreign policy chief kaja kallas at a conference of the european defence agency on january 22 the continent’s “failure to invest in military capabilities” she said “sends a dangerous signal to the aggressor weakness invites them in”",
    "summary": "European nations are working on security guarantees for Ukraine against Russia with, Trump making clear that the US won’t.\nBut can Europe meaningfully provide a security cover to Ukraine, without the US backing it?\nAdvertisementWhat role does the US play in European security?\nFollowing Russia’s 2022 invasion of Ukraine, NATO allies across Europe and Canada increased their spending by an unprecedented 18 percent.\n“Europeans need to wake up,” said EU foreign policy chief Kaja Kallas at a conference of the European Defence Agency on January 22.",
    "keywords": [
      "soldiers",
      "guarantee",
      "nato",
      "european",
      "according",
      "defence",
      "ukraine",
      "europe",
      "ukraines",
      "military",
      "russia",
      "security"
    ],
    "image_url": "https://www.aljazeera.com/wp-content/uploads/2025/02/AFP__20250219__36Y82PV__v1__HighRes__RomaniaNatoDefenceExercise-1740573916.jpg?resize=1920%2C1440",
    "t": 70
  }
}