{
  "https://apnews.com/article/guardians-ramirez-9d657b21bec21e70852af3cf96d90e63": {
    "source": "AP News",
    "url": "https://apnews.com/article/guardians-ramirez-9d657b21bec21e70852af3cf96d90e63",
    "date": "2025-05-01",
    "time": "23:11:01",
    "title": "Cleveland’s José Ramírez becomes first third baseman with 250 career homers and steals",
    "body": "CLEVELAND (AP) — José Ramírez picked the perfect opportunity to join another exclusive baseball club.\n\nCleveland’s six-time All-Star became the first primary third baseman in history to reach 250 career homers and 250 stolen bases during the 10th inning of the Guardians 4-3 victory against the Minnesota Twins.\n\n“At that moment, the last thing you’re thinking is any milestones or personal records,” Ramirez said through an interpreter. “To me it was where we had the chance to get running, obviously get in a position where I can score with a base hit given the situation of the game.”\n\nRamírez, who has 260 homers, got his 250th steal with one out in the 10th inning after he got aboard with an RBI base hit. The 32-year old native of the Dominican Republic is the 24th player to accomplish the feat, and the only active one in the majors.\n\nHe is also the first Cleveland player reach 250-250 and just the second switch-hitter, joining Carlos Beltrán (435 homers, 312 stolen bases).\n\n“It’s a testament to hard work for a really long time and being really, really good for a long time,” manager Stephen Vogt said. “He came through big with the hit and then he gets the stolen base in the milestone and scores a winning run as well. He should have. He just continues to get accolade after accolade and I really enjoy watching it.”\n\nAfter Kyle Manzardo got aboard on an intentional walk, Ramírez acknowledged the small crowd still at Progressive Field after two rain delays totaling 2 hours, 23 minutes, and pointed at the scoreboard when it showed he had reached the milestone.\n\n“It was a good moment, but especially seeing all the guys on the dugout trying to cheer me up and chanting my name. So that’s kind of like something that make me smile,” he said.\n\nRamírez then scored the game-winning run on Angel Martinez’s single. He also made sure he got the base to add to his collection, saying he would add it to the three other bases he has marking other accomplishments.\n\nRamírez dazzles his teammates on an almost daily basis, so it’s not a surprise to them that he’s added his name to another elite list.\n\n“He’s a guy that leads by example,” catcher Bo Naylor said. “He goes out there, plays his hardest, and when you see one of the leaders on your team doing that, there’s no excuse for you to not be able to do that. He takes on that role himself and just does such a good job of keeping all of us accountable without making his voice heard in a way.\n\n“He’s one of the guys that makes this whole team go and every accomplishment that he’s had come along the way, it’s been super awesome to be able to witness it one and be able to celebrate it with him afterward.”\n\nAlong with the other milestones, Ramírez joins Robin Yount, Craig Biggio and Derek Jeter as the only players to accomplish the 250-250 feat with only one team.\n\n“Milestones are important, but for me the really important part is to keep playing and trying to win,” said Ramirez, who made his big-league debut in 2013 “Winning is the most important thing for me and I feel still young. I feel like I can still continue doing this and hopefully we can continue adding up.”\n\n___\n\nFreelancer Tom Withers contributed to this story.\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "cleveland ap — josé ramírez picked the perfect opportunity to join another exclusive baseball club cleveland’s sixtime allstar became the first primary third baseman in history to reach 250 career homers and 250 stolen bases during the 10th inning of the guardians 43 victory against the minnesota twins “at that moment the last thing you’re thinking is any milestones or personal records” ramirez said through an interpreter “to me it was where we had the chance to get running obviously get in a position where i can score with a base hit given the situation of the game” ramírez who has 260 homers got his 250th steal with one out in the 10th inning after he got aboard with an rbi base hit the 32year old native of the dominican republic is the 24th player to accomplish the feat and the only active one in the majors he is also the first cleveland player reach 250250 and just the second switchhitter joining carlos beltrán 435 homers 312 stolen bases “it’s a testament to hard work for a really long time and being really really good for a long time” manager stephen vogt said “he came through big with the hit and then he gets the stolen base in the milestone and scores a winning run as well he should have he just continues to get accolade after accolade and i really enjoy watching it” after kyle manzardo got aboard on an intentional walk ramírez acknowledged the small crowd still at progressive field after two rain delays totaling 2 hours 23 minutes and pointed at the scoreboard when it showed he had reached the milestone “it was a good moment but especially seeing all the guys on the dugout trying to cheer me up and chanting my name so that’s kind of like something that make me smile” he said ramírez then scored the gamewinning run on angel martinez’s single he also made sure he got the base to add to his collection saying he would add it to the three other bases he has marking other accomplishments ramírez dazzles his teammates on an almost daily basis so it’s not a surprise to them that he’s added his name to another elite list “he’s a guy that leads by example” catcher bo naylor said “he goes out there plays his hardest and when you see one of the leaders on your team doing that there’s no excuse for you to not be able to do that he takes on that role himself and just does such a good job of keeping all of us accountable without making his voice heard in a way “he’s one of the guys that makes this whole team go and every accomplishment that he’s had come along the way it’s been super awesome to be able to witness it one and be able to celebrate it with him afterward” along with the other milestones ramírez joins robin yount craig biggio and derek jeter as the only players to accomplish the 250250 feat with only one team “milestones are important but for me the really important part is to keep playing and trying to win” said ramirez who made his bigleague debut in 2013 “winning is the most important thing for me and i feel still young i feel like i can still continue doing this and hopefully we can continue adding up” freelancer tom withers contributed to this story ap mlb httpsapnewscomhubmlb",
    "summary": "CLEVELAND (AP) — José Ramírez picked the perfect opportunity to join another exclusive baseball club.\nCleveland’s six-time All-Star became the first primary third baseman in history to reach 250 career homers and 250 stolen bases during the 10th inning of the Guardians 4-3 victory against the Minnesota Twins.\nHe is also the first Cleveland player reach 250-250 and just the second switch-hitter, joining Carlos Beltrán (435 homers, 312 stolen bases).\n“It’s a testament to hard work for a really long time and being really, really good for a long time,” manager Stephen Vogt said.\n“He came through big with the hit and then he gets the stolen base in the milestone and scores a winning run as well.",
    "keywords": [
      "baseman",
      "steals",
      "stolen",
      "good",
      "clevelands",
      "able",
      "josé",
      "career",
      "ramírez",
      "homers",
      "250",
      "really",
      "winning",
      "hit",
      "important",
      "base"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/5057276/2147483647/strip/true/crop/4997x2811+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F06%2Fcea748d288f1009525e876fb0716%2F7c1d3feb9ade47cd82bb17fc31749d86",
    "t": 11
  },
  "https://apnews.com/article/nhl-playoffs-480e309764b2d58681da942b19a6ca74": {
    "source": "AP News",
    "url": "https://apnews.com/article/nhl-playoffs-480e309764b2d58681da942b19a6ca74",
    "date": "2025-05-01",
    "time": "18:15:49",
    "title": "Blues hoping to defend home ice once again as Jets look to fight their way into NHL’s second round",
    "body": "The first five games of the Winnipeg-St. Louis series have all had the same result. The home team won.\n\nThe Blues need that trend to continue Friday — or else.\n\nGame 6 of the Jets-Blues matchup awaits in St. Louis, with Winnipeg — the NHL’s best team in the regular season — holding a 3-2 series lead. The Blues rolled to wins on their home ice in Games 3 and 4, taking those games by scores of 7-2 and 5-1 to extend a run of invincibility there that has lasted for more than two months.\n\n“It’s a tough building to play in,” Jets forward Vladislav Namestnikov said. “But I know we can get the win there.”\n\nIf they do, they will be doing so without star Mark Scheifele, the team’s second-leading scorer and leader in game-winning goals this season. Scheifele was hurt in Game 5 and wasn’t flying with Winnipeg to St. Louis on Thursday for Game 6.\n\nThe teams had different opinions about when Scheifele got hurt, but the bottom line is the Jets will be missing a big part of their team for a potential closeout game.\n\n“Certainly, not having him is going to be huge,” Jets coach Scott Arniel said Thursday. “But at the end of the day, last night, our three centermen had to step up and play big minutes and did a great job. ... So proud of the group, how everybody stepped up. It’s kind of what our team has done all year. Guys go down, other guys step in.”\n\nWinnipeg was the most recent visiting team to win in St. Louis — but that was more than two months ago.\n\nThe Blues have put together the longest home winning streak in the NHL this season, a 14-game run that started on Feb. 23 and hasn’t stopped. St. Louis has outscored opponents 69-25 in that span at home, winning by an average of a whopping 3.14 goals per game.\n\n“We’ve played some good hockey at home for a couple months now,” St. Louis’ Brayden Schenn said. “We’re comfortable there.”\n\nThat’s a bit of an understatement. The Blues have simply looked like a different team in their own building; St. Louis has had stretches of three goals in five minutes, three goals in eight minutes and three goals in 15 minutes so far in this series on its own ice.\n\nThey looked nothing like that club in Game 5, a 5-3 Winnipeg win that probably wasn’t as close as that score would make it seem. Blues coach Jim Montgomery didn’t waste any time thinking about that game once the final horn sounded.\n\n“We can analyze every part of it. They were better,” Montgomery said. “So, we’re on to the next one.”\n\nIt took St. Louis a long — long — time to get home on Thursday, after their travel plans were seriously delayed.\n\nThe Blues had plane issues trying to leave Winnipeg and, after a replacement jet was sent to Manitoba, they finally took off about eight hours behind schedule.\n\nThe Jets landed in St. Louis around 3 p.m. Central time on Thursday, actually a tiny bit ahead of schedule, while the Blues didn’t get there until about 9 p.m.\n\nWinnipeg Jets at St. Louis Blues\n\nWhen/Where to Watch: Game 6, Friday. 8 p.m. (TNT/truTV/Max)\n\nSeries: Jets lead 3-2\n\nWinnipeg hasn’t closed out a series with a road win since 2018, and getting it done Friday will be difficult.\n\nForget St. Louis’ 14-game home winning streak, which is impressive enough. The Blues simply don’t give up scoring chances in their building; they have allowed two goals or less in 11 of those 14 wins, and that level of stinginess puts enormous pressure on the other team’s netminder.\n\nThat said, Winnipeg goalie and MVP hopeful Connor Hellebuyck has reveled in big moments like this all season.\n\nThe newly announced Hart Trophy finalist — alongside Edmonton forward Leon Draisaitl and Tampa Bay forward Nikita Kucherov — led the NHL with 47 wins, a 2.00 GAA, and a .925 save percentage this season, had eight shutouts, steered Winnipeg to its first Presidents’ Trophy, won the William M. Jennings Trophy (fewest goals allowed) for the second straight year and seems like a lock for the Vezina Trophy (top goalie) for the second straight year and third time in six seasons.\n\nIf Hellebuyck does win the Hart as MVP, he’d be the fourth goalie in the league’s expansion era to do it alongside Dominik Hasek, José Théodore and Carey Price. He was pulled twice in St. Louis and has a gaudy 3.96 goals-against average and .822 save percentage in this series — including all three wins.\n\n“He’s our best player,” Namestnikov said.\n\n___\n\nAP NHL: https://apnews.com/hub/nhl",
    "clean_body": "the first five games of the winnipegst louis series have all had the same result the home team won the blues need that trend to continue friday — or else game 6 of the jetsblues matchup awaits in st louis with winnipeg — the nhl’s best team in the regular season — holding a 32 series lead the blues rolled to wins on their home ice in games 3 and 4 taking those games by scores of 72 and 51 to extend a run of invincibility there that has lasted for more than two months “it’s a tough building to play in” jets forward vladislav namestnikov said “but i know we can get the win there” if they do they will be doing so without star mark scheifele the team’s secondleading scorer and leader in gamewinning goals this season scheifele was hurt in game 5 and wasn’t flying with winnipeg to st louis on thursday for game 6 the teams had different opinions about when scheifele got hurt but the bottom line is the jets will be missing a big part of their team for a potential closeout game “certainly not having him is going to be huge” jets coach scott arniel said thursday “but at the end of the day last night our three centermen had to step up and play big minutes and did a great job so proud of the group how everybody stepped up it’s kind of what our team has done all year guys go down other guys step in” winnipeg was the most recent visiting team to win in st louis — but that was more than two months ago the blues have put together the longest home winning streak in the nhl this season a 14game run that started on feb 23 and hasn’t stopped st louis has outscored opponents 6925 in that span at home winning by an average of a whopping 314 goals per game “we’ve played some good hockey at home for a couple months now” st louis’ brayden schenn said “we’re comfortable there” that’s a bit of an understatement the blues have simply looked like a different team in their own building st louis has had stretches of three goals in five minutes three goals in eight minutes and three goals in 15 minutes so far in this series on its own ice they looked nothing like that club in game 5 a 53 winnipeg win that probably wasn’t as close as that score would make it seem blues coach jim montgomery didn’t waste any time thinking about that game once the final horn sounded “we can analyze every part of it they were better” montgomery said “so we’re on to the next one” it took st louis a long — long — time to get home on thursday after their travel plans were seriously delayed the blues had plane issues trying to leave winnipeg and after a replacement jet was sent to manitoba they finally took off about eight hours behind schedule the jets landed in st louis around 3 pm central time on thursday actually a tiny bit ahead of schedule while the blues didn’t get there until about 9 pm winnipeg jets at st louis blues whenwhere to watch game 6 friday 8 pm tnttrutvmax series jets lead 32 winnipeg hasn’t closed out a series with a road win since 2018 and getting it done friday will be difficult forget st louis’ 14game home winning streak which is impressive enough the blues simply don’t give up scoring chances in their building they have allowed two goals or less in 11 of those 14 wins and that level of stinginess puts enormous pressure on the other team’s netminder that said winnipeg goalie and mvp hopeful connor hellebuyck has reveled in big moments like this all season the newly announced hart trophy finalist — alongside edmonton forward leon draisaitl and tampa bay forward nikita kucherov — led the nhl with 47 wins a 200 gaa and a 925 save percentage this season had eight shutouts steered winnipeg to its first presidents’ trophy won the william m jennings trophy fewest goals allowed for the second straight year and seems like a lock for the vezina trophy top goalie for the second straight year and third time in six seasons if hellebuyck does win the hart as mvp he’d be the fourth goalie in the league’s expansion era to do it alongside dominik hasek josé théodore and carey price he was pulled twice in st louis and has a gaudy 396 goalsagainst average and 822 save percentage in this series — including all three wins “he’s our best player” namestnikov said ap nhl httpsapnewscomhubnhl",
    "summary": "The first five games of the Winnipeg-St. Louis series have all had the same result.\nScheifele was hurt in Game 5 and wasn’t flying with Winnipeg to St. Louis on Thursday for Game 6.\n“We’ve played some good hockey at home for a couple months now,” St. Louis’ Brayden Schenn said.\n“So, we’re on to the next one.”It took St. Louis a long — long — time to get home on Thursday, after their travel plans were seriously delayed.\nForget St. Louis’ 14-game home winning streak, which is impressive enough.",
    "keywords": [
      "blues",
      "round",
      "fight",
      "st",
      "win",
      "second",
      "way",
      "game",
      "look",
      "jets",
      "nhls",
      "defend",
      "hoping",
      "louis",
      "goals",
      "series",
      "ice",
      "winnipeg",
      "team"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/e8f0d64/2147483647/strip/true/crop/4829x2716+0+243/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2Fc0%2F5a4ee49f1d601d1289134337df3f%2F060b971d0c794821b29911c4318d5c44",
    "t": 11
  },
  "https://apnews.com/article/germany-stuttgart-8571ad0e3d0b6954c094c39dea0500f6": {
    "source": "AP News",
    "url": "https://apnews.com/article/germany-stuttgart-8571ad0e3d0b6954c094c39dea0500f6",
    "date": "2025-05-02",
    "time": "18:02:26",
    "title": "Vehicle slams into pedestrians in German city of Stuttgart, killing 1 person and injuring several",
    "body": "BERLIN (AP) — A vehicle slammed into a group of pedestrians in the southwestern German city of Stuttgart on Friday, killing one person and injuring several others in what police said appeared to be an accident.\n\nThe driver was detained, but Stuttgart police said on X that there was “currently no evidence of an attack or a deliberate act” and that all the information so far indicates it was a “tragic traffic accident.”\n\nThe incident happened at an above-ground subway stop in downtown Stuttgart, police said.\n\n“Five people were slightly injured and three seriously injured in the accident. Of the seriously injured, a 46-year-old woman has since succumbed to her injuries in the hospital,” police said in a Friday evening statement, hours after the accident.\n\nAn investigation was under way, and the area was cordoned off as emergency responders, police and forensic specialists examined the scene. Witnesses were being interviewed, and subway service through the area was suspended.\n\nPhotos from the scene showed plastic gloves, blankets and bags scattered on the ground near the SUV.\n\n___\n\nCorrects that the accident occurred on Friday, not Thursday.",
    "clean_body": "berlin ap — a vehicle slammed into a group of pedestrians in the southwestern german city of stuttgart on friday killing one person and injuring several others in what police said appeared to be an accident the driver was detained but stuttgart police said on x that there was “currently no evidence of an attack or a deliberate act” and that all the information so far indicates it was a “tragic traffic accident” the incident happened at an aboveground subway stop in downtown stuttgart police said “five people were slightly injured and three seriously injured in the accident of the seriously injured a 46yearold woman has since succumbed to her injuries in the hospital” police said in a friday evening statement hours after the accident an investigation was under way and the area was cordoned off as emergency responders police and forensic specialists examined the scene witnesses were being interviewed and subway service through the area was suspended photos from the scene showed plastic gloves blankets and bags scattered on the ground near the suv corrects that the accident occurred on friday not thursday",
    "summary": "BERLIN (AP) — A vehicle slammed into a group of pedestrians in the southwestern German city of Stuttgart on Friday, killing one person and injuring several others in what police said appeared to be an accident.\n“Five people were slightly injured and three seriously injured in the accident.\nOf the seriously injured, a 46-year-old woman has since succumbed to her injuries in the hospital,” police said in a Friday evening statement, hours after the accident.\nAn investigation was under way, and the area was cordoned off as emergency responders, police and forensic specialists examined the scene.\nPhotos from the scene showed plastic gloves, blankets and bags scattered on the ground near the SUV.",
    "keywords": [
      "subway",
      "seriously",
      "area",
      "city",
      "injured",
      "x",
      "accident",
      "scene",
      "slams",
      "injuring",
      "woman",
      "german",
      "accidentthe",
      "person",
      "killing",
      "stuttgart",
      "vehicle",
      "pedestrians"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/7215f65/2147483647/strip/true/crop/3081x1733+0+24/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F41%2F7f%2Fa42385974ede3b73b4edb80665da%2F7c4d89db24ec42f8990fe333536ca399",
    "t": 10
  },
  "https://apnews.com/article/brasil-inundaciones-1a478f741a5a6b3c7a3de032ef6f9ed1": {
    "source": "AP News",
    "url": "https://apnews.com/article/brasil-inundaciones-1a478f741a5a6b3c7a3de032ef6f9ed1",
    "date": "2025-05-01",
    "time": "19:48:05",
    "title": "Comisión de derechos humanos insta a monitorear recuperación tras inundaciones en Brasil",
    "body": "SAO PAULO (AP) — La Comisión Interamericana de Derechos Humanos está solicitando un sistema de monitoreo permanente para rastrear el cumplimiento de Brasil con sus recomendaciones tras las devastadoras inundaciones que azotaron el sur del país hace un año.\n\nJavier Palummo, el relator especial de la comisión, dijo a The Associated Press el jueves que la iniciativa busca mantener un canal permanente con el gobierno de Brasil y “fortalecer la rendición de cuentas, dar visibilidad internacional a las buenas prácticas y monitorear los riesgos de retrocesos, especialmente en las áreas más afectadas y para los grupos vulnerables”.\n\nEntre abril y mayo de 2024, inundaciones sin precedentes afectaron a casi todos los municipios en el estado sureño de Rio Grande do Sul. Más de 2,3 millones de personas se vieron afectadas. Cientos de miles fueron desplazadas y 182 murieron, según datos oficiales. Los analistas compararon la magnitud de la devastación con el huracán Katrina, que golpeó Nueva Orleans en 2005.\n\nUn nuevo informe de la Comisión Interamericana de Derechos Humanos publicado el miércoles destaca marcadas desigualdades en el proceso de recuperación. Las comunidades indígenas y quilombolas —que son hogar de descendientes de esclavos fugitivos—, los hogares encabezados por mujeres y las personas sin hogar han enfrentado desafíos significativos para acceder a la ayuda para la reconstrucción y los servicios públicos.\n\n“Estos grupos a menudo informaron ser excluidos de la planificación de la recuperación. La falta de regularización de tierras y el limitado compromiso institucional refuerzan las desigualdades históricas”, manifestó Palummo.\n\nPalummo visitó las áreas afectadas por las inundaciones en diciembre. Citó la solidaridad de una comunidad quilombola donde las mujeres lideraron los esfuerzos de ayuda como especialmente conmovedora. También señaló a los Mbyá-Guaraní de Eldorado do Sul, quienes perdieron sus hogares y escuela primero por las inundaciones y luego por un proyecto de construcción. Obligados a reasentarse cerca de una carretera, ahora enfrentan inseguridad, riesgos para la salud y pérdida cultural.\n\n“Estos desastres no son solo naturales, están agravados por el abandono crónico”, expresó. “Reflejan profundas desigualdades estructurales y una creciente vulnerabilidad climática alimentada por el crecimiento urbano no planificado, la degradación ambiental y el racismo ambiental”.\n\nEl informe, dijo, es el primero de su tipo por la comisión afiliada a la Organización de los Estados Americanos. Palummo presentará los hallazgos la próxima semana a las comunidades locales en Porto Alegre y a funcionarios federales y estatales. También hablará en una audiencia pública el 8 de mayo en Brasilia.\n\n___________________________________\n\nEsta historia fue traducida del inglés por un editor de AP con la ayuda de una herramienta de inteligencia artificial generativa.",
    "clean_body": "sao paulo ap — la comisión interamericana de derechos humanos está solicitando un sistema de monitoreo permanente para rastrear el cumplimiento de brasil con sus recomendaciones tras las devastadoras inundaciones que azotaron el sur del país hace un año javier palummo el relator especial de la comisión dijo a the associated press el jueves que la iniciativa busca mantener un canal permanente con el gobierno de brasil y “fortalecer la rendición de cuentas dar visibilidad internacional a las buenas prácticas y monitorear los riesgos de retrocesos especialmente en las áreas más afectadas y para los grupos vulnerables” entre abril y mayo de 2024 inundaciones sin precedentes afectaron a casi todos los municipios en el estado sureño de rio grande do sul más de 23 millones de personas se vieron afectadas cientos de miles fueron desplazadas y 182 murieron según datos oficiales los analistas compararon la magnitud de la devastación con el huracán katrina que golpeó nueva orleans en 2005 un nuevo informe de la comisión interamericana de derechos humanos publicado el miércoles destaca marcadas desigualdades en el proceso de recuperación las comunidades indígenas y quilombolas —que son hogar de descendientes de esclavos fugitivos— los hogares encabezados por mujeres y las personas sin hogar han enfrentado desafíos significativos para acceder a la ayuda para la reconstrucción y los servicios públicos “estos grupos a menudo informaron ser excluidos de la planificación de la recuperación la falta de regularización de tierras y el limitado compromiso institucional refuerzan las desigualdades históricas” manifestó palummo palummo visitó las áreas afectadas por las inundaciones en diciembre citó la solidaridad de una comunidad quilombola donde las mujeres lideraron los esfuerzos de ayuda como especialmente conmovedora también señaló a los mbyáguaraní de eldorado do sul quienes perdieron sus hogares y escuela primero por las inundaciones y luego por un proyecto de construcción obligados a reasentarse cerca de una carretera ahora enfrentan inseguridad riesgos para la salud y pérdida cultural “estos desastres no son solo naturales están agravados por el abandono crónico” expresó “reflejan profundas desigualdades estructurales y una creciente vulnerabilidad climática alimentada por el crecimiento urbano no planificado la degradación ambiental y el racismo ambiental” el informe dijo es el primero de su tipo por la comisión afiliada a la organización de los estados americanos palummo presentará los hallazgos la próxima semana a las comunidades locales en porto alegre y a funcionarios federales y estatales también hablará en una audiencia pública el 8 de mayo en brasilia esta historia fue traducida del inglés por un editor de ap con la ayuda de una herramienta de inteligencia artificial generativa",
    "summary": "Un nuevo informe de la Comisión Interamericana de Derechos Humanos publicado el miércoles destaca marcadas desigualdades en el proceso de recuperación.\nPalummo visitó las áreas afectadas por las inundaciones en diciembre.\n“Reflejan profundas desigualdades estructurales y una creciente vulnerabilidad climática alimentada por el crecimiento urbano no planificado, la degradación ambiental y el racismo ambiental”.\nEl informe, dijo, es el primero de su tipo por la comisión afiliada a la Organización de los Estados Americanos.\nTambién hablará en una audiencia pública el 8 de mayo en Brasilia.",
    "keywords": [
      "brasil",
      "por",
      "una",
      "derechos",
      "comisión",
      "insta",
      "los",
      "las",
      "el",
      "humanos",
      "tras",
      "para",
      "inundaciones",
      "recuperación",
      "y",
      "en",
      "la",
      "monitorear",
      "que"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/d90041f/2147483647/strip/true/crop/3568x2007+0+186/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffa%2F7f%2F54fc9f66bfae7026caa41d2e7ba1%2F79865d62042443eeba4d8c64316e1f14",
    "t": 11
  }
}