{
  "https://apnews.com/article/joshshapiroarsonantisemitism-789c12954a3c91ae045f7778f934bb4f": {
    "source": "AP News",
    "url": "https://apnews.com/article/joshshapiroarsonantisemitism-789c12954a3c91ae045f7778f934bb4f",
    "date": "2025-04-17",
    "time": "16:22:55",
    "title": "Some Pennsylvania Jews reminded of Tree of Life shooting after arson attack on Josh Shapiro’s home",
    "body": "HARRISBURG, Pa. (AP) — A year ago, Carole Zawatsky was invited by Pennsylvania Gov. Josh Shapiro to a Passover Seder, held in the same room at the governor’s official residence that was devastated by an arsonist just hours after Shapiro hosted this year’s Jewish holiday feast.\n\nNow, as she looks at photos of the destruction, Zawatsky can envision where she had been seated and how deadly the attack could have been.\n\nLike many others, Zawatsky is cautiously awaiting word from investigators about the motivations of the attacker, which are clouded by hints of erratic behavior as well as statements from his past.\n\nStill, the attack hit the Jewish community hard in a state where such pain is achingly familiar. It targeted Pennsylvania’s religiously observant Jewish governor in the very place where just hours before he had hosted one of the central rituals of the Jewish calendar.\n\nZawatsky heads a Pittsburgh organization formed to counter antisemitism and memorialize the victims of another Pennsylvania assault – the murders of 11 worshippers from three congregations at the Tree of Life synagogue more than six years ago, the deadliest antisemitic attack in U.S. history.\n\n“Seeing those images is deeply traumatic,” said Zawatsky, CEO of The Tree of Life, the group established in the wake of the Oct. 27, 2018 killings. “It’s not too much to ask that we all live in a country where we celebrate our faith without fear.”\n\nA murkier picture emerges on motive\n\nThe synagogue shooting trial revealed that the gunman, who was convicted and sentenced to death, had long been steeped in antisemitism and methodically carried out the attack.\n\nIn the Harrisburg case, things are less clear. Investigators have released only fragments of what the suspect, Cody Balmer, of Harrisburg, told them. His relatives say he has struggled with mental illness, and his lawyers suggested Wednesday that will be central to their defense.\n\n“We have no definitive information about this person’s motive,” Zawatsky said. “We do know that there was certainly hate involved.”\n\nPennsylvania State Police said the 38-year-old Balmer confessed to the attack, harbored hatred for the governor and said he planned to beat Shapiro with a hammer.\n\n“BALMER identified himself by name and related that Governor Josh SHAPIRO needs to know that he ‘...will not take part in his plans for what he wants to do to the Palestinian people,’” police wrote as part of applications for search warrants. Exactly who and what that meant were unclear in the documents.\n\nSenate Democratic Leader Chuck Schumer of New York on Thursday called on the Justice Department to determine whether the attack qualifies as a federal hate crime.\n\nAudrey Glickman, a survivor of the 2018 attack and a member of Tree of Life Congregation, said she admired Shapiro’s composure, just hours after the attack, and his emphatic denunciation of hatred regardless of motivation.\n\n“It takes a while to realize you’ve been attacked and what to make of it,” Glickman said. She admired “how he stood up right away and spoke strongly about it.”\n\nShapiro responded to the scene of the 2018 Pittsburgh attack as Pennsylvania’s then-attorney general. As governor, he took part in the 2024 groundbreaking for a new building to replace the synagogue, including a memorial, programming and other exhibits aimed to counter antisemitism.\n\nReminders of an overheated political climate\n\nAbout 200 people participated in a somber march Wednesday night in Harrisburg. They walked from the parking lot of a synagogue to the governor’s residence, where they held a multifaith prayer vigil across the street.\n\nSeveral marchers connected the attack to the overheated political climate.\n\n“To deny it is like putting your head in the sand,” said retired Presbyterian minister Don Potter, 75, of Dillsburg, who said the images of the building’s interior with fire damage “made me sick.”\n\nEnid Wassner, a retired child care worker from Hershey, said the fact that the firebombing occurring during Passover and targeted Shapiro and his family was “extremely worrying.” She noted that Jewish institutions and buildings in Harrisburg have had to increase security.\n\n“Gradually things have been getting more worrisome, for me personally and the entire Jewish community.”\n\nQuestions emerge about attacker’s mental state\n\nPolice said in court affidavits that in an interview with detectives Balmer “admitted to harboring hatred towards” Shapiro and referred to the Palestinian people in a 911 call attributed to him that was placed shortly after the break-in.\n\nBalmer’s mother and brother have said he suffered from bipolar disorder and would not consistently take medication. His brother, Dan Balmer, said Cody Balmer twice in recent years spent time in a psychiatric hospital in Harrisburg. During a court hearing on Monday, Balmer denied any history of mental illness.\n\nDan Balmer told the AP on Tuesday that Cody Balmer “had these theories that were going on in his head” and became angry when family members would tell him his views didn’t reflect reality.\n\n“The allegations, if true, demonstrate the devastating consequences of severe mental illness,” Mary Klatt, the chief public defender in Dauphin County, whose office is representing Balmer, said Wednesday. She said his preliminary hearing would be delayed to determine whether Balmer is mentally competent to stand trial.\n\nIdentity moves to forefront for Shapiro\n\nShapiro declined to talk about the attacker’s motive on Wednesday, saying prosecutors will ultimately determine what drove him.\n\n“It’s not for me to answer that,” he said.\n\nThe governor has publicly criticized Israeli Prime Minister Benjamin Netanyahu’s government and the nature of Israel’s military action in Gaza, but also has backed Israel’s right to defend itself from Hamas.\n\nHank Butler, executive director of the Pennsylvania Jewish Coalition, said Shapiro’s focus has been Pennsylvania and not the Palestinian people.\n\n“To say that our governor wishes the worst on the Palestinian people is not welcomed here,” Butler said. “It is not justified, absolutely not justified -- no attack is justified.”\n\nShapiro has won statewide races three times in a crucial battleground state. He was a finalist to be Vice President Kamala Harris’s running mate in last year’s presidential campaign and is considered a potential 2028 Democratic candidate for president.\n\nThe attack once again puts his identity front and center. When Harris picked Minnesota Gov. Tim Walz over Shapiro, Republicans tried to cast the pick as a snub to Jewish voters.\n\nRabbi Rick Jacobs, president of the Union for Reform Judaism, an umbrella group for more than 800 Reform congregations in North America, connected the attack to Shapiro’s identity.\n\n“He’s also someone who is a strong supporter of Israel,” Jacobs said of Shapiro. “Are those things that put your life at risk in the 21st century?”\n\nZawatsky, the Tree of Life CEO, noted that in the Passover ritual, Jews are instructed not just to recite the story of their ancient forebears’ liberation from slavery but to envision themselves as having experienced it – something that feels especially poignant now. Whether law enforcement officials ultimately settle on a definitive conclusion about what motivated last weekend’s attack, she and others already know what living in fear feels like.\n\n“It’s very sad to think we pass along the inherited trauma of the fear of antisemitism, but never did I think we would be a generation that would have the lived experience of this kind of violent antisemitism,” she said.\n\n___\n\nAssociated Press religion coverage receives support through the AP’s collaboration with The Conversation US, with funding from Lilly Endowment Inc. The AP is solely responsible for this content.\n\n___\n\nSmith reported from Pittsburgh and Cooper from Phoenix.",
    "clean_body": "harrisburg pa ap — a year ago carole zawatsky was invited by pennsylvania gov josh shapiro to a passover seder held in the same room at the governor’s official residence that was devastated by an arsonist just hours after shapiro hosted this year’s jewish holiday feast now as she looks at photos of the destruction zawatsky can envision where she had been seated and how deadly the attack could have been like many others zawatsky is cautiously awaiting word from investigators about the motivations of the attacker which are clouded by hints of erratic behavior as well as statements from his past still the attack hit the jewish community hard in a state where such pain is achingly familiar it targeted pennsylvania’s religiously observant jewish governor in the very place where just hours before he had hosted one of the central rituals of the jewish calendar zawatsky heads a pittsburgh organization formed to counter antisemitism and memorialize the victims of another pennsylvania assault – the murders of 11 worshippers from three congregations at the tree of life synagogue more than six years ago the deadliest antisemitic attack in us history “seeing those images is deeply traumatic” said zawatsky ceo of the tree of life the group established in the wake of the oct 27 2018 killings “it’s not too much to ask that we all live in a country where we celebrate our faith without fear” a murkier picture emerges on motive the synagogue shooting trial revealed that the gunman who was convicted and sentenced to death had long been steeped in antisemitism and methodically carried out the attack in the harrisburg case things are less clear investigators have released only fragments of what the suspect cody balmer of harrisburg told them his relatives say he has struggled with mental illness and his lawyers suggested wednesday that will be central to their defense “we have no definitive information about this person’s motive” zawatsky said “we do know that there was certainly hate involved” pennsylvania state police said the 38yearold balmer confessed to the attack harbored hatred for the governor and said he planned to beat shapiro with a hammer “balmer identified himself by name and related that governor josh shapiro needs to know that he ‘will not take part in his plans for what he wants to do to the palestinian people’” police wrote as part of applications for search warrants exactly who and what that meant were unclear in the documents senate democratic leader chuck schumer of new york on thursday called on the justice department to determine whether the attack qualifies as a federal hate crime audrey glickman a survivor of the 2018 attack and a member of tree of life congregation said she admired shapiro’s composure just hours after the attack and his emphatic denunciation of hatred regardless of motivation “it takes a while to realize you’ve been attacked and what to make of it” glickman said she admired “how he stood up right away and spoke strongly about it” shapiro responded to the scene of the 2018 pittsburgh attack as pennsylvania’s thenattorney general as governor he took part in the 2024 groundbreaking for a new building to replace the synagogue including a memorial programming and other exhibits aimed to counter antisemitism reminders of an overheated political climate about 200 people participated in a somber march wednesday night in harrisburg they walked from the parking lot of a synagogue to the governor’s residence where they held a multifaith prayer vigil across the street several marchers connected the attack to the overheated political climate “to deny it is like putting your head in the sand” said retired presbyterian minister don potter 75 of dillsburg who said the images of the building’s interior with fire damage “made me sick” enid wassner a retired child care worker from hershey said the fact that the firebombing occurring during passover and targeted shapiro and his family was “extremely worrying” she noted that jewish institutions and buildings in harrisburg have had to increase security “gradually things have been getting more worrisome for me personally and the entire jewish community” questions emerge about attacker’s mental state police said in court affidavits that in an interview with detectives balmer “admitted to harboring hatred towards” shapiro and referred to the palestinian people in a 911 call attributed to him that was placed shortly after the breakin balmer’s mother and brother have said he suffered from bipolar disorder and would not consistently take medication his brother dan balmer said cody balmer twice in recent years spent time in a psychiatric hospital in harrisburg during a court hearing on monday balmer denied any history of mental illness dan balmer told the ap on tuesday that cody balmer “had these theories that were going on in his head” and became angry when family members would tell him his views didn’t reflect reality “the allegations if true demonstrate the devastating consequences of severe mental illness” mary klatt the chief public defender in dauphin county whose office is representing balmer said wednesday she said his preliminary hearing would be delayed to determine whether balmer is mentally competent to stand trial identity moves to forefront for shapiro shapiro declined to talk about the attacker’s motive on wednesday saying prosecutors will ultimately determine what drove him “it’s not for me to answer that” he said the governor has publicly criticized israeli prime minister benjamin netanyahu’s government and the nature of israel’s military action in gaza but also has backed israel’s right to defend itself from hamas hank butler executive director of the pennsylvania jewish coalition said shapiro’s focus has been pennsylvania and not the palestinian people “to say that our governor wishes the worst on the palestinian people is not welcomed here” butler said “it is not justified absolutely not justified no attack is justified” shapiro has won statewide races three times in a crucial battleground state he was a finalist to be vice president kamala harris’s running mate in last year’s presidential campaign and is considered a potential 2028 democratic candidate for president the attack once again puts his identity front and center when harris picked minnesota gov tim walz over shapiro republicans tried to cast the pick as a snub to jewish voters rabbi rick jacobs president of the union for reform judaism an umbrella group for more than 800 reform congregations in north america connected the attack to shapiro’s identity “he’s also someone who is a strong supporter of israel” jacobs said of shapiro “are those things that put your life at risk in the 21st century” zawatsky the tree of life ceo noted that in the passover ritual jews are instructed not just to recite the story of their ancient forebears’ liberation from slavery but to envision themselves as having experienced it – something that feels especially poignant now whether law enforcement officials ultimately settle on a definitive conclusion about what motivated last weekend’s attack she and others already know what living in fear feels like “it’s very sad to think we pass along the inherited trauma of the fear of antisemitism but never did i think we would be a generation that would have the lived experience of this kind of violent antisemitism” she said associated press religion coverage receives support through the ap’s collaboration with the conversation us with funding from lilly endowment inc the ap is solely responsible for this content smith reported from pittsburgh and cooper from phoenix",
    "summary": "Still, the attack hit the Jewish community hard in a state where such pain is achingly familiar.\nIt targeted Pennsylvania’s religiously observant Jewish governor in the very place where just hours before he had hosted one of the central rituals of the Jewish calendar.\n“Seeing those images is deeply traumatic,” said Zawatsky, CEO of The Tree of Life, the group established in the wake of the Oct. 27, 2018 killings.\nAudrey Glickman, a survivor of the 2018 attack and a member of Tree of Life Congregation, said she admired Shapiro’s composure, just hours after the attack, and his emphatic denunciation of hatred regardless of motivation.\nHank Butler, executive director of the Pennsylvania Jewish Coalition, said Shapiro’s focus has been Pennsylvania and not the Palestinian people.",
    "keywords": [
      "jews",
      "shooting",
      "life",
      "shapiros",
      "josh",
      "zawatsky",
      "pennsylvania",
      "attack",
      "jewish",
      "arson",
      "balmer",
      "synagogue",
      "governor",
      "harrisburg",
      "tree",
      "reminded",
      "shapiro"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/c8c5321/2147483647/strip/true/crop/3803x2139+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F8c%2F71fbc8288344d352eed5edd7ffd3%2F4dfc2302d50b4eeba74ad5edf5a2b967",
    "t": 25
  },
  "https://apnews.com/article/nl-west-292ba4bdccb39d55166bcde77620c250": {
    "source": "AP News",
    "url": "https://apnews.com/article/nl-west-292ba4bdccb39d55166bcde77620c250",
    "date": "2025-04-25",
    "time": "20:12:53",
    "title": "Excellent start for baseball’s NL West foreshadows a potentially historic 4-team summer race",
    "body": "PHOENIX (AP) — The Los Angeles Dodgers seem like they have nearly unlimited amounts of money, three former MVPs in their starting lineup with Shohei Ohtani, Mookie Betts and Freddie Freeman, and a pitching staff that never runs out of overpowering arms.\n\nSo far, that’s good for third place in their five-team division.\n\nWelcome to the National League West, which is far from a one-team show four weeks into the season. Going into Friday night’s games, the San Diego Padres (17-8), San Francisco Giants (17-9), Dodgers (16-9) and Arizona Diamondbacks (14-11) are all off to a good start, foreshadowing a potentially fascinating summer race.\n\n“For us, who are so close to it, not surprised,” Dodgers manager Dave Roberts said. “They’re all very good teams. I think it’s the best division in baseball. We’re all sort of built differently, too, which is interesting and fun if you look at the construction, the strengths, weaknesses of the four clubs.\n\n“It’s going to be an interesting season how this all plays out.”\n\nTo be clear, the big-spending Dodgers have not underperformed this season. Los Angeles has a .640 winning percentage through 25 games, which translates to a 104-win pace. That’s right where everyone pretty much expected them to be.\n\nInstead, it’s the great play from the Padres and Giants — and to a lesser extent the D-backs — that has set up a summer of fun. Since baseball split the NL and AL into three divisions in 1994, the 2002 AL West has the record for the highest winning percentage with a .566 mark.\n\nSo far, the 2025 version of the NL West is off to a .544 start — and that’s including the Colorado Rockies, who are a dreadful 4-20 for the worst record in baseball. Take out the Rockies, and the other four teams have combined for a .634 winning percentage.\n\n“It’s gonna be a battle the entire season,” Giants third baseman Matt Chapman said. “We knew the Dodgers are the Dodgers, the Padres are really, really good and so are the Diamondbacks.”\n\nThe Dodgers continue to be the undeniable favorites to win the division. Los Angeles is off to a quality start despite Betts’ illness that caused him to drop around 15 pounds, Freeman’s shower mishap and Blake Snell’s arm trouble.\n\nA good first month from Tommy Edman, Will Smith and Teoscar Hernández at the plate have showcased the lineup’s depth. Yoshinobu Yamamoto looks like a potential NL Cy Young award winner with an 0.93 ERA through five starts. Ohtani has slugged six homers with his return to the mound looming.\n\nThe Padres are playing well largely thanks to Fernando Tatis Jr., who is off to a torrid start with a .333 batting average, eight homers and 17 RBIs. Veteran starting pitchers Nick Pivetta and Michael King have led the rotation while closer Robert Suarez hasn’t given up a run this season and leads the NL with 10 saves.\n\n“Obviously, we’re aware to some degree of what is taking place in the division and in the league, but our energy — my energy — is not about what anyone else is doing. It is on what we do,” Padres manager Mike Shildt said. “We’re spending our time and efforts on taking care of ourselves, because if we don’t do that, nothing else is going to matter.”\n\nThe Giants are arguably the division’s biggest surprise, led by a productive lineup that includes Jung Hoo Lee, Mike Yastrzemski, Wilmer Flores and Chapman. Right-hander Logan Webb has been dominant, with a 1.98 ERA and 44 strikeouts over six starts.\n\nThe D-backs have been a little more inconsistent than their division rivals, but are still lurking. Outfielder Corbin Carroll is off to an MVP-caliber start with a .321 batting average, nine homers, 23 RBIs and five stolen bases.\n\nDiamondbacks manager Torey Lovullo echoed others when he said he’s aware of the division’s excellence, but tries not to dwell on it. The 162-game regular season is hard enough to navigate without worrying about other teams.\n\nBeing in the NL West might prove particularly stressful — and fun — this summer.\n\n“At the end of the day, it makes everyone crazy,” Lovullo said, grinning. “It makes you guys crazy, you guys make me crazy, I make you crazy. Everyone’s crazy.”\n\n___\n\nAP Baseball Writers Janie McCauley and Jay Cohen, and freelancer Dave Hogg, contributed to this story.\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "phoenix ap — the los angeles dodgers seem like they have nearly unlimited amounts of money three former mvps in their starting lineup with shohei ohtani mookie betts and freddie freeman and a pitching staff that never runs out of overpowering arms so far that’s good for third place in their fiveteam division welcome to the national league west which is far from a oneteam show four weeks into the season going into friday night’s games the san diego padres 178 san francisco giants 179 dodgers 169 and arizona diamondbacks 1411 are all off to a good start foreshadowing a potentially fascinating summer race “for us who are so close to it not surprised” dodgers manager dave roberts said “they’re all very good teams i think it’s the best division in baseball we’re all sort of built differently too which is interesting and fun if you look at the construction the strengths weaknesses of the four clubs “it’s going to be an interesting season how this all plays out” to be clear the bigspending dodgers have not underperformed this season los angeles has a 640 winning percentage through 25 games which translates to a 104win pace that’s right where everyone pretty much expected them to be instead it’s the great play from the padres and giants — and to a lesser extent the dbacks — that has set up a summer of fun since baseball split the nl and al into three divisions in 1994 the 2002 al west has the record for the highest winning percentage with a 566 mark so far the 2025 version of the nl west is off to a 544 start — and that’s including the colorado rockies who are a dreadful 420 for the worst record in baseball take out the rockies and the other four teams have combined for a 634 winning percentage “it’s gonna be a battle the entire season” giants third baseman matt chapman said “we knew the dodgers are the dodgers the padres are really really good and so are the diamondbacks” the dodgers continue to be the undeniable favorites to win the division los angeles is off to a quality start despite betts’ illness that caused him to drop around 15 pounds freeman’s shower mishap and blake snell’s arm trouble a good first month from tommy edman will smith and teoscar hernández at the plate have showcased the lineup’s depth yoshinobu yamamoto looks like a potential nl cy young award winner with an 093 era through five starts ohtani has slugged six homers with his return to the mound looming the padres are playing well largely thanks to fernando tatis jr who is off to a torrid start with a 333 batting average eight homers and 17 rbis veteran starting pitchers nick pivetta and michael king have led the rotation while closer robert suarez hasn’t given up a run this season and leads the nl with 10 saves “obviously we’re aware to some degree of what is taking place in the division and in the league but our energy — my energy — is not about what anyone else is doing it is on what we do” padres manager mike shildt said “we’re spending our time and efforts on taking care of ourselves because if we don’t do that nothing else is going to matter” the giants are arguably the division’s biggest surprise led by a productive lineup that includes jung hoo lee mike yastrzemski wilmer flores and chapman righthander logan webb has been dominant with a 198 era and 44 strikeouts over six starts the dbacks have been a little more inconsistent than their division rivals but are still lurking outfielder corbin carroll is off to an mvpcaliber start with a 321 batting average nine homers 23 rbis and five stolen bases diamondbacks manager torey lovullo echoed others when he said he’s aware of the division’s excellence but tries not to dwell on it the 162game regular season is hard enough to navigate without worrying about other teams being in the nl west might prove particularly stressful — and fun — this summer “at the end of the day it makes everyone crazy” lovullo said grinning “it makes you guys crazy you guys make me crazy i make you crazy everyone’s crazy” ap baseball writers janie mccauley and jay cohen and freelancer dave hogg contributed to this story ap mlb httpsapnewscomhubmlb",
    "summary": "Welcome to the National League West, which is far from a one-team show four weeks into the season.\nGoing into Friday night’s games, the San Diego Padres (17-8), San Francisco Giants (17-9), Dodgers (16-9) and Arizona Diamondbacks (14-11) are all off to a good start, foreshadowing a potentially fascinating summer race.\nSo far, the 2025 version of the NL West is off to a .544 start — and that’s including the Colorado Rockies, who are a dreadful 4-20 for the worst record in baseball.\n“It’s gonna be a battle the entire season,” Giants third baseman Matt Chapman said.\nBeing in the NL West might prove particularly stressful — and fun — this summer.",
    "keywords": [
      "potentially",
      "dodgers",
      "baseballs",
      "padres",
      "good",
      "crazy",
      "nl",
      "division",
      "race",
      "west",
      "start",
      "excellent",
      "foreshadows",
      "summer",
      "season",
      "giants",
      "historic"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/1dd96ba/2147483647/strip/true/crop/5413x3045+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F50%2F65%2F4556bb8ae6836dc0fbfb1fc27fa3%2F1b293f0827624a5aa3b17bc46106326f",
    "t": 17
  },
  "https://apnews.com/article/dinamarca-groenlandia-1f50650670b4d785cf8453ab4100e872": {
    "source": "AP News",
    "url": "https://apnews.com/article/dinamarca-groenlandia-1f50650670b4d785cf8453ab4100e872",
    "date": "2025-04-27",
    "time": "16:23:09",
    "title": "Groenlandia: Palabras de Trump “no han sido respetuosas”",
    "body": "LYNGBY, Dinamarca (AP) — El primer ministro de Groenlandia afirmó el domingo que las declaraciones de Estados Unidos sobre la isla ártica rica en minerales han sido irrespetuosas y que Groenlandia “nunca, jamás será una propiedad que pueda ser comprada por cualquiera”.\n\nLos comentarios del primer ministro Jens-Frederik Nielsen se dan luego que el presidente estadounidense Donald Trump expresó interés en tomar control del estratégico territorio.\n\n“Las palabras de Estados Unidos no han sido respetuosas”, manifestó Nielsen mientras se encontraba junto a la primera ministra danesa, Mette Frederiksen, quien está en el segundo día de una visita oficial de tres días. Groenlandia es un territorio semiautónomo de Dinamarca.\n\nNielsen habló en una conferencia de prensa en la residencia oficial de la primera ministra en Marienborg, en Lyngby, a 12 kilómetros al norte de Copenhague.\n\n“Las palabras utilizadas no han sido respetuosas. Por eso, en esta situación, necesitamos estar unidos”, añadió.\n\nLos partidos políticos en Groenlandia, que han estado inclinándose hacia una eventual independencia de Dinamarca durante años, acordaron recientemente formar un nuevo gobierno de coalición amplio ante los designios de Trump sobre el territorio.\n\nEl gobierno de Groenlandia indicó que la visita de tres días de Nielsen, que comenzó el sábado, busca fortalecer la cooperación futura entre los dos países.\n\n“Dinamarca tiene la voluntad de invertir en la sociedad groenlandesa, y no solo lo hacemos por razones históricas. También lo hacemos porque somos parte de la comunidad (danesa) entre nosotros”, expresó Frederiksen.\n\n“Por supuesto, también tenemos la voluntad de seguir invirtiendo en la sociedad groenlandesa”, agregó.\n\nNielsen se reunirá con el rey Federico X el lunes, antes de regresar a Groenlandia con Frederik para una visita real a la isla.\n\nSe les preguntó a Frederiksen y Nielsen si se estaba planeando una reunión entre ellos y Trump.\n\n“Siempre queremos reunirnos con el presidente estadounidense”, señaló Frederiksen. “Por supuesto que queremos. Pero creo que hemos sido muy, muy claros en cuál es el enfoque de la comunidad (danesa) hacia todas las partes del Reino de Dinamarca”.\n\n___________________________________\n\nEsta historia fue traducida del inglés por un editor de AP con la ayuda de una herramienta de inteligencia artificial generativa.",
    "clean_body": "lyngby dinamarca ap — el primer ministro de groenlandia afirmó el domingo que las declaraciones de estados unidos sobre la isla ártica rica en minerales han sido irrespetuosas y que groenlandia “nunca jamás será una propiedad que pueda ser comprada por cualquiera” los comentarios del primer ministro jensfrederik nielsen se dan luego que el presidente estadounidense donald trump expresó interés en tomar control del estratégico territorio “las palabras de estados unidos no han sido respetuosas” manifestó nielsen mientras se encontraba junto a la primera ministra danesa mette frederiksen quien está en el segundo día de una visita oficial de tres días groenlandia es un territorio semiautónomo de dinamarca nielsen habló en una conferencia de prensa en la residencia oficial de la primera ministra en marienborg en lyngby a 12 kilómetros al norte de copenhague “las palabras utilizadas no han sido respetuosas por eso en esta situación necesitamos estar unidos” añadió los partidos políticos en groenlandia que han estado inclinándose hacia una eventual independencia de dinamarca durante años acordaron recientemente formar un nuevo gobierno de coalición amplio ante los designios de trump sobre el territorio el gobierno de groenlandia indicó que la visita de tres días de nielsen que comenzó el sábado busca fortalecer la cooperación futura entre los dos países “dinamarca tiene la voluntad de invertir en la sociedad groenlandesa y no solo lo hacemos por razones históricas también lo hacemos porque somos parte de la comunidad danesa entre nosotros” expresó frederiksen “por supuesto también tenemos la voluntad de seguir invirtiendo en la sociedad groenlandesa” agregó nielsen se reunirá con el rey federico x el lunes antes de regresar a groenlandia con frederik para una visita real a la isla se les preguntó a frederiksen y nielsen si se estaba planeando una reunión entre ellos y trump “siempre queremos reunirnos con el presidente estadounidense” señaló frederiksen “por supuesto que queremos pero creo que hemos sido muy muy claros en cuál es el enfoque de la comunidad danesa hacia todas las partes del reino de dinamarca” esta historia fue traducida del inglés por un editor de ap con la ayuda de una herramienta de inteligencia artificial generativa",
    "summary": "LYNGBY, Dinamarca (AP) — El primer ministro de Groenlandia afirmó el domingo que las declaraciones de Estados Unidos sobre la isla ártica rica en minerales han sido irrespetuosas y que Groenlandia “nunca, jamás será una propiedad que pueda ser comprada por cualquiera”.\nLos comentarios del primer ministro Jens-Frederik Nielsen se dan luego que el presidente estadounidense Donald Trump expresó interés en tomar control del estratégico territorio.\n“Las palabras de Estados Unidos no han sido respetuosas”, manifestó Nielsen mientras se encontraba junto a la primera ministra danesa, Mette Frederiksen, quien está en el segundo día de una visita oficial de tres días.\nNielsen habló en una conferencia de prensa en la residencia oficial de la primera ministra en Marienborg, en Lyngby, a 12 kilómetros al norte de Copenhague.\nEl gobierno de Groenlandia indicó que la visita de tres días de Nielsen, que comenzó el sábado, busca fortalecer la cooperación futura entre los dos países.",
    "keywords": [
      "sido",
      "palabras",
      "y",
      "en",
      "trump",
      "por",
      "groenlandia",
      "una",
      "que",
      "se",
      "han",
      "el",
      "la",
      "respetuosas"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/ddb3bd0/2147483647/strip/true/crop/7319x4117+0+381/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F63%2F5d%2F877514184d0ce270dad1ee4e53b9%2F22f3645eb6334c669f85aa43466b8d4b",
    "t": 15
  },
  "https://apnews.com/article/lewandowski-barcelona-c96d4c910ba243144e077d441878ac87": {
    "source": "AP News",
    "url": "https://apnews.com/article/lewandowski-barcelona-c96d4c910ba243144e077d441878ac87",
    "date": "2025-04-19",
    "time": "16:58:27",
    "title": "Barcelona’s Lewandowski substituted with possible leg problem before crunch games",
    "body": "BARCELONA, Spain (AP) — Barcelona will be hoping top scorer Robert Lewandowski is not injured before their biggest games of the season.\n\nThe Poland striker appeared to ask to be substituted in the final minutes of Barcelona’s 4-3 win over Celta Vigo on Saturday in La Liga. He touched his left thigh while sitting on the field before he got up and walked when replaced.\n\nBarcelona coach Hansi Flick said Lewandowski will undergo medical tests on Sunday.\n\n“We have to wait until tomorrow,” he said.\n\nThere is no let up for Barcelona with three titles in play.\n\nBarcelona plays Mallorca in the league on Tuesday and faces Real Madrid in the Copa del Rey final on April 26. Four days after that it will start its Champions League semifinal against Inter Milan.\n\nLewandowski has 40 goals for his club this season, including a La Liga high of 25.\n\n___\n\nAP soccer: https://apnews.com/hub/soccer",
    "clean_body": "barcelona spain ap — barcelona will be hoping top scorer robert lewandowski is not injured before their biggest games of the season the poland striker appeared to ask to be substituted in the final minutes of barcelona’s 43 win over celta vigo on saturday in la liga he touched his left thigh while sitting on the field before he got up and walked when replaced barcelona coach hansi flick said lewandowski will undergo medical tests on sunday “we have to wait until tomorrow” he said there is no let up for barcelona with three titles in play barcelona plays mallorca in the league on tuesday and faces real madrid in the copa del rey final on april 26 four days after that it will start its champions league semifinal against inter milan lewandowski has 40 goals for his club this season including a la liga high of 25 ap soccer httpsapnewscomhubsoccer",
    "summary": "BARCELONA, Spain (AP) — Barcelona will be hoping top scorer Robert Lewandowski is not injured before their biggest games of the season.\nThe Poland striker appeared to ask to be substituted in the final minutes of Barcelona’s 4-3 win over Celta Vigo on Saturday in La Liga.\nHe touched his left thigh while sitting on the field before he got up and walked when replaced.\nBarcelona plays Mallorca in the league on Tuesday and faces Real Madrid in the Copa del Rey final on April 26.\nLewandowski has 40 goals for his club this season, including a La Liga high of 25.",
    "keywords": [
      "final",
      "walked",
      "barcelonas",
      "games",
      "crunch",
      "barcelona",
      "liga",
      "vigo",
      "win",
      "wait",
      "substituted",
      "possible",
      "league",
      "leg",
      "problem",
      "la",
      "lewandowski"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/bbef8bc/2147483647/strip/true/crop/2930x1648+0+152/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8e%2Fb9%2F5610d4b70b57035db29dff0e1d6f%2F350446938cef46f99e3d152b6de2e411",
    "t": 23
  },
  "https://apnews.com/article/ups-amazon-ece105621fe23b2d0de76a2247df6b8b": {
    "source": "AP News",
    "url": "https://apnews.com/article/ups-amazon-ece105621fe23b2d0de76a2247df6b8b",
    "date": "2025-04-29",
    "time": "15:25:49",
    "title": "UPS to cut 20,000 jobs, close some facilities as it reduces amount of Amazon shipments it handles",
    "body": "UPS is looking to slash about 20,000 jobs and close more than 70 facilities as it drastically reduces the amount of Amazon shipments it handles.\n\nThe package delivery company said Tuesday that it anticipates making the job cuts this year. It anticipates closing 73 leased and owned buildings by the end of June. UPS said that it is still reviewing its network and may identify more buildings to be shuttered.\n\n“The actions we are taking to reconfigure our network and reduce cost across our business could not be timelier,” CEO Carol Tomé said in a statement on Tuesday. “The macro environment may be uncertain, but with our actions, we will emerge as an even stronger, more nimble UPS.”\n\nIn January UPS announced that it had reached a deal with Amazon, its biggest customer, to lower its volume by more than 50% by the second half of 2026.\n\nDuring UPS’ fourth-quarter earnings conference call in January, Tomé said that the company had partnered with Amazon for almost 30 years and that when its contract came up this year, UPS decided to reassess the relationship.\n\n“Amazon is our largest customer but it’s not our most profitable customer,” Tomé said at the time. “Its margin is very dilutive to the U.S. domestic business.”\n\nTomé said that UPS considered various options and determined that the volume reduction was the best alternative.\n\nThe company employs about 490,000 workers, according to FactSet.\n\nUnited Parcel Service Inc. also reported its first-quarter financial results on Tuesday. The Atlanta-based company earned $1.19 billion, or $$1.40 per share, in the quarter ended March 31.\n\nStripping out certain items, earnings were $1.49 per share. That’s better than the $1.44 per share that analysts polled by Zacks Investment Research were calling for.\n\nRevenue totaled $21.55 billion, beating Wall Street’s estimate of $21.06 billion.\n\nUPS said that it wasn’t providing any updates to its previously announced full-year outlook, given current macroeconomic uncertainty. The company previously said that it expected 2025 revenue of approximately $89 billion.\n\nShares of UPS rose slightly in morning trading.",
    "clean_body": "ups is looking to slash about 20000 jobs and close more than 70 facilities as it drastically reduces the amount of amazon shipments it handles the package delivery company said tuesday that it anticipates making the job cuts this year it anticipates closing 73 leased and owned buildings by the end of june ups said that it is still reviewing its network and may identify more buildings to be shuttered “the actions we are taking to reconfigure our network and reduce cost across our business could not be timelier” ceo carol tomé said in a statement on tuesday “the macro environment may be uncertain but with our actions we will emerge as an even stronger more nimble ups” in january ups announced that it had reached a deal with amazon its biggest customer to lower its volume by more than 50 by the second half of 2026 during ups’ fourthquarter earnings conference call in january tomé said that the company had partnered with amazon for almost 30 years and that when its contract came up this year ups decided to reassess the relationship “amazon is our largest customer but it’s not our most profitable customer” tomé said at the time “its margin is very dilutive to the us domestic business” tomé said that ups considered various options and determined that the volume reduction was the best alternative the company employs about 490000 workers according to factset united parcel service inc also reported its firstquarter financial results on tuesday the atlantabased company earned 119 billion or 140 per share in the quarter ended march 31 stripping out certain items earnings were 149 per share that’s better than the 144 per share that analysts polled by zacks investment research were calling for revenue totaled 2155 billion beating wall street’s estimate of 2106 billion ups said that it wasn’t providing any updates to its previously announced fullyear outlook given current macroeconomic uncertainty the company previously said that it expected 2025 revenue of approximately 89 billion shares of ups rose slightly in morning trading",
    "summary": "UPS is looking to slash about 20,000 jobs and close more than 70 facilities as it drastically reduces the amount of Amazon shipments it handles.\nUPS said that it is still reviewing its network and may identify more buildings to be shuttered.\n“Amazon is our largest customer but it’s not our most profitable customer,” Tomé said at the time.\nUPS said that it wasn’t providing any updates to its previously announced full-year outlook, given current macroeconomic uncertainty.\nThe company previously said that it expected 2025 revenue of approximately $89 billion.",
    "keywords": [
      "cut",
      "amazon",
      "previously",
      "shipments",
      "jobs",
      "company",
      "share",
      "customer",
      "tomé",
      "volume",
      "handles",
      "ups",
      "20000",
      "network",
      "close",
      "earnings",
      "reduces",
      "facilities"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/b8ebc53/2147483647/strip/true/crop/3827x2153+0+240/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2F88%2F6ee0c2c288511394e9545247b6a8%2Fad80907bf57d49f69e1abc49daff00c4",
    "t": 13
  },
  "https://apnews.com/article/minneapolis-shooting-6708eaa39a62e1f958f27f2d073bc774": {
    "source": "AP News",
    "url": "https://apnews.com/article/minneapolis-shooting-6708eaa39a62e1f958f27f2d073bc774",
    "date": "2025-04-30",
    "time": "16:09:39",
    "title": "Police suspect 2 shootings that left 4 dead in Minneapolis were connected and gang related",
    "body": "MINNEAPOLIS (AP) — Investigators strongly suspect that a pair of shootings three blocks apart in Minneapolis that left four people dead and two others seriously injured were connected and were gang related, the police chief said Wednesday.\n\nThe first shooting happened late Tuesday and killed three people. The second, which happened around 1 p.m. Wednesday, killed one person. A bullet fired during that shooting just barely missed two young children in a nearby vehicle, police Chief Brian O’Hara said.\n\nThe police chief said at a news conference that investigators believe all of the victims were Native Americans and that the shootings had shaken the large Indigenous community in the Phillips neighborhood south of downtown.\n\nHe told reporters that investigators were still trying to establish a link between the shootings, and he declined to speculate on a motive or give details about any suspected gang connections. He said the investigation was still at its early stages. No arrests have been made.\n\n“We’re three blocks away. The community’s saying something’s going on here, ”he said. “We have to follow the evidence. I cannot speculate. You can make your own assumptions based off the facts.”\n\nThe killings followed a period of relative peace in Minneapolis, which like many cities saw an increase in crime during the COVID-19 pandemic and after the 2020 murder of George Floyd by Minneapolis police.\n\nBut crime fell in many major cities last year, and Minneapolis recently went two months without a homicide until a man was shot to death April 19. It was the city’s longest period without a homicide in a decade, according to police. Authorities have credited the work of community organizations and a federal crackdown on local gang members.\n\n“Our entire city is grieving right now,” Mayor Jacob Frey told reporters. “And we know that our Native community is feeling that trauma quite acutely.”\n\nIn the late Tuesday shooting, four people were shot in a vehicle and one on a nearby sidewalk, according to police. O’Hara said a 20-year-old woman, a 17-year-old boy and a 27-year-old man were killed. A 28-year-old man and a 20-year-old woman were taken to a hospital with life-threatening injuries. O’Hara said the man remained in grave condition Wednesday afternoon.\n\nWednesday’s shooting happened outside an apartment building that houses the Minneapolis offices of the Red Lake Nation tribe. A man in his 30s died, O’Hara said.\n\n“What is even more disturbing,” he added, was that one round from the shooting went through the rear door of an SUV “and passed just beneath the legs of two children in child seats, an infant and a toddler.”\n\nO’Hara reiterated his earlier statements that it was “very clear” that victims of the first shooting were deliberately targeted and that it was “potentially gang related.”\n\nThe chief did not say whether the fatal shootings might have been connected with another nearby shooting overnight in which a man was dropped off at a hospital with a non-life-threatening gunshot wound.\n\nO’Hara appealed for anyone with information to come forward.\n\n“We need everyone to stand up and say this is not OK,” he said. “And law enforcement will not rest until everyone involved in both of these incidents is brought into custody.",
    "clean_body": "minneapolis ap — investigators strongly suspect that a pair of shootings three blocks apart in minneapolis that left four people dead and two others seriously injured were connected and were gang related the police chief said wednesday the first shooting happened late tuesday and killed three people the second which happened around 1 pm wednesday killed one person a bullet fired during that shooting just barely missed two young children in a nearby vehicle police chief brian o’hara said the police chief said at a news conference that investigators believe all of the victims were native americans and that the shootings had shaken the large indigenous community in the phillips neighborhood south of downtown he told reporters that investigators were still trying to establish a link between the shootings and he declined to speculate on a motive or give details about any suspected gang connections he said the investigation was still at its early stages no arrests have been made “we’re three blocks away the community’s saying something’s going on here ”he said “we have to follow the evidence i cannot speculate you can make your own assumptions based off the facts” the killings followed a period of relative peace in minneapolis which like many cities saw an increase in crime during the covid19 pandemic and after the 2020 murder of george floyd by minneapolis police but crime fell in many major cities last year and minneapolis recently went two months without a homicide until a man was shot to death april 19 it was the city’s longest period without a homicide in a decade according to police authorities have credited the work of community organizations and a federal crackdown on local gang members “our entire city is grieving right now” mayor jacob frey told reporters “and we know that our native community is feeling that trauma quite acutely” in the late tuesday shooting four people were shot in a vehicle and one on a nearby sidewalk according to police o’hara said a 20yearold woman a 17yearold boy and a 27yearold man were killed a 28yearold man and a 20yearold woman were taken to a hospital with lifethreatening injuries o’hara said the man remained in grave condition wednesday afternoon wednesday’s shooting happened outside an apartment building that houses the minneapolis offices of the red lake nation tribe a man in his 30s died o’hara said “what is even more disturbing” he added was that one round from the shooting went through the rear door of an suv “and passed just beneath the legs of two children in child seats an infant and a toddler” o’hara reiterated his earlier statements that it was “very clear” that victims of the first shooting were deliberately targeted and that it was “potentially gang related” the chief did not say whether the fatal shootings might have been connected with another nearby shooting overnight in which a man was dropped off at a hospital with a nonlifethreatening gunshot wound o’hara appealed for anyone with information to come forward “we need everyone to stand up and say this is not ok” he said “and law enforcement will not rest until everyone involved in both of these incidents is brought into custody",
    "summary": "MINNEAPOLIS (AP) — Investigators strongly suspect that a pair of shootings three blocks apart in Minneapolis that left four people dead and two others seriously injured were connected and were gang related, the police chief said Wednesday.\nA bullet fired during that shooting just barely missed two young children in a nearby vehicle, police Chief Brian O’Hara said.\nAuthorities have credited the work of community organizations and a federal crackdown on local gang members.\nO’Hara said a 20-year-old woman, a 17-year-old boy and a 27-year-old man were killed.\nWednesday’s shooting happened outside an apartment building that houses the Minneapolis offices of the Red Lake Nation tribe.",
    "keywords": [
      "suspect",
      "shooting",
      "connected",
      "shootings",
      "ohara",
      "left",
      "minneapolis",
      "related",
      "gang",
      "man",
      "investigators",
      "killed",
      "nearby",
      "chief",
      "dead"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/6b2d522/2147483647/strip/true/crop/3000x1688+0+430/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F25%2F3d62076507ee19c0ec952502b0a3%2Ff76f92497f644c6793436314fe1570f9",
    "t": 12
  },
  "https://apnews.com/article/texas-school-b81a704521f1249d3479606fbaaff4fa": {
    "source": "AP News",
    "url": "https://apnews.com/article/texas-school-b81a704521f1249d3479606fbaaff4fa",
    "date": "2025-04-15",
    "time": "19:26:44",
    "title": "Suspect in shooting at Dallas high school is in custody, officials say",
    "body": "DALLAS (AP) — A suspect in a shooting at a Dallas high school that wounded four students and drew a heavy police response to the campus has been taken into custody, school district officials announced Tuesday night.\n\nThree of the students were injured by gunfire and the fourth was injured in their lower body, according to the Dallas Fire-Rescue Department. The department said units were dispatched to Wilmer-Hutchins High School just after 1 p.m. and that the four students, all of whom are male, were taken to hospitals with injuries ranging from serious to not life-threatening.\n\n“Quite frankly, this is just becoming way too familiar. And it should not be familiar,” Stephanie Elizalde, superintendent of the Dallas Independent School District, said at a news conference.\n\nThe school district said in a statement Tuesday night that a suspect was apprehended within hours of the shooting, but didn’t provide details about the person or say whether they had been arrested.\n\nChristina Smith, assistant police chief for the Dallas Independent School District, said at the earlier news conference that the investigation was fluid and she did not have any information on what led to the shooting.\n\nThe three who were shot were between the ages of 15 and 18, while the age of a person with a “musculoskeletal injury” was not known, Dallas Fire-Rescue said.\n\nA woman arrives to a checkpoint outside Wilmer-Hutchins High School, where police are responding to reports of a shooting, in Dallas, Tx., Tuesday, April 15, 2025. (AP Photo/Julio Cortez) A woman arrives to a checkpoint outside Wilmer-Hutchins High School, where police are responding to reports of a shooting, in Dallas, Tx., Tuesday, April 15, 2025. (AP Photo/Julio Cortez) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nSheriff vehicles sit parked in a lot at Wilmer-Hutchins High School, where police are responding to reports of a shooting in Dallas, Tx., Tuesday, April 15, 2025. (AP Photo/Julio Cortez) Sheriff vehicles sit parked in a lot at Wilmer-Hutchins High School, where police are responding to reports of a shooting in Dallas, Tx., Tuesday, April 15, 2025. (AP Photo/Julio Cortez) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More A fire engine blocks a road accessing Wilmer-Hutchins High School, where police are responding to reports of a shooting, in Dallas, Tx., Tuesday, April 15, 2025. (AP Photo/Julio Cortez) A fire engine blocks a road accessing Wilmer-Hutchins High School, where police are responding to reports of a shooting, in Dallas, Tx., Tuesday, April 15, 2025. (AP Photo/Julio Cortez) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nSchool district officials and police gave few details during the news conference held several hours after the shooting, which drew a large number of police and other law enforcement agents to the roughly 1,000-student campus.\n\n“I know that there are many questions and we’re not going to have all of the answers right now because some of the information will be inaccurate,” Elizalde said.\n\nAuthorities said other students and their parents had been safely reunited after the students had evacuated earlier in the day from the campus. Aerial television footage taken above the high school Tuesday afternoon showed multiple police vehicles thronging the complex.\n\nElizalde said that there would be no school at the high school for the rest of the week but that counselors would be available to students.\n\nSmith said that the gun didn’t come into the school during “regular intake time.” She said “it was not a failure of our staff, of our protocols, or of the machinery that we have.” But she said she could not elaborate on that.\n\nShauna Williams, who has two students at the campus, said after the shooting that she was now considering homeschooling them. At the same school last April, one student shot another in the leg.\n\n“I can’t keep going through this as a parent,” she told Dallas television station KDFW. “I’m telling you, it’s very frightening to think about losing your child, your kids.”\n\nTexas Gov. Greg Abbott said in a statement that “our hearts go out to the victims of this senseless act of violence.”",
    "clean_body": "dallas ap — a suspect in a shooting at a dallas high school that wounded four students and drew a heavy police response to the campus has been taken into custody school district officials announced tuesday night three of the students were injured by gunfire and the fourth was injured in their lower body according to the dallas firerescue department the department said units were dispatched to wilmerhutchins high school just after 1 pm and that the four students all of whom are male were taken to hospitals with injuries ranging from serious to not lifethreatening “quite frankly this is just becoming way too familiar and it should not be familiar” stephanie elizalde superintendent of the dallas independent school district said at a news conference the school district said in a statement tuesday night that a suspect was apprehended within hours of the shooting but didn’t provide details about the person or say whether they had been arrested christina smith assistant police chief for the dallas independent school district said at the earlier news conference that the investigation was fluid and she did not have any information on what led to the shooting the three who were shot were between the ages of 15 and 18 while the age of a person with a “musculoskeletal injury” was not known dallas firerescue said a woman arrives to a checkpoint outside wilmerhutchins high school where police are responding to reports of a shooting in dallas tx tuesday april 15 2025 ap photojulio cortez a woman arrives to a checkpoint outside wilmerhutchins high school where police are responding to reports of a shooting in dallas tx tuesday april 15 2025 ap photojulio cortez share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more sheriff vehicles sit parked in a lot at wilmerhutchins high school where police are responding to reports of a shooting in dallas tx tuesday april 15 2025 ap photojulio cortez sheriff vehicles sit parked in a lot at wilmerhutchins high school where police are responding to reports of a shooting in dallas tx tuesday april 15 2025 ap photojulio cortez share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more a fire engine blocks a road accessing wilmerhutchins high school where police are responding to reports of a shooting in dallas tx tuesday april 15 2025 ap photojulio cortez a fire engine blocks a road accessing wilmerhutchins high school where police are responding to reports of a shooting in dallas tx tuesday april 15 2025 ap photojulio cortez share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more school district officials and police gave few details during the news conference held several hours after the shooting which drew a large number of police and other law enforcement agents to the roughly 1000student campus “i know that there are many questions and we’re not going to have all of the answers right now because some of the information will be inaccurate” elizalde said authorities said other students and their parents had been safely reunited after the students had evacuated earlier in the day from the campus aerial television footage taken above the high school tuesday afternoon showed multiple police vehicles thronging the complex elizalde said that there would be no school at the high school for the rest of the week but that counselors would be available to students smith said that the gun didn’t come into the school during “regular intake time” she said “it was not a failure of our staff of our protocols or of the machinery that we have” but she said she could not elaborate on that shauna williams who has two students at the campus said after the shooting that she was now considering homeschooling them at the same school last april one student shot another in the leg “i can’t keep going through this as a parent” she told dallas television station kdfw “i’m telling you it’s very frightening to think about losing your child your kids” texas gov greg abbott said in a statement that “our hearts go out to the victims of this senseless act of violence”",
    "summary": "DALLAS (AP) — A suspect in a shooting at a Dallas high school that wounded four students and drew a heavy police response to the campus has been taken into custody, school district officials announced Tuesday night.\nA woman arrives to a checkpoint outside Wilmer-Hutchins High School, where police are responding to reports of a shooting, in Dallas, Tx., Tuesday, April 15, 2025.\n(AP Photo/Julio Cortez) A woman arrives to a checkpoint outside Wilmer-Hutchins High School, where police are responding to reports of a shooting, in Dallas, Tx., Tuesday, April 15, 2025.\nAerial television footage taken above the high school Tuesday afternoon showed multiple police vehicles thronging the complex.\nElizalde said that there would be no school at the high school for the rest of the week but that counselors would be available to students.",
    "keywords": [
      "suspect",
      "shooting",
      "custody",
      "students",
      "dallas",
      "wilmerhutchins",
      "say",
      "ap",
      "share",
      "15",
      "high",
      "school",
      "tx",
      "officials"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/eee3d8e/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa1%2F99%2F06e0340d30d9fa0eccad3de13a90%2F4858165af89a4436baf278435c28b8ff",
    "t": 27
  },
  "https://apnews.com/article/dodgers-snell-f3c1d258f3c589b62aa372b7f591b90b": {
    "source": "AP News",
    "url": "https://apnews.com/article/dodgers-snell-f3c1d258f3c589b62aa372b7f591b90b",
    "date": "2025-04-23",
    "time": "23:29:46",
    "title": "Dodgers LHP Blake Snell to stop throwing for a couple days after experiencing discomfort",
    "body": "CHICAGO (AP) — Dodgers left-hander Blake Snell is going to stop throwing for a couple days after he felt some discomfort when he played catch Tuesday.\n\nSnell is on the 15-day injured list because of shoulder inflammation. The two-time Cy Young Award winner signed a $182 million, five-year contract in November.\n\n“Blake, as he was playing catch, just didn’t feel great,” manager Dave Roberts said before Wednesday night’s 7-6 loss to the Chicago Cubs. “So right now we’re going to slow play the throwing and probably get it looked at again when we get back home.”\n\nThe 32-year-old Snell is 1-0 with a 2.00 ERA in two starts this season. It was unclear when the pitcher reported the issue; Roberts said before Tuesday’s 11-10 loss to the Cubs that Snell had played catch and “it went well.”\n\nRoberts said Wednesday that he isn’t concerned at this point.\n\n“Part of the messaging from us to Blake is it’s about later on in the season and if there’s any type of discomfort, let’s not try to fight through it,” Roberts said. “And so, given where we’re at right now on the calendar, not concerned at all, and even talking to Blake yesterday, wasn’t concerned.”\n\nAfter signing Roki Sasaki in January, the Dodgers began the season with some pitching depth. But that depth is being tested.\n\nTyler Glasnow left Sunday’s win against the Rangers because of lower leg cramps, but the 31-year-old right-hander is on track to start Sunday at home against Pittsburgh.\n\nThe World Series champions also have some help on the way. Clayton Kershaw pitched three-plus innings of one-run ball in a rehab appearance with Double-A Tulsa on Tuesday. Tony Gonsolin worked five-plus innings of two-run ball in a rehab start for Triple-A Oklahoma City on Wednesday night.\n\nKershaw, 37, is coming back from offseason surgeries on his toe and knee. The three-time Cy Young Award winner struck out four and walked one in his second rehab start.\n\n“It was good. He came out of it well,” Roberts said. “Velocity was good. Got into the fourth inning. He’ll make a start next week, so really positive stuff.”\n\nRoberts said Kershaw’s toe injury is getting better, but “it’s probably going to be something he’s going to have to deal with, and it’s not going to be pain-free.”\n\nThe Dodgers played without catcher Will Smith in their series finale against the Cubs. Smith had some left wrist soreness after making a tag at the plate in the sixth inning of Tuesday night’s game.\n\nRoberts said the team could get some imaging for Smith when it gets back to Los Angeles. The Dodgers are off Thursday before hosting Pittsburgh on Friday night in the opener of a three-game series.\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "chicago ap — dodgers lefthander blake snell is going to stop throwing for a couple days after he felt some discomfort when he played catch tuesday snell is on the 15day injured list because of shoulder inflammation the twotime cy young award winner signed a 182 million fiveyear contract in november “blake as he was playing catch just didn’t feel great” manager dave roberts said before wednesday night’s 76 loss to the chicago cubs “so right now we’re going to slow play the throwing and probably get it looked at again when we get back home” the 32yearold snell is 10 with a 200 era in two starts this season it was unclear when the pitcher reported the issue roberts said before tuesday’s 1110 loss to the cubs that snell had played catch and “it went well” roberts said wednesday that he isn’t concerned at this point “part of the messaging from us to blake is it’s about later on in the season and if there’s any type of discomfort let’s not try to fight through it” roberts said “and so given where we’re at right now on the calendar not concerned at all and even talking to blake yesterday wasn’t concerned” after signing roki sasaki in january the dodgers began the season with some pitching depth but that depth is being tested tyler glasnow left sunday’s win against the rangers because of lower leg cramps but the 31yearold righthander is on track to start sunday at home against pittsburgh the world series champions also have some help on the way clayton kershaw pitched threeplus innings of onerun ball in a rehab appearance with doublea tulsa on tuesday tony gonsolin worked fiveplus innings of tworun ball in a rehab start for triplea oklahoma city on wednesday night kershaw 37 is coming back from offseason surgeries on his toe and knee the threetime cy young award winner struck out four and walked one in his second rehab start “it was good he came out of it well” roberts said “velocity was good got into the fourth inning he’ll make a start next week so really positive stuff” roberts said kershaw’s toe injury is getting better but “it’s probably going to be something he’s going to have to deal with and it’s not going to be painfree” the dodgers played without catcher will smith in their series finale against the cubs smith had some left wrist soreness after making a tag at the plate in the sixth inning of tuesday night’s game roberts said the team could get some imaging for smith when it gets back to los angeles the dodgers are off thursday before hosting pittsburgh on friday night in the opener of a threegame series ap mlb httpsapnewscomhubmlb",
    "summary": "CHICAGO (AP) — Dodgers left-hander Blake Snell is going to stop throwing for a couple days after he felt some discomfort when he played catch Tuesday.\n“Blake, as he was playing catch, just didn’t feel great,” manager Dave Roberts said before Wednesday night’s 7-6 loss to the Chicago Cubs.\nTony Gonsolin worked five-plus innings of two-run ball in a rehab start for Triple-A Oklahoma City on Wednesday night.\nThe three-time Cy Young Award winner struck out four and walked one in his second rehab start.\nThe Dodgers are off Thursday before hosting Pittsburgh on Friday night in the opener of a three-game series.",
    "keywords": [
      "going",
      "dodgers",
      "cubs",
      "couple",
      "roberts",
      "stop",
      "lhp",
      "rehab",
      "played",
      "snell",
      "experiencing",
      "throwing",
      "start",
      "season",
      "smith",
      "discomfort",
      "days",
      "blake"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/162389e/2147483647/strip/true/crop/5490x3088+0+282/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0e%2F69%2F9c2d3a83d4da700dd98305d4edcd%2F340582bd5cab4c3482fb4bf941ae928f",
    "t": 19
  },
  "https://apnews.com/article/sports-betting-3d235788bbe08a9afc9dbcf8c8415958": {
    "source": "AP News",
    "url": "https://apnews.com/article/sports-betting-3d235788bbe08a9afc9dbcf8c8415958",
    "date": "2025-04-21",
    "time": "16:34:02",
    "title": "Sports betting roundup: Big favorites put up big numbers in NBA playoffs",
    "body": "The big favorites in the NBA playoffs all won and covered over the weekend.\n\nThe Oklahoma City Thunder (-13.5 vs. the Memphis Grizzlies), Boston Celtics (-13.5 vs. the Orlando Magic) and Cleveland Cavaliers (-12.5 vs. the Miami Heat) all were favored to take the lead in their series at the BetMGM online sportsbook.\n\nThe NHL playoffs also got underway while the baseball season had its normal full weekend slate of games and the PGA Tour had another signature event with the RBC Heritage from Hilton Head Island, South Carolina.\n\nTrends of the Week\n\nThe NBA results continued the trend of big favorites covering in the first round of the NBA playoffs. In the last 10 years, double-digit favorites have gone 35-18-1 (66%) against the spread.\n\nThe Denver Nuggets beat the Los Angeles Clippers 112-110 in overtime in Game 1 on Saturday. Denver closed as 2.5-point favorites and took in 64% of the bets but only 40% of the money. Despite the game going to overtime, the under of 224.5 hit. When it came to betting, 75% of the money was on the over.\n\nBrett Howden scored an empty-net goal with a tenth of a second left in Vegas’ 4-2 win over Minnesota on Sunday. This was meaningless in terms of the result, but it enabled the over of 5.5 goals to hit. In terms of bets, 63% of them and 47% of the money was on the over.\n\nUpsets of the Week\n\nMinnesota upset the Los Angeles Lakers 117-95 in Saturday’s Game 1. The Lakers were 4.5-point favorites and took in 63% of the bets and 44% of the money in against-the-spread betting. In terms of the moneyline, Minnesota took in only 35% of bets and 9% of the money.\n\nHouston closed as a 1.5-point favorite against Golden State in Sunday’s Game 1 and fell 95-85. The Rockets took in 54% of the bets and 66% of the money in against-the-spread betting.\n\nJustin Thomas won for the first time on the PGA Tour since 2022, beating Andrew Novak on the first playoff hole. Both players finished the tournament at 17-under. Thomas opened the tournament with +2000 odds to win and took in 4.2% of the bets and 6.4% of the money in pre-tournament outright winning betting.\n\nComing up\n\nThe NFL Draft will get underway Thursday night from Green Bay.\n\nCameron Ward could be the No. 1 overall pick, with odds of -10000 to hear his name called first. For the No. 2 overall pick, Travis Hunter is the favorite at -1000, while Abdul Carter is -650 to be selected No. 3 overall.\n\nAt No. 4, Will Campbell is the odds-on favorite with -650 odds, while No. 5 is a toss-up. Mason Graham is -125, Ashton Jeanty is +200 and Jalon Walker is +650.\n\n___\n\nThis column was provided to The Associated Press by BetMGM online sportsbook.\n\n___\n\nAP sports: https://apnews.com/hub/sports",
    "clean_body": "the big favorites in the nba playoffs all won and covered over the weekend the oklahoma city thunder 135 vs the memphis grizzlies boston celtics 135 vs the orlando magic and cleveland cavaliers 125 vs the miami heat all were favored to take the lead in their series at the betmgm online sportsbook the nhl playoffs also got underway while the baseball season had its normal full weekend slate of games and the pga tour had another signature event with the rbc heritage from hilton head island south carolina trends of the week the nba results continued the trend of big favorites covering in the first round of the nba playoffs in the last 10 years doubledigit favorites have gone 35181 66 against the spread the denver nuggets beat the los angeles clippers 112110 in overtime in game 1 on saturday denver closed as 25point favorites and took in 64 of the bets but only 40 of the money despite the game going to overtime the under of 2245 hit when it came to betting 75 of the money was on the over brett howden scored an emptynet goal with a tenth of a second left in vegas’ 42 win over minnesota on sunday this was meaningless in terms of the result but it enabled the over of 55 goals to hit in terms of bets 63 of them and 47 of the money was on the over upsets of the week minnesota upset the los angeles lakers 11795 in saturday’s game 1 the lakers were 45point favorites and took in 63 of the bets and 44 of the money in againstthespread betting in terms of the moneyline minnesota took in only 35 of bets and 9 of the money houston closed as a 15point favorite against golden state in sunday’s game 1 and fell 9585 the rockets took in 54 of the bets and 66 of the money in againstthespread betting justin thomas won for the first time on the pga tour since 2022 beating andrew novak on the first playoff hole both players finished the tournament at 17under thomas opened the tournament with 2000 odds to win and took in 42 of the bets and 64 of the money in pretournament outright winning betting coming up the nfl draft will get underway thursday night from green bay cameron ward could be the no 1 overall pick with odds of 10000 to hear his name called first for the no 2 overall pick travis hunter is the favorite at 1000 while abdul carter is 650 to be selected no 3 overall at no 4 will campbell is the oddson favorite with 650 odds while no 5 is a tossup mason graham is 125 ashton jeanty is 200 and jalon walker is 650 this column was provided to the associated press by betmgm online sportsbook ap sports httpsapnewscomhubsports",
    "summary": "The big favorites in the NBA playoffs all won and covered over the weekend.\nTrends of the WeekThe NBA results continued the trend of big favorites covering in the first round of the NBA playoffs.\nDenver closed as 2.5-point favorites and took in 64% of the bets but only 40% of the money.\nThe Lakers were 4.5-point favorites and took in 63% of the bets and 44% of the money in against-the-spread betting.\nThe Rockets took in 54% of the bets and 66% of the money in against-the-spread betting.",
    "keywords": [
      "vs",
      "big",
      "took",
      "playoffs",
      "terms",
      "betting",
      "game",
      "numbers",
      "roundup",
      "money",
      "favorites",
      "nba",
      "bets",
      "odds"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/289563f/2147483647/strip/true/crop/3453x1942+0+180/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F8f%2F503f0d401cbda9a78e84524610aa%2F91efe2a0c5a54982822141bbf2ae20b4",
    "t": 21
  },
  "https://apnews.com/article/cardinals-winn-9d5d6818724897c3923229d13082a8ee": {
    "source": "AP News",
    "url": "https://apnews.com/article/cardinals-winn-9d5d6818724897c3923229d13082a8ee",
    "date": "2025-04-12",
    "time": "00:58:49",
    "title": "Cardinals 2B Winn leaves game against Phillies due to lower back spasms",
    "body": "ST. LOUIS (AP) — St. Louis Cardinals second baseman Masyn Winn left Friday night’s game against the Philadelphia Phillies due to lower back spasms.\n\nWinn played the first inning of the game, but did not go onto the field for the second.\n\nThe Cardinals moved catcher Pedro Pagés to second base. Pagés has played catcher or first base in his two major league seasons.\n\nRookie Thomas Saggese, who was playing second base, moved to shortstop.\n\nRookie Yohel Pozo took over at catcher and assumed Winn’s spot at ninth in the batting order. Pozo has played in 22 MLB games. He made his St. Louis debut on Monday — his first game in the majors since 2021.\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "st louis ap — st louis cardinals second baseman masyn winn left friday night’s game against the philadelphia phillies due to lower back spasms winn played the first inning of the game but did not go onto the field for the second the cardinals moved catcher pedro pagés to second base pagés has played catcher or first base in his two major league seasons rookie thomas saggese who was playing second base moved to shortstop rookie yohel pozo took over at catcher and assumed winn’s spot at ninth in the batting order pozo has played in 22 mlb games he made his st louis debut on monday — his first game in the majors since 2021 ap mlb httpsapnewscomhubmlb",
    "summary": "ST. LOUIS (AP) — St. Louis Cardinals second baseman Masyn Winn left Friday night’s game against the Philadelphia Phillies due to lower back spasms.\nWinn played the first inning of the game, but did not go onto the field for the second.\nThe Cardinals moved catcher Pedro Pagés to second base.\nRookie Thomas Saggese, who was playing second base, moved to shortstop.\nHe made his St. Louis debut on Monday — his first game in the majors since 2021.",
    "keywords": [
      "winn",
      "leaves",
      "moved",
      "phillies",
      "catcher",
      "spasms",
      "cardinals",
      "st",
      "played",
      "pozo",
      "game",
      "pagés",
      "louis",
      "second",
      "2b",
      "lower",
      "base"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/d5ae757/2147483647/strip/true/crop/4200x2363+0+169/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4e%2Fd6%2F5979cdca4a5ee64a72be568ff9e0%2F51658b4052e34d63b80936b2c50350c4",
    "t": 30
  },
  "https://apnews.com/article/phillies-romano-fdef698cef051b825d5e63fe2f3570b9": {
    "source": "AP News",
    "url": "https://apnews.com/article/phillies-romano-fdef698cef051b825d5e63fe2f3570b9",
    "date": "2025-04-19",
    "time": "21:40:54",
    "title": "Former All-Star closer Romano getting rocked in 1st season with Phillies",
    "body": "PHILADELPHIA (AP) — Jordan Romano says his right arm felt the best it had in a long time — the two-time All-Star closer even hit 99.8 mph on a four-seam fastball.\n\nThe Marlins just hit him — rocked him, actually — much, much harder.\n\nThe Phillies’ eight-inning rout turned close in the ninth once Romano was summoned to close out an 11-4 lead. Dane Myers instead hit a three-run homer, Graham Pauley added an RBI double and Liam Hicks added a two-run shot — his first big-league homer — and suddenly it was 11-10.\n\nRomano, already in the midst of a rough first season in Philly, was heavily booed Saturday as he trudged off the mound.\n\n“Kind of expect that when you’re pitching like that, for sure,” Romano said.\n\nRomano was charged with six runs and retired just two batters in the ninth before José Alvarado bailed him out and got the final out of the 11-10 win for his fifth save.\n\nRomano’s ERA ballooned to 15.26 in nine games this season.\n\n“I felt confident, honestly, in all my pitches,” Romano said. “I don’t know, they were seeing it really well today. Everything I threw in there, I felt like they were pretty comfortable with. Obviously, putting pretty good swings on it.”\n\nAfter a slow start to the season, Romano thought he might have solved his mechanical issues when he adjusted the leg lift on his delivery. Romano was left to wonder after he gave up six hits on just 22 pitches if perhaps he’s tipping his pitches. He said he’d watch the video to find out if there’s another flaw in his delivery.\n\n“Usually, I don’t (watch video), when it’s just a blooper or something like that,” Romano said. “But when they’re putting that good a swings on it, for sure.”\n\nManager Rob Thomson said the Phillies will conduct a deeper dive to determine whether Romano is tipping his pitches.\n\n“He’s got a great track record,” Thomson said. “As long as his stuff is good, you’ve got to believe in him.”\n\nAn All-Star in 2022 and 2023, Romano spent the first six seasons of his major league career with the Toronto Blue Jays. He had 105 saves and a 2.90 ERA in 231 relief appearances with Toronto. The Phillies declined to re-sign former All-Star relievers Carlos Estévez and Jeff Hoffman and instead made a short-term bet on Romano with an $8.5 million, one-year contract.\n\nHoffman signed with the Blue Jays and entered Saturday 2-0 with a 1.59 ERA, 16 strikeouts in 11 1/3 innings and five saves.\n\nThe 31-year-old Romano was limited to just eight saves in 15 games last season. He had arthroscopic surgery on his elbow in July but has been healthy with the Phillies.\n\n“What’s honestly crazy to me is like, I went out there and executed what I wanted to do,” Romano said. “It’s just the worst result possible. I wanted to drive the zone with my heater, throw the slider in there for strikes. I did that. Just got crushed.”\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "philadelphia ap — jordan romano says his right arm felt the best it had in a long time — the twotime allstar closer even hit 998 mph on a fourseam fastball the marlins just hit him — rocked him actually — much much harder the phillies’ eightinning rout turned close in the ninth once romano was summoned to close out an 114 lead dane myers instead hit a threerun homer graham pauley added an rbi double and liam hicks added a tworun shot — his first bigleague homer — and suddenly it was 1110 romano already in the midst of a rough first season in philly was heavily booed saturday as he trudged off the mound “kind of expect that when you’re pitching like that for sure” romano said romano was charged with six runs and retired just two batters in the ninth before josé alvarado bailed him out and got the final out of the 1110 win for his fifth save romano’s era ballooned to 1526 in nine games this season “i felt confident honestly in all my pitches” romano said “i don’t know they were seeing it really well today everything i threw in there i felt like they were pretty comfortable with obviously putting pretty good swings on it” after a slow start to the season romano thought he might have solved his mechanical issues when he adjusted the leg lift on his delivery romano was left to wonder after he gave up six hits on just 22 pitches if perhaps he’s tipping his pitches he said he’d watch the video to find out if there’s another flaw in his delivery “usually i don’t watch video when it’s just a blooper or something like that” romano said “but when they’re putting that good a swings on it for sure” manager rob thomson said the phillies will conduct a deeper dive to determine whether romano is tipping his pitches “he’s got a great track record” thomson said “as long as his stuff is good you’ve got to believe in him” an allstar in 2022 and 2023 romano spent the first six seasons of his major league career with the toronto blue jays he had 105 saves and a 290 era in 231 relief appearances with toronto the phillies declined to resign former allstar relievers carlos estévez and jeff hoffman and instead made a shortterm bet on romano with an 85 million oneyear contract hoffman signed with the blue jays and entered saturday 20 with a 159 era 16 strikeouts in 11 13 innings and five saves the 31yearold romano was limited to just eight saves in 15 games last season he had arthroscopic surgery on his elbow in july but has been healthy with the phillies “what’s honestly crazy to me is like i went out there and executed what i wanted to do” romano said “it’s just the worst result possible i wanted to drive the zone with my heater throw the slider in there for strikes i did that just got crushed” ap mlb httpsapnewscomhubmlb",
    "summary": "PHILADELPHIA (AP) — Jordan Romano says his right arm felt the best it had in a long time — the two-time All-Star closer even hit 99.8 mph on a four-seam fastball.\nThe Phillies’ eight-inning rout turned close in the ninth once Romano was summoned to close out an 11-4 lead.\nRomano, already in the midst of a rough first season in Philly, was heavily booed Saturday as he trudged off the mound.\n“I felt confident, honestly, in all my pitches,” Romano said.\nObviously, putting pretty good swings on it.”After a slow start to the season, Romano thought he might have solved his mechanical issues when he adjusted the leg lift on his delivery.",
    "keywords": [
      "1st",
      "closer",
      "good",
      "felt",
      "phillies",
      "getting",
      "rocked",
      "watch",
      "allstar",
      "romano",
      "season",
      "hit",
      "pitches",
      "era"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/0c3e28c/2147483647/strip/true/crop/5258x2958+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3a%2F59%2F0170418936da4a7c03053b9fb7e2%2Fe9ab7ed81a4c4e5db33bbe8604332f49",
    "t": 23
  },
  "https://apnews.com/article/nfl-draft-c8f5432414906672f7105a617c1501e8": {
    "source": "AP News",
    "url": "https://apnews.com/article/nfl-draft-c8f5432414906672f7105a617c1501e8",
    "date": "2025-04-29",
    "time": "10:00:06",
    "title": "Shedeur Sanders’ draft slide leads to a rare QB double dip by the Browns",
    "body": "Shedeur Sanders’ slide down the NFL draft was the dominant story of the weekend with one of college football’s most high-profile players lasting until the fifth round.\n\nThe fact Sanders was taken by the Browns two rounds after they drafted another quarterback in Dillon Gabriel made the entire situation even more rare.\n\nThe Browns were the first team to draft two quarterbacks in the first five rounds of the NFL draft since Washington did it in 2012, when the team traded up to take Robert Griffin III with the second-overall pick and then drafted Kirk Cousins in the fourth round.\n\nThere are only a handful of other times in the common draft era beginning in 1967 that a team picked two quarterbacks that high in the draft.\n\nGreen Bay drafted Anthony Dilweg in the third round and Jeff Graham in the fourth in 1989. The Packers traded Graham to Washington later in the draft and he never played a game in the NFL despite spending time with several teams. Dilweg started seven games in 1990.\n\nThe Colts double-dipped at quarterback in 1982, taking Art Schlichter fourth overall and Mike Pagel in the fourth round. Schlichter played only 13 games because of gambling problems, while Pagel had a long career, mostly as a backup.\n\nThe Houston Oilers also did it in 1971, taking Dan Pastorini in the first round and Lynn Dickey in the third. Both had long careers as starters in the NFL.\n\nThere were two other times it happened but one of those QBs quickly shifted positions to receiver once joining the NFL.\n\nThe Jets took Kellen Clemens in the second round and Brad Smith in the fourth in 2006. Clemens spent 12 seasons in the NFL, mostly as a backup, while Smith had a successful career as a receiver, returner and occasional wildcat quarterback.\n\nThe Raiders took quarterbacks with their first two picks in 1968 but first-rounder Eldrige Dickey moved to receiver following his first training camp and had only five catches in his career. Second-rounder Ken Stabler went on to become the 1974 AP NFL MVP and had a Hall of Fame career as a quarterback.\n\nTrading up\n\nTrading up for a top-two pick in the NFL draft isn’t that uncommon with it happening five times in the last 13 drafts before this season. Doing it for a non-quarterback was rare.\n\nThe deal made by Jacksonville with Cleveland to move up from No. 5 to No. 2 to take Travis Hunter marked the first time since 1997 that a team traded up that high to draft a non-quarterback.\n\nIt happened twice in 1997, with the Raiders trading up to No. 2 that year before the Rams jumped them two weeks later to trade for the No. 1 pick. The Rams took Hall of Famer Orlando Pace and the Raiders drafted Darrell Russell.\n\nThere hadn’t been a receiver taken in the top two since Calvin Johnson went second to Detroit in 2007 and no defensive back had been taken that high since safety Eric Turner went second to Cleveland in 1991.\n\nThere were 12 other instances in the common draft era starting in 1967 when a team traded up for a top-two pick and drafted a non-quarterback.\n\nPace was one of four Hall of Famers acquired that way with the other three all being running backs: Eric Dickerson (1983), Earl Campbell (1978) and Tony Dorsett (1977).\n\nSome of the other trades weren’t as successful, like Cincinnati moving up to take running back Ki-Jana Carter first in 1995, the Jets trading up for receiver Lam Jones in 1980 and the Vikings moving up for running back Clint Jones in 1967.\n\nOhio State and SEC top the draft lists\n\nWith the SEC setting a record with 79 players drafted and Ohio State having 14 of the 71 draft picks in the Big Ten, the two most prominent college football conferences dominated draft weekend.\n\nThanks to the first year of expansion that sent Texas and Oklahoma to the SEC, along with USC, UCLA, Oregon and Washington joining the Big Ten, those conferences accounted for 58% of all draft picks.\n\nThrow in the 42 picks for the ACC and 31 for the Big 12 and the four power conferences had nearly 87% of all draft picks this year, along with six more from Notre Dame.\n\nThe Group of Five had just 18 players drafted as many players who began their careers at that level have moved up to power conferences. There were only eight players chosen from non-FBS teams.\n\nThere were players who finished their college careers at 86 schools that got drafted, with the defending champion Buckeyes leading the way with 14 — one off of the record since the start of the seven-round draft era in 1994 set by Georgia in 2022.\n\nThe Bulldogs were next with 13, followed Texas with 12, Oregon with 10 and Ole Miss with eight. Five schools had seven players drafted: Alabama, Florida, LSU, Miami and Michigan.\n\nThis marked the 87th straight draft with a player from Michigan being taken. USC also has had a player taken in every draft since 1939, tying the Wolverines for the longest active streak.\n\nPosition breakdown\n\nThere was an even split of offensive and defensive players picked in the draft with 126 players from each side of the ball picked — not including the two-way player Hunter.\n\nThe other four players taken were specialists, including a rare long snapper drafted with Julian Ashby getting taken by New England with the 252nd pick.\n\nThe defensive line led the way with 58 players taken, according to Sportradar, followed by 47 exclusive defensive backs and 41 offensive linemen. There were 30 receivers drafted in addition to Hunter, along with 25 running backs, 21 linebackers, 16 tight ends and 14 QBs.\n\nThis marked just the fourth time in the common draft era that two tight ends were taken in they top 15, with Chicago taking Colston Loveland 10th and Indianapolis choosing Tyler Warren 14th.\n\nIt also happened in 1992 (Derek Brown and Johnny Mitchell), 1973 (Charlie Young and Paul Seymour) and 1972 (Riley Odoms and Jerome Barkum).\n\n___\n\nInside the Numbers dives into NFL statistics, streaks and trends each week. For more Inside the Numbers, head here.\n\n___\n\nAP NFL: https://apnews.com/hub/NFL",
    "clean_body": "shedeur sanders’ slide down the nfl draft was the dominant story of the weekend with one of college football’s most highprofile players lasting until the fifth round the fact sanders was taken by the browns two rounds after they drafted another quarterback in dillon gabriel made the entire situation even more rare the browns were the first team to draft two quarterbacks in the first five rounds of the nfl draft since washington did it in 2012 when the team traded up to take robert griffin iii with the secondoverall pick and then drafted kirk cousins in the fourth round there are only a handful of other times in the common draft era beginning in 1967 that a team picked two quarterbacks that high in the draft green bay drafted anthony dilweg in the third round and jeff graham in the fourth in 1989 the packers traded graham to washington later in the draft and he never played a game in the nfl despite spending time with several teams dilweg started seven games in 1990 the colts doubledipped at quarterback in 1982 taking art schlichter fourth overall and mike pagel in the fourth round schlichter played only 13 games because of gambling problems while pagel had a long career mostly as a backup the houston oilers also did it in 1971 taking dan pastorini in the first round and lynn dickey in the third both had long careers as starters in the nfl there were two other times it happened but one of those qbs quickly shifted positions to receiver once joining the nfl the jets took kellen clemens in the second round and brad smith in the fourth in 2006 clemens spent 12 seasons in the nfl mostly as a backup while smith had a successful career as a receiver returner and occasional wildcat quarterback the raiders took quarterbacks with their first two picks in 1968 but firstrounder eldrige dickey moved to receiver following his first training camp and had only five catches in his career secondrounder ken stabler went on to become the 1974 ap nfl mvp and had a hall of fame career as a quarterback trading up trading up for a toptwo pick in the nfl draft isn’t that uncommon with it happening five times in the last 13 drafts before this season doing it for a nonquarterback was rare the deal made by jacksonville with cleveland to move up from no 5 to no 2 to take travis hunter marked the first time since 1997 that a team traded up that high to draft a nonquarterback it happened twice in 1997 with the raiders trading up to no 2 that year before the rams jumped them two weeks later to trade for the no 1 pick the rams took hall of famer orlando pace and the raiders drafted darrell russell there hadn’t been a receiver taken in the top two since calvin johnson went second to detroit in 2007 and no defensive back had been taken that high since safety eric turner went second to cleveland in 1991 there were 12 other instances in the common draft era starting in 1967 when a team traded up for a toptwo pick and drafted a nonquarterback pace was one of four hall of famers acquired that way with the other three all being running backs eric dickerson 1983 earl campbell 1978 and tony dorsett 1977 some of the other trades weren’t as successful like cincinnati moving up to take running back kijana carter first in 1995 the jets trading up for receiver lam jones in 1980 and the vikings moving up for running back clint jones in 1967 ohio state and sec top the draft lists with the sec setting a record with 79 players drafted and ohio state having 14 of the 71 draft picks in the big ten the two most prominent college football conferences dominated draft weekend thanks to the first year of expansion that sent texas and oklahoma to the sec along with usc ucla oregon and washington joining the big ten those conferences accounted for 58 of all draft picks throw in the 42 picks for the acc and 31 for the big 12 and the four power conferences had nearly 87 of all draft picks this year along with six more from notre dame the group of five had just 18 players drafted as many players who began their careers at that level have moved up to power conferences there were only eight players chosen from nonfbs teams there were players who finished their college careers at 86 schools that got drafted with the defending champion buckeyes leading the way with 14 — one off of the record since the start of the sevenround draft era in 1994 set by georgia in 2022 the bulldogs were next with 13 followed texas with 12 oregon with 10 and ole miss with eight five schools had seven players drafted alabama florida lsu miami and michigan this marked the 87th straight draft with a player from michigan being taken usc also has had a player taken in every draft since 1939 tying the wolverines for the longest active streak position breakdown there was an even split of offensive and defensive players picked in the draft with 126 players from each side of the ball picked — not including the twoway player hunter the other four players taken were specialists including a rare long snapper drafted with julian ashby getting taken by new england with the 252nd pick the defensive line led the way with 58 players taken according to sportradar followed by 47 exclusive defensive backs and 41 offensive linemen there were 30 receivers drafted in addition to hunter along with 25 running backs 21 linebackers 16 tight ends and 14 qbs this marked just the fourth time in the common draft era that two tight ends were taken in they top 15 with chicago taking colston loveland 10th and indianapolis choosing tyler warren 14th it also happened in 1992 derek brown and johnny mitchell 1973 charlie young and paul seymour and 1972 riley odoms and jerome barkum inside the numbers dives into nfl statistics streaks and trends each week for more inside the numbers head here ap nfl httpsapnewscomhubnfl",
    "summary": "Shedeur Sanders’ slide down the NFL draft was the dominant story of the weekend with one of college football’s most high-profile players lasting until the fifth round.\nTrading upTrading up for a top-two pick in the NFL draft isn’t that uncommon with it happening five times in the last 13 drafts before this season.\n2 to take Travis Hunter marked the first time since 1997 that a team traded up that high to draft a non-quarterback.\nThe Group of Five had just 18 players drafted as many players who began their careers at that level have moved up to power conferences.\nThe defensive line led the way with 58 players taken, according to Sportradar, followed by 47 exclusive defensive backs and 41 offensive linemen.",
    "keywords": [
      "receiver",
      "dip",
      "taken",
      "qb",
      "rare",
      "players",
      "traded",
      "double",
      "running",
      "shedeur",
      "drafted",
      "draft",
      "leads",
      "sanders",
      "fourth",
      "nfl",
      "browns",
      "slide",
      "team"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/347e4a1/2147483647/strip/true/crop/4500x2531+0+234/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbd%2Fd8%2F40460da38940d64e879fddfc1357%2F31e646c1a53f448d993f181aacb24f23",
    "t": 13
  },
  "https://apnews.com/article/microsoft-earnings-0c9702a96b50e943b0ed48bca980630c": {
    "source": "AP News",
    "url": "https://apnews.com/article/microsoft-earnings-0c9702a96b50e943b0ed48bca980630c",
    "date": "2025-04-30",
    "time": "20:19:49",
    "title": "Microsoft says quarterly profits up 18% as it weathers tech sector turbulence with cloud growth",
    "body": "REDMOND, Wash. (AP) — Microsoft’s cloud computing and artificial intelligence business helped deliver $70.1 billion in sales and boosted profits by 18% for the January-March quarter, a dose of relief for investors during a turbulent time for the tech sector and U.S. economy.\n\nThe company reported quarterly net income of $25.8 billion, or $3.46 per share, beating Wall Street expectations for earnings of $3.22 a share.\n\nThe Redmond, Washington-based software maker posted revenue of $70.1 billion in the period, its third fiscal quarter, up 13% from the same period a year ago and also beating Wall Street expectations. Analysts polled by FactSet expected Microsoft to post revenue of $68.44 billion for the quarter.\n\nMicrosoft CEO Satya Nadella credited cloud growth for its strong quarter. The company’s cloud unit posted revenue of $26.8 billion, compared with expectations of $26.17 billion.\n\n“Cloud and AI are the essential inputs for every business to expand output, reduce costs, and accelerate growth,” Nadella said in a statement.\n\nThe company also saw a 6% increase in revenue in its personal computing unit, which includes its laptop business and Xbox services.\n\nNadella noted on a call with investors that demand for cloud and artificial intelligence remained strong. He said Microsoft is constantly tweaking its investments based on efficiency improvements in computing systems and what kind of services customers want.\n\n“We just want to make sure we are accounting for the latest and greatest information,” he said.\n\nMicrosoft is among a group of the tech industry’s bellwether companies that have been through a period of uncertainty and turmoil since President Donald Trump returned to the White House, with a see-sawing of stocks that has eviscerated trillions of dollars in shareholder wealth amid an onslaught of tariffs and other actions.\n\nMicrosoft’s stock price has dropped nearly 8% since Trump’s inauguration in January, to about $395 at the close of markets Wednesday. But investors appeared pleased moments later after Microsoft released its earnings report, sending stocks up more than 6% in after-hours trading.\n\nRevenue from Microsoft’s cloud computing business segment grew 21%, to $26.8 billion, also beating Wall Street projections.\n\nThe company felt more tariff uncertainty in its personal computing business, which is centered around its Windows operating system and the fees it collects from computer makers that put it on the hardware they sell. Revenue from that business was $13.4 billion for the quarter, up 6% from the first three months of last year.",
    "clean_body": "redmond wash ap — microsoft’s cloud computing and artificial intelligence business helped deliver 701 billion in sales and boosted profits by 18 for the januarymarch quarter a dose of relief for investors during a turbulent time for the tech sector and us economy the company reported quarterly net income of 258 billion or 346 per share beating wall street expectations for earnings of 322 a share the redmond washingtonbased software maker posted revenue of 701 billion in the period its third fiscal quarter up 13 from the same period a year ago and also beating wall street expectations analysts polled by factset expected microsoft to post revenue of 6844 billion for the quarter microsoft ceo satya nadella credited cloud growth for its strong quarter the company’s cloud unit posted revenue of 268 billion compared with expectations of 2617 billion “cloud and ai are the essential inputs for every business to expand output reduce costs and accelerate growth” nadella said in a statement the company also saw a 6 increase in revenue in its personal computing unit which includes its laptop business and xbox services nadella noted on a call with investors that demand for cloud and artificial intelligence remained strong he said microsoft is constantly tweaking its investments based on efficiency improvements in computing systems and what kind of services customers want “we just want to make sure we are accounting for the latest and greatest information” he said microsoft is among a group of the tech industry’s bellwether companies that have been through a period of uncertainty and turmoil since president donald trump returned to the white house with a seesawing of stocks that has eviscerated trillions of dollars in shareholder wealth amid an onslaught of tariffs and other actions microsoft’s stock price has dropped nearly 8 since trump’s inauguration in january to about 395 at the close of markets wednesday but investors appeared pleased moments later after microsoft released its earnings report sending stocks up more than 6 in afterhours trading revenue from microsoft’s cloud computing business segment grew 21 to 268 billion also beating wall street projections the company felt more tariff uncertainty in its personal computing business which is centered around its windows operating system and the fees it collects from computer makers that put it on the hardware they sell revenue from that business was 134 billion for the quarter up 6 from the first three months of last year",
    "summary": "The company reported quarterly net income of $25.8 billion, or $3.46 per share, beating Wall Street expectations for earnings of $3.22 a share.\nAnalysts polled by FactSet expected Microsoft to post revenue of $68.44 billion for the quarter.\nMicrosoft CEO Satya Nadella credited cloud growth for its strong quarter.\nRevenue from Microsoft’s cloud computing business segment grew 21%, to $26.8 billion, also beating Wall Street projections.\nRevenue from that business was $13.4 billion for the quarter, up 6% from the first three months of last year.",
    "keywords": [
      "street",
      "18",
      "computing",
      "billion",
      "microsoft",
      "quarter",
      "sector",
      "revenue",
      "quarterly",
      "growth",
      "weathers",
      "profits",
      "turbulence",
      "cloud",
      "business",
      "wall",
      "period",
      "tech"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/f9c0720/2147483647/strip/true/crop/3600x2025+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F20%2F3e77584a5cd691d5b7f2b8e46e94%2Fbe0badc1b00249e193a166f3b87358e6",
    "t": 12
  },
  "https://apnews.com/article/tigres-orioles-643e2a52bdcb9036d701ebca25eea84a": {
    "source": "AP News",
    "url": "https://apnews.com/article/tigres-orioles-643e2a52bdcb9036d701ebca25eea84a",
    "date": "2025-04-26",
    "time": "20:42:28",
    "title": "HR de 3 carreras de Greene ante Morton ayuda a Tigres a barrer doble cartelera ante Orioles",
    "body": "DETROIT (AP) — Riley Greene conectó un jonrón de tres carreras en el segundo juego que ayudó a Charlie Morton a su sexta derrota consecutiva, y los Tigres de Detroit barrieron el sábado 4-3 y 6-2 a los Orioles de Baltimore.\n\nDespués de que un doble productor de Gunnar Henderson ante Keider Montero puso a Baltimore adelante en el tercero, pero el jardinero izquierdo Zach McKinstry evitó una segunda carrera al sacar a Cedric Mullins en el plato.\n\nGreene conectó su cuarto jonrón de la temporada en la parte baja con una recta de Morton (0-6), quien reemplazó a Keegan Akin en la segunda entrada y permitió tres carreras, tres hits y cinco bases por bolas en 3 2/3 entradas. Morton lidera las Grandes Ligas en derrotas.\n\nDetroit tiene marca de 7-2 en su estadía en casa.\n\nBaltimore ha perdido cinco de seis y cayó a 1-4 en su gira.\n\nEn el primero de la doble cartelera Spencer Torkelson conectó su octavo jonrón, el puertorriqueño Javier Báez disparó tres hits desde el noveno puesto en el orden al bate.\n\nEn el primero de la doble cartelera, por los Orioles, el mexicano Ramón Urías de 4-3, una anotada y una impulsada.\n\nPor los Tigres, Báez de 4-3, una remolcada. Torres de 4-0, una empujada.\n\nEn el segundo de la doble cartelera, por los Orioles, el dominicano Ramón Laureano de 1-0 con una producida.",
    "clean_body": "detroit ap — riley greene conectó un jonrón de tres carreras en el segundo juego que ayudó a charlie morton a su sexta derrota consecutiva y los tigres de detroit barrieron el sábado 43 y 62 a los orioles de baltimore después de que un doble productor de gunnar henderson ante keider montero puso a baltimore adelante en el tercero pero el jardinero izquierdo zach mckinstry evitó una segunda carrera al sacar a cedric mullins en el plato greene conectó su cuarto jonrón de la temporada en la parte baja con una recta de morton 06 quien reemplazó a keegan akin en la segunda entrada y permitió tres carreras tres hits y cinco bases por bolas en 3 23 entradas morton lidera las grandes ligas en derrotas detroit tiene marca de 72 en su estadía en casa baltimore ha perdido cinco de seis y cayó a 14 en su gira en el primero de la doble cartelera spencer torkelson conectó su octavo jonrón el puertorriqueño javier báez disparó tres hits desde el noveno puesto en el orden al bate en el primero de la doble cartelera por los orioles el mexicano ramón urías de 43 una anotada y una impulsada por los tigres báez de 43 una remolcada torres de 40 una empujada en el segundo de la doble cartelera por los orioles el dominicano ramón laureano de 10 con una producida",
    "summary": "Después de que un doble productor de Gunnar Henderson ante Keider Montero puso a Baltimore adelante en el tercero, pero el jardinero izquierdo Zach McKinstry evitó una segunda carrera al sacar a Cedric Mullins en el plato.\nDetroit tiene marca de 7-2 en su estadía en casa.\nEn el primero de la doble cartelera Spencer Torkelson conectó su octavo jonrón, el puertorriqueño Javier Báez disparó tres hits desde el noveno puesto en el orden al bate.\nEn el primero de la doble cartelera, por los Orioles, el mexicano Ramón Urías de 4-3, una anotada y una impulsada.\nEn el segundo de la doble cartelera, por los Orioles, el dominicano Ramón Laureano de 1-0 con una producida.",
    "keywords": [
      "greene",
      "carreras",
      "por",
      "una",
      "los",
      "el",
      "ante",
      "tigres",
      "orioles",
      "tres",
      "barrer",
      "cartelera",
      "morton",
      "y",
      "en",
      "su",
      "la",
      "hr",
      "doble"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/96bc3e4/2147483647/strip/true/crop/3189x1794+0+159/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2Ffb%2F9fe25fb8afaf18374aaaddcff196%2F5128f8c922f5454d86eded7f53d74dd7",
    "t": 16
  },
  "https://apnews.com/article/sinners-cinematographer-2e0c37c4df691228386294c280efc0fc": {
    "source": "AP News",
    "url": "https://apnews.com/article/sinners-cinematographer-2e0c37c4df691228386294c280efc0fc",
    "date": "2025-04-18",
    "time": "13:34:57",
    "title": "‘Sinners,’ shot on IMAX film, is a historic first for female cinematographers",
    "body": "Cinematographer Autumn Durald Arkapaw didn’t realize she was going to make history on “Sinners.” The Ryan Coogler film, now playing in theaters nationwide, marks the first time a female director of photography has shot a movie on large format IMAX film.\n\nIt was Kodak executive Vanessa Bendetti who texted her the news.\n\n“I smiled at the thought,” Arkapaw said in a recent interview. “I felt very proud that Ryan gave me the opportunity.”\n\nThe format, a favorite of filmmakers like Christopher Nolan, has gained popularity in recent years — not just with directors but with moviegoers seeking it out as well. Coogler hadn’t originally sought it out for “Sinners” (he had planned on using 16 mm) until Warner Bros. executive Jesse Ehrman asked him if he’d considered large format, which gives moviegoers more resolution and a shallower depth of field.\n\n“Just from an exhibition sense in this day and age with folks having so much access to streaming and watching so many things on their phones, it’s nice to have a format like IMAX that can be an experience you can only experience in the theaters,” Coogler told The Associated Press.\n\nCoogler and Arkapaw then began a testing process, looking at 70 mm IMAX prints of films like “2001: A Space Odyssey,” “The Hateful Eight” and “Tenet” and consulting with Nolan and his regular cinematographer Hoyte van Hoytema. Coogler quickly fell in love with the format and felt it was fitting for the larger-than-life, genre-bending film about vampires, the blues and life in the Jim Crow south in 1932.\n\n“I wasn’t surprised that we were exploring large format,” Arkapaw said. “We shot ‘Wakanda Forever’ on IMAX, but that was digital. We always talked about true IMAX being ... something that you see and you fall in love with.”\n\nHer conversation with Hoytema made her even more excited. The Oscar-winning “Oppenheimer” cinematographer told her not to worry about the size or weight of the equipment and to shoot the movie as she would with any other kind of camera.\n\n“Hearing that straight off was inspiring and encouraging and we took that advice and just told our story,” Arkapaw said. “It was very freeing.”\n\nIn the end, they decided to employ a combination of IMAX film and Ultra Panavision 70, an even rarer format that Quentin Tarantino resurrected for “The Hateful Eight.” This means different scenes have different aspect ratios, which Coogler himself broke down in a video explainer for Kodak.\n\n“We’re using these two formats for the very first time,” Coogler said. “It really complements the story, it really complements the setting and it really complements the filmmaking.”\n\nOne of Arkapaw’s favorite scenes was one they weren’t even initially going to do on IMAX film because it was dialogue heavy and the cameras are notoriously noisy. But if her work on “Wakanda” taught her anything about Coogler, it’s that he’s always looking to push boundaries.\n\nThe scene is the introduction to Jack O’Connell’s Irish vampire Remmick and the Choctaw trying to hunt him down, which they shot like a Western as the sun sets in the distance.\n\n“We had a lot of beautiful crane work in that and some intimate stuff. Ryan loves a hallway, so there’s a Steadicam shot inside. It’s very eerie,” she said. “I can’t see that scene in any other format now.”\n\nWith “Sinners” out now, the hope is that audiences will seek out the special formats where they can, whether it’s IMAX film or digital.\n\n“We want to bring people back to the cinema, get back to theaters,” “Sinners” star Michael B. Jordan said. “I think this is a movie that’s meant to give for the moviegoing experience…it takes you on a ride.”\n\nThe profession has come a long way since Arkapaw started exploring cinematography as a career path. It wasn’t too long ago that she said she struggled to find many women cinematographers besides Ellen Kuras (“Eternal Sunshine of the Spotless Mind”). And while there are more than there were 20 years ago, there are still barriers to be broken, including an Oscar win. Only three have been nominated: Rachel Morrison (who worked with Coogler on “Fruitvale Station” and “Black Panther”) was the first for “Mudbound,” in 2018, followed by Ari Wegner for “The Power of the Dog” and Mandy Walker for “Elvis.”\n\nArkapaw takes the significance of her landmark seriously.\n\n“I heard a phrase that said you need to see you to be you,” she said. “I think for us females in business, the more women are able to shoot on large format, it will inspire the younger girls who maybe don’t think that they can get there.”",
    "clean_body": "cinematographer autumn durald arkapaw didn’t realize she was going to make history on “sinners” the ryan coogler film now playing in theaters nationwide marks the first time a female director of photography has shot a movie on large format imax film it was kodak executive vanessa bendetti who texted her the news “i smiled at the thought” arkapaw said in a recent interview “i felt very proud that ryan gave me the opportunity” the format a favorite of filmmakers like christopher nolan has gained popularity in recent years — not just with directors but with moviegoers seeking it out as well coogler hadn’t originally sought it out for “sinners” he had planned on using 16 mm until warner bros executive jesse ehrman asked him if he’d considered large format which gives moviegoers more resolution and a shallower depth of field “just from an exhibition sense in this day and age with folks having so much access to streaming and watching so many things on their phones it’s nice to have a format like imax that can be an experience you can only experience in the theaters” coogler told the associated press coogler and arkapaw then began a testing process looking at 70 mm imax prints of films like “2001 a space odyssey” “the hateful eight” and “tenet” and consulting with nolan and his regular cinematographer hoyte van hoytema coogler quickly fell in love with the format and felt it was fitting for the largerthanlife genrebending film about vampires the blues and life in the jim crow south in 1932 “i wasn’t surprised that we were exploring large format” arkapaw said “we shot ‘wakanda forever’ on imax but that was digital we always talked about true imax being something that you see and you fall in love with” her conversation with hoytema made her even more excited the oscarwinning “oppenheimer” cinematographer told her not to worry about the size or weight of the equipment and to shoot the movie as she would with any other kind of camera “hearing that straight off was inspiring and encouraging and we took that advice and just told our story” arkapaw said “it was very freeing” in the end they decided to employ a combination of imax film and ultra panavision 70 an even rarer format that quentin tarantino resurrected for “the hateful eight” this means different scenes have different aspect ratios which coogler himself broke down in a video explainer for kodak “we’re using these two formats for the very first time” coogler said “it really complements the story it really complements the setting and it really complements the filmmaking” one of arkapaw’s favorite scenes was one they weren’t even initially going to do on imax film because it was dialogue heavy and the cameras are notoriously noisy but if her work on “wakanda” taught her anything about coogler it’s that he’s always looking to push boundaries the scene is the introduction to jack o’connell’s irish vampire remmick and the choctaw trying to hunt him down which they shot like a western as the sun sets in the distance “we had a lot of beautiful crane work in that and some intimate stuff ryan loves a hallway so there’s a steadicam shot inside it’s very eerie” she said “i can’t see that scene in any other format now” with “sinners” out now the hope is that audiences will seek out the special formats where they can whether it’s imax film or digital “we want to bring people back to the cinema get back to theaters” “sinners” star michael b jordan said “i think this is a movie that’s meant to give for the moviegoing experience…it takes you on a ride” the profession has come a long way since arkapaw started exploring cinematography as a career path it wasn’t too long ago that she said she struggled to find many women cinematographers besides ellen kuras “eternal sunshine of the spotless mind” and while there are more than there were 20 years ago there are still barriers to be broken including an oscar win only three have been nominated rachel morrison who worked with coogler on “fruitvale station” and “black panther” was the first for “mudbound” in 2018 followed by ari wegner for “the power of the dog” and mandy walker for “elvis” arkapaw takes the significance of her landmark seriously “i heard a phrase that said you need to see you to be you” she said “i think for us females in business the more women are able to shoot on large format it will inspire the younger girls who maybe don’t think that they can get there”",
    "summary": "Cinematographer Autumn Durald Arkapaw didn’t realize she was going to make history on “Sinners.” The Ryan Coogler film, now playing in theaters nationwide, marks the first time a female director of photography has shot a movie on large format IMAX film.\n“I wasn’t surprised that we were exploring large format,” Arkapaw said.\n“We shot ‘Wakanda Forever’ on IMAX, but that was digital.\n“I can’t see that scene in any other format now.”With “Sinners” out now, the hope is that audiences will seek out the special formats where they can, whether it’s IMAX film or digital.\n“We want to bring people back to the cinema, get back to theaters,” “Sinners” star Michael B. Jordan said.",
    "keywords": [
      "coogler",
      "cinematographers",
      "shot",
      "large",
      "told",
      "female",
      "imax",
      "think",
      "arkapaw",
      "format",
      "sinners",
      "historic",
      "film"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/526dc58/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F34%2F5f%2Ff062903b1b02e1746f10c1819462%2F1d818047c62240f7bdc9bf70861fd828",
    "t": 24
  },
  "https://apnews.com/article/sharks-nhl-b06ac60b454987c2c47798e681055e00": {
    "source": "AP News",
    "url": "https://apnews.com/article/sharks-nhl-b06ac60b454987c2c47798e681055e00",
    "date": "2025-04-18",
    "time": "19:49:19",
    "title": "The Sharks look to a brighter future after 2nd straight season with the NHL’s worst record",
    "body": "SAN JOSE, Calif. (AP) — The end result wasn’t much different for the San Jose Sharks with a second straight season finishing at the bottom of the NHL standings.\n\nThe way they got there with promising play from a young core led by talented rookies Macklin Celebrini and Will Smith and far more competitive play on the ice offers hope that one of the four franchises to miss the playoffs each of the last six seasons is not far off from getting back to playoff contention.\n\n“It was a step forward,” general manager Mike Grier said Friday. “It was disappointing to still finish the season where we did. It’s still a wins and loss league at the end of the day. To some degree you are what your record says you are. That’s the kind of frustrating, disappointing piece of it all because I think the group played better. Definitely more competitive and everything. But there’s still a long ways to go.”\n\nThe Sharks finished the season 20-50-12 for a league-low 52 points — five more than last season — as they became the first team in 10 years to lose at least 50 games in regulation in back-to-back seasons.\n\nThe team improved its goal differential by 44 goals from the previous season but still finished last in the NHL in both goals scored and goals allowed.\n\n“It was a season of frustration,” first-year coach Ryan Warsofsky said. “I think there’s some growth individually and as a group. But obviously we have a lot of work to do.”\n\nGrier said the priority this offseason will be improving defensively, with the hope that the team can be better at protecting leads.\n\nThe Sharks lost 10 times in regulation this season after holding a lead in the third period — no other team in the league had more than four — and had five more losses in overtime or shootouts after leading in the third.\n\nTheir eight regulation losses this season when leading at the end of the second period were the most for any team in eight years and tied for the most in the NHL in any season since at least 1970-71.\n\n“It’s a fine line between winning and losing in this league,” Warsofsky said. “It’s usually one play here or there or two plays, a save here or there and that’s the game. We saw that this year. Our players saw that this year. We’ll see that in the playoffs this year. ... I’m glad we went through those. At the time, it was tough. But hopefully everything happens for a reason and we can learn from those.”\n\nWarsofsky attributes some of those issues to the youth of the team, which is also the biggest selling point for improvement next season.\n\nCelebrini, the first pick of last year’s draft, had a sensational season as an 18-year-old, leading all rookies with 25 goals, ranking second with 63 points and playing as a top-line center often against the opponent’s best players.\n\nCelebrini talked about wanting to cut down on his turnovers and Warsofsky said knowing when to take chances will come with more experience.\n\n“I can’t say enough great things about this kid,” Warsofsky said. “The way he works, the way he competes to how driven he is, his natural leadership ability. He’s a winner through and through. He’s going to help this organization win hockey games very, very soon and he already has. There’s some things that every player needs to work on. Mac really drags guys into the fight, the way he competes. We’re very, very happy with his season.”\n\nSmith, the fourth overall pick in 2023, also showed promise as a rookie with 18 goals and 45 points, playing his best at the end of the season.\n\nThe Sharks got contributions from several other young players including William Eklund, Shakir Mukhamadullin, Collin Graf and Henry Thrun and are hoping that Yaroslav Askarov can seize the job as No. 1 goalie next season.\n\nWith several more young prospects in the pipeline and two first-round picks — including one in the top three — there is reason for optimism, especially if the Sharks can use their cap room to add a few key veterans this offseason.\n\n“I think around the league, people see we have some really, really good young players and they’re coming and they’re coming quick,” Warsofsky said. “We have great people in this organization. I think that there’s a light at the end of the tunnel that this team is on the up and up.”\n\n___\n\nAP NHL: https://apnews.com/NHL",
    "clean_body": "san jose calif ap — the end result wasn’t much different for the san jose sharks with a second straight season finishing at the bottom of the nhl standings the way they got there with promising play from a young core led by talented rookies macklin celebrini and will smith and far more competitive play on the ice offers hope that one of the four franchises to miss the playoffs each of the last six seasons is not far off from getting back to playoff contention “it was a step forward” general manager mike grier said friday “it was disappointing to still finish the season where we did it’s still a wins and loss league at the end of the day to some degree you are what your record says you are that’s the kind of frustrating disappointing piece of it all because i think the group played better definitely more competitive and everything but there’s still a long ways to go” the sharks finished the season 205012 for a leaguelow 52 points — five more than last season — as they became the first team in 10 years to lose at least 50 games in regulation in backtoback seasons the team improved its goal differential by 44 goals from the previous season but still finished last in the nhl in both goals scored and goals allowed “it was a season of frustration” firstyear coach ryan warsofsky said “i think there’s some growth individually and as a group but obviously we have a lot of work to do” grier said the priority this offseason will be improving defensively with the hope that the team can be better at protecting leads the sharks lost 10 times in regulation this season after holding a lead in the third period — no other team in the league had more than four — and had five more losses in overtime or shootouts after leading in the third their eight regulation losses this season when leading at the end of the second period were the most for any team in eight years and tied for the most in the nhl in any season since at least 197071 “it’s a fine line between winning and losing in this league” warsofsky said “it’s usually one play here or there or two plays a save here or there and that’s the game we saw that this year our players saw that this year we’ll see that in the playoffs this year i’m glad we went through those at the time it was tough but hopefully everything happens for a reason and we can learn from those” warsofsky attributes some of those issues to the youth of the team which is also the biggest selling point for improvement next season celebrini the first pick of last year’s draft had a sensational season as an 18yearold leading all rookies with 25 goals ranking second with 63 points and playing as a topline center often against the opponent’s best players celebrini talked about wanting to cut down on his turnovers and warsofsky said knowing when to take chances will come with more experience “i can’t say enough great things about this kid” warsofsky said “the way he works the way he competes to how driven he is his natural leadership ability he’s a winner through and through he’s going to help this organization win hockey games very very soon and he already has there’s some things that every player needs to work on mac really drags guys into the fight the way he competes we’re very very happy with his season” smith the fourth overall pick in 2023 also showed promise as a rookie with 18 goals and 45 points playing his best at the end of the season the sharks got contributions from several other young players including william eklund shakir mukhamadullin collin graf and henry thrun and are hoping that yaroslav askarov can seize the job as no 1 goalie next season with several more young prospects in the pipeline and two firstround picks — including one in the top three — there is reason for optimism especially if the sharks can use their cap room to add a few key veterans this offseason “i think around the league people see we have some really really good young players and they’re coming and they’re coming quick” warsofsky said “we have great people in this organization i think that there’s a light at the end of the tunnel that this team is on the up and up” ap nhl httpsapnewscomnhl",
    "summary": "SAN JOSE, Calif. (AP) — The end result wasn’t much different for the San Jose Sharks with a second straight season finishing at the bottom of the NHL standings.\nThat’s the kind of frustrating, disappointing piece of it all because I think the group played better.\nThe team improved its goal differential by 44 goals from the previous season but still finished last in the NHL in both goals scored and goals allowed.\n“I think there’s some growth individually and as a group.\nI think that there’s a light at the end of the tunnel that this team is on the up and up.”___AP NHL: https://apnews.com/NHL",
    "keywords": [
      "sharks",
      "theres",
      "record",
      "warsofsky",
      "end",
      "think",
      "straight",
      "look",
      "goals",
      "future",
      "young",
      "season",
      "worst",
      "nhls",
      "team",
      "brighter",
      "way",
      "2nd"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/a33c4bd/2147483647/strip/true/crop/3888x2187+0+203/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2F3b%2F1bab6360c9ccbc0ce305951e71b5%2Fb4b7390f4ef0401c893ec789a8122d54",
    "t": 24
  },
  "https://apnews.com/article/stan-love-52ec73b6e140efa5b09f60478b705fc6": {
    "source": "AP News",
    "url": "https://apnews.com/article/stan-love-52ec73b6e140efa5b09f60478b705fc6",
    "date": "2025-04-28",
    "time": "06:23:25",
    "title": "Stan Love, brother of Beach Boys’ Mike Love and father of Heat’s Kevin Love, dies at 76",
    "body": "MIAMI (AP) — Former NBA player Stan Love, the brother of Beach Boys singer Mike Love and the father of Miami Heat player Kevin Love, has died. He was 76.\n\nKevin Love announced his father’s death in an Instagram post Sunday night. No cause was given, but he referenced longstanding health issues in the post.\n\n“Dad, you fought for a long time,” Kevin posted. “The hardest stretch being these past 6 months. The most painful to witness being these last few weeks. And even at the end as you continued to deteriorate — I still saw you as a Giant. My Protector. My first Hero.”\n\nHe went on to write, “Dad, I’m so proud to be your son. My only hope is that you’re proud of me. It was all I ever wanted. Thank you for everything.”\n\nStan Love was a 6-foot-9 forward who starred at Morningside High School in Inglewood, California, and at Oregon before he was selected ninth overall by Baltimore in the 1971 NBA draft.\n\nHe averaged 6.8 points and 4.0 rebounds in 226 games in four seasons with the Bullets and the Los Angeles Lakers. He also played 12 games for San Antonio in the American Basketball Association.\n\nMike Love posted, “My big younger brother, you called me the superstar, but to me you are the superstar!! You always had my back! I am blessed to be your brother. I will cherish our lives spent together, whether spoofing on each other or reliving memories. I know you’re on the big court now, pounding down 3’s; don’t foul out, bro.”\n\nStan Love introduced Kevin to basketball after the family moved from California to Oregon in the 1980s. He often attended UCLA games along with Mike Love when Kevin starred for the Bruins as a freshman in 2007-08.\n\n“He’d always tell me stories about Wes Unseld, Connie Hawkins, Jerry West,” the younger Love told The Associated Press in 2008. “I wanted to be the greatest basketball player of all time, like every little kid wanted to be.”\n\nThe elder Love focused his hard-nosed development efforts on Kevin, his middle child and second son. Some days, Kevin would be outside in the rain at their Lake Oswego, Oregon, home shooting jumper after jumper.\n\n“My hands would be all dirty, I’d come in and make the floor all muddy,” Love told AP. “Once he saw I was a self-starter, then he kind of backed off.”\n\nBesides Kevin, the elder Love is survived by wife Karen, son Collin and daughter Emily.\n\nKevin Love has been away from Heat because of personal reasons and will not play in Game 4 against Cleveland on Monday night.\n\n___\n\nAP NBA: https://apnews.com/hub/nba",
    "clean_body": "miami ap — former nba player stan love the brother of beach boys singer mike love and the father of miami heat player kevin love has died he was 76 kevin love announced his father’s death in an instagram post sunday night no cause was given but he referenced longstanding health issues in the post “dad you fought for a long time” kevin posted “the hardest stretch being these past 6 months the most painful to witness being these last few weeks and even at the end as you continued to deteriorate — i still saw you as a giant my protector my first hero” he went on to write “dad i’m so proud to be your son my only hope is that you’re proud of me it was all i ever wanted thank you for everything” stan love was a 6foot9 forward who starred at morningside high school in inglewood california and at oregon before he was selected ninth overall by baltimore in the 1971 nba draft he averaged 68 points and 40 rebounds in 226 games in four seasons with the bullets and the los angeles lakers he also played 12 games for san antonio in the american basketball association mike love posted “my big younger brother you called me the superstar but to me you are the superstar you always had my back i am blessed to be your brother i will cherish our lives spent together whether spoofing on each other or reliving memories i know you’re on the big court now pounding down 3’s don’t foul out bro” stan love introduced kevin to basketball after the family moved from california to oregon in the 1980s he often attended ucla games along with mike love when kevin starred for the bruins as a freshman in 200708 “he’d always tell me stories about wes unseld connie hawkins jerry west” the younger love told the associated press in 2008 “i wanted to be the greatest basketball player of all time like every little kid wanted to be” the elder love focused his hardnosed development efforts on kevin his middle child and second son some days kevin would be outside in the rain at their lake oswego oregon home shooting jumper after jumper “my hands would be all dirty i’d come in and make the floor all muddy” love told ap “once he saw i was a selfstarter then he kind of backed off” besides kevin the elder love is survived by wife karen son collin and daughter emily kevin love has been away from heat because of personal reasons and will not play in game 4 against cleveland on monday night ap nba httpsapnewscomhubnba",
    "summary": "MIAMI (AP) — Former NBA player Stan Love, the brother of Beach Boys singer Mike Love and the father of Miami Heat player Kevin Love, has died.\nKevin Love announced his father’s death in an Instagram post Sunday night.\nMike Love posted, “My big younger brother, you called me the superstar, but to me you are the superstar!!\nHe often attended UCLA games along with Mike Love when Kevin starred for the Bruins as a freshman in 2007-08.\nKevin Love has been away from Heat because of personal reasons and will not play in Game 4 against Cleveland on Monday night.",
    "keywords": [
      "heats",
      "wanted",
      "player",
      "beach",
      "oregon",
      "dies",
      "brother",
      "son",
      "mike",
      "stan",
      "boys",
      "love",
      "nba",
      "father",
      "basketball",
      "games",
      "kevin"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/bd1a999/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc8%2F49%2F1d0b19704ca6738ef49922621b1f%2Fce3ae4b5111543a0b92aa42a191d4730",
    "t": 14
  },
  "https://apnews.com/article/knicks-pistons-cunningham-ffc451dd42f57ba0e850b56ccb01e03a": {
    "source": "AP News",
    "url": "https://apnews.com/article/knicks-pistons-cunningham-ffc451dd42f57ba0e850b56ccb01e03a",
    "date": "2025-04-27",
    "time": "21:38:08",
    "title": "Pistons star Cade Cunningham tries to stay upbeat after ugly finish to Game 4 loss to Knicks",
    "body": "DETROIT (AP) — Cade Cunningham had exactly what he wanted.\n\nWith seven seconds left and his Detroit Pistons trailing the New York Knicks 94-93 in Game 4, Cunningham was looking at a wide-open 15-footer from the middle of the floor.\n\n“I got a shot I loved,” he said. “It was a shot that feels like muscle memory for me.”\n\nIf he hit it, the Pistons were going back to New York with the series tied at 2 and Jalen Brunson likely dealing with a sore right leg.\n\nInstead, Cunningham missed and Detroit is facing elimination after losing both games at home.\n\n“We want to win, so there’s disappointment,” he said. “But I’m not disheartened. I’m looking forward to getting to the next game.”\n\nThe most emotion Cunningham showed at his locker came when he asked about Detroit’s second shot on the last possession. After he missed, the rebound came out to Tim Hardaway Jr. on the left baseline.\n\nHe also missed, but only after contact with Josh Hart. Hardaway and Cunningham agreed that it should have been a foul. Even the officials concurred.\n\n“You saw it,” Hardaway said. “It was blatant.”\n\nFor Cunningham, it was another frustrating moment in a series where he has struggled to get to the free-throw line.\n\n“It’s nothing different than what we’ve seen before,” he said. “I want to say it was a surprise, because it was a foul, but I’m not surprised.”\n\nThe Pistons had an unexpected ally in disputing the call.\n\n“During live play, it was judged that Josh Hart made a legal defensive play,” crew chief David Guthrie told a pool reporter after the game. “After postgame review, we observed that Hart makes body contact that is more than marginal to Hardaway Jr. and a foul should have been called.”\n\nCunningham missed a 15-footer with 1:07 to play, then turned the ball over with 37 seconds to go.\n\n“Cade has to carry us a lot on the offensive end of the floor,” Pistons coach J.B. Bickerstaff said. “He has come through for us over and over again.”\n\nThat made for an ugly finish to a historic game for Cunningham. He finished with 25 points, 10 assists and 10 rebounds — just the third playoff triple-double in franchise history. The first two belonged to Isiah Thomas in 1986 and 1989.\n\nHe had only six points in the first half but put up 19 points, nine rebounds and seven assists as Detroit rallied in the second half.\n\n“Cunningham — that’s a great player,” Knicks coach Tom Thibodeau said. “You need your whole team tied together on that and you got to try to make him work.”\n\nCunningham is averaging 25.8 points, 9.0 assists and 8.8 rebounds in his first playoff series, with at least one game to go.\n\n“This has been a lot of fun,” he said. “It’s amazing to still be playing basketball at this time of the year.”\n\n___\n\nAP NBA: https://apnews.com/hub/nba",
    "clean_body": "detroit ap — cade cunningham had exactly what he wanted with seven seconds left and his detroit pistons trailing the new york knicks 9493 in game 4 cunningham was looking at a wideopen 15footer from the middle of the floor “i got a shot i loved” he said “it was a shot that feels like muscle memory for me” if he hit it the pistons were going back to new york with the series tied at 2 and jalen brunson likely dealing with a sore right leg instead cunningham missed and detroit is facing elimination after losing both games at home “we want to win so there’s disappointment” he said “but i’m not disheartened i’m looking forward to getting to the next game” the most emotion cunningham showed at his locker came when he asked about detroit’s second shot on the last possession after he missed the rebound came out to tim hardaway jr on the left baseline he also missed but only after contact with josh hart hardaway and cunningham agreed that it should have been a foul even the officials concurred “you saw it” hardaway said “it was blatant” for cunningham it was another frustrating moment in a series where he has struggled to get to the freethrow line “it’s nothing different than what we’ve seen before” he said “i want to say it was a surprise because it was a foul but i’m not surprised” the pistons had an unexpected ally in disputing the call “during live play it was judged that josh hart made a legal defensive play” crew chief david guthrie told a pool reporter after the game “after postgame review we observed that hart makes body contact that is more than marginal to hardaway jr and a foul should have been called” cunningham missed a 15footer with 107 to play then turned the ball over with 37 seconds to go “cade has to carry us a lot on the offensive end of the floor” pistons coach jb bickerstaff said “he has come through for us over and over again” that made for an ugly finish to a historic game for cunningham he finished with 25 points 10 assists and 10 rebounds — just the third playoff tripledouble in franchise history the first two belonged to isiah thomas in 1986 and 1989 he had only six points in the first half but put up 19 points nine rebounds and seven assists as detroit rallied in the second half “cunningham — that’s a great player” knicks coach tom thibodeau said “you need your whole team tied together on that and you got to try to make him work” cunningham is averaging 258 points 90 assists and 88 rebounds in his first playoff series with at least one game to go “this has been a lot of fun” he said “it’s amazing to still be playing basketball at this time of the year” ap nba httpsapnewscomhubnba",
    "summary": "DETROIT (AP) — Cade Cunningham had exactly what he wanted.\nWith seven seconds left and his Detroit Pistons trailing the New York Knicks 94-93 in Game 4, Cunningham was looking at a wide-open 15-footer from the middle of the floor.\nInstead, Cunningham missed and Detroit is facing elimination after losing both games at home.\n“Cade has to carry us a lot on the offensive end of the floor,” Pistons coach J.B. Bickerstaff said.\n“He has come through for us over and over again.”That made for an ugly finish to a historic game for Cunningham.",
    "keywords": [
      "cunningham",
      "points",
      "upbeat",
      "stay",
      "detroit",
      "shot",
      "finish",
      "hardaway",
      "series",
      "missed",
      "star",
      "ugly",
      "tries",
      "game",
      "knicks",
      "pistons",
      "loss",
      "rebounds"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/9eb54a0/2147483647/strip/true/crop/3350x1884+0+224/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff3%2F51%2Fa5aa157758b6c38f92130918b30a%2F741f702548134c0ebd8b21cd9ff49b10",
    "t": 15
  },
  "https://apnews.com/article/phillies-cardinals-score-161fc9ef762067680ca3a36bab268afe": {
    "source": "AP News",
    "url": "https://apnews.com/article/phillies-cardinals-score-161fc9ef762067680ca3a36bab268afe",
    "date": "2025-04-12",
    "time": "21:00:04",
    "title": "Phillies turn 5 double plays in 4-1 win over Cardinals",
    "body": "ST. LOUIS (AP) — Nick Castellanos had a two-run double to stake Philadelphia to an early lead, and the Phillies turned five double plays in a 4-1 win Saturday over the St. Louis Cardinals.\n\nCristopher Sánchez (1-0) allowed eight hits in 6 1/3 innings, but he kept inducing ground balls to get out of trouble. Sanchez struck out three and walked two.\n\nJosé Alvarado worked a spotless ninth inning for his third save.\n\nCardinals starter Miles Mikolas (0-2) gave up three runs and three hits in five innings. He struck out six and walked two, with both of those runners coming around to score.\n\nVictor Scott II sped into the left-center field gap and dove in an attempt to catch Castellanos’ hard line-drive in the first, but the ball bounced off his glove as Bryce Harper and Kyle Schwarber came around to score.\n\nThe Phillies added runs on Bryson Stott’s RBI double in the fifth and Trea Turner’s two-out single in the seventh.\n\nWillson Contreras drove in the Cardinals’ run in the sixth, when he followed Luken Baker’s double with an RBI single.\n\nKey moment\n\nSánchez preserved a 2-0 lead in the third inning when Baker grounded into an inning-ending double play with the bases loaded. The Phillies turned double plays in each of the first three innings.\n\nIn the fifth, Stott’s error trying to catch a toss from Turner cost them a chance at another but only for a moment. The next batter, Thomas Saggese, grounded into an inning-ending double play.\n\nPhiladelphia turned its final double play on Nolan Arenado’s grounder in the eighth.\n\nKey stat\n\nPhiladelphia has not lost a series at Busch Stadium since June 2017. Since then, the Phillies have won nine series and tied three.\n\nUp next\n\nPhiladelphia RHP Zack Wheeler (1-0, 3.44 ERA) faces Cardinals LHP Matthew Liberatore (0-1, 5.84) in the series finale.\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "st louis ap — nick castellanos had a tworun double to stake philadelphia to an early lead and the phillies turned five double plays in a 41 win saturday over the st louis cardinals cristopher sánchez 10 allowed eight hits in 6 13 innings but he kept inducing ground balls to get out of trouble sanchez struck out three and walked two josé alvarado worked a spotless ninth inning for his third save cardinals starter miles mikolas 02 gave up three runs and three hits in five innings he struck out six and walked two with both of those runners coming around to score victor scott ii sped into the leftcenter field gap and dove in an attempt to catch castellanos’ hard linedrive in the first but the ball bounced off his glove as bryce harper and kyle schwarber came around to score the phillies added runs on bryson stott’s rbi double in the fifth and trea turner’s twoout single in the seventh willson contreras drove in the cardinals’ run in the sixth when he followed luken baker’s double with an rbi single key moment sánchez preserved a 20 lead in the third inning when baker grounded into an inningending double play with the bases loaded the phillies turned double plays in each of the first three innings in the fifth stott’s error trying to catch a toss from turner cost them a chance at another but only for a moment the next batter thomas saggese grounded into an inningending double play philadelphia turned its final double play on nolan arenado’s grounder in the eighth key stat philadelphia has not lost a series at busch stadium since june 2017 since then the phillies have won nine series and tied three up next philadelphia rhp zack wheeler 10 344 era faces cardinals lhp matthew liberatore 01 584 in the series finale ap mlb httpsapnewscomhubmlb",
    "summary": "ST. LOUIS (AP) — Nick Castellanos had a two-run double to stake Philadelphia to an early lead, and the Phillies turned five double plays in a 4-1 win Saturday over the St. Louis Cardinals.\nThe Phillies added runs on Bryson Stott’s RBI double in the fifth and Trea Turner’s two-out single in the seventh.\nWillson Contreras drove in the Cardinals’ run in the sixth, when he followed Luken Baker’s double with an RBI single.\nThe Phillies turned double plays in each of the first three innings.\nUp nextPhiladelphia RHP Zack Wheeler (1-0, 3.44 ERA) faces Cardinals LHP Matthew Liberatore (0-1, 5.84) in the series finale.",
    "keywords": [
      "walked",
      "turned",
      "double",
      "phillies",
      "series",
      "cardinals",
      "win",
      "41",
      "stotts",
      "st",
      "runs",
      "rbi",
      "plays",
      "turn",
      "struck"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/cad047e/2147483647/strip/true/crop/5056x2844+0+263/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fed%2F9d%2F955121aebaed1698417cd6c26215%2F639eb84deeec4b4ca1cb0461021fdf4c",
    "t": 30
  },
  "https://apnews.com/article/mets-nationals-score-f87b76aa09aa07d806e0af5516d097e6": {
    "source": "AP News",
    "url": "https://apnews.com/article/mets-nationals-score-f87b76aa09aa07d806e0af5516d097e6",
    "date": "2025-04-28",
    "time": "23:23:10",
    "title": "Brandon Nimmo ties Mets record with 9 RBIs in 19-5 rout of Nationals",
    "body": "WASHINGTON (AP) — Brandon Nimmo hit a grand slam and matched a franchise record with nine RBIs, helping the New York Mets pound Washington Nationals 19-5 on Monday.\n\nNimmo also hit a three-run drive in his seventh career multihomer game. The 32-year-old outfielder had four hits and scored four times after beginning the day with a .192 batting average.\n\nNew York earned a split of the four-game series. The Mets have won nine of 11 overall to improve to a major league-best 20-9.\n\nJeff McNeil and Mark Vientos also homered for New York, which finished with 21 hits. Vientos connected for a three-run drive against Washington infielder Amed Rosario in the ninth.\n\nJames Wood and Nathaniel Lowe homered for Washington in the eighth.\n\nThe Mets had a 3-0 lead when Colin Poche replaced Nationals starter Trevor Williams (1-3) with two on in the sixth. Nimmo greeted the left-hander by ripping a 2-0 fastball deep to right-center.\n\nAn inning later, the Mets had the bases loaded when Nimmo sent Cole Henry’s fastball into the right-field seats for his second career grand slam.\n\nNimmo added a two-run double in the eighth to tie the franchise record for RBIs set by Carlos Delgado in the first game of a doubleheader against the New York Yankees on June 27, 2008.\n\nMcNeil, who made his season debut Friday after missing 25 games with a right oblique strain, hit the first pitch of the fifth deep to right for his first home run of the year.\n\nGriffin Canning (4-1) pitched five innings of four-hit ball for New York. He has won four consecutive starts for the first time in his six-season career.\n\nJosé Ureña earned his first save of the season. He allowed five runs in three innings in his Mets debut.\n\nWilliams yielded five runs in a season-high 5 1/3 innings.\n\nFrancisco Lindor was hit twice by Cole Henry pitches in the seventh. He became the ninth player to be hit twice in an inning and the first since the New York Yankees’ Brandon Moss on April 25, 2014, according to the Elias Sports Bureau.\n\nKey moment\n\nNimmo’s sixth-inning shot broke open the game. It was his first homer since April 12.\n\nKey stat\n\nNimmo was mired in a 7-for-47 (.149) slump with no extra-base hits in his previous 12 games before Monday.\n\nUp next\n\nNew York left-hander David Peterson (1-1, 3.29 ERA) starts Tuesday in the opener of a three-game series against Arizona.\n\nLefty MacKenzie Gore (2-3, 3.34 ERA) starts Tuesday as Washington opens a three-game series at Philadelphia.\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "washington ap — brandon nimmo hit a grand slam and matched a franchise record with nine rbis helping the new york mets pound washington nationals 195 on monday nimmo also hit a threerun drive in his seventh career multihomer game the 32yearold outfielder had four hits and scored four times after beginning the day with a 192 batting average new york earned a split of the fourgame series the mets have won nine of 11 overall to improve to a major leaguebest 209 jeff mcneil and mark vientos also homered for new york which finished with 21 hits vientos connected for a threerun drive against washington infielder amed rosario in the ninth james wood and nathaniel lowe homered for washington in the eighth the mets had a 30 lead when colin poche replaced nationals starter trevor williams 13 with two on in the sixth nimmo greeted the lefthander by ripping a 20 fastball deep to rightcenter an inning later the mets had the bases loaded when nimmo sent cole henry’s fastball into the rightfield seats for his second career grand slam nimmo added a tworun double in the eighth to tie the franchise record for rbis set by carlos delgado in the first game of a doubleheader against the new york yankees on june 27 2008 mcneil who made his season debut friday after missing 25 games with a right oblique strain hit the first pitch of the fifth deep to right for his first home run of the year griffin canning 41 pitched five innings of fourhit ball for new york he has won four consecutive starts for the first time in his sixseason career josé ureña earned his first save of the season he allowed five runs in three innings in his mets debut williams yielded five runs in a seasonhigh 5 13 innings francisco lindor was hit twice by cole henry pitches in the seventh he became the ninth player to be hit twice in an inning and the first since the new york yankees’ brandon moss on april 25 2014 according to the elias sports bureau key moment nimmo’s sixthinning shot broke open the game it was his first homer since april 12 key stat nimmo was mired in a 7for47 149 slump with no extrabase hits in his previous 12 games before monday up next new york lefthander david peterson 11 329 era starts tuesday in the opener of a threegame series against arizona lefty mackenzie gore 23 334 era starts tuesday as washington opens a threegame series at philadelphia ap mlb httpsapnewscomhubmlb",
    "summary": "WASHINGTON (AP) — Brandon Nimmo hit a grand slam and matched a franchise record with nine RBIs, helping the New York Mets pound Washington Nationals 19-5 on Monday.\nNimmo also hit a three-run drive in his seventh career multihomer game.\nThe Mets had a 3-0 lead when Colin Poche replaced Nationals starter Trevor Williams (1-3) with two on in the sixth.\nNimmo added a two-run double in the eighth to tie the franchise record for RBIs set by Carlos Delgado in the first game of a doubleheader against the New York Yankees on June 27, 2008.\nUp nextNew York left-hander David Peterson (1-1, 3.29 ERA) starts Tuesday in the opener of a three-game series against Arizona.",
    "keywords": [
      "ties",
      "nationals",
      "record",
      "mets",
      "washington",
      "starts",
      "york",
      "nimmo",
      "series",
      "hits",
      "rbis",
      "game",
      "195",
      "rout",
      "hit",
      "brandon",
      "yankees"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/dc39452/2147483647/strip/true/crop/2194x1234+0+116/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F89%2F320b76ab15dadd8c478ff8d2c76f%2F864243bc19a74b80a1ac0d1424fea8da",
    "t": 14
  },
  "https://apnews.com/article/hostages-israel-gaza-6eb99b5152f42b94f8bfb50bee96af02": {
    "source": "AP News",
    "url": "https://apnews.com/article/hostages-israel-gaza-6eb99b5152f42b94f8bfb50bee96af02",
    "date": "2025-04-24",
    "time": "05:03:48",
    "title": "Freed Israeli hostage feared the ‘many ways to die’ in Gaza but kept hope alive",
    "body": "TEL AVIV, Israel (AP) — Whether the threat was abusive Hamas guards, hunger, illness or Israeli strikes, there were moments during Tal Shoham’s 505 days of captivity in Gaza when he didn’t think he’d be alive the next morning.\n\nThere were “many times that I separated from life and ... tried to accept death,” the 40-year-old Israeli, who also holds Austrian citizenship, told The Associated Press. “There are so many ways to die there.”\n\nShoham was one of dozens of hostages released from Gaza in February as part of a ceasefire agreement between Hamas and Israel that has since been broken. His wife, two children and three other family members were also kidnapped on Oct. 7, 2023, and were freed a month later.\n\nShoham said he spent half his captivity in apartments and the rest in underground tunnels. He was sometimes bound, starved, beaten and threatened with death, and initially didn’t know if his family was alive.\n\nAfter his wife was released, Shoham said, someone identifying himself as a member of Hamas called to warn her not to talk about what she’d been through or they’d kill her husband. So as he recounted his own experience, Shoham said there were details he wouldn’t discuss, fearful of endangering remaining hostages.\n\nWith ceasefire talks at a standstill, Israel is vowing to advance deeper into Gaza until Hamas releases the 59 hostages still there, more than half of whom are believed dead.\n\nThe resumption of fighting has inflamed debate in Israel over the course of the war and the hostages’ fate. Israeli Prime Minister Benjamin Netanyahu has come under mounting domestic pressure for his handling of the hostage crisis. But he also faces demands from his hard-line allies not to accept any deal that falls short of Hamas’ destruction.\n\nThe abduction\n\nShoham was kidnapped while visiting relatives in Kibbutz Be’eri. When Hamas attacked, he and his family hid in a safe room meant to offer protection from incoming rockets. But as militants pried open a window and used explosives to try to break in, the family surrendered, a decision Shoham credits with saving their lives.\n\nShoham was thrown into the back of a vehicle and taken into Gaza, not knowing what happened to his wife or children. Be’eri was among the hardest-hit communities that day.\n\nBefore being separated, Shoham recalled telling his now 9-year-old son that he didn’t know if they were going to die. “I didn’t want him to hear a lie from me, if it’s the last minutes of our life,” he said.\n\nUpon entering Gaza, a militant jumped on the car’s roof, pointed his gun at Shoham and told him to kneel. But Shoham refused, not wanting to be killed on their terms, he said.\n\nHe said the militant had “murder in his eyes.”\n\nThe apartments\n\nShoham was first taken to an apartment that his captors said was in northern Gaza. He spent weeks there, handcuffed and confined to a room.\n\nAbout a month later, he was moved to another apartment and joined by Evyatar David and Guy Gilboa-Dalal, hostages he would spend most of his captivity with.\n\nThe two men were abducted from a music festival in southern Israel where at least 364 people were killed and dozens more taken hostage. Hearing about the conditions of their captivity made Shoham feel lucky about his own. They’d been kept in more uncomfortable zip-tie handcuffs, with plastic bags on their heads, he said, and fed one pita per day.\n\nThe three lived in that apartment for months, where they endured daily beatings. Guards would taunt and humiliate them, asking how the music festival was and making shooting noises, Shoham said.\n\nForbidden by their captors from speaking, they got to know each other through furtive whispers.\n\nTo humanize himself in the eyes of his captors, and hopefully make them less likely to kill him, Shoham learned Arabic and talked with them about his life in Israel.\n\nOne of their guards liked massages, Shoham said, so the captives provided daily back rubs in exchange for more variety in their diet, like tuna, sardines and even eggs.\n\nShoham learned his wife and children were alive about 50 days into his captivity. In what he considered an act of kindness, his captors gave him a letter written by his wife that said she and their children were OK and would be released soon.\n\nHe credits that gesture by the guards with giving him more mental strength to focus on his own survival.\n\nThe tunnel\n\nLast June, Shoham, David and Gilboa-Dalal were relocated to a tunnel that they estimated to be about 30 meters (98 feet) underground.\n\nShoham said they were moved after Israel rescued four hostages from apartments in Gaza earlier that month, an operation that killed more than 270 Palestinians.\n\nThey were transported in an ambulance, Shoham said, cleanly shaved, dressed in clothes meant to make him blend in and blindfolded. Hamas operates from civilian areas, including hospitals, and Israel accuses Hamas militants of taking cover in ambulances and other emergency vehicles.\n\nThe tunnels were dark and damp, and it was hard to breathe, Shoham said. The three men were kept with another hostage, Omer Wenkert, who had been in the tunnels for much longer.\n\nThey shared a 12-meter-long (39-foot-long) cell and slept on mattresses on the ground, a meter away from a hole that was their toilet. They showered roughly every 21 days.\n\nShoham lost about 60 pounds (28 kilograms) while in captivity. He developed a leg infection that was so bad he couldn’t walk for weeks. After a doctor visited and provided vitamins, he said his health improved.\n\nWhat also helped Shoham survive, he said, was focusing on what he could control. He started doing mindfulness activities he had learned from his wife, a psychologist, and discussed his feelings with the other hostages. “The only thing that I have power upon is my inner life,” he said.\n\nHe told himself each day that he’d eventually be free.\n\nBack home and healing\n\nShoham and Wenkert were freed together in the last release of living hostages before the ceasefire ended. The last thing Shoham told David and Gilboa-Dalal was to be strong and not lose hope.\n\nHamas later released a video showing the two men, sitting in a nearby vehicle, distressed as they were forced to watch the handover for released hostages that day. A group representing hostages’ families called the video “sickening.”\n\nShoham worries they’re running out of time and is urging the government and the international community not to tie the hostages’ fate to a ceasefire or a peace agreement.\n\n“I really fear that if they won’t be released soon, they probably will die there,” he said.\n\nShoham says his own healing process has been made easier by knowing his family can relate to what he endured.\n\nAnd his freedom has helped the family properly mourn those killed on Oct. 7, including his wife’s father. While he was in captivity, they’d been so focused on his release, he said.\n\nSince returning home, Shoham has gained 35 pounds (16 kilograms), saying he wanted to eat everything and never felt full. Lately he’s been trying to get back to his pre-captivity routine of intermittent fasting.\n\nWhile his leg is still not fully healed, Shoham says he’s one of the lucky ones, in that he’s not suffering from nightmares. He credits his children with helping him keep moving forward.\n\n“When I can hear my children addressing us, like mother and father, mom and dad, saying both names, it’s like music to the ears,” he said. “As a family, we’re all in the process of recovery now. But we are doing it together.”",
    "clean_body": "tel aviv israel ap — whether the threat was abusive hamas guards hunger illness or israeli strikes there were moments during tal shoham’s 505 days of captivity in gaza when he didn’t think he’d be alive the next morning there were “many times that i separated from life and tried to accept death” the 40yearold israeli who also holds austrian citizenship told the associated press “there are so many ways to die there” shoham was one of dozens of hostages released from gaza in february as part of a ceasefire agreement between hamas and israel that has since been broken his wife two children and three other family members were also kidnapped on oct 7 2023 and were freed a month later shoham said he spent half his captivity in apartments and the rest in underground tunnels he was sometimes bound starved beaten and threatened with death and initially didn’t know if his family was alive after his wife was released shoham said someone identifying himself as a member of hamas called to warn her not to talk about what she’d been through or they’d kill her husband so as he recounted his own experience shoham said there were details he wouldn’t discuss fearful of endangering remaining hostages with ceasefire talks at a standstill israel is vowing to advance deeper into gaza until hamas releases the 59 hostages still there more than half of whom are believed dead the resumption of fighting has inflamed debate in israel over the course of the war and the hostages’ fate israeli prime minister benjamin netanyahu has come under mounting domestic pressure for his handling of the hostage crisis but he also faces demands from his hardline allies not to accept any deal that falls short of hamas’ destruction the abduction shoham was kidnapped while visiting relatives in kibbutz be’eri when hamas attacked he and his family hid in a safe room meant to offer protection from incoming rockets but as militants pried open a window and used explosives to try to break in the family surrendered a decision shoham credits with saving their lives shoham was thrown into the back of a vehicle and taken into gaza not knowing what happened to his wife or children be’eri was among the hardesthit communities that day before being separated shoham recalled telling his now 9yearold son that he didn’t know if they were going to die “i didn’t want him to hear a lie from me if it’s the last minutes of our life” he said upon entering gaza a militant jumped on the car’s roof pointed his gun at shoham and told him to kneel but shoham refused not wanting to be killed on their terms he said he said the militant had “murder in his eyes” the apartments shoham was first taken to an apartment that his captors said was in northern gaza he spent weeks there handcuffed and confined to a room about a month later he was moved to another apartment and joined by evyatar david and guy gilboadalal hostages he would spend most of his captivity with the two men were abducted from a music festival in southern israel where at least 364 people were killed and dozens more taken hostage hearing about the conditions of their captivity made shoham feel lucky about his own they’d been kept in more uncomfortable ziptie handcuffs with plastic bags on their heads he said and fed one pita per day the three lived in that apartment for months where they endured daily beatings guards would taunt and humiliate them asking how the music festival was and making shooting noises shoham said forbidden by their captors from speaking they got to know each other through furtive whispers to humanize himself in the eyes of his captors and hopefully make them less likely to kill him shoham learned arabic and talked with them about his life in israel one of their guards liked massages shoham said so the captives provided daily back rubs in exchange for more variety in their diet like tuna sardines and even eggs shoham learned his wife and children were alive about 50 days into his captivity in what he considered an act of kindness his captors gave him a letter written by his wife that said she and their children were ok and would be released soon he credits that gesture by the guards with giving him more mental strength to focus on his own survival the tunnel last june shoham david and gilboadalal were relocated to a tunnel that they estimated to be about 30 meters 98 feet underground shoham said they were moved after israel rescued four hostages from apartments in gaza earlier that month an operation that killed more than 270 palestinians they were transported in an ambulance shoham said cleanly shaved dressed in clothes meant to make him blend in and blindfolded hamas operates from civilian areas including hospitals and israel accuses hamas militants of taking cover in ambulances and other emergency vehicles the tunnels were dark and damp and it was hard to breathe shoham said the three men were kept with another hostage omer wenkert who had been in the tunnels for much longer they shared a 12meterlong 39footlong cell and slept on mattresses on the ground a meter away from a hole that was their toilet they showered roughly every 21 days shoham lost about 60 pounds 28 kilograms while in captivity he developed a leg infection that was so bad he couldn’t walk for weeks after a doctor visited and provided vitamins he said his health improved what also helped shoham survive he said was focusing on what he could control he started doing mindfulness activities he had learned from his wife a psychologist and discussed his feelings with the other hostages “the only thing that i have power upon is my inner life” he said he told himself each day that he’d eventually be free back home and healing shoham and wenkert were freed together in the last release of living hostages before the ceasefire ended the last thing shoham told david and gilboadalal was to be strong and not lose hope hamas later released a video showing the two men sitting in a nearby vehicle distressed as they were forced to watch the handover for released hostages that day a group representing hostages’ families called the video “sickening” shoham worries they’re running out of time and is urging the government and the international community not to tie the hostages’ fate to a ceasefire or a peace agreement “i really fear that if they won’t be released soon they probably will die there” he said shoham says his own healing process has been made easier by knowing his family can relate to what he endured and his freedom has helped the family properly mourn those killed on oct 7 including his wife’s father while he was in captivity they’d been so focused on his release he said since returning home shoham has gained 35 pounds 16 kilograms saying he wanted to eat everything and never felt full lately he’s been trying to get back to his precaptivity routine of intermittent fasting while his leg is still not fully healed shoham says he’s one of the lucky ones in that he’s not suffering from nightmares he credits his children with helping him keep moving forward “when i can hear my children addressing us like mother and father mom and dad saying both names it’s like music to the ears” he said “as a family we’re all in the process of recovery now but we are doing it together”",
    "summary": "“There are so many ways to die there.”Shoham was one of dozens of hostages released from Gaza in February as part of a ceasefire agreement between Hamas and Israel that has since been broken.\nHis wife, two children and three other family members were also kidnapped on Oct. 7, 2023, and were freed a month later.\nIsraeli Prime Minister Benjamin Netanyahu has come under mounting domestic pressure for his handling of the hostage crisis.\nShoham was thrown into the back of a vehicle and taken into Gaza, not knowing what happened to his wife or children.\nHamas later released a video showing the two men, sitting in a nearby vehicle, distressed as they were forced to watch the handover for released hostages that day.",
    "keywords": [
      "released",
      "kept",
      "alive",
      "israel",
      "hope",
      "gaza",
      "shoham",
      "israeli",
      "wife",
      "children",
      "family",
      "die",
      "hostages",
      "freed",
      "hamas",
      "hostage",
      "captivity",
      "ways",
      "feared"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/d2b1e43/2147483647/strip/true/crop/8101x4557+0+422/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F60%2Fef%2F649434c15c93729853e2fc1a3f92%2Fac9eff9043c14531a4471531dcb5c15b",
    "t": 18
  },
  "https://apnews.com/article/orioles-guardians-score-c0ae8137cdc503a336a919daea908f86": {
    "source": "AP News",
    "url": "https://apnews.com/article/orioles-guardians-score-c0ae8137cdc503a336a919daea908f86",
    "date": "2025-04-17",
    "time": "01:28:14",
    "title": "Jackson Holliday’s early grand slam sends the Orioles to a 9-1 victory over Cleveland",
    "body": "BALTIMORE (AP) — Jackson Holliday hit a second-inning grand slam, Dean Kremer turned in his best start of the young season and the Baltimore Orioles routed the Cleveland Guardians 9-1 on Wednesday night.\n\nHolliday snapped an 0-for-17 drought with a drive that carried into the Baltimore bullpen in center field off Gavin Williams (1-1) with one out in the second.\n\nKremer (2-2) entered the game with an ERA of 8.16 but allowed just one run — a homer by Gabriel Arias in the third — in 5 1/3 innings. He allowed four hits.\n\nRamón Laureano hit a solo homer for the Orioles in the seventh, and Ryan O’Hearn added one in Baltimore’s four-run eighth.\n\nCleveland loaded the bases with one out in the eighth but failed to score.\n\nBaltimore did its pitchers few favors defensively. On three occasions, Cleveland hitters were credited with hits on plays that probably should have been made. Right fielder Heston Kjerstad did make a nice sliding catch along the warning track in right-center field in the sixth, denying an extra-base hit that may have scored two runs for Cleveland.\n\nWilliams allowed five runs, four hits and four walks in 6 2/3 innings. He struck out four.\n\nKey moment\n\nHolliday’s grand slam was the second of his career — the 21-year-old infielder has hit only seven homers. The Orioles loaded the bases that inning with walks by Cedric Mullins and Ramón Urías and a single by Ryan Mountcastle.\n\nKey stat\n\nIn their seven wins this year, the Orioles have averaged 8.0 runs per game. In their 10 losses, they’ve averaged 2.2.\n\nUp next\n\nThe Orioles will try for their first series win of the season in Thursday night’s finale. Baltimore sends Tomoyuki Sugano (1-1) to the mound against Cleveland’s Tanner Bibee (1-1).\n\n___\n\nAP MLB: https://apnews.com/hub/MLB",
    "clean_body": "baltimore ap — jackson holliday hit a secondinning grand slam dean kremer turned in his best start of the young season and the baltimore orioles routed the cleveland guardians 91 on wednesday night holliday snapped an 0for17 drought with a drive that carried into the baltimore bullpen in center field off gavin williams 11 with one out in the second kremer 22 entered the game with an era of 816 but allowed just one run — a homer by gabriel arias in the third — in 5 13 innings he allowed four hits ramón laureano hit a solo homer for the orioles in the seventh and ryan o’hearn added one in baltimore’s fourrun eighth cleveland loaded the bases with one out in the eighth but failed to score baltimore did its pitchers few favors defensively on three occasions cleveland hitters were credited with hits on plays that probably should have been made right fielder heston kjerstad did make a nice sliding catch along the warning track in rightcenter field in the sixth denying an extrabase hit that may have scored two runs for cleveland williams allowed five runs four hits and four walks in 6 23 innings he struck out four key moment holliday’s grand slam was the second of his career — the 21yearold infielder has hit only seven homers the orioles loaded the bases that inning with walks by cedric mullins and ramón urías and a single by ryan mountcastle key stat in their seven wins this year the orioles have averaged 80 runs per game in their 10 losses they’ve averaged 22 up next the orioles will try for their first series win of the season in thursday night’s finale baltimore sends tomoyuki sugano 11 to the mound against cleveland’s tanner bibee 11 ap mlb httpsapnewscomhubmlb",
    "summary": "BALTIMORE (AP) — Jackson Holliday hit a second-inning grand slam, Dean Kremer turned in his best start of the young season and the Baltimore Orioles routed the Cleveland Guardians 9-1 on Wednesday night.\nRamón Laureano hit a solo homer for the Orioles in the seventh, and Ryan O’Hearn added one in Baltimore’s four-run eighth.\nKey momentHolliday’s grand slam was the second of his career — the 21-year-old infielder has hit only seven homers.\nThe Orioles loaded the bases that inning with walks by Cedric Mullins and Ramón Urías and a single by Ryan Mountcastle.\nKey statIn their seven wins this year, the Orioles have averaged 8.0 runs per game.",
    "keywords": [
      "grand",
      "sends",
      "cleveland",
      "ryan",
      "seven",
      "victory",
      "91",
      "allowed",
      "slam",
      "early",
      "runs",
      "hollidays",
      "baltimore",
      "season",
      "walks",
      "hit",
      "jackson",
      "orioles"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/9e9626c/2147483647/strip/true/crop/7339x4128+0+382/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F55%2F1bd898afe77b41b50e1614baa592%2F69ccbb690cec404c94655b0a22aa77ca",
    "t": 25
  },
  "https://apnews.com/article/capitals-canadiens-score-5579a36d0b9146b6b2f27fbbb1441f9f": {
    "source": "AP News",
    "url": "https://apnews.com/article/capitals-canadiens-score-5579a36d0b9146b6b2f27fbbb1441f9f",
    "date": "2025-04-26",
    "time": "02:21:23",
    "title": "Canadiens beat the Capitals 6-3 to cut their series deficit to 2-1",
    "body": "MONTREAL (AP) — Christian Dvorak broke a tie at 4:17 of the third period and the Montreal Canadiens beat the Washington Capitals 6-3 on Friday night to cut their deficit in the first-round series to 2-1.\n\nDvorak fired shot from the far left side that hit Washington forward Brandon Duhaime and deflected past goalie Logan Thompson. Juraj Slafkovsky made it a two-goal game with 6:37 remaining, with Capitals forward Dylan Strome crashing into Thompson on the play and injuring him.\n\nThompson put no weight on his left skate while being helped off, leaving his status Sunday night for Game 4 in Montreal in doubt.\n\n“It was tough, obviously, (Strome) is trying to get back and make a desperate play to save a goal and it’s unfortunate,” Capitals defenseman Jakob Chychrun.\n\nMontreal also lost its starting goalie, with Sam Montembeault leaving in the middle of the second period because a lower-body injury.\n\nAlexandre Carrier, Nick Suzuki, Cole Caufield and Alex Newhook also scored for Montreal.\n\n“We knew we had to turn it up to another level,” Slafkovsky said. “It was something crazy. I never experienced something like today. The crowd was amazing, and I hope we can bring more and more playoff games to this building. This is probably the best feeling.”\n\nMontembeault stopped 11 of 13 shots, and Jakub Dobes made seven saves on eight shots in relief in his NHL debut.\n\n“You guys cannot imagine how a person feels,” Dobes said. “I was afraid, I was excited, I was emotional. I was crying at the end. I was a mess.”\n\nAlex Ovechkin, Connor McMichael, Jakob Chychrun scored for Washington, with Ovechkin tying it at 3 at 2:29 of the third period.\n\nThompson stopped 30 of 35 shots. Charlie Lindgren made four saves in five shots.\n\nAt the end of the second period, a heated fight between Capitals forward Tom Wilson and Montreal’s Josh Anderson spilled into Washington’s bench.\n\nAfter some pushing and shoving between Montreal defenseman Arber Xhekaj and Wilson with both benches empty, Anderson got involved and fell backward into the Capitals’ bench, which had the door open.\n\nWilson followed Anderson in and charged through a linesman toward the Canadiens winger while other Montreal and Washington players exchanged blows on the ice.\n\n“I was on my way to walk across the ice,” Capitals coach Spencer Carbery said. “Then I had to reverse my course and head back, because there were two large individuals coming through the door that I was trying to exit.”\n\n___\n\nAP NHL: https://apnews.com/hub/nhl",
    "clean_body": "montreal ap — christian dvorak broke a tie at 417 of the third period and the montreal canadiens beat the washington capitals 63 on friday night to cut their deficit in the firstround series to 21 dvorak fired shot from the far left side that hit washington forward brandon duhaime and deflected past goalie logan thompson juraj slafkovsky made it a twogoal game with 637 remaining with capitals forward dylan strome crashing into thompson on the play and injuring him thompson put no weight on his left skate while being helped off leaving his status sunday night for game 4 in montreal in doubt “it was tough obviously strome is trying to get back and make a desperate play to save a goal and it’s unfortunate” capitals defenseman jakob chychrun montreal also lost its starting goalie with sam montembeault leaving in the middle of the second period because a lowerbody injury alexandre carrier nick suzuki cole caufield and alex newhook also scored for montreal “we knew we had to turn it up to another level” slafkovsky said “it was something crazy i never experienced something like today the crowd was amazing and i hope we can bring more and more playoff games to this building this is probably the best feeling” montembeault stopped 11 of 13 shots and jakub dobes made seven saves on eight shots in relief in his nhl debut “you guys cannot imagine how a person feels” dobes said “i was afraid i was excited i was emotional i was crying at the end i was a mess” alex ovechkin connor mcmichael jakob chychrun scored for washington with ovechkin tying it at 3 at 229 of the third period thompson stopped 30 of 35 shots charlie lindgren made four saves in five shots at the end of the second period a heated fight between capitals forward tom wilson and montreal’s josh anderson spilled into washington’s bench after some pushing and shoving between montreal defenseman arber xhekaj and wilson with both benches empty anderson got involved and fell backward into the capitals’ bench which had the door open wilson followed anderson in and charged through a linesman toward the canadiens winger while other montreal and washington players exchanged blows on the ice “i was on my way to walk across the ice” capitals coach spencer carbery said “then i had to reverse my course and head back because there were two large individuals coming through the door that i was trying to exit” ap nhl httpsapnewscomhubnhl",
    "summary": "MONTREAL (AP) — Christian Dvorak broke a tie at 4:17 of the third period and the Montreal Canadiens beat the Washington Capitals 6-3 on Friday night to cut their deficit in the first-round series to 2-1.\nDvorak fired shot from the far left side that hit Washington forward Brandon Duhaime and deflected past goalie Logan Thompson.\nJuraj Slafkovsky made it a two-goal game with 6:37 remaining, with Capitals forward Dylan Strome crashing into Thompson on the play and injuring him.\nAt the end of the second period, a heated fight between Capitals forward Tom Wilson and Montreal’s Josh Anderson spilled into Washington’s bench.\nWilson followed Anderson in and charged through a linesman toward the Canadiens winger while other Montreal and Washington players exchanged blows on the ice.",
    "keywords": [
      "cut",
      "forward",
      "washington",
      "21",
      "thompson",
      "series",
      "canadiens",
      "beat",
      "montreal",
      "capitals",
      "63",
      "anderson",
      "shots",
      "trying",
      "period",
      "deficit",
      "wilson"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/f544f6a/2147483647/strip/true/crop/3875x2180+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb1%2Fa1%2F3dda8bd4f382f1099e6c673fdc84%2Fdb24978611134192b6df64781570be26",
    "t": 16
  },
  "https://apnews.com/article/yemen-us-airstrikes-563f61bbd96e1f2de68373fdf76c8811": {
    "source": "AP News",
    "url": "https://apnews.com/article/yemen-us-airstrikes-563f61bbd96e1f2de68373fdf76c8811",
    "date": "2025-04-18",
    "time": "01:21:03",
    "title": "Deadly US airstrike on Yemeni oil port escalates Trump’s campaign against the Houthis",
    "body": "DUBAI, United Arab Emirates (AP) — A U.S. airstrike on an important oil port held by Yemen’s Houthi rebels killed more than 70 people and wounded many others, the Iranian-backed rebel group said Friday, marking a major escalation in the military campaign President Donald Trump launched against the faction last month.\n\nThe overnight strike on the Ras Isa port sent massive fireballs billowing skyward and turned tanker trucks into burning wrecks. It was the first American attack on a Houthi-controlled oil facility in the new U.S. bombing campaign. It also came just before the resumption of negotiations in Rome between the U.S. and Iran over Tehran’s rapidly advancing nuclear program, which Washington has linked to its attacks in Yemen.\n\nThe U.S. is targeting the Houthis because of the group’s attacks on shipping in the Red Sea, a crucial global trade route, and on Israel. The Houthis are the last militant group in Iran’s self-described “Axis of Resistance” that is capable of regularly attacking Israel.\n\nThe port is a major hub for incoming fuel shipments that power areas of Yemen held by the Houthis, and analysts say the airstrike could seriously affect daily life there.\n\nThe Houthis, who said the attack killed at least 74 people and wounded 171 others, aired graphic footage of the aftermath on their al-Masirah satellite news channel, showing corpses strewn about the port and smashed tanker trucks. They denounced the strike as a “completely unjustified aggression.”\n\nThis photo taken from video released by Al Masirah TV channel shows medics carrying a severely wounded person onto a stretcher after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.( Al Masirah TV via AP) This photo taken from video released by Al Masirah TV channel shows medics carrying a severely wounded person onto a stretcher after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.( Al Masirah TV via AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nAP AUDIO: US strikes on a Yemeni oil port kill 74 people, Houthis say, in deadliest attack of Trump campaign AP correspondent Charles de Ledesma reports U.S. airstrikes targeting an oil port held by Yemen’s Houthi rebels killed more than 70 people with 170 others wounded, the group says.\n\n“It targets a vital civilian facility that has served the Yemeni people for decades,” the group said in a statement.\n\nIn this photo taken from video released by Al Masirah TV channel shows a burning oil tanker after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.( Al Masirah TV via AP) In this photo taken from video released by Al Masirah TV channel shows a burning oil tanker after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.( Al Masirah TV via AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nU.S. Central Command declined to answer any questions about possible civilian casualties but referred to a statement in which it said “this strike was not intended to harm the people of Yemen.”\n\n“U.S. forces took action to eliminate this source of fuel for the Iran-backed Houthi terrorists and deprive them of illegal revenue that has funded Houthi efforts to terrorize the entire region for over 10 years,” it said in its statement.\n\nA U.S. official said the attack sent a message to those supplying fuel to the Houthis despite sanctions. The official spoke to The Associated Press on the condition of anonymity to provide details not yet made public.\n\nHours after the U.S. strike, the Houthis launched a missile toward Israel that was intercepted, the Israeli military said. Sirens sounded in Tel Aviv and elsewhere. Meanwhile, the Houthis said they shot down another American MQ-9 Predator drone, which the U.S. official acknowledged.\n\nThe port’s strategic significance\n\nThe Ras Isa port is a collection of oil tanks and equipment that sits in Yemen’s Hodeida governorate along the Red Sea. It is just off Kamaran Island, which has been targeted by intense U.S. airstrikes in recent days.\n\nBefore the Houthis took control of Yemen’s capital, Sanaa, in 2014 and sent the government into exile, oil from the country’s energy-rich Marib governorate moved through Ras Isa for export. But since the Houthis don’t control that region, the port now serves as an import hub for gasoline, diesel and liquefied petroleum gas that help power those parts of Yemen the Houthis control.\n\nA deadly escalation of Trump’s Yemen campaign\n\nThe new U.S. operation against the Houthis under Trump appears more extensive than attacks on the group were under President Joe Biden, an AP review found. The new campaign started after the rebels threatened to begin targeting “Israeli” ships again over Israel blocking aid from entering the Gaza Strip.\n\nFrom November 2023 until this January, the Houthis targeted more than 100 merchant vessels with missiles and drones, sinking two of them and killing four sailors. That has greatly reduced the flow of trade through the Red Sea corridor, which typically sees $1 trillion of goods move through it. The Houthis also launched attacks targeting American warships without success.\n\nAssessing the toll of the month-old U.S. airstrike campaign has been difficult because the military hasn’t released information about the attacks, including what was targeted and how many people were killed. The Houthis, meanwhile, strictly control access to attacked areas and don’t publish complete information on the strikes, many of which likely have targeted military and security sites.\n\nThis photo taken from video released by Al Masirah TV channel shows medics carrying a dead person after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.( Al Masirah TV via AP) This photo taken from video released by Al Masirah TV channel shows medics carrying a dead person after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.( Al Masirah TV via AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nThe Ras Isa port airstrike is the deadliest known attack yet in the month-old campaign. The actual cost in lives is hard to assess, said Luca Nevola, the senior analyst for Yemen and the Gulf at the Armed Conflict Location & Event Data Project, a think tank.\n\n“Since they are targeting civilian areas, there’s a lot more victims. But it’s also difficult to assess how many because the Houthis are releasing these umbrella statements that cover all the victims ... or tend to stress only the civilian victims,” Nevola said.\n\nFurther complicating the situation is the U.S. strikes hitting military targets, said Mohammed al-Basha, a Yemen expert at the Basha Report risk advisory firm. He pointed to an American attack that Trump highlighted online with black-and-white strike footage, which might have killed about 70 fighters.\n\n“Although the Houthis claimed it was a tribal gathering, they neither released any footage nor named a single casualty, strongly suggesting the victims were not civilians but affiliated fighters,” al-Basha said. “However, the overnight strike on the Ras Isa Fuel Port marks the first mass-casualty incident the Houthis have openly acknowledged and publicized.”\n\nThe AP analyzed satellite images of the port provided by Planet Labs PBC that showed destroyed oil tanks and vehicles, and what appeared to be oil leaking into the Red Sea.\n\nWim Zwijnenburg, an analyst with the Dutch peace organization PAX, said it appeared at least three fuel storage tanks had been destroyed and that oil had leaked from mooring pipelines.\n\nThe U.S. airstrikes continued overnight into early Saturday, with the Houthis reporting them in Yemen’s al-Jawf, Sadaa and Sanaa governorates.\n\nThe U.S. accuses a Chinese company of aiding Houthi attacks\n\nA U.S. State Department spokesperson, Tammy Bruce, accused a Chinese commercial satellite image provider, Chang Guang Satellite Technology Co. Ltd., of “directly supporting Iran-backed Houthi terrorist attacks on U.S. interests.”\n\nDuring a briefing with reporters, Bruce did not elaborate in detail. But she acknowledged a report by The Financial Times that quoted anonymous American officials saying the company linked to the People’s Liberation Army has provided images allowing the rebels to target U.S. warships and commercial vessels traveling through the Red Sea corridor.\n\nBruce said “Beijing’s support” of the satellite company ... “contradicts their claims of being peace supporters.”\n\nResponding to a question about the allegation, Chinese Foreign Ministry spokesperson Lin Jian said Friday: “I am not familiar with the situation you mentioned.” However, he insisted China is seen as urging countries “to make more efforts conducive to regional peace and stability.”\n\n“Since the escalations in the Red Sea situation, China has been playing a positive role in de-escalating the situation,” Lin said. “Who is promoting talks for peace and deescalating the tensions, and who is imposing sanctions and pressure?”\n\nThe company didn’t respond to request for comment. The U.S. Treasury sanctioned it in 2023 for allegedly providing satellite images to the Russian mercenary force the Wagner Group as it fought in Ukraine.\n\nIt remains unclear whether Chang Guang is linked to the Chinese government. The U.S. government in the past has used images taken by American commercial satellite companies to share with allies, like Ukraine, to avoid releasing its own top-secret pictures.\n\nThis photo taken from video released by Al Masirah TV channel shows medics carrying a wounded man into the hospital after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.( Al Masirah TV via AP) This photo taken from video released by Al Masirah TV channel shows medics carrying a wounded man into the hospital after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.( Al Masirah TV via AP) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\n___\n\nAssociated Press writers Sam Mednick in Tel Aviv, Israel, and Tara Copp in Washington contributed to this report.",
    "clean_body": "dubai united arab emirates ap — a us airstrike on an important oil port held by yemen’s houthi rebels killed more than 70 people and wounded many others the iranianbacked rebel group said friday marking a major escalation in the military campaign president donald trump launched against the faction last month the overnight strike on the ras isa port sent massive fireballs billowing skyward and turned tanker trucks into burning wrecks it was the first american attack on a houthicontrolled oil facility in the new us bombing campaign it also came just before the resumption of negotiations in rome between the us and iran over tehran’s rapidly advancing nuclear program which washington has linked to its attacks in yemen the us is targeting the houthis because of the group’s attacks on shipping in the red sea a crucial global trade route and on israel the houthis are the last militant group in iran’s selfdescribed “axis of resistance” that is capable of regularly attacking israel the port is a major hub for incoming fuel shipments that power areas of yemen held by the houthis and analysts say the airstrike could seriously affect daily life there the houthis who said the attack killed at least 74 people and wounded 171 others aired graphic footage of the aftermath on their almasirah satellite news channel showing corpses strewn about the port and smashed tanker trucks they denounced the strike as a “completely unjustified aggression” this photo taken from video released by al masirah tv channel shows medics carrying a severely wounded person onto a stretcher after us airstrikes targeted the ras isa oil port held by yemen’s houthi rebels in hodeida yemen friday april 18 2025 al masirah tv via ap this photo taken from video released by al masirah tv channel shows medics carrying a severely wounded person onto a stretcher after us airstrikes targeted the ras isa oil port held by yemen’s houthi rebels in hodeida yemen friday april 18 2025 al masirah tv via ap share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more ap audio us strikes on a yemeni oil port kill 74 people houthis say in deadliest attack of trump campaign ap correspondent charles de ledesma reports us airstrikes targeting an oil port held by yemen’s houthi rebels killed more than 70 people with 170 others wounded the group says “it targets a vital civilian facility that has served the yemeni people for decades” the group said in a statement in this photo taken from video released by al masirah tv channel shows a burning oil tanker after us airstrikes targeted the ras isa oil port held by yemen’s houthi rebels in hodeida yemen friday april 18 2025 al masirah tv via ap in this photo taken from video released by al masirah tv channel shows a burning oil tanker after us airstrikes targeted the ras isa oil port held by yemen’s houthi rebels in hodeida yemen friday april 18 2025 al masirah tv via ap share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more us central command declined to answer any questions about possible civilian casualties but referred to a statement in which it said “this strike was not intended to harm the people of yemen” “us forces took action to eliminate this source of fuel for the iranbacked houthi terrorists and deprive them of illegal revenue that has funded houthi efforts to terrorize the entire region for over 10 years” it said in its statement a us official said the attack sent a message to those supplying fuel to the houthis despite sanctions the official spoke to the associated press on the condition of anonymity to provide details not yet made public hours after the us strike the houthis launched a missile toward israel that was intercepted the israeli military said sirens sounded in tel aviv and elsewhere meanwhile the houthis said they shot down another american mq9 predator drone which the us official acknowledged the port’s strategic significance the ras isa port is a collection of oil tanks and equipment that sits in yemen’s hodeida governorate along the red sea it is just off kamaran island which has been targeted by intense us airstrikes in recent days before the houthis took control of yemen’s capital sanaa in 2014 and sent the government into exile oil from the country’s energyrich marib governorate moved through ras isa for export but since the houthis don’t control that region the port now serves as an import hub for gasoline diesel and liquefied petroleum gas that help power those parts of yemen the houthis control a deadly escalation of trump’s yemen campaign the new us operation against the houthis under trump appears more extensive than attacks on the group were under president joe biden an ap review found the new campaign started after the rebels threatened to begin targeting “israeli” ships again over israel blocking aid from entering the gaza strip from november 2023 until this january the houthis targeted more than 100 merchant vessels with missiles and drones sinking two of them and killing four sailors that has greatly reduced the flow of trade through the red sea corridor which typically sees 1 trillion of goods move through it the houthis also launched attacks targeting american warships without success assessing the toll of the monthold us airstrike campaign has been difficult because the military hasn’t released information about the attacks including what was targeted and how many people were killed the houthis meanwhile strictly control access to attacked areas and don’t publish complete information on the strikes many of which likely have targeted military and security sites this photo taken from video released by al masirah tv channel shows medics carrying a dead person after us airstrikes targeted the ras isa oil port held by yemen’s houthi rebels in hodeida yemen friday april 18 2025 al masirah tv via ap this photo taken from video released by al masirah tv channel shows medics carrying a dead person after us airstrikes targeted the ras isa oil port held by yemen’s houthi rebels in hodeida yemen friday april 18 2025 al masirah tv via ap share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more the ras isa port airstrike is the deadliest known attack yet in the monthold campaign the actual cost in lives is hard to assess said luca nevola the senior analyst for yemen and the gulf at the armed conflict location event data project a think tank “since they are targeting civilian areas there’s a lot more victims but it’s also difficult to assess how many because the houthis are releasing these umbrella statements that cover all the victims or tend to stress only the civilian victims” nevola said further complicating the situation is the us strikes hitting military targets said mohammed albasha a yemen expert at the basha report risk advisory firm he pointed to an american attack that trump highlighted online with blackandwhite strike footage which might have killed about 70 fighters “although the houthis claimed it was a tribal gathering they neither released any footage nor named a single casualty strongly suggesting the victims were not civilians but affiliated fighters” albasha said “however the overnight strike on the ras isa fuel port marks the first masscasualty incident the houthis have openly acknowledged and publicized” the ap analyzed satellite images of the port provided by planet labs pbc that showed destroyed oil tanks and vehicles and what appeared to be oil leaking into the red sea wim zwijnenburg an analyst with the dutch peace organization pax said it appeared at least three fuel storage tanks had been destroyed and that oil had leaked from mooring pipelines the us airstrikes continued overnight into early saturday with the houthis reporting them in yemen’s aljawf sadaa and sanaa governorates the us accuses a chinese company of aiding houthi attacks a us state department spokesperson tammy bruce accused a chinese commercial satellite image provider chang guang satellite technology co ltd of “directly supporting iranbacked houthi terrorist attacks on us interests” during a briefing with reporters bruce did not elaborate in detail but she acknowledged a report by the financial times that quoted anonymous american officials saying the company linked to the people’s liberation army has provided images allowing the rebels to target us warships and commercial vessels traveling through the red sea corridor bruce said “beijing’s support” of the satellite company “contradicts their claims of being peace supporters” responding to a question about the allegation chinese foreign ministry spokesperson lin jian said friday “i am not familiar with the situation you mentioned” however he insisted china is seen as urging countries “to make more efforts conducive to regional peace and stability” “since the escalations in the red sea situation china has been playing a positive role in deescalating the situation” lin said “who is promoting talks for peace and deescalating the tensions and who is imposing sanctions and pressure” the company didn’t respond to request for comment the us treasury sanctioned it in 2023 for allegedly providing satellite images to the russian mercenary force the wagner group as it fought in ukraine it remains unclear whether chang guang is linked to the chinese government the us government in the past has used images taken by american commercial satellite companies to share with allies like ukraine to avoid releasing its own topsecret pictures this photo taken from video released by al masirah tv channel shows medics carrying a wounded man into the hospital after us airstrikes targeted the ras isa oil port held by yemen’s houthi rebels in hodeida yemen friday april 18 2025 al masirah tv via ap this photo taken from video released by al masirah tv channel shows medics carrying a wounded man into the hospital after us airstrikes targeted the ras isa oil port held by yemen’s houthi rebels in hodeida yemen friday april 18 2025 al masirah tv via ap share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more associated press writers sam mednick in tel aviv israel and tara copp in washington contributed to this report",
    "summary": "The overnight strike on the Ras Isa port sent massive fireballs billowing skyward and turned tanker trucks into burning wrecks.\nThe Houthis are the last militant group in Iran’s self-described “Axis of Resistance” that is capable of regularly attacking Israel.\nIn this photo taken from video released by Al Masirah TV channel shows a burning oil tanker after U.S. airstrikes targeted the Ras Isa oil port held by Yemen’s Houthi rebels in Hodeida, Yemen, Friday, April 18, 2025.\n( Al Masirah TV via AP) Share Share FacebookCopy Link copiedPrintEmailXLinkedInBlueskyFlipboardPinterestReddit Read MoreThe Ras Isa port airstrike is the deadliest known attack yet in the month-old campaign.\n( Al Masirah TV via AP) Share Share FacebookCopy Link copiedPrintEmailXLinkedInBlueskyFlipboardPinterestReddit Read More___Associated Press writers Sam Mednick in Tel Aviv, Israel, and Tara Copp in Washington contributed to this report.",
    "keywords": [
      "airstrike",
      "yemeni",
      "houthi",
      "al",
      "yemen",
      "escalates",
      "port",
      "campaign",
      "deadly",
      "houthis",
      "yemens",
      "ras",
      "oil",
      "tv",
      "masirah",
      "trumps"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/c26f859/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2F85%2Fc72260576a3e45f32f2826df5659%2Fda55e1329cfa40ad90a2cd3bcf761c8d",
    "t": 24
  },
  "https://apnews.com/article/orioles-reds-score-5b1ad3f7b579a9a102736b7fa8e75ca3": {
    "source": "AP News",
    "url": "https://apnews.com/article/orioles-reds-score-5b1ad3f7b579a9a102736b7fa8e75ca3",
    "date": "2025-04-20",
    "time": "21:10:41",
    "title": "Marte has 7 RBIs and Wynn has 6 as Reds score most runs since 1999 in 24-2 rout of Orioles",
    "body": "BALTIMORE (AP) — Noelvi Marte had seven RBIs and hit his first career grand slam with a drive off infielder Jorge Mateo, Austin Wynn had a career-high six RBIs and the Cincinnati Reds scored their most runs in 26 years in a 24-2 route of the Baltimore Orioles on Sunday.\n\nMarte finished with five hits, including his eighth-inning homer off Mateo. Wynn hit a three-run homer in the ninth off catcher Gary Sánchez.\n\nCincinnati scored its most runs since a 24-12 win at Colorado on May 19, 1999, and finished with 25 hits.\n\nBaltimore allowed its most runs since a 30-3 loss to Texas on Aug. 22, 2007.\n\nMarte, the No. 8 hitter, and Wynn, batting ninth, combined for 11 hits, the most from the final two spots in a batting order since at least 1901. Their 13 RBIs tied for second-most since RBIs became an official statistic in 1920.\n\nAustin Hays was 4 for 6 and finished his first series against his former team 8 for 14 with five RBIs.\n\nElly De La Cruz started a seven-run third with a home run off Charlie Morton (0-5), who allowed seven runs, seven hits and four walks over 2 1/3 innings in his shortest outing since September 2023.\n\nTaylor Rogers (1-0) worked the fifth inning of a bullpen game for the Reds, and Randy Wynne pitched three innings for his first career save.\n\nAdley Rutschman homered late for Baltimore.\n\nKey moment\n\nDe La Cruz sprung to his left at shortstop in the second and made a soaring grab to deny Jackson Holliday a single up the middle and likely RBI.\n\nKey stat\n\nWynn’s previous best was four RBIs for San Francisco in a 12-10 win over Atlanta on June 21, 2022.\n\nUp next\n\nReds: LHP Nick Lodolo (2-1, 2.31 ERA) pitches Monday as the nine-game trip continues at Miami, which starts RHP Max Meyer (1-2, 2.63).\n\nOrioles: RHP Dean Kremer (2-2, 6.41) pitches Tuesday at Washington in the opener of a six-game trip. LHP Mitchell Parker (2-1, 1.85) starts for the Nationals.\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "baltimore ap — noelvi marte had seven rbis and hit his first career grand slam with a drive off infielder jorge mateo austin wynn had a careerhigh six rbis and the cincinnati reds scored their most runs in 26 years in a 242 route of the baltimore orioles on sunday marte finished with five hits including his eighthinning homer off mateo wynn hit a threerun homer in the ninth off catcher gary sánchez cincinnati scored its most runs since a 2412 win at colorado on may 19 1999 and finished with 25 hits baltimore allowed its most runs since a 303 loss to texas on aug 22 2007 marte the no 8 hitter and wynn batting ninth combined for 11 hits the most from the final two spots in a batting order since at least 1901 their 13 rbis tied for secondmost since rbis became an official statistic in 1920 austin hays was 4 for 6 and finished his first series against his former team 8 for 14 with five rbis elly de la cruz started a sevenrun third with a home run off charlie morton 05 who allowed seven runs seven hits and four walks over 2 13 innings in his shortest outing since september 2023 taylor rogers 10 worked the fifth inning of a bullpen game for the reds and randy wynne pitched three innings for his first career save adley rutschman homered late for baltimore key moment de la cruz sprung to his left at shortstop in the second and made a soaring grab to deny jackson holliday a single up the middle and likely rbi key stat wynn’s previous best was four rbis for san francisco in a 1210 win over atlanta on june 21 2022 up next reds lhp nick lodolo 21 231 era pitches monday as the ninegame trip continues at miami which starts rhp max meyer 12 263 orioles rhp dean kremer 22 641 pitches tuesday at washington in the opener of a sixgame trip lhp mitchell parker 21 185 starts for the nationals ap mlb httpsapnewscomhubmlb",
    "summary": "BALTIMORE (AP) — Noelvi Marte had seven RBIs and hit his first career grand slam with a drive off infielder Jorge Mateo, Austin Wynn had a career-high six RBIs and the Cincinnati Reds scored their most runs in 26 years in a 24-2 route of the Baltimore Orioles on Sunday.\nCincinnati scored its most runs since a 24-12 win at Colorado on May 19, 1999, and finished with 25 hits.\nTheir 13 RBIs tied for second-most since RBIs became an official statistic in 1920.\nElly De La Cruz started a seven-run third with a home run off Charlie Morton (0-5), who allowed seven runs, seven hits and four walks over 2 1/3 innings in his shortest outing since September 2023.\nKey statWynn’s previous best was four RBIs for San Francisco in a 12-10 win over Atlanta on June 21, 2022.",
    "keywords": [
      "trip",
      "marte",
      "242",
      "21",
      "wynn",
      "seven",
      "win",
      "hits",
      "rbis",
      "runs",
      "reds",
      "rout",
      "finished",
      "1999",
      "score",
      "starts",
      "orioles"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/3513601/2147483647/strip/true/crop/5069x2851+0+264/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff9%2F2e%2F3d7dca8a0dc7d0ba995f060ebdfd%2F93a5be93310b4f99b8895456339448bc",
    "t": 22
  },
  "https://apnews.com/article/rockies-braves-score-cf8acded50f5535501cdfd9137542e43": {
    "source": "AP News",
    "url": "https://apnews.com/article/rockies-braves-score-cf8acded50f5535501cdfd9137542e43",
    "date": "2025-04-30",
    "time": "22:01:54",
    "title": "Rockies end 8-game losing streak, beat Sale and Braves 2-1 behind Doyle homer to improve to 5-25",
    "body": "DENVER (AP) — The Colorado Rockies ended an eight-game losing streak as Brenton Doyle hit a tiebreaking home run off reigning NL Cy Young Award winner Chris Sale in the third inning of a 2-1 win over the Atlanta Braves on Wednesday.\n\nColorado had lost 16 of its previous 17 games and had been outscored by 78 runs. At 5-25, the Rockies avoided joining the 1988 Baltimore Orioles as the only teams since 1901 to lose at least 26 of their first 30 games.\n\nDoyle homered on an inside fastball, ending an 0-for-20 skid with a 421-foot drive to left-center. He later doubled.\n\nRookie Chase Dollander (2-3), the Rockies’ No. 9 overall pick in the 2023 amateur draft, allowed one run, two hits and three walks in 5 2/3 innings with four strikeouts. Making his fifth big league start, he got his second win. Dollander came out after trying to pitch with a cracked fingernail.\n\nJake Bird, Seth Halvorsen and Zach Agnos finished a three-hitter, with Agnos getting three outs for his first major league save. Bird struck out two in 1 1/3 innings and has 24 strikeouts in 17 2/3 innings.\n\nColorado pitchers had allowed 14 hits in each of the first two games of the series.\n\nRyan McMahon went 0 for 3 and extended his hitless streak to a team record 0 for 34, one more than Desi Relaford in 2005. McMahon has two hits in his last 58 at-bats.\n\nDoyle’s solo home run in the third inning ended a skid of 20 consecutive at-bats without a hit.\n\nSale (1-3) struck out a second-high 10 and walked none, allowing two runs and five hits. The Braves had won nine of their previous 11 games.\n\nSean Bouchard put Colorado ahead with an RBI groundout in the second, but Michael Harris hit a run-scoring groundout in the third.\n\nKey moment\n\nAfter replacing Dollander with a 2-1 lead, Bird struck out Ozzie Albies with runners on first and second. Atlanta didn’t put a runner in scoring position for the remainder of the game.\n\nKey stat\n\nAtlanta’s Eli White ended a streak of six consecutive games with at least one extra-base hit.\n\nUp next\n\nBraves: RHP Grant Holmes (2-1, 4.50) starts a homestand opener Friday against the Los Angeles Dodgers and RHP Yoshinobu Yamamoto (3-2 and a major league-best 1.06)\n\nRockies: LHP Kyle Freeland (0-4, 5.93 ERA) starts Thursday at San Francisco, which goes with RHP Justin Verlander (0-2, 4.99).\n\n___\n\nAP MLB: https://apnews.com/hub/mlb",
    "clean_body": "denver ap — the colorado rockies ended an eightgame losing streak as brenton doyle hit a tiebreaking home run off reigning nl cy young award winner chris sale in the third inning of a 21 win over the atlanta braves on wednesday colorado had lost 16 of its previous 17 games and had been outscored by 78 runs at 525 the rockies avoided joining the 1988 baltimore orioles as the only teams since 1901 to lose at least 26 of their first 30 games doyle homered on an inside fastball ending an 0for20 skid with a 421foot drive to leftcenter he later doubled rookie chase dollander 23 the rockies’ no 9 overall pick in the 2023 amateur draft allowed one run two hits and three walks in 5 23 innings with four strikeouts making his fifth big league start he got his second win dollander came out after trying to pitch with a cracked fingernail jake bird seth halvorsen and zach agnos finished a threehitter with agnos getting three outs for his first major league save bird struck out two in 1 13 innings and has 24 strikeouts in 17 23 innings colorado pitchers had allowed 14 hits in each of the first two games of the series ryan mcmahon went 0 for 3 and extended his hitless streak to a team record 0 for 34 one more than desi relaford in 2005 mcmahon has two hits in his last 58 atbats doyle’s solo home run in the third inning ended a skid of 20 consecutive atbats without a hit sale 13 struck out a secondhigh 10 and walked none allowing two runs and five hits the braves had won nine of their previous 11 games sean bouchard put colorado ahead with an rbi groundout in the second but michael harris hit a runscoring groundout in the third key moment after replacing dollander with a 21 lead bird struck out ozzie albies with runners on first and second atlanta didn’t put a runner in scoring position for the remainder of the game key stat atlanta’s eli white ended a streak of six consecutive games with at least one extrabase hit up next braves rhp grant holmes 21 450 starts a homestand opener friday against the los angeles dodgers and rhp yoshinobu yamamoto 32 and a major leaguebest 106 rockies lhp kyle freeland 04 593 era starts thursday at san francisco which goes with rhp justin verlander 02 499 ap mlb httpsapnewscomhubmlb",
    "summary": "DENVER (AP) — The Colorado Rockies ended an eight-game losing streak as Brenton Doyle hit a tiebreaking home run off reigning NL Cy Young Award winner Chris Sale in the third inning of a 2-1 win over the Atlanta Braves on Wednesday.\nAt 5-25, the Rockies avoided joining the 1988 Baltimore Orioles as the only teams since 1901 to lose at least 26 of their first 30 games.\n9 overall pick in the 2023 amateur draft, allowed one run, two hits and three walks in 5 2/3 innings with four strikeouts.\nKey momentAfter replacing Dollander with a 2-1 lead, Bird struck out Ozzie Albies with runners on first and second.\nKey statAtlanta’s Eli White ended a streak of six consecutive games with at least one extra-base hit.",
    "keywords": [
      "rockies",
      "improve",
      "ended",
      "braves",
      "games",
      "rhp",
      "beat",
      "sale",
      "hits",
      "dollander",
      "end",
      "streak",
      "struck",
      "second",
      "losing",
      "doyle",
      "run",
      "homer"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/d3bb4fe/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff0%2Fdf%2Fcfb87c9cb218b3cc6310280fa3c9%2Ff4266e81e14b45f58dadf1f0e91a5049",
    "t": 12
  }
}