{
  "https://apnews.com/article/nasa-stuck-astronauts-77e8f0b988e483a793732297cd868490": {
    "source": "AP News",
    "url": "https://apnews.com/article/nasa-stuck-astronauts-77e8f0b988e483a793732297cd868490",
    "date": "2024-12-17",
    "time": "21:56:48",
    "title": "NASA’s 2 stuck astronauts face more time in space with return delayed until at least late March",
    "body": "CAPE CANAVERAL, Fla. (AP) — NASA’s two stuck astronauts just got their space mission extended again. That means they won’t be back on Earth until spring, 10 months after rocketing into orbit on Boeing’s Starliner capsule.\n\nNASA announced the latest delay in Butch Wilmore and Suni Williams’ homecoming on Tuesday.\n\nThe two test pilots planned on being away just a week or so when they blasted off June 5 on Boeing’s first astronaut flight to the International Space Station. Their mission grew from eight days to eight months after NASA decided to send the company’s problem-plagued Starliner capsule back empty in September.\n\nNow the pair won’t return until the end of March or even April because of a delay in launching their replacements, according to NASA.\n\nA fresh crew needs to launch before Wilmore and Williams can return and the next mission has been bumped more than a month, according to the space agency.\n\nNASA’s next crew of four was supposed to launch in February, followed by Wilmore and Williams’ return home by the end of that month alongside two other astronauts. But SpaceX needs more time to prepare the brand new capsule for liftoff. That launch is now scheduled for no earlier than late March.\n\nNASA said it considered using a different SpaceX capsule to fly up the replacement crew in order to keep the flights on schedule. But it decided the best option was to wait for the new capsule to transport the next crew.\n\nNASA prefers to have overlapping crews at the space station for a smoother transition, according to officials.\n\nMost space station missions last six months, with a few reaching a full year.\n\n___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group. The AP is solely responsible for all content.",
    "clean_body": "cape canaveral fla ap — nasa’s two stuck astronauts just got their space mission extended again that means they won’t be back on earth until spring 10 months after rocketing into orbit on boeing’s starliner capsule nasa announced the latest delay in butch wilmore and suni williams’ homecoming on tuesday the two test pilots planned on being away just a week or so when they blasted off june 5 on boeing’s first astronaut flight to the international space station their mission grew from eight days to eight months after nasa decided to send the company’s problemplagued starliner capsule back empty in september now the pair won’t return until the end of march or even april because of a delay in launching their replacements according to nasa a fresh crew needs to launch before wilmore and williams can return and the next mission has been bumped more than a month according to the space agency nasa’s next crew of four was supposed to launch in february followed by wilmore and williams’ return home by the end of that month alongside two other astronauts but spacex needs more time to prepare the brand new capsule for liftoff that launch is now scheduled for no earlier than late march nasa said it considered using a different spacex capsule to fly up the replacement crew in order to keep the flights on schedule but it decided the best option was to wait for the new capsule to transport the next crew nasa prefers to have overlapping crews at the space station for a smoother transition according to officials most space station missions last six months with a few reaching a full year the associated press health and science department receives support from the howard hughes medical institute’s science and educational media group the ap is solely responsible for all content",
    "summary": "CAPE CANAVERAL, Fla. (AP) — NASA’s two stuck astronauts just got their space mission extended again.\nThe two test pilots planned on being away just a week or so when they blasted off June 5 on Boeing’s first astronaut flight to the International Space Station.\nNASA’s next crew of four was supposed to launch in February, followed by Wilmore and Williams’ return home by the end of that month alongside two other astronauts.\nNASA prefers to have overlapping crews at the space station for a smoother transition, according to officials.\nMost space station missions last six months, with a few reaching a full year.",
    "keywords": [
      "nasas",
      "late",
      "astronauts",
      "face",
      "wilmore",
      "return",
      "williams",
      "months",
      "crew",
      "stuck",
      "mission",
      "delayed",
      "space",
      "station",
      "capsule",
      "launch"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/2fee34f/2147483647/strip/true/crop/5904x3321+48+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1b%2F86%2F320f762607b2d1da2208ccd6e00b%2F104c293428f44879bcee47bee6c1bf13",
    "t": 146
  }
}