{
  "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930": {
    "source": "AP News",
    "url": "https://apnews.com/article/cdc-reinstatements-c1f0b33d677e5a02a4df1210b82ca930",
    "date": "2025-03-05",
    "time": "19:46:20",
    "title": "‘Read this e-mail immediately': CDC tells about 180 fired employees to come back to work",
    "body": "▶ Follow live updates on President Donald Trump and his administration\n\nNEW YORK (AP) — The nation’s top public health agency says about 180 employees who were laid off two weeks ago can come back to work.\n\nEmails went out Tuesday to some Centers for Disease Control and Prevention probationary employees who got termination notices last month, according to current and former CDC employees.\n\nA message seen by the AP was sent with the subject line, “Read this e-mail immediately.” It said that “after further review and consideration,” a Feb. 15 termination notice has been rescinded and the employee was cleared to return to work on Wednesday. “You should return to duty under your previous work schedule,” it said. “We apologize for any disruption that this may have caused.”\n\nAbout 180 people received reinstatement emails, according to two federal health officials who were briefed on the tally but were not authorized to discuss it and spoke on condition of anonymity.\n\nIt’s not clear how many of the reinstated employees returned to work Wednesday. And it’s also unclear whether the employees would be spared from widespread job cuts that are expected soon across government agencies.\n\nA sign marks the entrance to the federal Centers for Disease Control and Prevention (CDC) in Atlanta, on Oct. 8, 2013. (AP Photo/David Goldman, File) A sign marks the entrance to the federal Centers for Disease Control and Prevention (CDC) in Atlanta, on Oct. 8, 2013. (AP Photo/David Goldman, File) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nThe CDC is the latest federal agency trying to coax back workers soon after they were dismissed as part of President Donald Trump’s and billionaire Elon Musk’s cost-cutting purge. Similar reversals have been made among employees responsible for medical device oversight, food safety, bird flu response, nuclear weapons and national parks.\n\nThe Atlanta-based CDC is charged with protecting Americans from outbreaks and other public health threats. Before the job cuts, the agency had about 13,000 employees.\n\nLast month, Trump administration officials told the CDC that nearly 1,300 of the agency’s probationary employees would be let go. That tally quickly changed, as the number who actually got termination notices turned out to be 700 to 750.\n\nWith 180 more people now being told they can return, the actual number of CDC employees terminated so far would seem to stand somewhere around 550. But federal health officials haven’t confirmed any specifics.\n\nHealth and Human Services Secretary Robert F. Kennedy Jr. last month pledged “ radical transparency ” at the department, but HHS officials have not provided detail about CDC staff changes and did not respond to emailed requests on Tuesday and Wednesday. An agency spokesman, Andrew Nixon, previously told the AP only that CDC had more full-time employees after the job cuts than it did before the COVID-19 pandemic.\n\nThose who received reinstatement emails included outbreak responders in two fellowship programs — a two-year training that prepares recent graduates to enter the public health workforce through field experience and a laboratory program that brings in doctorate-holding professionals.\n\nU.S. Sen. Raphael Warnock celebrated the reinstatements, but said it’s not enough.\n\n“Today’s announcement is a welcome relief, but until all fired CDC employees are restored, our country’s public health and national security will continue to be at risk,” Warnock, a Georgia Democrat, said in a statement Wednesday.\n\nContacting The Associated Press The Associated Press is an independent global news organization dedicated to factual, nonpartisan journalism. We are reporting on changes within the U.S. government under the new administration. If you are a former or current government worker who would like to share information with us, please message us on Signal at TheAP.1846\n\n___\n\nAssociated Press writer Michelle R. Smith in Providence, Rhode Island, contributed to this report.\n\n___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.",
    "clean_body": "▶ follow live updates on president donald trump and his administration new york ap — the nation’s top public health agency says about 180 employees who were laid off two weeks ago can come back to work emails went out tuesday to some centers for disease control and prevention probationary employees who got termination notices last month according to current and former cdc employees a message seen by the ap was sent with the subject line “read this email immediately” it said that “after further review and consideration” a feb 15 termination notice has been rescinded and the employee was cleared to return to work on wednesday “you should return to duty under your previous work schedule” it said “we apologize for any disruption that this may have caused” about 180 people received reinstatement emails according to two federal health officials who were briefed on the tally but were not authorized to discuss it and spoke on condition of anonymity it’s not clear how many of the reinstated employees returned to work wednesday and it’s also unclear whether the employees would be spared from widespread job cuts that are expected soon across government agencies a sign marks the entrance to the federal centers for disease control and prevention cdc in atlanta on oct 8 2013 ap photodavid goldman file a sign marks the entrance to the federal centers for disease control and prevention cdc in atlanta on oct 8 2013 ap photodavid goldman file share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more the cdc is the latest federal agency trying to coax back workers soon after they were dismissed as part of president donald trump’s and billionaire elon musk’s costcutting purge similar reversals have been made among employees responsible for medical device oversight food safety bird flu response nuclear weapons and national parks the atlantabased cdc is charged with protecting americans from outbreaks and other public health threats before the job cuts the agency had about 13000 employees last month trump administration officials told the cdc that nearly 1300 of the agency’s probationary employees would be let go that tally quickly changed as the number who actually got termination notices turned out to be 700 to 750 with 180 more people now being told they can return the actual number of cdc employees terminated so far would seem to stand somewhere around 550 but federal health officials haven’t confirmed any specifics health and human services secretary robert f kennedy jr last month pledged “ radical transparency ” at the department but hhs officials have not provided detail about cdc staff changes and did not respond to emailed requests on tuesday and wednesday an agency spokesman andrew nixon previously told the ap only that cdc had more fulltime employees after the job cuts than it did before the covid19 pandemic those who received reinstatement emails included outbreak responders in two fellowship programs — a twoyear training that prepares recent graduates to enter the public health workforce through field experience and a laboratory program that brings in doctorateholding professionals us sen raphael warnock celebrated the reinstatements but said it’s not enough “today’s announcement is a welcome relief but until all fired cdc employees are restored our country’s public health and national security will continue to be at risk” warnock a georgia democrat said in a statement wednesday contacting the associated press the associated press is an independent global news organization dedicated to factual nonpartisan journalism we are reporting on changes within the us government under the new administration if you are a former or current government worker who would like to share information with us please message us on signal at theap1846 associated press writer michelle r smith in providence rhode island contributed to this report the associated press health and science department receives support from the howard hughes medical institute’s science and educational media group and the robert wood johnson foundation the ap is solely responsible for all content",
    "summary": "Emails went out Tuesday to some Centers for Disease Control and Prevention probationary employees who got termination notices last month, according to current and former CDC employees.\nThe Atlanta-based CDC is charged with protecting Americans from outbreaks and other public health threats.\nWith 180 more people now being told they can return, the actual number of CDC employees terminated so far would seem to stand somewhere around 550.\nBut federal health officials haven’t confirmed any specifics.\n___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation.",
    "keywords": [
      "tells",
      "read",
      "public",
      "immediately",
      "press",
      "fired",
      "agency",
      "180",
      "ap",
      "employees",
      "work",
      "cdc",
      "health",
      "federal",
      "officials",
      "come",
      "email"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/977c96f/2147483647/strip/true/crop/3300x1856+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fbf%2Ff3%2Fc28219f311c09b7e59b5e82de64f%2Fcb1cfaf434544ae0bb7daf1919f6a315",
    "t": 68
  },
  "https://apnews.com/article/donald-trump-protests-53c6a993ee4892d4b5f9f90607f410e3": {
    "source": "AP News",
    "url": "https://apnews.com/article/donald-trump-protests-53c6a993ee4892d4b5f9f90607f410e3",
    "date": "2025-03-04",
    "time": "22:14:39",
    "title": "Demonstrators across 50 states look to unify a disparate opposition to Trump and his sweeping agenda",
    "body": "ATLANTA (AP) — As Donald Trump prepared Tuesday to address a joint session of Congress, protest groups gathered at parks, statehouses and other public grounds across the country to assail his presidency as dangerous and un-American.\n\nThe rallies and marches — set in motion by the fledgling 50501 Movement, a volunteer-driven group organized in the weeks after Trump’s inauguration — mark the latest attempt at national resistance to the hardened support of Trump’s “Make America Great Again” base and the success it has had in reshaping the Republican Party in the president’s populist image.\n\nDemonstrators protest across the street from the Capitol in the hours prior to President Donald Trump’s address to a joint session of Congress at the Capitol, Tuesday, March 4, 2025, in Washington. (AP Photo/Rod Lamkey, Jr.) Demonstrators protest across the street from the Capitol in the hours prior to President Donald Trump’s address to a joint session of Congress at the Capitol, Tuesday, March 4, 2025, in Washington. (AP Photo/Rod Lamkey, Jr.) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nYet some early scenes Tuesday vividly demonstrated the difficulty Democrats, progressives and everyday citizens face in marshaling a tangible response to Trump and the swift, sweeping actions of his second administration. Protesters have so many things to push back against — from tariffs to Trump’s reset on the war in Ukraine to the aggressive and sometimes legally dubious actions of the Department of Government Efficiency and its leader, billionaire Elon Musk, that it’s hard to know what to focus on.\n\n“There are so many things to fight, but I hope by being here we are starting some conversations,” said Sara Grummer-Strawn, who held a sign declaring “So Much Wrong, So Little Space,” followed by a small-print litany of topics from Ukraine and tariffs to potential education cuts to the denial of climate and vaccine science.\n\nAround her in Atlanta were hundreds of people marching and chanting about a range of Trump initiatives. There were Palestinian flags and Ukrainian flags, along with signs bemoaning Trump ending military aid to Ukraine as it fights off the invading Russian troops of Vladimir Putin.\n\nTrump was called a fascist, a “Russian asset,” “Putin’s Puppet” and “Wannabe King,” among other, more profane monikers. One signed implored “Punch Nazis,” reflecting an increasingly common effort to compare Trump’s presidency to Nazi Germany. Musk was a frequent target of mockery and ire. But there were also appeals for transgender rights, abortion rights and diversity. One understated sign appealed simply, “Save Our Parks.”\n\nPeople hold up signs as they protest the Trump administration outside City Hall, Tuesday, March 4, 2025, in San Francisco. (AP Photo/Godofredo A. Vásquez) People hold up signs as they protest the Trump administration outside City Hall, Tuesday, March 4, 2025, in San Francisco. (AP Photo/Godofredo A. Vásquez) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nEvents were scheduled throughout the day in all 50 states, ending late Tuesday in Hawaii.\n\nIn Austin, Texas, those gathered at the statehouse leaned in to support Ukraine. Pops of yellow — a nod to the colors of Ukraine’s national flag — dotted the crowd as protesters affixed sunflowers to their hair, hats and clothing. The Texas crowd, which numbered in the hundreds, eventually made its way through downtown, chanting, “Hey hey, ho ho, Donald Trump has got to go.”\n\n“I think protests can be impactful,” said Carol Goodwin, an Austin resident active in the local advocacy scene. “I think these smaller protests are valuable for the people who come to express their frustrations, and I think this movement will grow over time.”\n\nFor some participants, Tuesday recalled 50501’s first day of national action on Feb. 5 — or the many women’s marches in 2017, at the outset of Trump’s first term. But for many others, it was a new step in their engagement.\n\nPeople protest on Boston Common, Tuesday, March 4, 2025, in Boston. (AP Photo/Charles Krupa) People protest on Boston Common, Tuesday, March 4, 2025, in Boston. (AP Photo/Charles Krupa) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nGoodwin cited Trump’s tariffs against Canada and Mexico and the Oval Office exchange between Trump and Ukrainian President Volodymyr Zelenskyy last week as her reasons for attending.\n\nIn San Francisco, Michael Gray also pointed to that White House exchange with the Ukrainian leader. “The meeting with Zelenskyy ... just made us so disgusted to see an American president act that way on the world stage,” said the Santa Rosa, California, resident.\n\nGrayson Taylor, a 33-year-old who came to the Atlanta event, had not protested until this year. He described the actions of Trump, his Cabinet and Musk as a “billionaire coup” leading a government that “will be serving the ultra-rich.”\n\nAt the same rally, Sherri Frias, 58, said her concerns about the extension of Trump’s 2017 tax cuts for corporations and the wealthiest Americans — in conjunction with GOP proposals to roll back Medicaid and other aid programs — drew her to her first protest. Trump has urged Congress to renew the tax cuts, which are set to expire.\n\nAnother Atlanta attendee, 67-year-old Phyllis Bedford, said she came to her first political protest because she felt overwhelmed by the breadth of Trump’s actions.\n\n“I was thinking on my way here what I want to say about the situation,” said Bedford, who drove from Republican-leaning Snellville, on the outer edges of metro Atlanta. “All I could come up with is, ‘I’m sorry.’ I am sorry to Canada. I’m sorry, Mexico. I’m sorry, Greenland. I’m so, so sorry, Ukraine and President Zelensky. … We’re just so wrong. And we don’t all support this man.”\n\nDemonstrators protest near the U.S. Capitol ahead of President Donald Trump address to a joint session of Congress in Washington, Tuesday, March 4, 2025. (AP Photo/Jose Luis Magana) Demonstrators protest near the U.S. Capitol ahead of President Donald Trump address to a joint session of Congress in Washington, Tuesday, March 4, 2025. (AP Photo/Jose Luis Magana) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\n“For my own mental health, because it makes me feel like I’m doing something other than just the screaming inside of my head, right? That goes on every day, And I want to be heard.”\n\nThe protests come after some Republican members of Congress met angry town hall crowds during a recent congressional recess and as Democrats on Capitol Hill face pressure from voters on the left to be more outspoken.\n\nTaylor wants Democrats to be “rude and aggressive” like Republicans “have been for years.”\n\n“The Republican Party right now is so much more organized, and not divisive,” Smith said. “The Democratic Party, they have individual issues, but in my observation it’s hard for them to come together to deal with the real issues they want.”\n\nMultiple demonstrators said they want to see Democrats relentlessly highlight the real-world impact of Trump’s executive orders, Musk’s commission and the pending Republican budget plan.\n\nA protester waves an upside down American flag in front of the Capitol, Tuesday, March 4, 2025, in Washington. (AP Photo/Julia Demaree Nikhinson) A protester waves an upside down American flag in front of the Capitol, Tuesday, March 4, 2025, in Washington. (AP Photo/Julia Demaree Nikhinson) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nBedford worked in the financial aid office at Georgia State University. “Most of the kids I dealt with would not have been enrolled without Pell Grants and the (federal) financial aid system,” she said. “And now there’s just a war on education, and higher education especially.”\n\nGrummer-Strawn divides her time between Atlanta and Geneva, where her husband works for the World Health Organization after having spent 24 years at the U.S. Centers for Disease Control and Prevention. Trump has withdrawn the U.S. from supporting WHO and clamped down on the CDC’s research and public health advocacy.\n\n“We need to get people to stop and pause and see what each of his actions is leading to, connecting the dots,” Grummer-Strawn said, “even if people don’t think Ukraine and tariffs and public health policy affect them directly.”\n\nFrias, meanwhile, thinks Democrats are doing everything they can given GOP control on Capitol Hill and in the White House. The ultimate responsibility for action, she said, rests with “the people of the U.S.”\n\n—-\n\nLathan reported from Austin, Texas. Associated Press journalist Haven Daley contributed from San Francisco.",
    "clean_body": "atlanta ap — as donald trump prepared tuesday to address a joint session of congress protest groups gathered at parks statehouses and other public grounds across the country to assail his presidency as dangerous and unamerican the rallies and marches — set in motion by the fledgling 50501 movement a volunteerdriven group organized in the weeks after trump’s inauguration — mark the latest attempt at national resistance to the hardened support of trump’s “make america great again” base and the success it has had in reshaping the republican party in the president’s populist image demonstrators protest across the street from the capitol in the hours prior to president donald trump’s address to a joint session of congress at the capitol tuesday march 4 2025 in washington ap photorod lamkey jr demonstrators protest across the street from the capitol in the hours prior to president donald trump’s address to a joint session of congress at the capitol tuesday march 4 2025 in washington ap photorod lamkey jr share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more yet some early scenes tuesday vividly demonstrated the difficulty democrats progressives and everyday citizens face in marshaling a tangible response to trump and the swift sweeping actions of his second administration protesters have so many things to push back against — from tariffs to trump’s reset on the war in ukraine to the aggressive and sometimes legally dubious actions of the department of government efficiency and its leader billionaire elon musk that it’s hard to know what to focus on “there are so many things to fight but i hope by being here we are starting some conversations” said sara grummerstrawn who held a sign declaring “so much wrong so little space” followed by a smallprint litany of topics from ukraine and tariffs to potential education cuts to the denial of climate and vaccine science around her in atlanta were hundreds of people marching and chanting about a range of trump initiatives there were palestinian flags and ukrainian flags along with signs bemoaning trump ending military aid to ukraine as it fights off the invading russian troops of vladimir putin trump was called a fascist a “russian asset” “putin’s puppet” and “wannabe king” among other more profane monikers one signed implored “punch nazis” reflecting an increasingly common effort to compare trump’s presidency to nazi germany musk was a frequent target of mockery and ire but there were also appeals for transgender rights abortion rights and diversity one understated sign appealed simply “save our parks” people hold up signs as they protest the trump administration outside city hall tuesday march 4 2025 in san francisco ap photogodofredo a vásquez people hold up signs as they protest the trump administration outside city hall tuesday march 4 2025 in san francisco ap photogodofredo a vásquez share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more events were scheduled throughout the day in all 50 states ending late tuesday in hawaii in austin texas those gathered at the statehouse leaned in to support ukraine pops of yellow — a nod to the colors of ukraine’s national flag — dotted the crowd as protesters affixed sunflowers to their hair hats and clothing the texas crowd which numbered in the hundreds eventually made its way through downtown chanting “hey hey ho ho donald trump has got to go” “i think protests can be impactful” said carol goodwin an austin resident active in the local advocacy scene “i think these smaller protests are valuable for the people who come to express their frustrations and i think this movement will grow over time” for some participants tuesday recalled 50501’s first day of national action on feb 5 — or the many women’s marches in 2017 at the outset of trump’s first term but for many others it was a new step in their engagement people protest on boston common tuesday march 4 2025 in boston ap photocharles krupa people protest on boston common tuesday march 4 2025 in boston ap photocharles krupa share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more goodwin cited trump’s tariffs against canada and mexico and the oval office exchange between trump and ukrainian president volodymyr zelenskyy last week as her reasons for attending in san francisco michael gray also pointed to that white house exchange with the ukrainian leader “the meeting with zelenskyy just made us so disgusted to see an american president act that way on the world stage” said the santa rosa california resident grayson taylor a 33yearold who came to the atlanta event had not protested until this year he described the actions of trump his cabinet and musk as a “billionaire coup” leading a government that “will be serving the ultrarich” at the same rally sherri frias 58 said her concerns about the extension of trump’s 2017 tax cuts for corporations and the wealthiest americans — in conjunction with gop proposals to roll back medicaid and other aid programs — drew her to her first protest trump has urged congress to renew the tax cuts which are set to expire another atlanta attendee 67yearold phyllis bedford said she came to her first political protest because she felt overwhelmed by the breadth of trump’s actions “i was thinking on my way here what i want to say about the situation” said bedford who drove from republicanleaning snellville on the outer edges of metro atlanta “all i could come up with is ‘i’m sorry’ i am sorry to canada i’m sorry mexico i’m sorry greenland i’m so so sorry ukraine and president zelensky … we’re just so wrong and we don’t all support this man” demonstrators protest near the us capitol ahead of president donald trump address to a joint session of congress in washington tuesday march 4 2025 ap photojose luis magana demonstrators protest near the us capitol ahead of president donald trump address to a joint session of congress in washington tuesday march 4 2025 ap photojose luis magana share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more “for my own mental health because it makes me feel like i’m doing something other than just the screaming inside of my head right that goes on every day and i want to be heard” the protests come after some republican members of congress met angry town hall crowds during a recent congressional recess and as democrats on capitol hill face pressure from voters on the left to be more outspoken taylor wants democrats to be “rude and aggressive” like republicans “have been for years” “the republican party right now is so much more organized and not divisive” smith said “the democratic party they have individual issues but in my observation it’s hard for them to come together to deal with the real issues they want” multiple demonstrators said they want to see democrats relentlessly highlight the realworld impact of trump’s executive orders musk’s commission and the pending republican budget plan a protester waves an upside down american flag in front of the capitol tuesday march 4 2025 in washington ap photojulia demaree nikhinson a protester waves an upside down american flag in front of the capitol tuesday march 4 2025 in washington ap photojulia demaree nikhinson share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more bedford worked in the financial aid office at georgia state university “most of the kids i dealt with would not have been enrolled without pell grants and the federal financial aid system” she said “and now there’s just a war on education and higher education especially” grummerstrawn divides her time between atlanta and geneva where her husband works for the world health organization after having spent 24 years at the us centers for disease control and prevention trump has withdrawn the us from supporting who and clamped down on the cdc’s research and public health advocacy “we need to get people to stop and pause and see what each of his actions is leading to connecting the dots” grummerstrawn said “even if people don’t think ukraine and tariffs and public health policy affect them directly” frias meanwhile thinks democrats are doing everything they can given gop control on capitol hill and in the white house the ultimate responsibility for action she said rests with “the people of the us” — lathan reported from austin texas associated press journalist haven daley contributed from san francisco",
    "summary": "Trump was called a fascist, a “Russian asset,” “Putin’s Puppet” and “Wannabe King,” among other, more profane monikers.\n(AP Photo/Godofredo A. Vásquez) People hold up signs as they protest the Trump administration outside City Hall, Tuesday, March 4, 2025, in San Francisco.\n(AP Photo/Godofredo A. Vásquez) Share Share FacebookCopy Link copiedPrintEmailXLinkedInBlueskyFlipboardPinterestReddit Read MoreEvents were scheduled throughout the day in all 50 states, ending late Tuesday in Hawaii.\n(AP Photo/Jose Luis Magana) Share Share FacebookCopy Link copiedPrintEmailXLinkedInBlueskyFlipboardPinterestReddit Read More“For my own mental health, because it makes me feel like I’m doing something other than just the screaming inside of my head, right?\n(AP Photo/Julia Demaree Nikhinson) Share Share FacebookCopy Link copiedPrintEmailXLinkedInBlueskyFlipboardPinterestReddit Read MoreBedford worked in the financial aid office at Georgia State University.",
    "keywords": [
      "unify",
      "ap",
      "sweeping",
      "washington",
      "share",
      "opposition",
      "agenda",
      "protest",
      "disparate",
      "congress",
      "trumps",
      "states",
      "2025",
      "trump",
      "50",
      "look",
      "president",
      "demonstrators",
      "capitol"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/7ff98b3/2147483647/strip/true/crop/4507x2535+0+235/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5f%2F81%2F00327b68af0ee41668f09f3bb24e%2F4cdaa82961a042edbd6f055605f2576e",
    "t": 69
  },
  "https://apnews.com/article/trump-aranceles-canada-c00eb68af7ea36aa48df270e81602dcf": {
    "source": "AP News",
    "url": "https://apnews.com/article/trump-aranceles-canada-c00eb68af7ea36aa48df270e81602dcf",
    "date": "2025-03-11",
    "time": "14:25:11",
    "title": "EEUU cancela duplicar aranceles a acero canadiense luego que Ontario suspende aumento a electricidad",
    "body": "WASHINGTON (AP) — La amenaza que lanzó el presidente Donald Trump el martes de duplicar los aranceles sobre el acero y el aluminio canadiense del 25% al 50% llevó al gobierno de la provincia de Ontario a ordenar la suspensión de su plan de aplicar recargos al precio de la electricidad que vende a Estados Unidos.\n\nComo resultado, el asesor comercial de la Casa Blanca, Peter Navarro, dijo que el presidente estadounidense dio marcha atrás en su decisión de duplicar los aranceles sobre el acero y el aluminio, aunque el gobierno federal aún planea imponer un gravamen del 25% sobre todas las importaciones de acero y aluminio a partir del miércoles.\n\nLa respuesta de Canadá representó una victoria para Trump, pero también aumentó las preocupaciones en torno a las medidas arancelarias que han agitado al mercado de valores y suscitado riesgos de una recesión. La escalada y el enfriamiento en la actual guerra comercial entre Estados Unidos y Canadá únicamente incrementaron la creciente sensación de incertidumbre sobre cómo los aumentos de aranceles de Trump afectarán a las economías de ambas naciones.\n\nTrump estremeció los mercados la mañana del martes al afirmar que el aumento de los aranceles que entraría en vigor el miércoles había sido una respuesta al aumento del 25% en el precio de la electricidad que Ontario vende a Estados Unidos.\n\n“He ordenado a mi secretario de Comercio para que añada un arancel adicional del 25%, llevándolo al 50%, sobre todo el acero y aluminio que ingresa a Estados Unidos desde Canadá, una de las naciones con los aranceles más altos de cualquier lugar del mundo”, publicó Trump el martes en su plataforma Truth Social.\n\nEl primer ministro de Ontario, Doug Ford, declaró el martes por la tarde que recibió una llamada del secretario de Comercio de Estados Unidos, Howard Lutnick, tras la cual acordó eliminar el incremento de precios. Añadió que estaba seguro de que el presidente de Estados Unidos también daría marcha atrás a sus propios planes de aranceles del 50% sobre el acero y el aluminio canadienses.\n\n“Tiene que consultarlo con el presidente, pero estoy bastante seguro de que dará marcha atrás”, dijo Ford sobre la amenaza de Trump de gravar el acero y aluminio. “De ninguna manera vamos a someternos. Lo que vamos a hacer es tener una conversación constructiva”.\n\nDespués de la caída en los mercados del lunes y el subsecuente nerviosismo el martes, Trump se enfrenta a una creciente presión por demostrar que cuenta un plan sólido para hacer crecer la economía. Hasta ahora, el mandatario ha ratificado su postura sobre los aranceles y puede señalar el drama del martes como evidencia de que los impuestos sobre las importaciones son una valiosa herramienta de negociación, incluso si generan agitación en el mercado de valores.\n\nTrump insinuó el martes que los aranceles son fundamentales para cambiar la economía de Estados Unidos, independientemente de las oscilaciones del mercado de valores.\n\nEl mandatario estadounidense ha dado distintas explicaciones para su antagonismo hacia Canadá. Señaló que sus aranceles del 25% sobre todas las importaciones, algunos de los cuales quedaron suspendidos durante un mes, se deben al contrabando de fentanilo, y ha expresado objeciones a que Canadá imponga altos gravámenes a las importaciones de productos lácteos que castigan a los granjeros estadounidenses. También ha mantenido su llamado para que Canadá se convierta en parte de Estados Unidos como solución, una forma de burla que ha enfurecido a los gobernantes canadienses.\n\n“Lo único que tiene sentido es que Canadá se convierta en nuestro querido quincuagésimo primer estado”, publicó Trump el martes. “Esto haría que todos los aranceles, y todo lo demás, desaparezca por completo”.\n\nTensiones entre Estados Unidos y Canadá\n\nEl primer ministro entrante de Canadá, Mark Carney, dijo que su gobierno mantendrá los aranceles hasta que los estadounidenses muestren respeto y se comprometan con el libre comercio, después de que Trump amenazó con una devastación financiera histórica para Canadá.\n\nCarney, quien tomará posesión en lugar de Justin Trudeau en los próximos días, dijo que los más recientes aranceles de Trump son un ataque a los trabajadores, las familias y las empresas canadienses.\n\n“Mi gobierno mantendrá nuestros aranceles hasta que los estadounidenses nos muestren respeto y asuman compromisos creíbles y fiables con el comercio libre y justo”, dijo Carney en un comunicado.\n\nLos funcionarios canadienses planean imponer aranceles de represalia en respuesta al gravamen sobre el acero y el aluminio, los cuales se tiene previsto que se den a conocer el miércoles.\n\nCarney se refería la primera ronda de aranceles de represalia de Canadá por 30.000 millones de dólares canadienses (21.000 millones de dólares estadounidenses) que se han aplicado a productos estadounidenses, como el jugo de naranja, la mantequilla de cacahuate, el café, los electrodomésticos, el calzado, los cosméticos, las motocicletas y determinados productos de pulpa y papel.\n\nTrump también ha impuesto a México aranceles del 25% debido a su descontento con el narcotráfico y la inmigración ilegal, aunque suspendió durante un mes los impuestos a las importaciones que cumplen con el pacto comercial T-MEC firmado en 2020.\n\nCuando se le preguntó sobre si México temía enfrentarse a los mismos aranceles del 50% sobre el acero y el aluminio que Canadá, la presidenta Claudia Sheinbaum, dijo: “No, nosotros somos respetuosos”.\n\nTrump participó el martes en una sesión de preguntas y respuestas con Business Roundtable, una asociación comercial de CEO a la que cortejó durante la campaña de 2024 con la promesa de tasas impositivas corporativas más bajas para los fabricantes nacionales. Pero sus aranceles sobre Canadá, México, China, y posiblemente más sobre Europa, Brasil, Corea del Sur, medicamentos farmacéuticos, cobre, madera y microprocesadores— equivaldrían a un enorme aumento de impuestos.\n\nEl voto de desconfianza del mercado de valores durante las últimas dos semanas pone al presidente en un dilema entre su entusiasmo por gravar las importaciones y su imagen como un político que entiende de negocios basado en sus propias experiencias en bienes raíces, medios y marketing.\n\n“Los aranceles están teniendo un impacto sumamente positivo — lo tendrán, y lo están teniendo”, declaró Trump ante la reunión de CEO, afirmando que los impuestos a las importaciones harían que más fábricas se reubiquen en Estados Unidos.\n\nAumentan las preocupaciones de una recesión\n\nEl economista de la Universidad de Harvard Larry Summers, secretario del Tesoro durante el gobierno de Bill Clinton, calcula que las probabilidades de una recesión son 50-50. El banco de inversión Goldman Sachs ajustó a la baja su pronóstico de crecimiento para este año: de 2,2% a 1,7%. Aumentó modestamente su probabilidad de recesión al 20% “porque la Casa Blanca tiene la opción de revertir los cambios de política si los riesgos a la baja comienzan a parecer más serios”.\n\nTrump ha tratado de asegurar al público que sus aranceles causarían una cierta “transición” para la economía, en la que los impuestos han impulsado a más empresas a comenzar un proceso de varios años para reubicar sus fábricas en Estados Unidos a fin de evitar los aranceles. Pero el domingo encendió las alarmas durante una entrevista en la que no descartó una posible recesión.\n\nContinúa el desplome del mercado de valores\n\nLa promesa de grandes cosas por venir no eliminó la ansiedad, y el índice bursátil S&P 500 cayó 2,7% el lunes, lo que ha borrado las ganancias con las que el mercado recibió la victoria electoral de Trump en noviembre de 2024. El índice S&P 500 cayó aproximadamente un 0,8% en las operaciones del martes por la tarde, recuperándose de una caída inicial después de que Ontario dio marcha atrás a su incremento en los precios de la electricidad.\n\nTrump ha confiado desde hace tiempo en el mercado de valores como un indicador económico y político a seguir, sólo para aparentemente ignorarlo mientras sigue decidido hasta ahora a imponer aranceles. Cuando ganó las elecciones el año pasado, proclamó que quería que se considerara que su mandato había comenzado el 6 de noviembre de 2024, el día de las elecciones, en lugar de la fecha de su toma de posesión del 20 de enero de 2025, para que se le pudieran atribuir las ganancias bursátiles postelectorales.\n\nTrump también advirtió repetidamente de una caída libre de la economía si perdía las elecciones.\n\n“Si no gano tendrán una depresión al estilo de 1929. Disfrútenla”, dijo Trump durante un mitin en agosto pasado en Pensilvania.\n\n___\n\nFabiola Sánchez contribuyó a este despacho desde Ciudad de México. Gillies informó desde Toronto.\n\n___\n\nEsta historia fue traducida del inglés por un editor de AP con la ayuda de una herramienta de inteligencia artificial generativa.",
    "clean_body": "washington ap — la amenaza que lanzó el presidente donald trump el martes de duplicar los aranceles sobre el acero y el aluminio canadiense del 25 al 50 llevó al gobierno de la provincia de ontario a ordenar la suspensión de su plan de aplicar recargos al precio de la electricidad que vende a estados unidos como resultado el asesor comercial de la casa blanca peter navarro dijo que el presidente estadounidense dio marcha atrás en su decisión de duplicar los aranceles sobre el acero y el aluminio aunque el gobierno federal aún planea imponer un gravamen del 25 sobre todas las importaciones de acero y aluminio a partir del miércoles la respuesta de canadá representó una victoria para trump pero también aumentó las preocupaciones en torno a las medidas arancelarias que han agitado al mercado de valores y suscitado riesgos de una recesión la escalada y el enfriamiento en la actual guerra comercial entre estados unidos y canadá únicamente incrementaron la creciente sensación de incertidumbre sobre cómo los aumentos de aranceles de trump afectarán a las economías de ambas naciones trump estremeció los mercados la mañana del martes al afirmar que el aumento de los aranceles que entraría en vigor el miércoles había sido una respuesta al aumento del 25 en el precio de la electricidad que ontario vende a estados unidos “he ordenado a mi secretario de comercio para que añada un arancel adicional del 25 llevándolo al 50 sobre todo el acero y aluminio que ingresa a estados unidos desde canadá una de las naciones con los aranceles más altos de cualquier lugar del mundo” publicó trump el martes en su plataforma truth social el primer ministro de ontario doug ford declaró el martes por la tarde que recibió una llamada del secretario de comercio de estados unidos howard lutnick tras la cual acordó eliminar el incremento de precios añadió que estaba seguro de que el presidente de estados unidos también daría marcha atrás a sus propios planes de aranceles del 50 sobre el acero y el aluminio canadienses “tiene que consultarlo con el presidente pero estoy bastante seguro de que dará marcha atrás” dijo ford sobre la amenaza de trump de gravar el acero y aluminio “de ninguna manera vamos a someternos lo que vamos a hacer es tener una conversación constructiva” después de la caída en los mercados del lunes y el subsecuente nerviosismo el martes trump se enfrenta a una creciente presión por demostrar que cuenta un plan sólido para hacer crecer la economía hasta ahora el mandatario ha ratificado su postura sobre los aranceles y puede señalar el drama del martes como evidencia de que los impuestos sobre las importaciones son una valiosa herramienta de negociación incluso si generan agitación en el mercado de valores trump insinuó el martes que los aranceles son fundamentales para cambiar la economía de estados unidos independientemente de las oscilaciones del mercado de valores el mandatario estadounidense ha dado distintas explicaciones para su antagonismo hacia canadá señaló que sus aranceles del 25 sobre todas las importaciones algunos de los cuales quedaron suspendidos durante un mes se deben al contrabando de fentanilo y ha expresado objeciones a que canadá imponga altos gravámenes a las importaciones de productos lácteos que castigan a los granjeros estadounidenses también ha mantenido su llamado para que canadá se convierta en parte de estados unidos como solución una forma de burla que ha enfurecido a los gobernantes canadienses “lo único que tiene sentido es que canadá se convierta en nuestro querido quincuagésimo primer estado” publicó trump el martes “esto haría que todos los aranceles y todo lo demás desaparezca por completo” tensiones entre estados unidos y canadá el primer ministro entrante de canadá mark carney dijo que su gobierno mantendrá los aranceles hasta que los estadounidenses muestren respeto y se comprometan con el libre comercio después de que trump amenazó con una devastación financiera histórica para canadá carney quien tomará posesión en lugar de justin trudeau en los próximos días dijo que los más recientes aranceles de trump son un ataque a los trabajadores las familias y las empresas canadienses “mi gobierno mantendrá nuestros aranceles hasta que los estadounidenses nos muestren respeto y asuman compromisos creíbles y fiables con el comercio libre y justo” dijo carney en un comunicado los funcionarios canadienses planean imponer aranceles de represalia en respuesta al gravamen sobre el acero y el aluminio los cuales se tiene previsto que se den a conocer el miércoles carney se refería la primera ronda de aranceles de represalia de canadá por 30000 millones de dólares canadienses 21000 millones de dólares estadounidenses que se han aplicado a productos estadounidenses como el jugo de naranja la mantequilla de cacahuate el café los electrodomésticos el calzado los cosméticos las motocicletas y determinados productos de pulpa y papel trump también ha impuesto a méxico aranceles del 25 debido a su descontento con el narcotráfico y la inmigración ilegal aunque suspendió durante un mes los impuestos a las importaciones que cumplen con el pacto comercial tmec firmado en 2020 cuando se le preguntó sobre si méxico temía enfrentarse a los mismos aranceles del 50 sobre el acero y el aluminio que canadá la presidenta claudia sheinbaum dijo “no nosotros somos respetuosos” trump participó el martes en una sesión de preguntas y respuestas con business roundtable una asociación comercial de ceo a la que cortejó durante la campaña de 2024 con la promesa de tasas impositivas corporativas más bajas para los fabricantes nacionales pero sus aranceles sobre canadá méxico china y posiblemente más sobre europa brasil corea del sur medicamentos farmacéuticos cobre madera y microprocesadores— equivaldrían a un enorme aumento de impuestos el voto de desconfianza del mercado de valores durante las últimas dos semanas pone al presidente en un dilema entre su entusiasmo por gravar las importaciones y su imagen como un político que entiende de negocios basado en sus propias experiencias en bienes raíces medios y marketing “los aranceles están teniendo un impacto sumamente positivo — lo tendrán y lo están teniendo” declaró trump ante la reunión de ceo afirmando que los impuestos a las importaciones harían que más fábricas se reubiquen en estados unidos aumentan las preocupaciones de una recesión el economista de la universidad de harvard larry summers secretario del tesoro durante el gobierno de bill clinton calcula que las probabilidades de una recesión son 5050 el banco de inversión goldman sachs ajustó a la baja su pronóstico de crecimiento para este año de 22 a 17 aumentó modestamente su probabilidad de recesión al 20 “porque la casa blanca tiene la opción de revertir los cambios de política si los riesgos a la baja comienzan a parecer más serios” trump ha tratado de asegurar al público que sus aranceles causarían una cierta “transición” para la economía en la que los impuestos han impulsado a más empresas a comenzar un proceso de varios años para reubicar sus fábricas en estados unidos a fin de evitar los aranceles pero el domingo encendió las alarmas durante una entrevista en la que no descartó una posible recesión continúa el desplome del mercado de valores la promesa de grandes cosas por venir no eliminó la ansiedad y el índice bursátil sp 500 cayó 27 el lunes lo que ha borrado las ganancias con las que el mercado recibió la victoria electoral de trump en noviembre de 2024 el índice sp 500 cayó aproximadamente un 08 en las operaciones del martes por la tarde recuperándose de una caída inicial después de que ontario dio marcha atrás a su incremento en los precios de la electricidad trump ha confiado desde hace tiempo en el mercado de valores como un indicador económico y político a seguir sólo para aparentemente ignorarlo mientras sigue decidido hasta ahora a imponer aranceles cuando ganó las elecciones el año pasado proclamó que quería que se considerara que su mandato había comenzado el 6 de noviembre de 2024 el día de las elecciones en lugar de la fecha de su toma de posesión del 20 de enero de 2025 para que se le pudieran atribuir las ganancias bursátiles postelectorales trump también advirtió repetidamente de una caída libre de la economía si perdía las elecciones “si no gano tendrán una depresión al estilo de 1929 disfrútenla” dijo trump durante un mitin en agosto pasado en pensilvania fabiola sánchez contribuyó a este despacho desde ciudad de méxico gillies informó desde toronto esta historia fue traducida del inglés por un editor de ap con la ayuda de una herramienta de inteligencia artificial generativa",
    "summary": "Trump estremeció los mercados la mañana del martes al afirmar que el aumento de los aranceles que entraría en vigor el miércoles había sido una respuesta al aumento del 25% en el precio de la electricidad que Ontario vende a Estados Unidos.\nAñadió que estaba seguro de que el presidente de Estados Unidos también daría marcha atrás a sus propios planes de aranceles del 50% sobre el acero y el aluminio canadienses.\nTrump insinuó el martes que los aranceles son fundamentales para cambiar la economía de Estados Unidos, independientemente de las oscilaciones del mercado de valores.\n“Esto haría que todos los aranceles, y todo lo demás, desaparezca por completo”.\nPero el domingo encendió las alarmas durante una entrevista en la que no descartó una posible recesión.",
    "keywords": [
      "en",
      "ontario",
      "luego",
      "una",
      "del",
      "el",
      "las",
      "que",
      "canadiense",
      "duplicar",
      "la",
      "los",
      "y",
      "eeuu",
      "electricidad",
      "cancela",
      "suspende",
      "aumento",
      "aranceles"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/fee16ee/2147483647/strip/true/crop/3501x1969+0+182/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F65%2F37%2Fdb97559a48effb5805b72aa72762%2F8c6f181f522b49c190e8f288912e6625",
    "t": 62
  },
  "https://apnews.com/article/roberta-flack-memorial-8b8b7151a5c603db8a87a7b1960c554e": {
    "source": "AP News",
    "url": "https://apnews.com/article/roberta-flack-memorial-8b8b7151a5c603db8a87a7b1960c554e",
    "date": "2025-03-10",
    "time": "04:00:32",
    "title": "Lauryn Hill and Stevie Wonder delight at Roberta Flack’s ‘Celebration of Life’ memorial",
    "body": "NEW YORK (AP) — A public memorial service bursting with music, including planned performances by Stevie Wonder and a surprise one by Lauryn Hill and Wyclef Jean of the Fugees, celebrated the life and legacy of the Grammy-winning singer and pianist Roberta Flack.\n\nFlack, whose intimate vocal and musical style made her one of the top recording artists of the 1970s and an influential performer long after, died last month at age 88.\n\nShe’s best-known for her transformative covers of “The First Time Ever I Saw Your Face” and “Killing Me Softly With His Song.” Both were expertly handled by Hill at the ceremony held Monday afternoon at New York’s Abyssinian Baptist Church.\n\nWonder followed the set and the Rev. Al Sharpton gave the eulogy.\n\nFlack “put a soundtrack to Black dignity,” Sharpton said.\n\nAs many said in their tributes, Flack’s musical genius stemmed from her ability to seamlessly move between soul, jazz, gospel and beyond.\n\nHer “Celebration of Life” memorial was livestreamed at www.RobertaFlack.com and on YouTube.\n\nHere are some highlights:\n\nFor the memory of a singing legend, a historic location\n\nFlack’s memorial was open to the public at the Abyssinian Baptist Church, a historic Harlem institution. Founded in 1808, it is one of the oldest Black Baptist churches in the U.S.\n\nThe church was decorated for the ceremony with stunning white and yellow bouquets. Seats filled quickly. At center, a screen showed a young Flack at the piano and played highlights of her career. Later, it would broadcast music industry legends paying tribute to Flack, including Clive Davis,Dionne Warwick, India.Arie and Alicia Keys.\n\nIt was a fitting location for such a celebration: Flack grew up with church gospel and her mother played organ at the Lomax African Methodist Episcopal Church in Arlington, Virginia. As a teen, she began accompanying the church choir on piano.\n\nThe ceremony detoured from a program handed out to attendees. It featured a powerful quote from Flack on the back that Arie would include in her message.\n\n“Remember: Always walk in the light,” Flack once said. “If you feel like you’re not walking in it, go find it. Love the Light.”\n\nCelebrating a life in music — through music\n\n“Her existence was a form of resistance,” Hill said in her speech, holding back tears.\n\nHill’s appearance was unexpected but fitting. In the 1990s, her hip-hop trio the Fugees did a masterful take on Flack’s cover “Killing Me Softly With His Song.” It won the group a Grammy, two decades after Flack took home the record of the year trophy for the song.\n\n“I adore Ms. Roberta Flack,” she said. “Roberta Flack is legend.”\n\nShe then launched into a cover of “The First Time Ever I Saw Your Face” followed by “Killing Me Softly With His Song” with the Fugees’ Wyclef Jean — and Wonder joining in on harmonica.\n\nA legend who needed no introduction but certainly received one with roaring applause, Wonder followed up.\n\n“The great thing about not having the ability to see with your eyes is the great opportunity of being able to even better see with your heart. And so I knew how beautiful Roberta was, not seeing her visually but being able to see and feel her heart,” Wonder said.\n\nHe performed his song “If It’s Magic,” accompanied only by a harpist. Then he sat at the piano to sing with the harpist a song he wrote for Flack, “I Can See the Sun in Late December.”\n\n“I love you, Roberta. And I will see you,” Wonder said at the end.\n\nEarlier, songwriter and performer Valerie Simpson of Ashford & Simpson played piano and sang an extended take of “Ain’t Nothing Like the Real Thing” interspersed with recollections of her friend.\n\n“But that voice. Aw, she’d just grab you in the heart. And then when she touched the keys, she knew how to dig down deep,” Simpson said.\n\nSimpson recalled being tapped to perform in “Chicago” for her 2018 Broadway debut and how she told Flack she wasn’t sure if she could act.\n\n“She looked at me and said, ‘Girl, where’s the script? Bring it over here. We’re going to work on this thing. We’re going to do this,’” remembered Simpson.\n\nNew Orleans singer and piano player Davell Crawford performed a soulful version of Flack’s song “Just When I Needed You” to celebratory shouts and cheers.\n\nA legendary artist remembered\n\n“Many of us are here today because she has touched not just our hearts but she also touched our souls,” said the Rev. Dr. Kevin R. Johnson, the senior church pastor who led the service.\n\nChoir performances including a rousing rendition of “Amazing Grace” came in between a video recollection of Flack’s life and scripture readings.\n\n“The reason we’re here is because she made a difference,” Sharpton said. And we should all ask ourselves when it comes our time, will they pack a church for you? If Roberta were here tonight, she would tell you, ‘Don’t just praise me, emulate me.’”\n\nActor Phylicia Rashad remembered first seeing Flack perform when she was a student at Howard University — to an audience that grew rapt by her quiet, steady voice.\n\nFlack lived comfortably with her genius and without having to proclaim it to people, Rashad said.\n\n“She wore that like a loose fitting garment and lived her life attending to that which she cared for most: music, love and humanity,” Rashad said.\n\n___\n\nMead Gruver contributed to this report from Cheyenne, Wyoming.",
    "clean_body": "new york ap — a public memorial service bursting with music including planned performances by stevie wonder and a surprise one by lauryn hill and wyclef jean of the fugees celebrated the life and legacy of the grammywinning singer and pianist roberta flack flack whose intimate vocal and musical style made her one of the top recording artists of the 1970s and an influential performer long after died last month at age 88 she’s bestknown for her transformative covers of “the first time ever i saw your face” and “killing me softly with his song” both were expertly handled by hill at the ceremony held monday afternoon at new york’s abyssinian baptist church wonder followed the set and the rev al sharpton gave the eulogy flack “put a soundtrack to black dignity” sharpton said as many said in their tributes flack’s musical genius stemmed from her ability to seamlessly move between soul jazz gospel and beyond her “celebration of life” memorial was livestreamed at wwwrobertaflackcom and on youtube here are some highlights for the memory of a singing legend a historic location flack’s memorial was open to the public at the abyssinian baptist church a historic harlem institution founded in 1808 it is one of the oldest black baptist churches in the us the church was decorated for the ceremony with stunning white and yellow bouquets seats filled quickly at center a screen showed a young flack at the piano and played highlights of her career later it would broadcast music industry legends paying tribute to flack including clive davisdionne warwick indiaarie and alicia keys it was a fitting location for such a celebration flack grew up with church gospel and her mother played organ at the lomax african methodist episcopal church in arlington virginia as a teen she began accompanying the church choir on piano the ceremony detoured from a program handed out to attendees it featured a powerful quote from flack on the back that arie would include in her message “remember always walk in the light” flack once said “if you feel like you’re not walking in it go find it love the light” celebrating a life in music — through music “her existence was a form of resistance” hill said in her speech holding back tears hill’s appearance was unexpected but fitting in the 1990s her hiphop trio the fugees did a masterful take on flack’s cover “killing me softly with his song” it won the group a grammy two decades after flack took home the record of the year trophy for the song “i adore ms roberta flack” she said “roberta flack is legend” she then launched into a cover of “the first time ever i saw your face” followed by “killing me softly with his song” with the fugees’ wyclef jean — and wonder joining in on harmonica a legend who needed no introduction but certainly received one with roaring applause wonder followed up “the great thing about not having the ability to see with your eyes is the great opportunity of being able to even better see with your heart and so i knew how beautiful roberta was not seeing her visually but being able to see and feel her heart” wonder said he performed his song “if it’s magic” accompanied only by a harpist then he sat at the piano to sing with the harpist a song he wrote for flack “i can see the sun in late december” “i love you roberta and i will see you” wonder said at the end earlier songwriter and performer valerie simpson of ashford simpson played piano and sang an extended take of “ain’t nothing like the real thing” interspersed with recollections of her friend “but that voice aw she’d just grab you in the heart and then when she touched the keys she knew how to dig down deep” simpson said simpson recalled being tapped to perform in “chicago” for her 2018 broadway debut and how she told flack she wasn’t sure if she could act “she looked at me and said ‘girl where’s the script bring it over here we’re going to work on this thing we’re going to do this’” remembered simpson new orleans singer and piano player davell crawford performed a soulful version of flack’s song “just when i needed you” to celebratory shouts and cheers a legendary artist remembered “many of us are here today because she has touched not just our hearts but she also touched our souls” said the rev dr kevin r johnson the senior church pastor who led the service choir performances including a rousing rendition of “amazing grace” came in between a video recollection of flack’s life and scripture readings “the reason we’re here is because she made a difference” sharpton said and we should all ask ourselves when it comes our time will they pack a church for you if roberta were here tonight she would tell you ‘don’t just praise me emulate me’” actor phylicia rashad remembered first seeing flack perform when she was a student at howard university — to an audience that grew rapt by her quiet steady voice flack lived comfortably with her genius and without having to proclaim it to people rashad said “she wore that like a loose fitting garment and lived her life attending to that which she cared for most music love and humanity” rashad said mead gruver contributed to this report from cheyenne wyoming",
    "summary": "NEW YORK (AP) — A public memorial service bursting with music, including planned performances by Stevie Wonder and a surprise one by Lauryn Hill and Wyclef Jean of the Fugees, celebrated the life and legacy of the Grammy-winning singer and pianist Roberta Flack.\nLove the Light.”Celebrating a life in music — through music“Her existence was a form of resistance,” Hill said in her speech, holding back tears.\n“I adore Ms. Roberta Flack,” she said.\nNew Orleans singer and piano player Davell Crawford performed a soulful version of Flack’s song “Just When I Needed You” to celebratory shouts and cheers.\nChoir performances including a rousing rendition of “Amazing Grace” came in between a video recollection of Flack’s life and scripture readings.",
    "keywords": [
      "music",
      "delight",
      "roberta",
      "stevie",
      "flacks",
      "song",
      "wonder",
      "hill",
      "flack",
      "touched",
      "lauryn",
      "church",
      "piano",
      "life",
      "celebration",
      "memorial"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/1e384ff/2147483647/strip/true/crop/4956x2788+0+258/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2Fe7%2F8a19f49af6495477b5e5a1699071%2F2704b8fb8a1e4529b259388f160fdbdf",
    "t": 63
  },
  "https://apnews.com/article/inflation-economy-prices-67791b46f1ad3c197975a75ee35226be": {
    "source": "AP News",
    "url": "https://apnews.com/article/inflation-economy-prices-67791b46f1ad3c197975a75ee35226be",
    "date": "2025-03-07",
    "time": "17:32:47",
    "title": "Fed Chair Powell says interest rates on hold with economic uncertainty widespread",
    "body": "NEW YORK (AP) — The Federal Reserve is likely to keep its key interest rate unchanged in the coming months as it waits for widespread “uncertainty” stemming from President Donald Trump’s policies to resolve, Chair Jerome Powell said Friday at a conference in New York.\n\nPowell said the Trump administration is making policy changes in several areas, including trade, taxes, government spending, immigration and regulation, and added that the “net effect” of those changes are what will matter for the economy and the Fed’s interest rate policies.\n\n“While there have been recent developments in some of these areas, especially trade policy, uncertainty around the changes and their likely effects remains high,” Powell said. “As we parse the incoming information, we are focused on separating the signal from the noise as the outlook evolves. We do not need to be in a hurry, and are well positioned to wait for greater clarity.”\n\nMost economists say that Trump’s plans to slap tariffs on a wide array of imports, including 25% duties on goods from Canada and Mexico that he partially delayed Thursday, will push up prices and slow growth. But many also expect that tax cuts and deregulation could boost the economy.\n\nPowell’s comments pushed some traders to pare back their forecasts for how many interest rate cuts the Fed may deliver this year. They had been banking on at least three following a stream of weaker-than-expected reports on the U.S. economy. But Powell reiterated the Fed is likely on hold for a while. That sent Treasury yields higher in the bond market.\n\nRate reductions could help bring down borrowing costs for mortgages, auto loans, credit cards, and business loans.\n\nPowell, in a question and answer session, acknowledged that typically tariffs would cause a “one-time” price increase, rather than persistent inflation, and the Fed could ignore such a temporary effect. Treasury Secretary Scott Bessent on Thursday made a similar argument: “We could get a one-time price adjustment,” Bessent said, before adding, “I’m not worried about inflation.”\n\nYet Powell also said there were other considerations the Fed has to take into account when deciding whether to keep its rate unchanged, or even raise rates. For example, Powell suggested tariffs might have more than just a one-time impact “if it turns into a series” of tariff hikes, or “if the increases are larger, that would matter.”\n\n“What really does matter is what is happening with long-term inflation expectations,” Powell added. Powell noted that shorter-term expectations have risen, partly out of concern about tariffs, though longer-term expectations have been stable.\n\nExpectations that prices will rise can worsen inflation if they cause consumers and businesses to change their behavior in anticipation. Some companies might charge more when they expect their own costs to increase.\n\nWhen Trump imposed tariffs in his last administration, Powell noted, the Fed ended up reducing its key rate, “because growth weakened so much.”\n\nPowell said the economy remains mostly healthy despite “elevated uncertainty.” He characterized Friday’s jobs report, which showed employers added 151,000 jobs and the unemployment rate ticked up to 4.1%, as in line with the “solid” gains of the past six months.\n\nHe also noted that there were signs consumer spending has slowed compared with the healthy gains in the second half of last year, and said surveys of consumers and businesses “point to heightened uncertainty about the economic outlook.” Further complicating matters, he acknowledged that measures of consumer sentiment “have not been a good predictor” of consumer spending in recent years.\n\nThe Fed’s own beige book, a collection of anecdotes from hundreds of businesses, mentioned uncertainty 47 times in its latest edition released Wednesday, up from just 17 times in January. The Fed publishes the beige book eight times a year.\n\nPowell spoke at a conference organized by the University of Chicago’s Booth School of Business.\n\nPresident Donald Trump’s on-again, off-again tariff policy and rapid-fire layoffs of government workers has created a spike in uncertainty among businesses and caused a sharp drop in consumer confidence. Many economists have marked down their estimates for the economy’s growth to as low as 1% at an annual rate in the first three months of this year, down from 2.3% in last year’s final quarter.\n\nYet as Fed governor Christopher Waller noted Thursday, there are “good news” cuts and “bad news” cuts. “Bad news” cuts occur if the Fed reduces rates out of concern that the economy is slowing, while “good news” reductions are those that reflect a sense by the Fed that inflation is returning to its target of 2%.\n\nWaller added that he still believes it will be possible for the Fed to engineer “good news” rate cuts later this year, though he dismissed the potential for a cut at the Fed’s next meeting this month.\n\nAfter cutting its key rate three times last year to about 4.3%, Powell indicated in January that the Fed would pause any further cuts amid signs that inflation has remained stuck above its target. The central bank’s preferred inflation gauge shows that prices rose 2.5% in January compared with a year ago. Excluding the volatile food and energy categories, core prices rose 2.6%, the smallest increase since June.",
    "clean_body": "new york ap — the federal reserve is likely to keep its key interest rate unchanged in the coming months as it waits for widespread “uncertainty” stemming from president donald trump’s policies to resolve chair jerome powell said friday at a conference in new york powell said the trump administration is making policy changes in several areas including trade taxes government spending immigration and regulation and added that the “net effect” of those changes are what will matter for the economy and the fed’s interest rate policies “while there have been recent developments in some of these areas especially trade policy uncertainty around the changes and their likely effects remains high” powell said “as we parse the incoming information we are focused on separating the signal from the noise as the outlook evolves we do not need to be in a hurry and are well positioned to wait for greater clarity” most economists say that trump’s plans to slap tariffs on a wide array of imports including 25 duties on goods from canada and mexico that he partially delayed thursday will push up prices and slow growth but many also expect that tax cuts and deregulation could boost the economy powell’s comments pushed some traders to pare back their forecasts for how many interest rate cuts the fed may deliver this year they had been banking on at least three following a stream of weakerthanexpected reports on the us economy but powell reiterated the fed is likely on hold for a while that sent treasury yields higher in the bond market rate reductions could help bring down borrowing costs for mortgages auto loans credit cards and business loans powell in a question and answer session acknowledged that typically tariffs would cause a “onetime” price increase rather than persistent inflation and the fed could ignore such a temporary effect treasury secretary scott bessent on thursday made a similar argument “we could get a onetime price adjustment” bessent said before adding “i’m not worried about inflation” yet powell also said there were other considerations the fed has to take into account when deciding whether to keep its rate unchanged or even raise rates for example powell suggested tariffs might have more than just a onetime impact “if it turns into a series” of tariff hikes or “if the increases are larger that would matter” “what really does matter is what is happening with longterm inflation expectations” powell added powell noted that shorterterm expectations have risen partly out of concern about tariffs though longerterm expectations have been stable expectations that prices will rise can worsen inflation if they cause consumers and businesses to change their behavior in anticipation some companies might charge more when they expect their own costs to increase when trump imposed tariffs in his last administration powell noted the fed ended up reducing its key rate “because growth weakened so much” powell said the economy remains mostly healthy despite “elevated uncertainty” he characterized friday’s jobs report which showed employers added 151000 jobs and the unemployment rate ticked up to 41 as in line with the “solid” gains of the past six months he also noted that there were signs consumer spending has slowed compared with the healthy gains in the second half of last year and said surveys of consumers and businesses “point to heightened uncertainty about the economic outlook” further complicating matters he acknowledged that measures of consumer sentiment “have not been a good predictor” of consumer spending in recent years the fed’s own beige book a collection of anecdotes from hundreds of businesses mentioned uncertainty 47 times in its latest edition released wednesday up from just 17 times in january the fed publishes the beige book eight times a year powell spoke at a conference organized by the university of chicago’s booth school of business president donald trump’s onagain offagain tariff policy and rapidfire layoffs of government workers has created a spike in uncertainty among businesses and caused a sharp drop in consumer confidence many economists have marked down their estimates for the economy’s growth to as low as 1 at an annual rate in the first three months of this year down from 23 in last year’s final quarter yet as fed governor christopher waller noted thursday there are “good news” cuts and “bad news” cuts “bad news” cuts occur if the fed reduces rates out of concern that the economy is slowing while “good news” reductions are those that reflect a sense by the fed that inflation is returning to its target of 2 waller added that he still believes it will be possible for the fed to engineer “good news” rate cuts later this year though he dismissed the potential for a cut at the fed’s next meeting this month after cutting its key rate three times last year to about 43 powell indicated in january that the fed would pause any further cuts amid signs that inflation has remained stuck above its target the central bank’s preferred inflation gauge shows that prices rose 25 in january compared with a year ago excluding the volatile food and energy categories core prices rose 26 the smallest increase since june",
    "summary": "“While there have been recent developments in some of these areas, especially trade policy, uncertainty around the changes and their likely effects remains high,” Powell said.\nPowell’s comments pushed some traders to pare back their forecasts for how many interest rate cuts the Fed may deliver this year.\nBut Powell reiterated the Fed is likely on hold for a while.\nPowell noted that shorter-term expectations have risen, partly out of concern about tariffs, though longer-term expectations have been stable.\nYet as Fed governor Christopher Waller noted Thursday, there are “good news” cuts and “bad news” cuts.",
    "keywords": [
      "rates",
      "prices",
      "times",
      "fed",
      "hold",
      "rate",
      "cuts",
      "chair",
      "uncertainty",
      "economic",
      "noted",
      "widespread",
      "inflation",
      "tariffs",
      "interest",
      "powell"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/8f2de0d/2147483647/strip/true/crop/5691x3201+0+296/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5b%2Fa0%2Fe48fb092aa9c0a52a50ceccb4a7b%2Fe55e454f191e40dbbd9919631dd721a3",
    "t": 66
  },
  "https://apnews.com/article/myanmar-thailand-earthquake-ee151c1f08d1dd36c3cc01c3c83fa870": {
    "source": "AP News",
    "url": "https://apnews.com/article/myanmar-thailand-earthquake-ee151c1f08d1dd36c3cc01c3c83fa870",
    "date": "2025-03-31",
    "time": "04:12:51",
    "title": "Earthquake compounds Myanmar’s humanitarian crisis as the death toll passes 2,000",
    "body": "BANGKOK (AP) — The death toll in last week’s massive earthquake in Myanmar has passed 2,000, state media said Monday, as accounts of some people’s last moments emerged: Two hundred Buddhist monks crushed by a collapsing monastery. Fifty children killed when a preschool classroom crumbled. Seven hundred Muslims struck while praying at mosques for Ramadan.\n\nIndian and Myanmar rescuers carry a dead body at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025. (AP Photo) Indian and Myanmar rescuers carry a dead body at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025. (AP Photo) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nThe quake could exacerbate hunger and disease outbreaks in a country that was already one of the world’s most challenging places for humanitarian organizations to operate because of civil war, aid groups and the United Nations warned.\n\nThe 7.7 magnitude quake hit Friday, with the epicenter near Myanmar’s second-largest city of Mandalay. It damaged the city’s airport, buckled roads and collapsed hundreds of buildings along a wide swath down the country’s center.\n\nRelief efforts are further hampered by power outages, fuel shortages and spotty communications. A lack of heavy machinery has slowed search-and-rescue operations, forcing many to search for survivors by hand in daily temperatures above 40 degrees Celsius (104 Fahrenheit).\n\nAP AUDIO: Earthquake compounds Myanmar’s humanitarian crisis as the death toll passes 2,000 AP correspondent Charles de Ledesma reports aid groups are getting into gear after last week’s devastating earthquake in Myanmar.\n\nRescue workers at Mandalay’s collapsed U Hla Thein monastery said they were still searching for about 150 of the dead monks.\n\nIndian and Myanmar rescuers carry a dead body at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025. (AP Photo) Indian and Myanmar rescuers carry a dead body at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025. (AP Photo) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nSome 700 Muslim worshipers attending Friday prayers were killed when mosques collapsed, said Tun Kyi, a member of the steering committee of the Spring Revolution Myanmar Muslim Network. He said some 60 mosques were damaged or destroyed. Videos posted on The Irrawaddy online news site showed several mosques toppling.\n\nIt was not clear whether those numbers were already included in the official toll.\n\nMyanmar state MRTV reported that the leader of the military government, Senior Gen. Min Aung Hlaing, told Pakistan’s prime minister during a call that 2,065 people were killed, with more than 3,900 injured and about 270 missing.\n\nRelief agencies expect those numbers to rise sharply, since access is slow to remote areas where communications are down.\n\nThe United Nations’ Myanmar country team called for unimpeded access for aid teams.\n\n“Even before this earthquake, nearly 20 million people in Myanmar were in need of humanitarian assistance,” said Marcoluigi Corsi, the U.N. resident and humanitarian coordinator.\n\nRescuers work at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025. (AP Photo) Rescuers work at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025. (AP Photo) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nDevastation’s full extent is not clear\n\n“We’re really not clear on the scale of the destruction at this stage,” Lauren Ellery, deputy director of programs in Myanmar for the International Rescue Committee, told The Associated Press. “They were talking about a town near Mandalay where 80% of the buildings were reportedly collapsed, but it wasn’t in the news because telecommunications have been slow.”\n\nGroups the IRC works with have reported that some places are cut off by landslides, she said.\n\nThe World Health Organization said it has reports of three hospitals destroyed and 22 partially damaged in the region.\n\n“There is an urgent need for trauma and surgical care, blood transfusion supplies, anesthetics, essential medicines and mental health support,” it said.\n\nMore than 10,000 buildings are collapsed or severely damaged in central and northwest Myanmar, the U.N. humanitarian agency said. One preschool classroom building collapsed in Mandalay district, killing 50 children and two teachers, it said.\n\nAn artificial intelligence analysis of satellite images of Mandalay by Microsoft’s AI for Good Lab showed 515 buildings with 80% to 100% damage and another 1,524 with 20% to 80% damage. It was not clear what percentage of the city’s buildings that represented.\n\nRescuers work at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025. (AP Photo) Rescuers work at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025. (AP Photo) Share Share Facebook\n\nCopy Link copied\n\nPrint\n\nEmail\n\nX\n\nLinkedIn\n\nBluesky\n\nFlipboard\n\nPinterest\n\nReddit Read More\n\nCivil war had displaced millions\n\nRescue efforts are also complicated by the civil war. In 2021, the military seized power from the elected government of Aung San Suu Kyi, sparking what has turned into significant armed resistance.\n\nWhile one group has declared a partial unilateral ceasefire, the government and other armed groups have not stopped fighting.\n\nGovernment forces have lost control of much of Myanmar, and many places were dangerous or impossible for aid groups to reach even before the quake. More than 3 million people have been displaced by the fighting, according to the U.N.\n\nEllery with the International Rescue Committee noted that the area worst hit by the earthquake was seriously damaged by flooding last year, and many displaced people sought refuge there.\n\nSince the earthquake, many people have been sleeping outside, either because homes were destroyed or out of fear of aftershocks.\n\nMonsoon rains start in May and finding people shelter will be a major challenge, she said.\n\nMyanmar’s neighbors and allies send aid\n\nInternational rescue teams from several countries are on the scene, including from Russia, China, India and several Southeast Asian countries.\n\nOn Monday, an Indian team jackhammered through slabs of fallen concrete at one site in Mandalay. They could be seen bringing out one body.\n\nThe European Union, Britain, Australia, New Zealand, South Korea and others have announced millions of dollars in aid.\n\nDespite massive cuts and firings at the U.S. Agency for International Development — the body charged with delivering humanitarian assistance overseas — the U.S. Embassy said a team of experts was on its way to Myanmar. The embassy said it would provide up to $2 million through local organizations.\n\nLooking for survivors in Bangkok\n\nA small number of U.S. military personnel were sent to assist in Bangkok, where the earthquake killed at least 18 people, many at a construction site where a partially built high-rise collapsed. Another 33 have been reported injured and 78 missing, primarily at the construction site near the popular Chatuchak market.\n\nOn Monday, heavy equipment was temporarily shut down at the site and authorities urged onlookers to be silent as they used machines to try and detect signs of life.\n\nBangkok Governor Chadchart Sittipunt told reporters that signs had been detected Sunday night, though experts could not determine whether it had been machine error.\n\nWatching the crews at work, Naruemon Thonglek said she had “made some peace” with the fact that her partner and five friends there were unlikely to be found alive.\n\n“A part of me still hope they will survive,” she said.\n\n___\n\nThis story has been updated to correct that 200 monks were reported killed.\n\n___\n\nAssociated Press journalists Jerry Harmer and Jintamas Saksornchai in Bangkok, and Jon Gambrell in Dubai, United Arab Emirates, contributed to this report.",
    "clean_body": "bangkok ap — the death toll in last week’s massive earthquake in myanmar has passed 2000 state media said monday as accounts of some people’s last moments emerged two hundred buddhist monks crushed by a collapsing monastery fifty children killed when a preschool classroom crumbled seven hundred muslims struck while praying at mosques for ramadan indian and myanmar rescuers carry a dead body at u hla thein buddhist monastery that collapsed in friday’s earthquake in mandalay myanmar monday march 31 2025 ap photo indian and myanmar rescuers carry a dead body at u hla thein buddhist monastery that collapsed in friday’s earthquake in mandalay myanmar monday march 31 2025 ap photo share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more the quake could exacerbate hunger and disease outbreaks in a country that was already one of the world’s most challenging places for humanitarian organizations to operate because of civil war aid groups and the united nations warned the 77 magnitude quake hit friday with the epicenter near myanmar’s secondlargest city of mandalay it damaged the city’s airport buckled roads and collapsed hundreds of buildings along a wide swath down the country’s center relief efforts are further hampered by power outages fuel shortages and spotty communications a lack of heavy machinery has slowed searchandrescue operations forcing many to search for survivors by hand in daily temperatures above 40 degrees celsius 104 fahrenheit ap audio earthquake compounds myanmar’s humanitarian crisis as the death toll passes 2000 ap correspondent charles de ledesma reports aid groups are getting into gear after last week’s devastating earthquake in myanmar rescue workers at mandalay’s collapsed u hla thein monastery said they were still searching for about 150 of the dead monks indian and myanmar rescuers carry a dead body at u hla thein buddhist monastery that collapsed in friday’s earthquake in mandalay myanmar monday march 31 2025 ap photo indian and myanmar rescuers carry a dead body at u hla thein buddhist monastery that collapsed in friday’s earthquake in mandalay myanmar monday march 31 2025 ap photo share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more some 700 muslim worshipers attending friday prayers were killed when mosques collapsed said tun kyi a member of the steering committee of the spring revolution myanmar muslim network he said some 60 mosques were damaged or destroyed videos posted on the irrawaddy online news site showed several mosques toppling it was not clear whether those numbers were already included in the official toll myanmar state mrtv reported that the leader of the military government senior gen min aung hlaing told pakistan’s prime minister during a call that 2065 people were killed with more than 3900 injured and about 270 missing relief agencies expect those numbers to rise sharply since access is slow to remote areas where communications are down the united nations’ myanmar country team called for unimpeded access for aid teams “even before this earthquake nearly 20 million people in myanmar were in need of humanitarian assistance” said marcoluigi corsi the un resident and humanitarian coordinator rescuers work at u hla thein buddhist monastery that collapsed in friday’s earthquake in mandalay myanmar monday march 31 2025 ap photo rescuers work at u hla thein buddhist monastery that collapsed in friday’s earthquake in mandalay myanmar monday march 31 2025 ap photo share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more devastation’s full extent is not clear “we’re really not clear on the scale of the destruction at this stage” lauren ellery deputy director of programs in myanmar for the international rescue committee told the associated press “they were talking about a town near mandalay where 80 of the buildings were reportedly collapsed but it wasn’t in the news because telecommunications have been slow” groups the irc works with have reported that some places are cut off by landslides she said the world health organization said it has reports of three hospitals destroyed and 22 partially damaged in the region “there is an urgent need for trauma and surgical care blood transfusion supplies anesthetics essential medicines and mental health support” it said more than 10000 buildings are collapsed or severely damaged in central and northwest myanmar the un humanitarian agency said one preschool classroom building collapsed in mandalay district killing 50 children and two teachers it said an artificial intelligence analysis of satellite images of mandalay by microsoft’s ai for good lab showed 515 buildings with 80 to 100 damage and another 1524 with 20 to 80 damage it was not clear what percentage of the city’s buildings that represented rescuers work at u hla thein buddhist monastery that collapsed in friday’s earthquake in mandalay myanmar monday march 31 2025 ap photo rescuers work at u hla thein buddhist monastery that collapsed in friday’s earthquake in mandalay myanmar monday march 31 2025 ap photo share share facebook copy link copied print email x linkedin bluesky flipboard pinterest reddit read more civil war had displaced millions rescue efforts are also complicated by the civil war in 2021 the military seized power from the elected government of aung san suu kyi sparking what has turned into significant armed resistance while one group has declared a partial unilateral ceasefire the government and other armed groups have not stopped fighting government forces have lost control of much of myanmar and many places were dangerous or impossible for aid groups to reach even before the quake more than 3 million people have been displaced by the fighting according to the un ellery with the international rescue committee noted that the area worst hit by the earthquake was seriously damaged by flooding last year and many displaced people sought refuge there since the earthquake many people have been sleeping outside either because homes were destroyed or out of fear of aftershocks monsoon rains start in may and finding people shelter will be a major challenge she said myanmar’s neighbors and allies send aid international rescue teams from several countries are on the scene including from russia china india and several southeast asian countries on monday an indian team jackhammered through slabs of fallen concrete at one site in mandalay they could be seen bringing out one body the european union britain australia new zealand south korea and others have announced millions of dollars in aid despite massive cuts and firings at the us agency for international development — the body charged with delivering humanitarian assistance overseas — the us embassy said a team of experts was on its way to myanmar the embassy said it would provide up to 2 million through local organizations looking for survivors in bangkok a small number of us military personnel were sent to assist in bangkok where the earthquake killed at least 18 people many at a construction site where a partially built highrise collapsed another 33 have been reported injured and 78 missing primarily at the construction site near the popular chatuchak market on monday heavy equipment was temporarily shut down at the site and authorities urged onlookers to be silent as they used machines to try and detect signs of life bangkok governor chadchart sittipunt told reporters that signs had been detected sunday night though experts could not determine whether it had been machine error watching the crews at work naruemon thonglek said she had “made some peace” with the fact that her partner and five friends there were unlikely to be found alive “a part of me still hope they will survive” she said this story has been updated to correct that 200 monks were reported killed associated press journalists jerry harmer and jintamas saksornchai in bangkok and jon gambrell in dubai united arab emirates contributed to this report",
    "summary": "AP AUDIO: Earthquake compounds Myanmar’s humanitarian crisis as the death toll passes 2,000 AP correspondent Charles de Ledesma reports aid groups are getting into gear after last week’s devastating earthquake in Myanmar.\nRescue workers at Mandalay’s collapsed U Hla Thein monastery said they were still searching for about 150 of the dead monks.\nRescuers work at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025.\nRescuers work at U Hla Thein Buddhist monastery that collapsed in Friday’s earthquake in Mandalay, Myanmar, Monday, March 31, 2025.\n(AP Photo) Share Share FacebookCopy Link copiedPrintEmailXLinkedInBlueskyFlipboardPinterestReddit Read MoreCivil war had displaced millionsRescue efforts are also complicated by the civil war.",
    "keywords": [
      "monastery",
      "crisis",
      "myanmars",
      "buddhist",
      "2000",
      "myanmar",
      "ap",
      "hla",
      "humanitarian",
      "death",
      "toll",
      "collapsed",
      "thein",
      "earthquake",
      "share",
      "passes",
      "mandalay",
      "compounds"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/8de5f83/2147483647/strip/true/crop/8507x4785+0+443/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F81%2F88%2Fcf1b8660c1b0877ce4c1be2ca778%2F8dccd34f9e4c44c4b5dbb1f67fa8d692",
    "t": 42
  },
  "https://apnews.com/article/coco-gauff-miami-46eaa3ef22014f108f89c81b8b939e3b": {
    "source": "AP News",
    "url": "https://apnews.com/article/coco-gauff-miami-46eaa3ef22014f108f89c81b8b939e3b",
    "date": "2025-03-17",
    "time": "21:44:45",
    "title": "Coco Gauff heads home to the Miami Open after her 21st birthday and a bit of a rough patch",
    "body": "MIAMI GARDENS, Fla. (AP) — Coco Gauff shrugged her right shoulder and chuckled a bit Monday at the notion that she seems to elicit concern from others when she goes through a two- or three-match losing streak — a rough patch in the course of a long season.\n\n“Sometimes when I don’t do well, people think there’s something personally wrong with me,” Gauff said on the eve of the Miami Open, where the women begin main-draw play on Tuesday and the men get started Wednesday.\n\nBow out early at one event or two — or drop a trio of outings consecutively, as she did at the Australian Open, Qatar and Dubai in January and February — and fans or former players will ask the 2023 U.S. Open champion, who just turned 21 last week, whether she’s OK.\n\n“I’m like, ‘I just lost a couple of matches! I’m chillin’,’” said Gauff, who has a first-round bye because she is seeded No. 3 at the hard-court Masters 1000 event and will get started by taking on another past Grand Slam champion — Petra Kvitova or Sofia Kenin — in the second round later in the week.\n\n“I’m obviously not happy with those past results, but it’s one of those things that, in the history of my career, I’ve had ups and downs. I still feel like I have a couple more years ... (to reach) that point where every week is a great week, I guess,” said Gauff, who is based not far from where the Miami Open is played. “I’m also in the middle of changes in my game; it’s been difficult.”\n\nShe’s spoken frequently about those switches, which began with adjusting her coaching staff after last year’s U.S. Open and also included adapting her serve — with a particular eye on shoring up second serves so as to avoid double-fault issues — and her forehand.\n\nIt’s been clear ever since she burst onto the scene as a 15-year-old qualifier at Wimbledon in 2019, beating seven-time major champion Venus Williams along the way to reaching the fourth round, that Gauff’s backhand is nothing if not elite, while her forehand is the shot that opponents tend to go after.\n\nThe American’s most recent match was a three-set loss to Tokyo Olympics gold medalist Belinda Bencic at Indian Wells, California, in the fourth round last week. Afterward, Bencic spoke about what her thinking was at 4-all in the final set.\n\n“I felt like she was more tense,” Bencic said about Gauff, “so I felt like that was the right time to go for her forehand.”\n\nGauff called the event held over the next two weeks at the stadium used by the NFL’s Miami Dolphins as her “home tournament.”\n\nShe’s 6-5 in Miami and has not made it beyond the fourth round there.\n\nNo matter what others might say to her, or about her, after setbacks, Gauff doesn’t like to harp on it too much — even if she expects more from herself, too.\n\nThat’s what comes with being ranked as highly as she is. And with having won Grand Slam titles in singles and doubles, along with the season-ending WTA Finals last year.\n\n“I will say that it is tough, sometimes, when everyone is (saying), ‘Oh, (lost) two matches in a row,’ and things like that,” she said Monday. “Because if I wasn’t a top-five player it wouldn’t, probably, be a conversation. That comes with being at the top. You’re expected to win. And I expect myself to win, as well.”\n\n___\n\nHoward Fendrich has been the AP’s tennis writer since 2002. Find his stories here: https://apnews.com/author/howard-fendrich. More AP tennis: https://apnews.com/hub/tennis",
    "clean_body": "miami gardens fla ap — coco gauff shrugged her right shoulder and chuckled a bit monday at the notion that she seems to elicit concern from others when she goes through a two or threematch losing streak — a rough patch in the course of a long season “sometimes when i don’t do well people think there’s something personally wrong with me” gauff said on the eve of the miami open where the women begin maindraw play on tuesday and the men get started wednesday bow out early at one event or two — or drop a trio of outings consecutively as she did at the australian open qatar and dubai in january and february — and fans or former players will ask the 2023 us open champion who just turned 21 last week whether she’s ok “i’m like ‘i just lost a couple of matches i’m chillin’’” said gauff who has a firstround bye because she is seeded no 3 at the hardcourt masters 1000 event and will get started by taking on another past grand slam champion — petra kvitova or sofia kenin — in the second round later in the week “i’m obviously not happy with those past results but it’s one of those things that in the history of my career i’ve had ups and downs i still feel like i have a couple more years to reach that point where every week is a great week i guess” said gauff who is based not far from where the miami open is played “i’m also in the middle of changes in my game it’s been difficult” she’s spoken frequently about those switches which began with adjusting her coaching staff after last year’s us open and also included adapting her serve — with a particular eye on shoring up second serves so as to avoid doublefault issues — and her forehand it’s been clear ever since she burst onto the scene as a 15yearold qualifier at wimbledon in 2019 beating seventime major champion venus williams along the way to reaching the fourth round that gauff’s backhand is nothing if not elite while her forehand is the shot that opponents tend to go after the american’s most recent match was a threeset loss to tokyo olympics gold medalist belinda bencic at indian wells california in the fourth round last week afterward bencic spoke about what her thinking was at 4all in the final set “i felt like she was more tense” bencic said about gauff “so i felt like that was the right time to go for her forehand” gauff called the event held over the next two weeks at the stadium used by the nfl’s miami dolphins as her “home tournament” she’s 65 in miami and has not made it beyond the fourth round there no matter what others might say to her or about her after setbacks gauff doesn’t like to harp on it too much — even if she expects more from herself too that’s what comes with being ranked as highly as she is and with having won grand slam titles in singles and doubles along with the seasonending wta finals last year “i will say that it is tough sometimes when everyone is saying ‘oh lost two matches in a row’ and things like that” she said monday “because if i wasn’t a topfive player it wouldn’t probably be a conversation that comes with being at the top you’re expected to win and i expect myself to win as well” howard fendrich has been the ap’s tennis writer since 2002 find his stories here httpsapnewscomauthorhowardfendrich more ap tennis httpsapnewscomhubtennis",
    "summary": "“Sometimes when I don’t do well, people think there’s something personally wrong with me,” Gauff said on the eve of the Miami Open, where the women begin main-draw play on Tuesday and the men get started Wednesday.\nI’m chillin’,’” said Gauff, who has a first-round bye because she is seeded No.\nI still feel like I have a couple more years ... (to reach) that point where every week is a great week, I guess,” said Gauff, who is based not far from where the Miami Open is played.\nThe American’s most recent match was a three-set loss to Tokyo Olympics gold medalist Belinda Bencic at Indian Wells, California, in the fourth round last week.\nAnd I expect myself to win, as well.”___Howard Fendrich has been the AP’s tennis writer since 2002.",
    "keywords": [
      "week",
      "bit",
      "21st",
      "open",
      "gauff",
      "fourth",
      "event",
      "patch",
      "birthday",
      "heads",
      "miami",
      "coco",
      "champion",
      "round",
      "win",
      "rough",
      "bencic"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/7f17950/2147483647/strip/true/crop/5443x3062+0+284/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7c%2F79%2Ffc8438c339a072198ac17f1c04c4%2F9c047f9e67db4dacb07a3388434b2e9f",
    "t": 56
  },
  "https://apnews.com/article/doge-social-security-116efd0a68244d616e41b340fba5e5c1": {
    "source": "AP News",
    "url": "https://apnews.com/article/doge-social-security-116efd0a68244d616e41b340fba5e5c1",
    "date": "2025-03-07",
    "time": "18:25:38",
    "title": "What to know about Social Security office closures driven by Musk’s DOGE",
    "body": "Across-the-board cuts at the Social Security Administration are prompting questions about how the benefits of millions of recipients may be affected.\n\nAmong the potential changes are layoffs for more than 10% of the agency’s workforce and the closure of dozens of offices throughout the U.S. It’s all part of the Trump administration’s efforts to shrink the size of the federal workforce through the Department of Government Efficiency, inspired by President Donald Trump’s adviser Elon Musk.\n\nSome of the public-facing locations listed for closure were already slated to be shuttered due to lack of use. The SSA says work in other non-public sites up for closure is being consolidated.\n\nHere’s a look at cuts to the agency, which serves more than 70 million Americans, and potential effects for recipients:\n\nWill the Social Security office near my home close?\n\nOn its website, DOGE lists 47 Social Security Administration field offices set for closure across the U.S., with many concentrated in the South and across the Southeast.\n\nAn agency spokesperson said last week that most of the leases not being renewed were for spaces used for in-person hearings, sites no longer necessary due to the majority of hearings now being held virtually. In the 2024 fiscal year, according to SSA, 20% of those offices held no in-person hearings.\n\nSome of the other properties had already been set for closure, or were being consolidated anyway, the spokesperson noted, saying the agency was working with the General Services Administration “to review our leases and ensure they are used efficiently.”\n\nAccording to the Social Security Administration, the agency has about 1,200 field offices across the U.S.\n\nWill my Social Security benefits be cut?\n\nNot necessarily, but advocates have claimed that agency reductions will result in diminished services.\n\nThe 72.5 million Social Security beneficiaries across the country include retirees and children who receive retirement and disability benefits.\n\nSenate Democratic Leader Chuck Schumer of New York has characterized Musk’s cuts to the agency as efforts to “attack the bedrock of America’s social safety net.”\n\nSocial Security is one of the nation’s largest and most popular social programs. A January poll from The Associated Press-NORC Center for Public Affairs Research found that two-thirds of U.S. adults think the country is spending too little on Social Security.\n\nThe program faces a looming bankruptcy date if it is not addressed by Congress. The May 2024 Social Security and Medicare trustees’ report states that Social Security’s trust funds — which cover old age and disability recipients — will be unable to pay full benefits beginning in 2035. Then, Social Security would be able to pay only 83% of benefits.\n\nWhat about Social Security employee layoffs?\n\nEarlier this week, a person familiar with the agency’s plans but not authorized to speak about them publicly said that the Social Security Administration was preparing to lay off at least 7,000 people from its workforce of 60,000.\n\nAccording to the Center on Budget Policy and Priorities, administering the program amounts to less than 1% of the revenue that funds it.\n\nAdvocates and Democratic lawmakers have warned that layoffs and agency cuts will reduce the agency’s ability to serve recipients in a timely manner.\n\nIn a letter last month to acting Social Security Administrator Michelle King, Democratic Sen. Kirsten Gillibrand of New York wrote that the White Plains hearing office in her state has 2,000 pending cases, saying “beneficiaries will be required to travel between 24 and 135 miles” to get to another office if it closes.\n\nWhat has the Trump administration said about Social Security?\n\nIn an episode with podcaster Joe Rogan airing last month, Musk called Social Security “the biggest Ponzi scheme of all time.”\n\nBut Trump, who during the presidential campaign vowed to make no changes to the program, has consistently said there would be no changes to benefits. Since his election in November, the Republican has reiterated those comments, saying Social Security benefits “won’t be touched” and “will only be strengthened.”\n\n___\n\nAssociated Press reporter Fatima Hussein contributed from Washington.\n\n___\n\nKinnard reported from Chapin, South Carolina, and can be reached at http://x.com/MegKinnardAP.",
    "clean_body": "acrosstheboard cuts at the social security administration are prompting questions about how the benefits of millions of recipients may be affected among the potential changes are layoffs for more than 10 of the agency’s workforce and the closure of dozens of offices throughout the us it’s all part of the trump administration’s efforts to shrink the size of the federal workforce through the department of government efficiency inspired by president donald trump’s adviser elon musk some of the publicfacing locations listed for closure were already slated to be shuttered due to lack of use the ssa says work in other nonpublic sites up for closure is being consolidated here’s a look at cuts to the agency which serves more than 70 million americans and potential effects for recipients will the social security office near my home close on its website doge lists 47 social security administration field offices set for closure across the us with many concentrated in the south and across the southeast an agency spokesperson said last week that most of the leases not being renewed were for spaces used for inperson hearings sites no longer necessary due to the majority of hearings now being held virtually in the 2024 fiscal year according to ssa 20 of those offices held no inperson hearings some of the other properties had already been set for closure or were being consolidated anyway the spokesperson noted saying the agency was working with the general services administration “to review our leases and ensure they are used efficiently” according to the social security administration the agency has about 1200 field offices across the us will my social security benefits be cut not necessarily but advocates have claimed that agency reductions will result in diminished services the 725 million social security beneficiaries across the country include retirees and children who receive retirement and disability benefits senate democratic leader chuck schumer of new york has characterized musk’s cuts to the agency as efforts to “attack the bedrock of america’s social safety net” social security is one of the nation’s largest and most popular social programs a january poll from the associated pressnorc center for public affairs research found that twothirds of us adults think the country is spending too little on social security the program faces a looming bankruptcy date if it is not addressed by congress the may 2024 social security and medicare trustees’ report states that social security’s trust funds — which cover old age and disability recipients — will be unable to pay full benefits beginning in 2035 then social security would be able to pay only 83 of benefits what about social security employee layoffs earlier this week a person familiar with the agency’s plans but not authorized to speak about them publicly said that the social security administration was preparing to lay off at least 7000 people from its workforce of 60000 according to the center on budget policy and priorities administering the program amounts to less than 1 of the revenue that funds it advocates and democratic lawmakers have warned that layoffs and agency cuts will reduce the agency’s ability to serve recipients in a timely manner in a letter last month to acting social security administrator michelle king democratic sen kirsten gillibrand of new york wrote that the white plains hearing office in her state has 2000 pending cases saying “beneficiaries will be required to travel between 24 and 135 miles” to get to another office if it closes what has the trump administration said about social security in an episode with podcaster joe rogan airing last month musk called social security “the biggest ponzi scheme of all time” but trump who during the presidential campaign vowed to make no changes to the program has consistently said there would be no changes to benefits since his election in november the republican has reiterated those comments saying social security benefits “won’t be touched” and “will only be strengthened” associated press reporter fatima hussein contributed from washington kinnard reported from chapin south carolina and can be reached at httpxcommegkinnardap",
    "summary": "Across-the-board cuts at the Social Security Administration are prompting questions about how the benefits of millions of recipients may be affected.\nOn its website, DOGE lists 47 Social Security Administration field offices set for closure across the U.S., with many concentrated in the South and across the Southeast.\nThe 72.5 million Social Security beneficiaries across the country include retirees and children who receive retirement and disability benefits.\nWhat has the Trump administration said about Social Security?\nSince his election in November, the Republican has reiterated those comments, saying Social Security benefits “won’t be touched” and “will only be strengthened.”___Associated Press reporter Fatima Hussein contributed from Washington.",
    "keywords": [
      "administration",
      "office",
      "security",
      "doge",
      "workforce",
      "musks",
      "agency",
      "know",
      "cuts",
      "social",
      "closures",
      "trump",
      "driven",
      "offices",
      "closure",
      "benefits"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/6469ff2/2147483647/strip/true/crop/6187x3480+0+322/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F54%2Fc4%2F567b096c40357421a58e7ecd5137%2Fddbd03eff35d411db8765dd1e451624b",
    "t": 66
  }
}