{
  "https://apnews.com/article/iodine-deficiency-73e65282708cef12a41df3cf48a9daec": {
    "source": "AP News",
    "url": "https://apnews.com/article/iodine-deficiency-73e65282708cef12a41df3cf48a9daec",
    "date": "2025-01-06",
    "time": "19:18:43",
    "title": "Doctors worry that iodine deficiency — a dietary problem from the past — is coming back",
    "body": "NEW YORK (AP) — The 13-year-old boy came to the clinic with a rapidly ballooning neck. Doctors were puzzled.\n\nTesting ruled out their first suspicion. But further tests pinpointed what they — and the boy — had been missing: iodine.\n\nA century ago, iodine deficiency affected kids across large swaths of the country. It essentially disappeared after some food makers started adding it to table salt, bread and some other foods, in one of the great public health success stories of the 20th century.\n\nBut today, people are getting less iodine because of changes in diet and food manufacturing.\n\nAlthough most people are still getting enough, researchers have increasingly been reporting low levels of iodine in pregnant women and other people, raising concerns about an impact on their newborns. And there is also a very small, but growing, number of reports of iodine deficiency in kids.\n\n“This needs to be on people’s radar,” said Dr. Monica Serrano-Gonzalez, a Brown University doctor who treated the boy in 2021 in Providence, Rhode Island.\n\nThis article is part of AP’s Be Well coverage, focusing on wellness, fitness, diet and mental health. Read more Be Well.\n\n\n\nWhat is iodine?\n\nIodine is a trace element found in seawater and in some soils — mostly in coastal areas. A French chemist accidentally discovered it in 1811 when an experiment with seaweed ash created a purple puff of vapor. The name iodine comes from a Greek word meaning violet-colored.\n\nLater that century, scientists began to understand that people need certain amounts of iodine to regulate their metabolism and stay healthy, and that it’s crucial in the development of brain function in children.\n\nOne sign of insufficient iodine is a swelling of the neck, known as a goiter. The thyroid gland in the neck uses iodine to produce hormones that regulate the heart rate and other body functions. When there’s not enough iodine, the thyroid gland enlarges as it goes into overdrive to make up for the lack of iodine.\n\nAt the beginning of the 20th century, goiter was very common in children in certain inland parts of the United States, especially in a “goiter belt” that stretched from Appalachia and the Great Lakes to the northwest United States. Some of the kids were unusually short, deaf, intellectually stunted and had other symptoms of a syndrome once known as “cretinism.”\n\nAdding iodine to salt\n\nPublic health experts realized they couldn’t solve the problem by feeding everyone seaweed and seafood, but they learned that iodine can essentially be sprayed on table salt. Iodized salt first became available in 1924. By the 1950s, more than 70% of U.S. households used iodized table salt. Bread and some other foods also were fortified with iodine, and iodine deficiency became rare.\n\nBut diets changed. Processed foods now make up a large part of the American diet, and though they contain a lot of salt, it’s not iodized. Leading bread brands no longer add iodine. In the case of the 13-year-old boy, he has mild autism and was a fussy eater, mostly only eating specific brands of bread and peanut butter.\n\nAnd for people who do salt their food, the fashion now is to use kosher salt, Himalayan rock salt or other noniodized products.\n\n“People have forgotten why there’s iodine in salt,” said Dr. Elizabeth Pearce of Boston Medical Center. She is a leader in the Iodine Global Network, a nongovernmental agency working to eliminate iodine deficiency disorders.\n\nShe noted a reported 50% drop in U.S. iodine levels in surveyed Americans between the 1970s and the 1990s.\n\nHow much iodine is enough?\n\nThough iodine consumption is falling overall, most Americans are still getting enough through their diet, experts say. But doctors worry that’s not the case for women and children, who are most vulnerable to iodine deficiency.\n\nThe American Academy of Pediatrics and other medical societies recommend that all pregnant and breastfeeding women get 150 micrograms of iodine each day. You can get that from one-half to three-quarters of a teaspoon of iodized table salt.\n\nIn the last 15 years or so, U.S. researchers have increasingly reported seeing mild iodine deficiency in pregnant women. A Michigan State University study of about 460 pregnant women in the city of Lansing found about a quarter of them were not getting enough.\n\nMany prenatal vitamins don’t contain iodine, noted Jean Kerver, the study’s lead author. That’s why doctors recommend that pregnant or breastfeeding women check labels to ensure they are taking multivitamins or prenatal supplements with iodine.\n\nSome studies have linked even mild iodine deficiency to lower IQs and language delay in children, although there is debate about at exactly what levels problems start, Pearce said.\n\nExperts say there hasn’t been enough research to establish what impact that iodine deficiency has actually been having on the U.S. population in recent years.\n\nSerrano-Gonzalez said she and her colleagues have seen four other cases in children in their clinic in Providence.\n\n“We’re concerned this may be increasing, especially in patients with restricted diets,” she said.\n\n___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group. The AP is solely responsible for all content.",
    "clean_body": "new york ap — the 13yearold boy came to the clinic with a rapidly ballooning neck doctors were puzzled testing ruled out their first suspicion but further tests pinpointed what they — and the boy — had been missing iodine a century ago iodine deficiency affected kids across large swaths of the country it essentially disappeared after some food makers started adding it to table salt bread and some other foods in one of the great public health success stories of the 20th century but today people are getting less iodine because of changes in diet and food manufacturing although most people are still getting enough researchers have increasingly been reporting low levels of iodine in pregnant women and other people raising concerns about an impact on their newborns and there is also a very small but growing number of reports of iodine deficiency in kids “this needs to be on people’s radar” said dr monica serranogonzalez a brown university doctor who treated the boy in 2021 in providence rhode island this article is part of ap’s be well coverage focusing on wellness fitness diet and mental health read more be well what is iodine iodine is a trace element found in seawater and in some soils — mostly in coastal areas a french chemist accidentally discovered it in 1811 when an experiment with seaweed ash created a purple puff of vapor the name iodine comes from a greek word meaning violetcolored later that century scientists began to understand that people need certain amounts of iodine to regulate their metabolism and stay healthy and that it’s crucial in the development of brain function in children one sign of insufficient iodine is a swelling of the neck known as a goiter the thyroid gland in the neck uses iodine to produce hormones that regulate the heart rate and other body functions when there’s not enough iodine the thyroid gland enlarges as it goes into overdrive to make up for the lack of iodine at the beginning of the 20th century goiter was very common in children in certain inland parts of the united states especially in a “goiter belt” that stretched from appalachia and the great lakes to the northwest united states some of the kids were unusually short deaf intellectually stunted and had other symptoms of a syndrome once known as “cretinism” adding iodine to salt public health experts realized they couldn’t solve the problem by feeding everyone seaweed and seafood but they learned that iodine can essentially be sprayed on table salt iodized salt first became available in 1924 by the 1950s more than 70 of us households used iodized table salt bread and some other foods also were fortified with iodine and iodine deficiency became rare but diets changed processed foods now make up a large part of the american diet and though they contain a lot of salt it’s not iodized leading bread brands no longer add iodine in the case of the 13yearold boy he has mild autism and was a fussy eater mostly only eating specific brands of bread and peanut butter and for people who do salt their food the fashion now is to use kosher salt himalayan rock salt or other noniodized products “people have forgotten why there’s iodine in salt” said dr elizabeth pearce of boston medical center she is a leader in the iodine global network a nongovernmental agency working to eliminate iodine deficiency disorders she noted a reported 50 drop in us iodine levels in surveyed americans between the 1970s and the 1990s how much iodine is enough though iodine consumption is falling overall most americans are still getting enough through their diet experts say but doctors worry that’s not the case for women and children who are most vulnerable to iodine deficiency the american academy of pediatrics and other medical societies recommend that all pregnant and breastfeeding women get 150 micrograms of iodine each day you can get that from onehalf to threequarters of a teaspoon of iodized table salt in the last 15 years or so us researchers have increasingly reported seeing mild iodine deficiency in pregnant women a michigan state university study of about 460 pregnant women in the city of lansing found about a quarter of them were not getting enough many prenatal vitamins don’t contain iodine noted jean kerver the study’s lead author that’s why doctors recommend that pregnant or breastfeeding women check labels to ensure they are taking multivitamins or prenatal supplements with iodine some studies have linked even mild iodine deficiency to lower iqs and language delay in children although there is debate about at exactly what levels problems start pearce said experts say there hasn’t been enough research to establish what impact that iodine deficiency has actually been having on the us population in recent years serranogonzalez said she and her colleagues have seen four other cases in children in their clinic in providence “we’re concerned this may be increasing especially in patients with restricted diets” she said the associated press health and science department receives support from the howard hughes medical institute’s science and educational media group the ap is solely responsible for all content",
    "summary": "And there is also a very small, but growing, number of reports of iodine deficiency in kids.\nBread and some other foods also were fortified with iodine, and iodine deficiency became rare.\nShe is a leader in the Iodine Global Network, a nongovernmental agency working to eliminate iodine deficiency disorders.\nBut doctors worry that’s not the case for women and children, who are most vulnerable to iodine deficiency.\nIn the last 15 years or so, U.S. researchers have increasingly reported seeing mild iodine deficiency in pregnant women.",
    "keywords": [
      "deficiency",
      "problem",
      "women",
      "coming",
      "worry",
      "doctors",
      "salt",
      "diet",
      "iodine",
      "table",
      "pregnant",
      "health",
      "iodized",
      "past",
      "dietary",
      "getting"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/60a1ac1/2147483647/strip/true/crop/4398x2474+0+229/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2F72%2F0bb8c368c0d0048d48b4c061ae10%2Fdc8c851cc68a4f6c85585adff6c2a6ff",
    "t": 126
  },
  "https://apnews.com/article/college-tuition-cost-5e69acffa7ae11300123df028eac5321": {
    "source": "AP News",
    "url": "https://apnews.com/article/college-tuition-cost-5e69acffa7ae11300123df028eac5321",
    "date": "2025-01-08",
    "time": "14:08:34",
    "title": "College tuition has fallen significantly at many schools",
    "body": "BOSTON (AP) — The cost of college keeps spiraling ever higher, right?\n\nNot necessarily. New research indicates students are paying significantly less to attend public universities than they were a decade ago. And tuition increases at private colleges have finally slowed after years of hefty rises.\n\nFigures compiled by the nonprofit College Board indicate the average student attending an in-state public university this year faces a tuition bill of $11,610, which is down 4% from a decade earlier when taking inflation into account. But the real savings come in what the average student actually pays after getting grants and financial aid. That’s down 40% over the decade, from $4,140 to $2,480 annually, according to the data.\n\nThat reduced cost means less borrowing. Just under half of students attending in-state public universities are graduating with some debt, down from 59% a decade earlier, according to the College Board figures. And among those who do borrow, the average loan balance has fallen by 17%, to $27,100.\n\nMeanwhile, at private colleges, tuition continues to rise, but at a much slower rate. It has increased 4% over the past decade, when taking inflation into account, to an average $43,350, according to the College Board. That’s a big change from the two decades prior, when tuition increased 68%.\n\nCosts are coming down as Americans question whether college is worth the price. Surveys find that Americans are increasingly skeptical about the value of a degree, and the percentage of high school graduates heading to college has fallen to levels not seen in decades, according to data from the U.S. Bureau of Labor Statistics.\n\nYet research still finds that, over time, a degree pays off. Americans with a bachelor’s degree earn a median of $2.8 million during their careers, 75% more than if they had only a high school diploma, according to research from Georgetown University’s Center on Education and the Workforce.\n\nThe COVID-19 pandemic has been a big factor in the cost reductions, said Jennifer Ma, an executive research scientist at the College Board and lead author of the study.\n\n“We know that during COVID, a lot of institutions — public and private — froze tuition,” Ma said.\n\nAs states and the federal government responded to the pandemic, Ma said, they increased higher education funding, allowing colleges to reduce the cost of attendance. Some of that money has since expired, however, including an infusion of federal pandemic aid that was mostly used up by the end of 2022.\n\nCost was a major consideration in Kai Mattinson’s decision to attend Northern Arizona University. It would have cost her about $39,000 annually to attend the public university but discounts and scholarships bring that down to between $15,000 and $20,000 for the 22-year-old senior from Nevada.\n\n“I originally wanted to go to the University of Arizona, but when it came down to tuition and other cost, Northern Arizona University was the best option,” said Mattinson, a physical education major who also works as a long-term substitute at a local elementary school.\n\nMany institutions have tried to limit cost increases. Purdue University in Indiana, for example, has frozen its annual in-state tuition at $9,992 for the past 13 years.\n\nMark Becker, the president of the Association of Public and Land-grant Universities, said he was pleased to see the new data.\n\n“Institutional efforts to control costs, combined with many states’ efforts to increase investments in public universities and federal investment in the Pell Grant, have increased college affordability and enabled significant progress on tackling student debt,” Becker said in a statement.\n\nCosts for those attending public two-year community colleges have fallen even more, by 9% over the past decade, according to the College Board data, which is broadly in line with federal figures collected by the National Center for Education Statistics.\n\nStill, for parents paying for their children to attend out-of-state public universities or private colleges, the costs remain daunting — as much as $95,000 annually, in some cases. However, many institutions offer significant discounts to the sticker price for middle- and lower-income students.\n\nSome private colleges have been expanding their financial aid, including the Massachusetts Institute of Technology, which in November announced undergraduates with a family income below $200,000 would no longer need to pay any tuition at all starting in the fall.\n\nOther private colleges are discounting tuition as a marketing move in an increasingly difficult environment. They face a dwindling pool of young adults, and students who are more wary of signing up for giant loans. Recruiting students is crucial for staying afloat as operational costs rise. After temporary relief thanks to federal money during the pandemic, many colleges have cut programs to try to keep costs under control.\n\n___\n\nAssociated Press writer Collin Binkley contributed to this report from Washington, D.C. Mumphrey reported from Phoenix.",
    "clean_body": "boston ap — the cost of college keeps spiraling ever higher right not necessarily new research indicates students are paying significantly less to attend public universities than they were a decade ago and tuition increases at private colleges have finally slowed after years of hefty rises figures compiled by the nonprofit college board indicate the average student attending an instate public university this year faces a tuition bill of 11610 which is down 4 from a decade earlier when taking inflation into account but the real savings come in what the average student actually pays after getting grants and financial aid that’s down 40 over the decade from 4140 to 2480 annually according to the data that reduced cost means less borrowing just under half of students attending instate public universities are graduating with some debt down from 59 a decade earlier according to the college board figures and among those who do borrow the average loan balance has fallen by 17 to 27100 meanwhile at private colleges tuition continues to rise but at a much slower rate it has increased 4 over the past decade when taking inflation into account to an average 43350 according to the college board that’s a big change from the two decades prior when tuition increased 68 costs are coming down as americans question whether college is worth the price surveys find that americans are increasingly skeptical about the value of a degree and the percentage of high school graduates heading to college has fallen to levels not seen in decades according to data from the us bureau of labor statistics yet research still finds that over time a degree pays off americans with a bachelor’s degree earn a median of 28 million during their careers 75 more than if they had only a high school diploma according to research from georgetown university’s center on education and the workforce the covid19 pandemic has been a big factor in the cost reductions said jennifer ma an executive research scientist at the college board and lead author of the study “we know that during covid a lot of institutions — public and private — froze tuition” ma said as states and the federal government responded to the pandemic ma said they increased higher education funding allowing colleges to reduce the cost of attendance some of that money has since expired however including an infusion of federal pandemic aid that was mostly used up by the end of 2022 cost was a major consideration in kai mattinson’s decision to attend northern arizona university it would have cost her about 39000 annually to attend the public university but discounts and scholarships bring that down to between 15000 and 20000 for the 22yearold senior from nevada “i originally wanted to go to the university of arizona but when it came down to tuition and other cost northern arizona university was the best option” said mattinson a physical education major who also works as a longterm substitute at a local elementary school many institutions have tried to limit cost increases purdue university in indiana for example has frozen its annual instate tuition at 9992 for the past 13 years mark becker the president of the association of public and landgrant universities said he was pleased to see the new data “institutional efforts to control costs combined with many states’ efforts to increase investments in public universities and federal investment in the pell grant have increased college affordability and enabled significant progress on tackling student debt” becker said in a statement costs for those attending public twoyear community colleges have fallen even more by 9 over the past decade according to the college board data which is broadly in line with federal figures collected by the national center for education statistics still for parents paying for their children to attend outofstate public universities or private colleges the costs remain daunting — as much as 95000 annually in some cases however many institutions offer significant discounts to the sticker price for middle and lowerincome students some private colleges have been expanding their financial aid including the massachusetts institute of technology which in november announced undergraduates with a family income below 200000 would no longer need to pay any tuition at all starting in the fall other private colleges are discounting tuition as a marketing move in an increasingly difficult environment they face a dwindling pool of young adults and students who are more wary of signing up for giant loans recruiting students is crucial for staying afloat as operational costs rise after temporary relief thanks to federal money during the pandemic many colleges have cut programs to try to keep costs under control associated press writer collin binkley contributed to this report from washington dc mumphrey reported from phoenix",
    "summary": "New research indicates students are paying significantly less to attend public universities than they were a decade ago.\nAnd tuition increases at private colleges have finally slowed after years of hefty rises.\nJust under half of students attending in-state public universities are graduating with some debt, down from 59% a decade earlier, according to the College Board figures.\nMeanwhile, at private colleges, tuition continues to rise, but at a much slower rate.\nOther private colleges are discounting tuition as a marketing move in an increasingly difficult environment.",
    "keywords": [
      "college",
      "colleges",
      "cost",
      "public",
      "according",
      "private",
      "universities",
      "fallen",
      "tuition",
      "schools",
      "decade",
      "significantly",
      "university"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/eacd452/2147483647/strip/true/crop/6157x3463+0+321/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdd%2F10%2F9538377889c0fa4398d2f662fa02%2F2568d422c1b945deb7dd5db69412a60e",
    "t": 124
  },
  "https://apnews.com/article/federal-executions-trump-d9b15ffc1db366a717f2f605330999e8": {
    "source": "AP News",
    "url": "https://apnews.com/article/federal-executions-trump-d9b15ffc1db366a717f2f605330999e8",
    "date": "2025-01-21",
    "time": "02:12:57",
    "title": "Trump signs death penalty order directing attorney general to help states get lethal injection drugs",
    "body": "▶ Follow live updates on President Donald Trump’s return to Washington\n\nWASHINGTON (AP) — President Donald Trump signed a sweeping execution order Monday on the death penalty that directs the attorney general to “take all necessary and lawful action” to ensure that states have enough lethal injection drugs to carry out executions.\n\nTrump’s order, coming just hours after he returned to the White House, compels the Justice Department to not only seek the death penalty in appropriate federal cases but also to help preserve capital punishment in states that have struggled to maintain adequate supplies of lethal injection drugs.\n\nTrump had been expected to restart federal executions, which have been on hold since a moratorium was imposed by former Attorney General Merrick Garland in 2021. Only three defendants remain on federal death row after Democratic President Joe Biden recently converted 37 of their sentences to life in prison.\n\nTrump directed the attorney general to pursue federal jurisdiction and seek the death penalty “regardless of other factors” when the case involves the killing of a law enforcement officer or capital crimes “committed by an alien illegally present in this country.” He’s also instructing the attorney general to seek to overrule Supreme Court precedents that “limit the authority of limit the authority of State and Federal governments to impose capital punishment.”\n\n“The Government’s most solemn responsibility is to protect its citizens from abhorrent acts, and my Administration will not tolerate efforts to stymie and eviscerate the laws that authorize capital punishment against those who commit horrible acts of violence against American citizens,” Trump’s order said.\n\nTrump’s administration carried out 13 federal executions during his first term, more than under any president in modern history, and the president has spoken frequently of expanding executions. In a speech announcing his 2024 campaign, Trump called for those “caught selling drugs to receive the death penalty for their heinous acts.” He later promised to execute drug and human smugglers and even praised China’s harsher treatment of drug peddlers.\n\nTrump’s order comes days after Garland withdrew the Justice Department’s protocol for federal executions that allowed for single-drug lethal injections with pentobarbital, after a government review raised concerns about the potential for “unnecessary pain and suffering.” The protocol could be imposed by Trump’s new acting Attorney General James McHenry III, or his his pick to lead the Justice Department, Pam Bondi, once she’s confirmed by the Senate.\n\nThe pentobarbital protocol was adopted by Bill Barr, attorney general during Trump’s first term, to replace a three-drug mix used in the 2000s, the last time federal executions were carried out before Trump was in office.\n\nBiden’s decision last month left just three inmates on federal death row. They are Dylann Roof, who carried out the 2015 racist slayings of nine Black members of Mother Emanuel AME Church in Charleston, South Carolina; 2013 Boston Marathon bomber Dzhokhar Tsarnaev; and Robert Bowers, who fatally shot 11 congregants at Pittsburgh’s Tree of Life synagogue in 2018, the deadliest antisemitic attack in U.S history.",
    "clean_body": "▶ follow live updates on president donald trump’s return to washington washington ap — president donald trump signed a sweeping execution order monday on the death penalty that directs the attorney general to “take all necessary and lawful action” to ensure that states have enough lethal injection drugs to carry out executions trump’s order coming just hours after he returned to the white house compels the justice department to not only seek the death penalty in appropriate federal cases but also to help preserve capital punishment in states that have struggled to maintain adequate supplies of lethal injection drugs trump had been expected to restart federal executions which have been on hold since a moratorium was imposed by former attorney general merrick garland in 2021 only three defendants remain on federal death row after democratic president joe biden recently converted 37 of their sentences to life in prison trump directed the attorney general to pursue federal jurisdiction and seek the death penalty “regardless of other factors” when the case involves the killing of a law enforcement officer or capital crimes “committed by an alien illegally present in this country” he’s also instructing the attorney general to seek to overrule supreme court precedents that “limit the authority of limit the authority of state and federal governments to impose capital punishment” “the government’s most solemn responsibility is to protect its citizens from abhorrent acts and my administration will not tolerate efforts to stymie and eviscerate the laws that authorize capital punishment against those who commit horrible acts of violence against american citizens” trump’s order said trump’s administration carried out 13 federal executions during his first term more than under any president in modern history and the president has spoken frequently of expanding executions in a speech announcing his 2024 campaign trump called for those “caught selling drugs to receive the death penalty for their heinous acts” he later promised to execute drug and human smugglers and even praised china’s harsher treatment of drug peddlers trump’s order comes days after garland withdrew the justice department’s protocol for federal executions that allowed for singledrug lethal injections with pentobarbital after a government review raised concerns about the potential for “unnecessary pain and suffering” the protocol could be imposed by trump’s new acting attorney general james mchenry iii or his his pick to lead the justice department pam bondi once she’s confirmed by the senate the pentobarbital protocol was adopted by bill barr attorney general during trump’s first term to replace a threedrug mix used in the 2000s the last time federal executions were carried out before trump was in office biden’s decision last month left just three inmates on federal death row they are dylann roof who carried out the 2015 racist slayings of nine black members of mother emanuel ame church in charleston south carolina 2013 boston marathon bomber dzhokhar tsarnaev and robert bowers who fatally shot 11 congregants at pittsburgh’s tree of life synagogue in 2018 the deadliest antisemitic attack in us history",
    "summary": "▶ Follow live updates on President Donald Trump’s return to WashingtonWASHINGTON (AP) — President Donald Trump signed a sweeping execution order Monday on the death penalty that directs the attorney general to “take all necessary and lawful action” to ensure that states have enough lethal injection drugs to carry out executions.\nTrump had been expected to restart federal executions, which have been on hold since a moratorium was imposed by former Attorney General Merrick Garland in 2021.\nOnly three defendants remain on federal death row after Democratic President Joe Biden recently converted 37 of their sentences to life in prison.\nIn a speech announcing his 2024 campaign, Trump called for those “caught selling drugs to receive the death penalty for their heinous acts.” He later promised to execute drug and human smugglers and even praised China’s harsher treatment of drug peddlers.\nBiden’s decision last month left just three inmates on federal death row.",
    "keywords": [
      "president",
      "injection",
      "trumps",
      "order",
      "lethal",
      "states",
      "executions",
      "help",
      "general",
      "federal",
      "trump",
      "death",
      "drugs",
      "capital",
      "penalty",
      "attorney",
      "signs"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/22060c6/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb9%2F9a%2F894c20b8f23d7bbd5d5576644509%2F7d3cf862377942699c41ae00d2132681",
    "t": 111
  },
  "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6": {
    "source": "AP News",
    "url": "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6",
    "date": "2025-01-27",
    "time": "20:19:49",
    "title": "CDC ordered to stop working with WHO immediately, upending expectations of an extended withdrawal",
    "body": "NEW YORK (AP) — U.S. public health officials have been told to stop working with the World Health Organization, effective immediately.\n\nA U.S. Centers for Disease Control and Prevention official, John Nkengasong, sent a memo to senior leaders at the agency on Sunday night telling them that all staff who work with the WHO must immediately stop their collaborations and “await further guidance.”\n\nExperts said the sudden stoppage was a surprise and would set back work on investigating and trying to stop outbreaks of Marburg virus and mpox in Africa, as well as brewing global threats. It also comes as health authorities around the world are monitoring bird flu outbreaks among U.S. livestock.\n\nThe Associated Press viewed a copy of Nkengasong’s memo, which said the stop-work policy applied to “all CDC staff engaging with WHO through technical working groups, coordinating centers, advisory boards, cooperative agreements or other means — in person or virtual.” It also says CDC staff are not allowed to visit WHO offices.\n\nPresident Donald Trump last week issued an executive order to begin the process of withdrawing the U.S. from WHO, but that did not take immediate effect. Leaving WHO requires the approval of Congress and that the U.S. meets its financial obligations for the current fiscal year. The U.S. also must provide a one-year notice.\n\nHis administration also told federal health agencies to stop most communications with the public through at least the end of the month.\n\n“Stopping communications and meetings with WHO is a big problem,” said Dr. Jeffrey Klausner, a University of Southern California public health expert who collaborates with WHO on work against sexually transmitted infections.\n\n“People thought there would be a slow withdrawal. This has really caught everyone with their pants down,” said Klausner, who said he learned of it from someone at CDC.\n\n“Talking to WHO is a two-way street,” he added, noting that the two agencies benefit from each other’s expertise. The collaboration allows the U.S. to learn about new tests, new treatments and emerging outbreaks — information “which can help us protect Americans abroad and at home,” Klausner said.\n\nThe CDC details nearly 30 people to WHO and sends many millions of dollars to it through cooperative agreements. The U.S. agency also has some of the world’s leading experts in infectious diseases and public health threats, and the two agencies’ staffers are in daily contact about health dangers and how to stop them.\n\nThe collaboration halt isn’t the only global health effect of Trump’s executive orders. Last week, the president froze spending on another critical program, PEPFAR or the President’s Emergency Plan for AIDS Relief.\n\nThe anti-HIV program is credited with saving 25 million lives, including those of 5.5 million children, since it was started by Republican President George W. Bush. It was included in a Trump administration freeze on foreign aid spending slated to last at least three months.\n\nPEPFAR provides HIV medication to more than 20 million people “and stopping its funding essential stops their HIV treatment,” International AIDS Society President Beatriz Grinsztejn said in a statement. “If that happens, people are going to die and HIV will resurge.”\n\nA U.S. health official confirmed that the CDC was stopping its work with WHO. The person was not authorized to talk about the memo and spoke on condition of anonymity.\n\nA WHO spokesperson referred questions about the withdrawal to U.S. officials.\n\nOfficials at the U.S. Department of Health and Human Services didn’t immediately respond to an emailed request for comment. And CDC officials didn’t respond to the AP’s request to speak with Nkengasong about the memo.\n\n___\n\nAP Medical Writer Lauran Neergaard contributed to this report.\n\n___\n\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group and the Robert Wood Johnson Foundation. The AP is solely responsible for all content.",
    "clean_body": "new york ap — us public health officials have been told to stop working with the world health organization effective immediately a us centers for disease control and prevention official john nkengasong sent a memo to senior leaders at the agency on sunday night telling them that all staff who work with the who must immediately stop their collaborations and “await further guidance” experts said the sudden stoppage was a surprise and would set back work on investigating and trying to stop outbreaks of marburg virus and mpox in africa as well as brewing global threats it also comes as health authorities around the world are monitoring bird flu outbreaks among us livestock the associated press viewed a copy of nkengasong’s memo which said the stopwork policy applied to “all cdc staff engaging with who through technical working groups coordinating centers advisory boards cooperative agreements or other means — in person or virtual” it also says cdc staff are not allowed to visit who offices president donald trump last week issued an executive order to begin the process of withdrawing the us from who but that did not take immediate effect leaving who requires the approval of congress and that the us meets its financial obligations for the current fiscal year the us also must provide a oneyear notice his administration also told federal health agencies to stop most communications with the public through at least the end of the month “stopping communications and meetings with who is a big problem” said dr jeffrey klausner a university of southern california public health expert who collaborates with who on work against sexually transmitted infections “people thought there would be a slow withdrawal this has really caught everyone with their pants down” said klausner who said he learned of it from someone at cdc “talking to who is a twoway street” he added noting that the two agencies benefit from each other’s expertise the collaboration allows the us to learn about new tests new treatments and emerging outbreaks — information “which can help us protect americans abroad and at home” klausner said the cdc details nearly 30 people to who and sends many millions of dollars to it through cooperative agreements the us agency also has some of the world’s leading experts in infectious diseases and public health threats and the two agencies’ staffers are in daily contact about health dangers and how to stop them the collaboration halt isn’t the only global health effect of trump’s executive orders last week the president froze spending on another critical program pepfar or the president’s emergency plan for aids relief the antihiv program is credited with saving 25 million lives including those of 55 million children since it was started by republican president george w bush it was included in a trump administration freeze on foreign aid spending slated to last at least three months pepfar provides hiv medication to more than 20 million people “and stopping its funding essential stops their hiv treatment” international aids society president beatriz grinsztejn said in a statement “if that happens people are going to die and hiv will resurge” a us health official confirmed that the cdc was stopping its work with who the person was not authorized to talk about the memo and spoke on condition of anonymity a who spokesperson referred questions about the withdrawal to us officials officials at the us department of health and human services didn’t immediately respond to an emailed request for comment and cdc officials didn’t respond to the ap’s request to speak with nkengasong about the memo ap medical writer lauran neergaard contributed to this report the associated press health and science department receives support from the howard hughes medical institute’s science and educational media group and the robert wood johnson foundation the ap is solely responsible for all content",
    "summary": "NEW YORK (AP) — U.S. public health officials have been told to stop working with the World Health Organization, effective immediately.\nThe Associated Press viewed a copy of Nkengasong’s memo, which said the stop-work policy applied to “all CDC staff engaging with WHO through technical working groups, coordinating centers, advisory boards, cooperative agreements or other means — in person or virtual.” It also says CDC staff are not allowed to visit WHO offices.\nHis administration also told federal health agencies to stop most communications with the public through at least the end of the month.\nThis has really caught everyone with their pants down,” said Klausner, who said he learned of it from someone at CDC.\nThe CDC details nearly 30 people to WHO and sends many millions of dollars to it through cooperative agreements.",
    "keywords": [
      "president",
      "public",
      "immediately",
      "stop",
      "staff",
      "withdrawal",
      "outbreaks",
      "extended",
      "expectations",
      "ordered",
      "work",
      "cdc",
      "health",
      "million",
      "upending",
      "working",
      "memo"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/9dad1fe/2147483647/strip/true/crop/5675x3192+0+298/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3d%2F24%2Ff56808076479c3aa06a201c8a111%2F18b3a9dc49d8448a9133e0f0b7b170fb",
    "t": 105
  },
  "https://apnews.com/article/trump-fbi-firing-a7b19a5f414ce82c6f6b5f6656000d23": {
    "source": "AP News",
    "url": "https://apnews.com/article/trump-fbi-firing-a7b19a5f414ce82c6f6b5f6656000d23",
    "date": "2025-01-31",
    "time": "20:00:28",
    "title": "Trump administration fires prosecutors involved in Jan. 6 cases and moves toward ousting FBI agents",
    "body": "WASHINGTON (AP) — The Trump administration on Friday fired a group of prosecutors involved in the Jan. 6 criminal cases and demanded the names of FBI agents involved in those same probes so they can possibly be ousted, moves that reflect a White House determination to exert control over federal law enforcement and purge agencies of career employees seen as insufficiently loyal.\n\nActing Deputy Attorney General Emil Bove ordered the firings of the Jan. 6 prosecutors days after President Donald Trump’s sweeping clemency action benefiting the more than 1,500 people charged in the U.S. Capitol attack, according to a memo obtained by The Associated Press. About two dozen employees at the U.S. attorney’s office in Washington were terminated, said a person familiar with the matter who spoke on the condition of anonymity because they were not authorized to discuss personnel issues.\n\nA separate memo by Bove identified more than a half-dozen FBI senior executives who were ordered to retire or be fired by Monday, and also asked for the names, titles and offices of all FBI employees who worked on investigations into the Jan. 6, 2021, U.S. Capitol riot — a list the bureau’s acting director said could number in the thousands. Bove, who has defended Trump in his criminal cases before joining the administration, said Justice Department officials would then carry out a “review process to determine whether any additional personnel actions are necessary.”\n\n“As we’ve said since the moment we agreed to take on these roles, we are going to follow the law, follow FBI policy, and do what’s in the best interest of the workforce and the American people — always,” acting FBI Director Brian Driscoll wrote in a letter to the workforce.\n\nThe prosecutors fired in the D.C. U.S. attorney’s office had been hired for temporary assignments to support the Jan. 6 cases, but were moved into permanent roles after Trump’s presidential win in November, according to the memo obtained by the AP. Bove, the acting deputy attorney general, said he would not “tolerate subversive personnel actions by the previous administration.”\n\nAny mass firings at the FBI would be a major blow to the historic independence from the White House of the nation’s premier federal law enforcement agency but would be in keeping with Trump’s persistent resolve to bend the law enforcement and intelligence community to his will. It would be part of a startling pattern of retribution waged on federal government employees, following the forced ousters of a group of senior FBI executives earlier this week as well as a broad termination by the Justice Department of prosecutors on special counsel Jack Smith’s team who investigated Trump.\n\nThe FBI Agents Association said the reported efforts to oust agents represented “outrageous actions by acting officials” that were “fundamentally at odds with the law enforcement objectives outlined by President Trump and his support for FBI Agents.”\n\n“Dismissing potentially hundreds of Agents would severely weaken the Bureau’s ability to protect the country from national security and criminal threats and will ultimately risk setting up the Bureau and its new leadership for failure,” the association said in a statement.\n\nIt was not immediately clear what recourse any fired agent might take, but the bureau has a well-defined process for terminations and any abrupt action that bypasses that protocol could presumably open the door to a legal challenge.\n\nWhen pressed during his confirmation hearing Thursday, Trump’s pick for FBI director, Kash Patel, said he was not aware of any plans to terminate or otherwise punish FBI employees who were involved in the Trump investigations. Patel said if he was confirmed he would follow the FBI’s internal review processes for taking action against employees.\n\nAsked by Democratic Sen. Cory Booker whether he would reverse any decisions before his confirmation that don’t follow that standard process, Patel said, “I don’t know what’s going on right now over there, but I’m committed to you, senator, and your colleagues, that I will honor the due process of the FBI.”\n\nBefore he was nominated for the director’s position, Patel had remarked on at least one podcast appearance about what he called anti-Trump “conspirators” in the government and news media who he said needed to be rooted out.\n\nTrump has for years expressed fury at the FBI and Justice Department over investigations that shadowed his presidency, including an inquiry into ties between Russia and his 2016 campaign, and continued over the last four years. He fired one FBI director, James Comey, amid the Russia investigation and then replaced his second, Christopher Wray, just weeks after his win in November.\n\nAsked at the White House on Friday if he had anything to do with the scrutiny of the agents, he said: “No, but we have some very bad people over there. It was weaponized at a level that nobody’s never seen before. They came after a lot of people — like me – but they came after a lot of people.”\n\nHe added, “If they fired some people over there, that’s a good thing, because they were very bad.”\n\nThe FBI and Smith’s team investigated Trump over his efforts to overturn the 2020 presidential election and his hoarding of classified documents at his Mar-a-Lago estate in Florida. Both of those cases resulted in indictments that were withdrawn after Trump’s November presidential win because of longstanding Justice Department policy prohibiting the federal prosecution of a sitting president.\n\nThe Justice Department also charged more than 1,500 Trump supporters in connection with the Capitol riot, though Trump on his first day in office granted clemency to all of them — including the ones convicted of violent crimes — through pardons, sentence commutations and dismissals of indictments.\n\nThis week, the Justice Department fired more than a dozen prosecutors who worked on Smith investigations, and a group of senior FBI executives — including several executive assistant directors and agents in charge of big-city field offices — have been told to either resign or retire or be fired Monday.\n\n_____\n\nAssociated Press writers Zeke Miller, Michael Kunzelman, Byron Tau and Jim Mustian contributed to this report.",
    "clean_body": "washington ap — the trump administration on friday fired a group of prosecutors involved in the jan 6 criminal cases and demanded the names of fbi agents involved in those same probes so they can possibly be ousted moves that reflect a white house determination to exert control over federal law enforcement and purge agencies of career employees seen as insufficiently loyal acting deputy attorney general emil bove ordered the firings of the jan 6 prosecutors days after president donald trump’s sweeping clemency action benefiting the more than 1500 people charged in the us capitol attack according to a memo obtained by the associated press about two dozen employees at the us attorney’s office in washington were terminated said a person familiar with the matter who spoke on the condition of anonymity because they were not authorized to discuss personnel issues a separate memo by bove identified more than a halfdozen fbi senior executives who were ordered to retire or be fired by monday and also asked for the names titles and offices of all fbi employees who worked on investigations into the jan 6 2021 us capitol riot — a list the bureau’s acting director said could number in the thousands bove who has defended trump in his criminal cases before joining the administration said justice department officials would then carry out a “review process to determine whether any additional personnel actions are necessary” “as we’ve said since the moment we agreed to take on these roles we are going to follow the law follow fbi policy and do what’s in the best interest of the workforce and the american people — always” acting fbi director brian driscoll wrote in a letter to the workforce the prosecutors fired in the dc us attorney’s office had been hired for temporary assignments to support the jan 6 cases but were moved into permanent roles after trump’s presidential win in november according to the memo obtained by the ap bove the acting deputy attorney general said he would not “tolerate subversive personnel actions by the previous administration” any mass firings at the fbi would be a major blow to the historic independence from the white house of the nation’s premier federal law enforcement agency but would be in keeping with trump’s persistent resolve to bend the law enforcement and intelligence community to his will it would be part of a startling pattern of retribution waged on federal government employees following the forced ousters of a group of senior fbi executives earlier this week as well as a broad termination by the justice department of prosecutors on special counsel jack smith’s team who investigated trump the fbi agents association said the reported efforts to oust agents represented “outrageous actions by acting officials” that were “fundamentally at odds with the law enforcement objectives outlined by president trump and his support for fbi agents” “dismissing potentially hundreds of agents would severely weaken the bureau’s ability to protect the country from national security and criminal threats and will ultimately risk setting up the bureau and its new leadership for failure” the association said in a statement it was not immediately clear what recourse any fired agent might take but the bureau has a welldefined process for terminations and any abrupt action that bypasses that protocol could presumably open the door to a legal challenge when pressed during his confirmation hearing thursday trump’s pick for fbi director kash patel said he was not aware of any plans to terminate or otherwise punish fbi employees who were involved in the trump investigations patel said if he was confirmed he would follow the fbi’s internal review processes for taking action against employees asked by democratic sen cory booker whether he would reverse any decisions before his confirmation that don’t follow that standard process patel said “i don’t know what’s going on right now over there but i’m committed to you senator and your colleagues that i will honor the due process of the fbi” before he was nominated for the director’s position patel had remarked on at least one podcast appearance about what he called antitrump “conspirators” in the government and news media who he said needed to be rooted out trump has for years expressed fury at the fbi and justice department over investigations that shadowed his presidency including an inquiry into ties between russia and his 2016 campaign and continued over the last four years he fired one fbi director james comey amid the russia investigation and then replaced his second christopher wray just weeks after his win in november asked at the white house on friday if he had anything to do with the scrutiny of the agents he said “no but we have some very bad people over there it was weaponized at a level that nobody’s never seen before they came after a lot of people — like me – but they came after a lot of people” he added “if they fired some people over there that’s a good thing because they were very bad” the fbi and smith’s team investigated trump over his efforts to overturn the 2020 presidential election and his hoarding of classified documents at his maralago estate in florida both of those cases resulted in indictments that were withdrawn after trump’s november presidential win because of longstanding justice department policy prohibiting the federal prosecution of a sitting president the justice department also charged more than 1500 trump supporters in connection with the capitol riot though trump on his first day in office granted clemency to all of them — including the ones convicted of violent crimes — through pardons sentence commutations and dismissals of indictments this week the justice department fired more than a dozen prosecutors who worked on smith investigations and a group of senior fbi executives — including several executive assistant directors and agents in charge of bigcity field offices — have been told to either resign or retire or be fired monday associated press writers zeke miller michael kunzelman byron tau and jim mustian contributed to this report",
    "summary": "The prosecutors fired in the D.C. U.S. attorney’s office had been hired for temporary assignments to support the Jan. 6 cases, but were moved into permanent roles after Trump’s presidential win in November, according to the memo obtained by the AP.\nWhen pressed during his confirmation hearing Thursday, Trump’s pick for FBI director, Kash Patel, said he was not aware of any plans to terminate or otherwise punish FBI employees who were involved in the Trump investigations.\nTrump has for years expressed fury at the FBI and Justice Department over investigations that shadowed his presidency, including an inquiry into ties between Russia and his 2016 campaign, and continued over the last four years.\nHe fired one FBI director, James Comey, amid the Russia investigation and then replaced his second, Christopher Wray, just weeks after his win in November.\nBoth of those cases resulted in indictments that were withdrawn after Trump’s November presidential win because of longstanding Justice Department policy prohibiting the federal prosecution of a sitting president.",
    "keywords": [
      "justice",
      "trumps",
      "fires",
      "ousting",
      "cases",
      "fired",
      "jan",
      "fbi",
      "employees",
      "trump",
      "prosecutors",
      "agents",
      "moves",
      "involved",
      "law",
      "department"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/75f0bb3/2147483647/strip/true/crop/5777x3250+0+301/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F39%2F7b%2Ff17837024f314d7f87e3d9f43214%2F7512c874e72e4e7683c9e1f56ab01033",
    "t": 101
  },
  "https://apnews.com/article/steven-soderbergh-presence-ae40202b72deda7c29d645578a346b48": {
    "source": "AP News",
    "url": "https://apnews.com/article/steven-soderbergh-presence-ae40202b72deda7c29d645578a346b48",
    "date": "2025-01-22",
    "time": "17:09:29",
    "title": "Steven Soderbergh: ‘I’m the cockroach of this industry. I can survive any version of it’",
    "body": "NEW YORK (AP) — Steven Soderbergh isn’t just the director and cinematographer of his latest film. He’s also, in a way, its central character.\n\n“Presence” is filmed entirely from the POV of a ghost inside a home a family has just moved into. Soderbergh, who serves as his own cinematographer under the pseudonym Peter Andrews (his father’s name), essentially performs as the presence, a floating point-of-view that watches as the violence that killed the mysterious ghost threatens to be repeated.\n\nFor even the prolific Soderbergh, the film, which opens Friday in theaters, was a unique challenge. He shot “Presence” with a small digital camera while wearing slippers to soften his steps.\n\nThe 62-year-old filmmaker recently met a reporter in a midtown Manhattan hotel in between finishing post-production on his other upcoming movie (“Black Bag,” a thriller Focus Features will release March 14) and beginning production in a few weeks on his next project, a romantic comedy that he says “feels like a George Cukor movie.”\n\nSoderbergh, whose films include “Out of Sight,” the “Ocean’s 11” movies, “Magic Mike” and “Erin Brockovich,” tends to do a lot in small windows of time. “Presence” took 11 days to film.\n\nThat dexterous proficiency has made the ever-experimenting Soderbergh one of Hollywood’s most widely respected evaluators of the movie business. In a wide-ranging conversation, he discussed why he thinks streaming is the most destructive force the movies have ever faced and why he’s “the cockroach of this industry.”\n\nAP: You use pseudonyms for yourself as a cinematographer and editor. Were you tempted to credit yourself as an actor for “Presence”?\n\nSODERBERGH: No, but what I did is subtle. For the first and only time Peter Andrews has a camera operator credit. That’s not a credit that I typically take because I don’t need it and I typically have another operator working with me. But I felt like this was a workout. It was tricky, but really fun. It was another level of performance anxiety because I ruined more takes than anyone else in the film by a larger factor. I was the one going: “Cut. I f—ed that up. We got to go again.”\n\nAP: You made this quickly and inexpensively, and then sold it to a distributor. Was it appealing to work outside the system?\n\nSODERBERGH: The beauty of projects at this scale is I can just do them without having to talk to anybody. It’s not because I don’t want notes. It’s because it’s just the brain trust and none of the psychic real estate is taken up by things that have nothing to do with what you’re going to shoot. I went from that into a more traditional project in which a lot of psychic real estate gets taken up by the process of having a studio finance your movie. I like these people, it’s just a lot of lawyers. Like, a lot of lawyers.\n\nAP: You’ve called streaming the most destructive force in movie history. What most irks you about it?\n\nSODERBERGH: It removes a key reference point for an artist. It’s helpful to know how something is doing, or how it did. You need to know that to calibrate whether you accomplished what you wanted to accomplish, whether you can work at a certain level. That’s one of the most confusing things about it, the black box of it. Apart from the economic invisibility of what’s going on there — the fact that we can’t really look under the hood of how these streaming companies work economically — there’s another kind of handrail that’s missing that I find really helpful. At the end of the day, I, at least, want to know. The market will tell you how you’re doing. I want to know that so I can adjust or go in another direction. Being irrelevant isn’t very appealing. What is the overlap between what people seem to be responding to and what I like? Because I don’t want to make these things and have nobody see them. I’ve had enough people say, “Oh, did that come out?” It’s a public art form.\n\nAP: How do you suspect the audience is changing?\n\nSODERBERGH: The good news is, if you talk to Focus Features and Neon and A24, young people are going to the movies. This is the Letterboxd generation. That’s fantastic. I hope that ripples outside the U.S. They are cine-literate and they expect something singular. They want the signature, they want the stamp of a filmmaker. And that’s turning into a real business. One of the things, I think, we all need to do, but especially the people who cover the industry, is to stop using the studio metric for what a success is. That’s not a template you should be applying to everything.\n\nAP: Do you ever lament that the movies that made you want to be a filmmaker like “All the President’s Men” and “Chinatown” occupied a different place in the culture than today’s films?\n\nSODERBERGH: There was a period of about 10 to 14 year where the best movies of the year were also the most popular movies of the year. That’s not necessarily true anymore. You can pick one of the movies that’s in the hunt this year and go: That’s a ’70s movie. That’s as good and interesting as one of those. But it’s not going to do the business that one of those would have done. It’s the artist’s job to adapt. When it comes to trying to control what people want to go see, you’re now in a place like: “If I really wish hard, it won’t rain.” The weather is the weather. To a certain degree, the audience is a weather system. Luckily because of the way I began, I’m the cockroach of this industry. I can survive any version of it.\n\nAP: You’ve described feeling a need to immediately “annihilate” whatever you just made by starting on something vastly different.\n\nSODERBERGH: Yeah, when you see “Black Bag,” you’re like, “Oh, that’s different.” There are more shots in the first four minutes of “Black Bag” than the entirety of “Presence.” It’s a different thing and it has different demands.\n\nAP: It’s not exhausting to reinvent yourself every movie?\n\nSODERBERGH: No, it feels more like a natural evolution and a natural response in the sense of: I want to be a different filmmaker for this. I don’t want to know the outcome. If you have a conversation with a filmmaker who says they have “figured things out,” you should run in the other direction. It’s like: You’re deluded and you have a very superficial understanding of what this art form demands if you’re not humbled by what it asks of you to be distinctive.\n\nAP: Do you feel you’ve gotten closer? There might not be a filmmaker alive who’s tried more ways to make a movie than you have.\n\nSODERBERGH: No, I still feel like I’m reaching for something I quite possibly won’t ever grasp and maybe shouldn’t. As frustrating as it may be to feel like I’ve never made a thing that is at the level of one of my heroes made, I don’t know what I’d do if I did feel that. Do you stop, then? The movie “Come and See,” that guy got to basically go: “That’s my mic drop.” I’ve never made anything approaching that.\n\nAP: It wouldn’t be the only film I’d suggest, but I think “Out of Sight” is pretty darn perfect.\n\nSODERBERGH: Oh, I’m very happy with that film. I’m very proud of that film. I can’t say there’s much in it that I’d go back and change. That said, it’s not “Apocalypse Now.” Or “The Third Man.” By my standards, I don’t look at it and go, “That’s as good as ‘The Third Man.’” I’m good at pushing myself into areas that are slightly beyond my comfort zone, but I also understand what my limitations are. I’m inherently not a grandiose thinker about myself or my work. That’s a critical component to some of the films I’m talking about that I think are amazing. I could never make “Apocalypse Now.” I don’t think of myself as a filmmaker the way Francis (Ford Coppola) thinks of himself. That’s not: He should be like me or I should be like him. It’s just how we’re built. I’m more earthbound, I guess is the word. And that’s what I like and what I’m good at.\n\nAP: Do you have any idea why?\n\nSODERBERGH: I think it’s the way I was born and the way I was raised. And the people who were around me when I was younger who mentored me. I just don’t think I was born with the grandiosity gene and there was nobody around me who would have cultivated that even if I had shown signs. Going to Sundance last year with “Presence” was really gratifying. If you’d told me 35 years later you’re going to come back here (where “Sex, Lies and Videotape” premiered in 1989) with a movie that people are interested in seeing, I would have wept.",
    "clean_body": "new york ap — steven soderbergh isn’t just the director and cinematographer of his latest film he’s also in a way its central character “presence” is filmed entirely from the pov of a ghost inside a home a family has just moved into soderbergh who serves as his own cinematographer under the pseudonym peter andrews his father’s name essentially performs as the presence a floating pointofview that watches as the violence that killed the mysterious ghost threatens to be repeated for even the prolific soderbergh the film which opens friday in theaters was a unique challenge he shot “presence” with a small digital camera while wearing slippers to soften his steps the 62yearold filmmaker recently met a reporter in a midtown manhattan hotel in between finishing postproduction on his other upcoming movie “black bag” a thriller focus features will release march 14 and beginning production in a few weeks on his next project a romantic comedy that he says “feels like a george cukor movie” soderbergh whose films include “out of sight” the “ocean’s 11” movies “magic mike” and “erin brockovich” tends to do a lot in small windows of time “presence” took 11 days to film that dexterous proficiency has made the everexperimenting soderbergh one of hollywood’s most widely respected evaluators of the movie business in a wideranging conversation he discussed why he thinks streaming is the most destructive force the movies have ever faced and why he’s “the cockroach of this industry” ap you use pseudonyms for yourself as a cinematographer and editor were you tempted to credit yourself as an actor for “presence” soderbergh no but what i did is subtle for the first and only time peter andrews has a camera operator credit that’s not a credit that i typically take because i don’t need it and i typically have another operator working with me but i felt like this was a workout it was tricky but really fun it was another level of performance anxiety because i ruined more takes than anyone else in the film by a larger factor i was the one going “cut i f—ed that up we got to go again” ap you made this quickly and inexpensively and then sold it to a distributor was it appealing to work outside the system soderbergh the beauty of projects at this scale is i can just do them without having to talk to anybody it’s not because i don’t want notes it’s because it’s just the brain trust and none of the psychic real estate is taken up by things that have nothing to do with what you’re going to shoot i went from that into a more traditional project in which a lot of psychic real estate gets taken up by the process of having a studio finance your movie i like these people it’s just a lot of lawyers like a lot of lawyers ap you’ve called streaming the most destructive force in movie history what most irks you about it soderbergh it removes a key reference point for an artist it’s helpful to know how something is doing or how it did you need to know that to calibrate whether you accomplished what you wanted to accomplish whether you can work at a certain level that’s one of the most confusing things about it the black box of it apart from the economic invisibility of what’s going on there — the fact that we can’t really look under the hood of how these streaming companies work economically — there’s another kind of handrail that’s missing that i find really helpful at the end of the day i at least want to know the market will tell you how you’re doing i want to know that so i can adjust or go in another direction being irrelevant isn’t very appealing what is the overlap between what people seem to be responding to and what i like because i don’t want to make these things and have nobody see them i’ve had enough people say “oh did that come out” it’s a public art form ap how do you suspect the audience is changing soderbergh the good news is if you talk to focus features and neon and a24 young people are going to the movies this is the letterboxd generation that’s fantastic i hope that ripples outside the us they are cineliterate and they expect something singular they want the signature they want the stamp of a filmmaker and that’s turning into a real business one of the things i think we all need to do but especially the people who cover the industry is to stop using the studio metric for what a success is that’s not a template you should be applying to everything ap do you ever lament that the movies that made you want to be a filmmaker like “all the president’s men” and “chinatown” occupied a different place in the culture than today’s films soderbergh there was a period of about 10 to 14 year where the best movies of the year were also the most popular movies of the year that’s not necessarily true anymore you can pick one of the movies that’s in the hunt this year and go that’s a ’70s movie that’s as good and interesting as one of those but it’s not going to do the business that one of those would have done it’s the artist’s job to adapt when it comes to trying to control what people want to go see you’re now in a place like “if i really wish hard it won’t rain” the weather is the weather to a certain degree the audience is a weather system luckily because of the way i began i’m the cockroach of this industry i can survive any version of it ap you’ve described feeling a need to immediately “annihilate” whatever you just made by starting on something vastly different soderbergh yeah when you see “black bag” you’re like “oh that’s different” there are more shots in the first four minutes of “black bag” than the entirety of “presence” it’s a different thing and it has different demands ap it’s not exhausting to reinvent yourself every movie soderbergh no it feels more like a natural evolution and a natural response in the sense of i want to be a different filmmaker for this i don’t want to know the outcome if you have a conversation with a filmmaker who says they have “figured things out” you should run in the other direction it’s like you’re deluded and you have a very superficial understanding of what this art form demands if you’re not humbled by what it asks of you to be distinctive ap do you feel you’ve gotten closer there might not be a filmmaker alive who’s tried more ways to make a movie than you have soderbergh no i still feel like i’m reaching for something i quite possibly won’t ever grasp and maybe shouldn’t as frustrating as it may be to feel like i’ve never made a thing that is at the level of one of my heroes made i don’t know what i’d do if i did feel that do you stop then the movie “come and see” that guy got to basically go “that’s my mic drop” i’ve never made anything approaching that ap it wouldn’t be the only film i’d suggest but i think “out of sight” is pretty darn perfect soderbergh oh i’m very happy with that film i’m very proud of that film i can’t say there’s much in it that i’d go back and change that said it’s not “apocalypse now” or “the third man” by my standards i don’t look at it and go “that’s as good as ‘the third man’” i’m good at pushing myself into areas that are slightly beyond my comfort zone but i also understand what my limitations are i’m inherently not a grandiose thinker about myself or my work that’s a critical component to some of the films i’m talking about that i think are amazing i could never make “apocalypse now” i don’t think of myself as a filmmaker the way francis ford coppola thinks of himself that’s not he should be like me or i should be like him it’s just how we’re built i’m more earthbound i guess is the word and that’s what i like and what i’m good at ap do you have any idea why soderbergh i think it’s the way i was born and the way i was raised and the people who were around me when i was younger who mentored me i just don’t think i was born with the grandiosity gene and there was nobody around me who would have cultivated that even if i had shown signs going to sundance last year with “presence” was really gratifying if you’d told me 35 years later you’re going to come back here where “sex lies and videotape” premiered in 1989 with a movie that people are interested in seeing i would have wept",
    "summary": "It’s because it’s just the brain trust and none of the psychic real estate is taken up by things that have nothing to do with what you’re going to shoot.\nYou can pick one of the movies that’s in the hunt this year and go: That’s a ’70s movie.\nSODERBERGH: No, I still feel like I’m reaching for something I quite possibly won’t ever grasp and maybe shouldn’t.\nI could never make “Apocalypse Now.” I don’t think of myself as a filmmaker the way Francis (Ford Coppola) thinks of himself.\nI just don’t think I was born with the grandiosity gene and there was nobody around me who would have cultivated that even if I had shown signs.",
    "keywords": [
      "version",
      "filmmaker",
      "think",
      "going",
      "soderbergh",
      "youre",
      "movie",
      "movies",
      "know",
      "cockroach",
      "dont",
      "steven",
      "thats",
      "im",
      "survive",
      "industry"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/1e4d714/2147483647/strip/true/crop/3798x2136+0+198/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fb1%2F2e0bb61fb4b93e0c3fae8a6a6dbf%2F941c11b0a76043fc98e025d34b8c0ffb",
    "t": 110
  }
}