{
  "https://apnews.com/article/al-trautwig-dies-7582edc677ecafb0648d86f004c20116": {
    "source": "AP News",
    "url": "https://apnews.com/article/al-trautwig-dies-7582edc677ecafb0648d86f004c20116",
    "date": "2025-02-24",
    "time": "22:15:55",
    "title": "Longtime New York sports broadcaster Al Trautwig dies at 68 from complications of cancer",
    "body": "Al Trautwig, one of the most recognizable sports broadcasters in New York and a fixture at numerous international sporting events for more than three decades, has died. He was 68.\n\nTrautwig’s son, Alex, told The Associated Press his father died Sunday at his home on Long Island from complications of cancer.\n\nTrautwig was part of MSG pre- and postgame broadcasts of the NBA’s Knicks, NHL’s Rangers and Major League Baseball’s Yankees. He also worked 16 Olympics, the Indianapolis 500, the Tour de France and the U.S. Open tennis tournament, and won four national Emmy Awards and more than 30 in New York.\n\n“Al was a staple on MSG Networks’ Knicks, Rangers and Yankees coverage for more than 30 years, and his passion for the teams he covered was undeniable,” MSG said in a statement. “He leaves behind one of the great legacies in New York sports broadcasting history. Our thoughts and prayers are with Al’s family and friends.”\n\nFor many fans watching games on TV in New York, Trautwig’s voice was often the first they heard. With a natural storytelling style, he used his pregame introductions to make big games at Madison Square Garden or Yankee Stadium feel even bigger, while rarely needing to raise the level of his voice.\n\nMSG Networks studio analyst Alan Hahn, who called Trautwig a friend, mentor and a career resource of support, said the accomplished sportscaster “was a skilled host who knew how to make every game feel like something you don’t want to miss.”\n\n“We lost a legendary voice in sports. But we lost a lot more than that,” Hahn wrote in a series of social media posts. “Al Trautwig had an amazing voice and knew how to use it the way a tenor could bring depth and intensity to a song. ... He loved sports and had incredible versatility from baseball to basketball and hockey. And that’s not even counting his incredible work at the Olympics.”\n\n___\n\nAP Sports Writer Brian Mahoney in New York contributed to this report.\n\n___\n\nAP sports: https://apnews.com/hub/sports",
    "clean_body": "al trautwig one of the most recognizable sports broadcasters in new york and a fixture at numerous international sporting events for more than three decades has died he was 68 trautwig’s son alex told the associated press his father died sunday at his home on long island from complications of cancer trautwig was part of msg pre and postgame broadcasts of the nba’s knicks nhl’s rangers and major league baseball’s yankees he also worked 16 olympics the indianapolis 500 the tour de france and the us open tennis tournament and won four national emmy awards and more than 30 in new york “al was a staple on msg networks’ knicks rangers and yankees coverage for more than 30 years and his passion for the teams he covered was undeniable” msg said in a statement “he leaves behind one of the great legacies in new york sports broadcasting history our thoughts and prayers are with al’s family and friends” for many fans watching games on tv in new york trautwig’s voice was often the first they heard with a natural storytelling style he used his pregame introductions to make big games at madison square garden or yankee stadium feel even bigger while rarely needing to raise the level of his voice msg networks studio analyst alan hahn who called trautwig a friend mentor and a career resource of support said the accomplished sportscaster “was a skilled host who knew how to make every game feel like something you don’t want to miss” “we lost a legendary voice in sports but we lost a lot more than that” hahn wrote in a series of social media posts “al trautwig had an amazing voice and knew how to use it the way a tenor could bring depth and intensity to a song he loved sports and had incredible versatility from baseball to basketball and hockey and that’s not even counting his incredible work at the olympics” ap sports writer brian mahoney in new york contributed to this report ap sports httpsapnewscomhubsports",
    "summary": "Al Trautwig, one of the most recognizable sports broadcasters in New York and a fixture at numerous international sporting events for more than three decades, has died.\nTrautwig’s son, Alex, told The Associated Press his father died Sunday at his home on Long Island from complications of cancer.\nTrautwig was part of MSG pre- and postgame broadcasts of the NBA’s Knicks, NHL’s Rangers and Major League Baseball’s Yankees.\n“Al was a staple on MSG Networks’ Knicks, Rangers and Yankees coverage for more than 30 years, and his passion for the teams he covered was undeniable,” MSG said in a statement.\n“Al Trautwig had an amazing voice and knew how to use it the way a tenor could bring depth and intensity to a song.",
    "keywords": [
      "msg",
      "rangers",
      "yankees",
      "cancer",
      "trautwig",
      "lost",
      "york",
      "dies",
      "knicks",
      "longtime",
      "broadcaster",
      "voice",
      "knew",
      "networks",
      "68",
      "al",
      "complications"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png",
    "t": 77
  },
  "https://apnews.com/article/denmark-greenland-california-75f1521f32871069e9840069e829e4dc": {
    "source": "AP News",
    "url": "https://apnews.com/article/denmark-greenland-california-75f1521f32871069e9840069e829e4dc",
    "date": "2025-02-12",
    "time": "09:53:45",
    "title": "A joke petition seeks to help Denmark buy California as Trump eyes Greenland",
    "body": "Is California for sale? A lighthearted petition to buy the state of California for Denmark prompted more than 200,000 signatures by Wednesday in response to President Donald Trump’s talk about taking control of Greenland, a vast and mineral-rich Arctic island.\n\n“Have you ever looked at a map and thought, ‘You know what Denmark needs? More sunshine, palm trees, and roller skates,’” the petition asks. “Well, we have a once-in-a-lifetime opportunity to make that dream a reality.\n\n“It is in the national interest to promote the extraordinary heritage of our Nation, so California will become New Denmark. Los Angeles? More like Løs Ångeles,” it says.\n\nXavier Dutoit, the petition’s organizer, got the idea last month while vacationing in the Philippines. He overheard an American tourist loudly discussing Trump’s Greenland pitch.\n\n“That American didn’t seem to grasp how unhinged and absurd it was for any country’s President — especially in a stable democracy that the USA claims to be — to offer or threaten to take over another sovereign country’s territory,” Dutoit wrote in an email to The Associated Press.\n\nWhile Dutoit is not Danish — he is Swiss-French — he consulted a multi-national group of friends who are helping him, including Kenneth Haar, who is Danish and lives in Copenhagen.\n\n“The Trump-Greenland issue is, by far, the biggest political issue in this country at the moment,” Haar told AP in a Zoom interview. “It is considered a very depressing and a very dangerous situation.”\n\nWhile Løs Ångeles is a joke, there is another city in Southern California with a very real connection to the land of Vikings, Lego and Hans Christian Andersen. Known as “the Danish capital of America,” Solvang was founded by three immigrants from Denmark in 1911.\n\nThe city is popular with tourists, who come in droves for its aebleskiver pastries (similar to fritters), Scandinavian windmills, a main street called “ Copenhagen Drive ” and, of course, a Hans Christian Andersen Museum to honor the famous Danish fairy tale author. Danish royals have visited several times over the decades.\n\nIn 2019, Trump scrapped a trip to Denmark, blaming Prime Minister Mette Frederiksen for making a “nasty” statement when she rejected his first-term idea of buying Greenland as an absurdity. Greenland is a semi-autonomous territory of Denmark, a U.S. ally and fellow member of NATO.\n\nBefore taking office again last month, Trump said he would not rule out the use of military force to seize control of Greenland, calling it vital to U.S. national security, and last month his son visited the island.\n\nMúte B. Egede, Greenland’s prime minister, shot back: “Greenland is for the Greenlandic people. We do not want to be Danish, we do not want to be American. We want to be Greenlandic.”\n\nHaar said California’s appeal to Danes is obvious, from its towering mountains to its sunny beaches.\n\n“We have none of that here,” he said. “Denmark is a pretty flat country with a pretty boring climate.”\n\nThe petition organizers even have their own plans for Disneyland in Southern California: “We’ll rename it Hans Christian Andersenland. Mickey Mouse in a Viking helmet? Yes, please.”\n\nThe petition notes that Trump isn’t a fan of the Golden State. Last year, he called it “Paradise Lost” and he regularly derides Gov. Gavin Newsom with the nickname “Newscum.”\n\nBut of course, every petition needs some fine print, way down at the bottom:\n\n“Disclaimer: This campaign is 100% real … in our dreams.”",
    "clean_body": "is california for sale a lighthearted petition to buy the state of california for denmark prompted more than 200000 signatures by wednesday in response to president donald trump’s talk about taking control of greenland a vast and mineralrich arctic island “have you ever looked at a map and thought ‘you know what denmark needs more sunshine palm trees and roller skates’” the petition asks “well we have a onceinalifetime opportunity to make that dream a reality “it is in the national interest to promote the extraordinary heritage of our nation so california will become new denmark los angeles more like løs ångeles” it says xavier dutoit the petition’s organizer got the idea last month while vacationing in the philippines he overheard an american tourist loudly discussing trump’s greenland pitch “that american didn’t seem to grasp how unhinged and absurd it was for any country’s president — especially in a stable democracy that the usa claims to be — to offer or threaten to take over another sovereign country’s territory” dutoit wrote in an email to the associated press while dutoit is not danish — he is swissfrench — he consulted a multinational group of friends who are helping him including kenneth haar who is danish and lives in copenhagen “the trumpgreenland issue is by far the biggest political issue in this country at the moment” haar told ap in a zoom interview “it is considered a very depressing and a very dangerous situation” while løs ångeles is a joke there is another city in southern california with a very real connection to the land of vikings lego and hans christian andersen known as “the danish capital of america” solvang was founded by three immigrants from denmark in 1911 the city is popular with tourists who come in droves for its aebleskiver pastries similar to fritters scandinavian windmills a main street called “ copenhagen drive ” and of course a hans christian andersen museum to honor the famous danish fairy tale author danish royals have visited several times over the decades in 2019 trump scrapped a trip to denmark blaming prime minister mette frederiksen for making a “nasty” statement when she rejected his firstterm idea of buying greenland as an absurdity greenland is a semiautonomous territory of denmark a us ally and fellow member of nato before taking office again last month trump said he would not rule out the use of military force to seize control of greenland calling it vital to us national security and last month his son visited the island múte b egede greenland’s prime minister shot back “greenland is for the greenlandic people we do not want to be danish we do not want to be american we want to be greenlandic” haar said california’s appeal to danes is obvious from its towering mountains to its sunny beaches “we have none of that here” he said “denmark is a pretty flat country with a pretty boring climate” the petition organizers even have their own plans for disneyland in southern california “we’ll rename it hans christian andersenland mickey mouse in a viking helmet yes please” the petition notes that trump isn’t a fan of the golden state last year he called it “paradise lost” and he regularly derides gov gavin newsom with the nickname “newscum” but of course every petition needs some fine print way down at the bottom “disclaimer this campaign is 100 real … in our dreams”",
    "summary": "A lighthearted petition to buy the state of California for Denmark prompted more than 200,000 signatures by Wednesday in response to President Donald Trump’s talk about taking control of Greenland, a vast and mineral-rich Arctic island.\n“It is in the national interest to promote the extraordinary heritage of our Nation, so California will become New Denmark.\nGreenland is a semi-autonomous territory of Denmark, a U.S. ally and fellow member of NATO.\n“Denmark is a pretty flat country with a pretty boring climate.”The petition organizers even have their own plans for Disneyland in Southern California: “We’ll rename it Hans Christian Andersenland.\nYes, please.”The petition notes that Trump isn’t a fan of the Golden State.",
    "keywords": [
      "seeks",
      "denmark",
      "greenland",
      "eyes",
      "danish",
      "joke",
      "hans",
      "month",
      "petition",
      "help",
      "buy",
      "trump",
      "dutoit",
      "christian",
      "california"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/bd1d94a/2147483647/strip/true/crop/3266x1837+0+211/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4a%2Ffa%2F7eea87598c8c84f8f75bc55877bb%2F9f3d5519817f43358f29341f35730e87",
    "t": 89
  },
  "https://apnews.com/article/scotland-cats-wildlife-186c3c2d2c586a57c831ec4061f246b3": {
    "source": "AP News",
    "url": "https://apnews.com/article/scotland-cats-wildlife-186c3c2d2c586a57c831ec4061f246b3",
    "date": "2025-02-04",
    "time": "15:15:25",
    "title": "Cats won’t be banned in Scotland, the government confirms",
    "body": "LONDON (AP) — The Scottish government wants everyone to know it does not plan to ban cats.\n\nFirst Minister John Swinney was forced to issue the statement after a report by independent experts branded felines a threat to Scotland’s wildlife and suggested “containment” measures be considered to reduce the damage.\n\nThe Scottish Animal Welfare Commission said cats kill at least 700 million birds and other animals each year in the U.K. It advised the government to consider a range of measures, including keeping domestic cats indoors or on leashes, to protect endangered species such as Scottish wildcats.\n\nThe report said “cat containment” measures could also include “restrictions on introducing cats to households in vulnerable areas” -– interpreted by some as effectively a ban.\n\nThe Scottish government said it would “fully consider” the recommendations.\n\nIn a nation of animal-lovers, the suggestions spawned alarming headlines. The Daily Mail reported: “Fury as households in Scotland could be banned from getting a pet cat.” The Scottish Daily Express branded the idea a “madcap scheme.”\n\nSwinney, who heads Scotland’s semi-autonomous Edinburgh-based government, spoke to journalists to defend the administration’s pro-feline credentials.\n\n“Let me just clear this up today,” he said Monday. “The government’s not going to be banning cats or restricting cats. We’ve no intention of doing so and we will not be doing it.”\n\nCats Protection, the U.K.’s biggest cat charity, gave the idea of draconian containment measures short shrift, saying “pragmatic solutions like keeping cats indoors at dawn and dusk can balance the needs of domestic cats and wild animals.”\n\n“Scotland is a nation of cat lovers,” said Alice Palombo, the charity’s advocacy and government relations officer for Scotland, with almost a quarter of households owning a feline pet.\n\n“Cats are great pets for all sorts of reasons, whether it’s providing companionship for elderly people or those living alone, comfort for people with health conditions or helping children learn important lessons in caring for others,” she said. “We believe everyone who is able to care for a cat should be able to enjoy these benefits.”",
    "clean_body": "london ap — the scottish government wants everyone to know it does not plan to ban cats first minister john swinney was forced to issue the statement after a report by independent experts branded felines a threat to scotland’s wildlife and suggested “containment” measures be considered to reduce the damage the scottish animal welfare commission said cats kill at least 700 million birds and other animals each year in the uk it advised the government to consider a range of measures including keeping domestic cats indoors or on leashes to protect endangered species such as scottish wildcats the report said “cat containment” measures could also include “restrictions on introducing cats to households in vulnerable areas” – interpreted by some as effectively a ban the scottish government said it would “fully consider” the recommendations in a nation of animallovers the suggestions spawned alarming headlines the daily mail reported “fury as households in scotland could be banned from getting a pet cat” the scottish daily express branded the idea a “madcap scheme” swinney who heads scotland’s semiautonomous edinburghbased government spoke to journalists to defend the administration’s profeline credentials “let me just clear this up today” he said monday “the government’s not going to be banning cats or restricting cats we’ve no intention of doing so and we will not be doing it” cats protection the uk’s biggest cat charity gave the idea of draconian containment measures short shrift saying “pragmatic solutions like keeping cats indoors at dawn and dusk can balance the needs of domestic cats and wild animals” “scotland is a nation of cat lovers” said alice palombo the charity’s advocacy and government relations officer for scotland with almost a quarter of households owning a feline pet “cats are great pets for all sorts of reasons whether it’s providing companionship for elderly people or those living alone comfort for people with health conditions or helping children learn important lessons in caring for others” she said “we believe everyone who is able to care for a cat should be able to enjoy these benefits”",
    "summary": "LONDON (AP) — The Scottish government wants everyone to know it does not plan to ban cats.\nThe Scottish Animal Welfare Commission said cats kill at least 700 million birds and other animals each year in the U.K.\nIt advised the government to consider a range of measures, including keeping domestic cats indoors or on leashes, to protect endangered species such as Scottish wildcats.\nThe report said “cat containment” measures could also include “restrictions on introducing cats to households in vulnerable areas” -– interpreted by some as effectively a ban.\n“The government’s not going to be banning cats or restricting cats.",
    "keywords": [
      "nation",
      "confirms",
      "banned",
      "cats",
      "scottish",
      "measures",
      "cat",
      "wont",
      "scotlands",
      "scotland",
      "containment",
      "households",
      "report"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/d38828f/2147483647/strip/true/crop/3867x2175+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2a%2Fd7%2Fd8fea83f211c8a6b23a3c28419e9%2F4d823d36bc7442bc9d8f6fe0b966e9eb",
    "t": 97
  },
  "https://apnews.com/article/pepsico-earnings-revenue-4483d93d6789c1ed70c57205be8a9d92": {
    "source": "AP News",
    "url": "https://apnews.com/article/pepsico-earnings-revenue-4483d93d6789c1ed70c57205be8a9d92",
    "date": "2025-02-04",
    "time": "11:29:23",
    "title": "Inflation and a pivot in US to healthier snacks weighs on PepsiCo in the fourth quarter",
    "body": "PepsiCo said Tuesday that high prices and changing consumer tastes have weakened U.S. demand for its snacks and drinks but it’s confident it can turn that around in the coming year.\n\nThe Purchase, New York-based company said its revenue fell slightly to $27.78 billion in the fourth quarter. That was short of Wall Street’s forecast of $27.89 billion, according to analysts polled by FactSet.\n\nU.S. demand flagged last year after two years of outsized, double-digit price increases. The average price of a 16-ounce bag of potato chips peaked at $6.68 in October 2023, according to government data.\n\nPepsiCo hit the brakes on prices, which rose 4% globally in 2024. The company focused on making its snacks more affordable, adding product promotions, more chips per bag and value packs. It also invested more heavily in its Chester’s and Santitas value brands, which saw strong revenue growth last year.\n\nIn a conference call Tuesday, CEO Ramon Laguarta said those efforts are paying off and consumers have begun buying salty snacks again. Still, North American sales volumes for both Frito-Lay snacks and beverages fell 3% in the October-December period.\n\nPepsiCo is also closely watching a longer-term trend toward healthier snacking, Laguarta said. The company isn’t seeing much impact from the growing use of GLP-1 weight loss drugs like Wegovy, he said. But people are looking for smaller, portion-controlled snacks, healthier ingredients like whole grains and lower sodium and fat.\n\n“There’s a higher level of awareness in general of American consumers toward health and wellness,” he said.\n\nPepsiCo is well-positioned to meet that need with products like Pepsi Zero Sugar, SunChips and its Simply line of chips, which have no artificial colors or flavors, Laguarta said. And more healthy, “permissible” snacks are coming, he said.\n\n“We’re very confident that our North American business will accelerate this year,” Laguarta said.\n\nPepsiCo is also trying to amp up its away-from-home offerings, like its Doritos Locos Tacos collaboration with Taco Bell and its Tostitos Cantina food trucks.\n\nPepsiCo’s snack food and beverage volumes both climbed 1% globally in the fourth quarter, with strong growth in Africa and Asia.\n\nNet income rose 17% to $1.5 billion. Adjusted for one-time items, PepsiCo earned $1.96, or two cents better than analysts had forecast.\n\nPepsiCo expects organic revenue growth in the low single digits in 2025. Organic revenue is adjusted for foreign currency exchanges and the impact of product acquisitions or divestments. The company reported organic revenue growth of 2% in 2024.\n\nThe company, which closed four U.S. bottling plants in October, also plans to continue a multi-year push to enhance productivity, including adding more automation in its plants and warehouses.\n\nPepsiCo shares fell 2% Tuesday.",
    "clean_body": "pepsico said tuesday that high prices and changing consumer tastes have weakened us demand for its snacks and drinks but it’s confident it can turn that around in the coming year the purchase new yorkbased company said its revenue fell slightly to 2778 billion in the fourth quarter that was short of wall street’s forecast of 2789 billion according to analysts polled by factset us demand flagged last year after two years of outsized doubledigit price increases the average price of a 16ounce bag of potato chips peaked at 668 in october 2023 according to government data pepsico hit the brakes on prices which rose 4 globally in 2024 the company focused on making its snacks more affordable adding product promotions more chips per bag and value packs it also invested more heavily in its chester’s and santitas value brands which saw strong revenue growth last year in a conference call tuesday ceo ramon laguarta said those efforts are paying off and consumers have begun buying salty snacks again still north american sales volumes for both fritolay snacks and beverages fell 3 in the octoberdecember period pepsico is also closely watching a longerterm trend toward healthier snacking laguarta said the company isn’t seeing much impact from the growing use of glp1 weight loss drugs like wegovy he said but people are looking for smaller portioncontrolled snacks healthier ingredients like whole grains and lower sodium and fat “there’s a higher level of awareness in general of american consumers toward health and wellness” he said pepsico is wellpositioned to meet that need with products like pepsi zero sugar sunchips and its simply line of chips which have no artificial colors or flavors laguarta said and more healthy “permissible” snacks are coming he said “we’re very confident that our north american business will accelerate this year” laguarta said pepsico is also trying to amp up its awayfromhome offerings like its doritos locos tacos collaboration with taco bell and its tostitos cantina food trucks pepsico’s snack food and beverage volumes both climbed 1 globally in the fourth quarter with strong growth in africa and asia net income rose 17 to 15 billion adjusted for onetime items pepsico earned 196 or two cents better than analysts had forecast pepsico expects organic revenue growth in the low single digits in 2025 organic revenue is adjusted for foreign currency exchanges and the impact of product acquisitions or divestments the company reported organic revenue growth of 2 in 2024 the company which closed four us bottling plants in october also plans to continue a multiyear push to enhance productivity including adding more automation in its plants and warehouses pepsico shares fell 2 tuesday",
    "summary": "The Purchase, New York-based company said its revenue fell slightly to $27.78 billion in the fourth quarter.\nIt also invested more heavily in its Chester’s and Santitas value brands, which saw strong revenue growth last year.\nPepsiCo expects organic revenue growth in the low single digits in 2025.\nOrganic revenue is adjusted for foreign currency exchanges and the impact of product acquisitions or divestments.\nThe company reported organic revenue growth of 2% in 2024.",
    "keywords": [
      "organic",
      "snacks",
      "laguarta",
      "fourth",
      "healthier",
      "company",
      "chips",
      "growth",
      "billion",
      "pepsico",
      "fell",
      "american",
      "inflation",
      "pivot",
      "weighs",
      "quarter",
      "revenue"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/550a9d1/2147483647/strip/true/crop/3000x1688+0+117/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd6%2Fe5%2F6f00ba6a6f9cd01458be6897430c%2F6716b918eb244dcfac5d7f243b6b7be6",
    "t": 97
  },
  "https://apnews.com/article/michelle-trachtenberg-dead-1789e0979c1548e4e56760badfad73ee": {
    "source": "AP News",
    "url": "https://apnews.com/article/michelle-trachtenberg-dead-1789e0979c1548e4e56760badfad73ee",
    "date": "2025-02-26",
    "time": "18:21:17",
    "title": "Michelle Trachtenberg, ‘Buffy the Vampire Slayer’ and ‘Harriet the Spy’ star, dies at 39",
    "body": "NEW YORK (AP) — Michelle Trachtenberg, a former child star who appeared in the 1996 “Harriet the Spy” hit movie and went on to co-star in two buzzy millennial-era TV shows — “Buffy the Vampire Slayer” and “Gossip Girl” — has died. She was 39.\n\nPolice responded to a 911 call shortly after 8 a.m. at a 51-story luxury apartment tower in Manhattan’s Hell’s Kitchen neighborhood where officers found Trachtenberg “unconscious and unresponsive,” according to an NYPD statement.\n\nParamedics pronounced her dead at the scene. No foul play was suspected.\n\nTrachtenberg’s family objected to an autopsy, the New York City’s Office of Chief Medical Examiner said Thursday. Because there was no evidence of criminality, the medical examiner’s office honored the objection, limiting its findings. Such objections are allowed by law. The cause and manner of her death are listed as undetermined.\n\n“The family requests privacy for their loss,” Trachtenberg’s representative, Gary Mantoosh, said in a statement Wednesday.\n\nTrachtenberg was 8 when she began playing Nona Mecklenberg on Nickelodeon’s “The Adventures of Pete & Pete” from 1994 to 1996 and then starred in the title role in the film adaptations of “Harriet the Spy” and “Inspector Gadget,” opposite Matthew Broderick.\n\n“Michelle comes off as genuine because she really is a genuine kid. Everyone can identify with her,” said Debby Beece, president of Nickelodeon Movies in 1996.\n\nIn 2000 Trachtenberg joined the cast of “Buffy,” playing Dawn Summers, the younger sister of the title character played by Sarah Michelle Gellar between 2000 and 2003.\n\nTrachtenberg thanked Gellar for speaking out against Joss Whedon in 2021, following abuse allegations made against the “Buffy” showrunner. “I am brave enough now as a 35-year-old woman to repost this,” she wrote on social media, and alluded to “his not appropriate behavior” she experienced as a teenage actor.\n\nIn 2001, she received a Daytime Emmy nomination for hosting Discovery’s “Truth or Scare.” Trachtenberg went on to recurring roles on “Six Feet Under,” “Weeds” and “Gossip Girl,” where she played the gang’s scheming nemesis, Georgina Sparks.\n\nFor her fan-favorite role, she was nominated as a TV villain at the Teen Choice Award in 2012. “It’s definitely a lot more fun than playing the good girl,” she told Seventeen in 2009. I love the reaction you get. I never understood why some actors don’t want to play villains or evil characters.”\n\nShe was one of the original series’ stars to return for a pair of guest appearances in the 2021 “Gossip Girl” revival.\n\nBlake Lively on Instagram on Tuesday honored her “Gossip Girl” co-star: “The world lost a deeply sensitive and good person in Michelle. May her work and her huge heart be remembered by those who were lucky enough to experience her fire.”\n\nAs if to cement herself in millennial culture, Trachtenberg made a cameo in Fall Out Boy’s music video for the “This Ain’t a Scene, It’s an Arms Race” alongside Seth Green.\n\nHollywood took to social media to mourn one of their own, one who had made the transition from kid star to teen queen to adult actor. “Buffy the Vampire Slayer” co-star David Boreanaz said on Instagram it was “so very sad.. horrible news.” Melissa Gilbert, who starred with Trachtenberg in the 1996 film “A Holiday for Love,” wrote on Instagram: “My heart aches for your family and all those who loved you so.”\n\nRosie O’Donnell, who starred alongside Trachtenberg in her “Harriet the Spy” debut, said her death was “heartbreaking:” “I loved her very much. She struggled the last few years. I wish I could have helped.” Glee star Chris Colfer remembered her this way: “Michelle was the absolute sweetest and one of the most supportive people I knew,” he wrote.\n\nTrachtenberg’s later credits included “Ice Princess” in 2005, playing a math prodigy and aspiring figure skater. The AP said it had “a good, though feeble, heart and the best of intentions” and said Trachtenberg was “mining the same nervous twitter from her kid-sister days on ‘Buffy the Vampire Slayer.’”\n\nThe New York City-born Trachtenberg also appeared in the 2004 teen sex comedy “EuroTrip,” she co-starred with Zac Efron and Leslie Mann in 2009’s “17 Again” and played a murderous stalker and abductor on an episode of “Criminal Minds.”\n\nFor “Killing Kennedy,” the 2013 film in which she played the wife of Lee Harvey Oswald, around 80% of Trachtenberg’s dialogue was in Russian. She had learned the language from her mother growing up.\n\nOther credits included supporting roles in the films “Mysterious Skin” in 2004 and “Black Christmas” in 2006. She also starred on the NBC medical series “Mercy” (2009–2010) opposite Taylor Schilling. More recently, she hosted the true-crime docuseries “Meet, Marry, Murder” on Tubi.\n\n___\n\nAssociated Press Writer Michael R. Sisak contributed to this report.\n\n___\n\nThis story first moved Feb. 26, 2025, and was updated on Feb. 27, 2025, to reflect that Trachtenberg’s cause of death was being listed as undetermined.",
    "clean_body": "new york ap — michelle trachtenberg a former child star who appeared in the 1996 “harriet the spy” hit movie and went on to costar in two buzzy millennialera tv shows — “buffy the vampire slayer” and “gossip girl” — has died she was 39 police responded to a 911 call shortly after 8 am at a 51story luxury apartment tower in manhattan’s hell’s kitchen neighborhood where officers found trachtenberg “unconscious and unresponsive” according to an nypd statement paramedics pronounced her dead at the scene no foul play was suspected trachtenberg’s family objected to an autopsy the new york city’s office of chief medical examiner said thursday because there was no evidence of criminality the medical examiner’s office honored the objection limiting its findings such objections are allowed by law the cause and manner of her death are listed as undetermined “the family requests privacy for their loss” trachtenberg’s representative gary mantoosh said in a statement wednesday trachtenberg was 8 when she began playing nona mecklenberg on nickelodeon’s “the adventures of pete pete” from 1994 to 1996 and then starred in the title role in the film adaptations of “harriet the spy” and “inspector gadget” opposite matthew broderick “michelle comes off as genuine because she really is a genuine kid everyone can identify with her” said debby beece president of nickelodeon movies in 1996 in 2000 trachtenberg joined the cast of “buffy” playing dawn summers the younger sister of the title character played by sarah michelle gellar between 2000 and 2003 trachtenberg thanked gellar for speaking out against joss whedon in 2021 following abuse allegations made against the “buffy” showrunner “i am brave enough now as a 35yearold woman to repost this” she wrote on social media and alluded to “his not appropriate behavior” she experienced as a teenage actor in 2001 she received a daytime emmy nomination for hosting discovery’s “truth or scare” trachtenberg went on to recurring roles on “six feet under” “weeds” and “gossip girl” where she played the gang’s scheming nemesis georgina sparks for her fanfavorite role she was nominated as a tv villain at the teen choice award in 2012 “it’s definitely a lot more fun than playing the good girl” she told seventeen in 2009 i love the reaction you get i never understood why some actors don’t want to play villains or evil characters” she was one of the original series’ stars to return for a pair of guest appearances in the 2021 “gossip girl” revival blake lively on instagram on tuesday honored her “gossip girl” costar “the world lost a deeply sensitive and good person in michelle may her work and her huge heart be remembered by those who were lucky enough to experience her fire” as if to cement herself in millennial culture trachtenberg made a cameo in fall out boy’s music video for the “this ain’t a scene it’s an arms race” alongside seth green hollywood took to social media to mourn one of their own one who had made the transition from kid star to teen queen to adult actor “buffy the vampire slayer” costar david boreanaz said on instagram it was “so very sad horrible news” melissa gilbert who starred with trachtenberg in the 1996 film “a holiday for love” wrote on instagram “my heart aches for your family and all those who loved you so” rosie o’donnell who starred alongside trachtenberg in her “harriet the spy” debut said her death was “heartbreaking” “i loved her very much she struggled the last few years i wish i could have helped” glee star chris colfer remembered her this way “michelle was the absolute sweetest and one of the most supportive people i knew” he wrote trachtenberg’s later credits included “ice princess” in 2005 playing a math prodigy and aspiring figure skater the ap said it had “a good though feeble heart and the best of intentions” and said trachtenberg was “mining the same nervous twitter from her kidsister days on ‘buffy the vampire slayer’” the new york cityborn trachtenberg also appeared in the 2004 teen sex comedy “eurotrip” she costarred with zac efron and leslie mann in 2009’s “17 again” and played a murderous stalker and abductor on an episode of “criminal minds” for “killing kennedy” the 2013 film in which she played the wife of lee harvey oswald around 80 of trachtenberg’s dialogue was in russian she had learned the language from her mother growing up other credits included supporting roles in the films “mysterious skin” in 2004 and “black christmas” in 2006 she also starred on the nbc medical series “mercy” 2009–2010 opposite taylor schilling more recently she hosted the truecrime docuseries “meet marry murder” on tubi associated press writer michael r sisak contributed to this report this story first moved feb 26 2025 and was updated on feb 27 2025 to reflect that trachtenberg’s cause of death was being listed as undetermined",
    "summary": "NEW YORK (AP) — Michelle Trachtenberg, a former child star who appeared in the 1996 “Harriet the Spy” hit movie and went on to co-star in two buzzy millennial-era TV shows — “Buffy the Vampire Slayer” and “Gossip Girl” — has died.\nIn 2000 Trachtenberg joined the cast of “Buffy,” playing Dawn Summers, the younger sister of the title character played by Sarah Michelle Gellar between 2000 and 2003.\nTrachtenberg thanked Gellar for speaking out against Joss Whedon in 2021, following abuse allegations made against the “Buffy” showrunner.\nI never understood why some actors don’t want to play villains or evil characters.”She was one of the original series’ stars to return for a pair of guest appearances in the 2021 “Gossip Girl” revival.\nBlake Lively on Instagram on Tuesday honored her “Gossip Girl” co-star: “The world lost a deeply sensitive and good person in Michelle.",
    "keywords": [
      "girl",
      "spy",
      "39",
      "york",
      "slayer",
      "michelle",
      "dies",
      "trachtenberg",
      "gossip",
      "harriet",
      "vampire",
      "buffy",
      "starred",
      "playing",
      "played",
      "star"
    ],
    "image_url": "https://dims.apnews.com/dims4/default/ee85ae2/2147483647/strip/true/crop/3000x1688+0+164/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F3c%2F79%2F93ff12f9bec736b692aa39e881be%2F9681b7feb5dd4ab2ae0879931b5966a5",
    "t": 75
  }
}