{
  "https://www.theguardian.com/p/x264zt": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x264zt",
    "date": "2025-04-30",
    "time": "21:40:06",
    "title": "Barcelona 3-3 Inter: Champions League semi-final, first leg – as it happened",
    "body": "30 Apr 2025 23.39 CEST Frenkie de Jong gives the Barca view to TNT. “It was a nice game to play … both teams really want to go to the final … both teams played their heart out … it’s half time, it’s still a draw, so let’s see next week … we knew it was going to be hard and difficult … it was a bad start from us … we knew we could make the comeback … we like to play attacking football, to dominate the game, score goals … of course we take some risks but we also get a lot of reward from it so I think we will keep playing like this … hopefully it will get us to the final … we feel we have the team that can do something special … we will go for it!” Share\n\n30 Apr 2025 23.26 CEST Inter’s Denzel Dumfries, who has been named man of the match by Uefa, talks to TNT. “Crazy game in the end … both teams fought for the win … 3-3 is a deserved result … we are now looking forward to the next match … they are a very good team but we also have a lot of quality.” He’s also told that he’s the first Dutch player to score and assist in a Champions League semi-final since Wesley Sneijder for eventual champions Inter in 2010. “That is a nice statistic … I’m very proud of the performance.” View image in fullscreen Denzel Dumfries of Inter takes a selfie with the Player Of The Match award. Photograph: Álex Caparrós/Uefa/Getty Images Share Updated at 23.30 CEST\n\n30 Apr 2025 23.15 CEST Inter midfielder Henrikh Mkhitaryan talks to TNT Sports. “It was a crazy game … a great game to watch but not to play … it was very hard … we did our best … we could have done even better … we were leading 2-0 with 20 minutes gone, but it was not that we thought we’d won the game already … Barca put loads of pressure on us … unfortunately we couldn’t keep the 3-2 … but this is football … I feel very gutted [that his second-half goal was disallowed] … maybe it was two or three centimetres … but this is football … my will was too much that I wanted to score … maybe I rushed … maybe I have to score in the second leg, let’s see! … Barcelona are very young and talented … we are going to do our best … it is not going to be easy because we have lost our captain and leader Lautaro Martínez … we will do our best to replace him and play without him.” Share\n\n30 Apr 2025 23.03 CEST At the end of a game that’s put the 2010 semi-final meeting between these clubs into perspective, Lamine Yamal is awarded a shirt with the number 100 on it. He may only be 17 years old, but that’s already his century of appearances for Barcelona! And how he marked the occasion, twisting in from the right to score a solo stunner in the style of Archie Gemmill in power-up mode. That changed the momentum of a match which saw Inter fly out of the blocks, Marcus Thuram scoring the fastest semi-final goal in Champions League history, and Denzil Dumfries making it 0-2 with an overhead kick. After Yamal’s art piece, Ferran Torres and Dumfries went on to trade further goals, before Raphinha made it 3-3 with a lashing drive off both crossbar and the back of the unfortunate Yann Sommer. It could have finished 7-3, 3-7 or anything in between, and it’s all got to happen again in Milan in six days time. Can’t wait. View image in fullscreen Wonder how many more of those shirts that Lamine Yamal get over his career. Photograph: Michael Regan/Uefa/Getty Images Share Updated at 23.09 CEST\n\n30 Apr 2025 22.52 CEST FULL TIME: Barcelona 3-3 Inter Counting down the days until San Siro next Tuesday already. Share\n\n30 Apr 2025 22.52 CEST 90 min +2: … a brief game of Head Tennis breaks out, but Inter are never in danger. Lopez eventually hoicks a poor cross from the left out for a goal kick. Share\n\n30 Apr 2025 22.51 CEST 90 min +1: Raphinha advances down the inside left and sends a speculative riser towards the top right. Sommer tips over spectacularly. No unlucky rebound off the bar and his back this time. But here comes a corner, from which … Share\n\n30 Apr 2025 22.50 CEST 90 min: There will be three additional minutes. Can’t we have 33? A third half? Share\n\n30 Apr 2025 22.49 CEST 89 min: It’s attack versus defence again. Yamal nearly finds Lopez with a clever chip down the middle, but Darmian’s telescopic leg hooks clear. Share\n\n30 Apr 2025 22.47 CEST 87 min: Torres advances on the Inter box and feeds Yamal to his right. The pass isn’t the best, and gets between Yamal’s feet, but the young genius somehow manages to dig it out and wedges an effort over Sommer and off the crossbar! He’d been quiet for a while. Too quiet. Share\n\n30 Apr 2025 22.45 CEST 85 min: Barca probe. Inter sit tight. Raphinha curls in from the left, hoping to find the head of Garcia. But Garcia clanks into Augusto, who goes down and wins a free kick. He doesn’t rush to get back up. Eventually he does. Share\n\n30 Apr 2025 22.42 CEST 83 min: Barcelona respond with a double swap of their own. Gavi and Christensen come on for Cubarsí and Pedri. Share\n\n30 Apr 2025 22.42 CEST 81 min: Inter make a double change with a view to taking the heat out of this wonderfully preposterous match. Thuram and the magnificent Dumfries make way for Zieliński and Darmian. Share\n\n30 Apr 2025 22.40 CEST 79 min: Yamal stands on the ball and spins away from Thuram with absurd ease. He nearly manages to release Raphinha down the left with an outside-of-boot diagonal pass, but it’s intercepted. Then Inter try to send Dumfries clear down the right, but Szczęsny races out of his box to blooter clear. Share\n\n30 Apr 2025 22.38 CEST 78 min: Yamal jigs in from the right and draws a foul from Mkhitaryan (who was only offside back there by the length of an uncut toenail). From the resulting free kick, Raphinha whistles a low curler towards the bottom left, but Sommer is behind it all the way. This game is gloriously nuts. Share\n\n30 Apr 2025 22.37 CEST 76 min: … and now Dumfries one-twos with Frattesi down the right and into the Barca box. He has the opportunity to shoot from ten yards but opts for the cutback. Wrong choice. Share\n\n30 Apr 2025 22.36 CEST 75 min: Inter have the ball in the net again! Dumfries is sent bombing down the right by Bisseck. He crosses low and long for Mkhitaryan, who races in from the left and slams home with his first touch! But he’s an inch offside. View image in fullscreen Inter's Henrikh Mkhitaryan thwacks the ball past Barcelona's keeper Wojciech Szczesny and in to the net but he’s thwarted by the offside flag. Photograph: Albert Gea/Reuters Share Updated at 22.47 CEST\n\n30 Apr 2025 22.34 CEST 74 min: Until Inter scored their third, this match was attack versus defence. Now it’s an end-to-end basketball-infused affair. Now it’s Barca’s turn to attack, Lopez with the chance of releasing Raphinha into the box down the left, only to overcook the pass. Both teams fancy this. Share\n\n30 Apr 2025 22.32 CEST 72 min: Anything could happen here. Thuram blazes down the middle and for a second looks to have burst clear of Cubarsi, but the Barca defender does well to make up some ground and block the eventual shot with an extended leg. Share\n\n30 Apr 2025 22.31 CEST 71 min: Sixty seconds of hot administrative action, as Cubarsi is booked for a tug on Taremi, then Çalhanoğlu makes way for Frattesi. Share\n\n30 Apr 2025 22.30 CEST 70 min: Thuram carelessly gifts the ball to Lopez on the edge of the Inter box. Lopez dribbles a shot straight at Sommer, and Thuram breathes again. That was a decent chance. Share\n\n30 Apr 2025 22.28 CEST 68 min: Olmo is replaced by Fermín López. Share\n\n30 Apr 2025 22.27 CEST 67 min: One minute and 53 seconds passed between those two goals. This is one of the great semis. And there’s still a quarter of it left! Share\n\n30 Apr 2025 22.26 CEST GOAL! Barcelona 3-3 Inter (Sommer og 65) The corner’s pulled back. Yamal leaves it for Raphinha, who creams a first-time riser towards the top right. The ball caroms off the underside of the bar, then off the back of the keeper and in. What terrible luck for the keeper, who touched that onto the bar, but that was all Raphinha’s work. What a strike! View image in fullscreen Barcelona’s Raphinha lets fly from distance. Photograph: Joan Monfort/AP View image in fullscreen The ball comes back off the woodwork and hits Inter’s keeper Yann Sommer on the bonce and goes into the net for Barcelona’s equaliser. Photograph: Lluís Gené/AFP/Getty Images View image in fullscreen Inter’s Francesco Acerbi looks dejected. Photograph: Albert Gea/Reuters View image in fullscreen Whilst Raphinha and his Barca teammates celebrate. Photograph: Nacho Doce/Reuters Share Updated at 23.29 CEST\n\n30 Apr 2025 22.25 CEST 64 min: Can Barca respond again? Well, Raphinha wins a corner down the left, and from that … Share\n\n30 Apr 2025 22.24 CEST GOAL! Barcelona 2-3 Inter (Dumfries 63) The corner’s hit long from the right. Dumfries rises above Olmo at the far stick and plants a header into the top left. Easy as that! View image in fullscreen Denzel Dumfries (centre) scores his second, and Inter’s third. Photograph: Carl Recine/Getty Images Share Updated at 22.31 CEST\n\n30 Apr 2025 22.23 CEST 62 min: This is better from Inter, as Thuram sends Dumfries into space down the right. Dumfries looks to hook into the middle, but his low cross is deflected out by Araújo. Inter claim a penalty, preposterously, as it hit the defender’s leg. But it doesn’t matter, because … Share\n\n30 Apr 2025 22.22 CEST 61 min: Inter are reduced to repeatedly hacking the ball upfield to nobody in particular. Cubarsi stupidly gives them an out by jumping all over the back of Thuram. From the resulting free kick, a long pass down the middle appears to be handled by Martínez. Barella claims a free kick but there’s nothing doing. Share\n\n30 Apr 2025 22.19 CEST 59 min: Çalhanoğlu receives the first caution of the evening, clattering through the back of Pedri, who had diddled him with a drop of the shoulder and was off into space. Share\n\n30 Apr 2025 22.17 CEST 58 min: Yamal exchanges cute passes with Olmo down the inside-right channel, then attempts to surprise Sommer with a cheeky toe-poke towards the bottom right from distance. Sommer reads his opponent well, and gathers. Share\n\n30 Apr 2025 22.15 CEST 56 min: … so Inter make a change, swapping Dimarco for Augusto, who now has the responsibility of keeping Yamal quiet. Good luck and godspeed, sir. Share\n\n30 Apr 2025 22.14 CEST 55 min: Yamal dribbles down the right. His cross is half cleared. Pedri sends a low pearler wide right. It’s all Barca. Share\n\n30 Apr 2025 22.14 CEST 54 min: Barca stay patient. Inter aren’t seeing much of the ball and they can’t get out of their final third. View image in fullscreen Inter coach Simone Inzaghi (right) urges on his team. Photograph: Nacho Doce/Reuters Share Updated at 22.20 CEST\n\n30 Apr 2025 22.12 CEST 52 min: Barca pin Inter back. Yamal probes down the right. Martinez crosses low from the left. The visitors hack clear. Barca start again. This could be the pattern of the second half, right here. Share\n\n30 Apr 2025 22.11 CEST 50 min: Bisseck pulls a low cross back from the right. Dimarco, romping in from the left, sends a rising shot over the bar. It might have grazed the top of the frame, but the ball was going so fast, it’s hard to say for sure. View image in fullscreen Inter's Federico Dimarco fires off a shot before Barcelona's Eric Garcia can block. Photograph: Albert Gea/Reuters Share Updated at 22.18 CEST\n\n30 Apr 2025 22.09 CEST 49 min: Yamal has the opportunity to release Raphinha down the left, but overcooks the pass. Nobody’s perfect. Meanwhile Scott Blair writes: “I make no claim to be a well-informed observer of the fitba’ but I’m 61 and largely enjoy it as an entertaining diversion rather than following a particular team. (I like to see Scotland do well, if that provides perspective.) Accordingly I’ve seen a lot of goals over the years. I genuinely don’t think I’ve seen anyone do that before.” Scott’s teasing us about Archie Gemmill, isn’t he, readers. Share\n\n30 Apr 2025 22.06 CEST 47 min: A free kick for Inter, just left of centre, 40 yards out. Barella scoops a diagonal ball towards Thuram, who is easily beaten to it by Szczęsny on the right-hand edge of the six-yard box. No super-fast start to the half for Inter this time. Share\n\n30 Apr 2025 22.04 CEST Barcelona get the second half started. As expected, Inter have been forced into a change, their injured captain Lautaro Martínez making way for Mehdi Taremi. Barca meanwhile have swapped out Gerard Martín for Ronald Araújo. Share\n\n30 Apr 2025 21.50 CEST HALF TIME: Barcelona 2-2 Inter The fastest-ever goal in a Champions League semi. A spectacular overhead kick. An exquisitely cushioned assist. Lamine Yamal. Lamine Yamal. Lamine Yamal. That … that was football. Share Updated at 21.56 CEST\n\n30 Apr 2025 21.47 CEST 45 min: There will be two additional first-half minutes. Can we not have 22, please? Share\n\n30 Apr 2025 21.47 CEST 44 min: Martínez suddenly pulls up. He wants to come off, but Simone Inzaghi screams at his captain to continue. Martinez hobbles around, but stays on for now. Share\n\n30 Apr 2025 21.45 CEST 43 min: Raphinha tries to score with a sidefoot into the bottom left from 25 yards. It’s blocked out for a corner, and from the set piece, Lamal nearly successfully one-twos his way down the right channel and into a shooting position. He’s crowded out just in time. Share\n\n30 Apr 2025 21.43 CEST 42 min: Kounde can’t continue, and Eric García comes on in his stead. Share\n\n30 Apr 2025 21.42 CEST 40 min: Kounde goes down holding his left leg. On comes the trainer. The only way the ferocious pace of this game could be halted. Share\n\n30 Apr 2025 21.40 CEST GOAL! Barcelona 2-2 Inter (Torres 38) Yeah, they’ve responded well all right. Pedri, in space down the inside-right channel, crosses long towards Raphinha, who cushions a header back across goal and into the path of Torres, who gets in ahead of Acerbi and can’t miss from six yards. Barca are level! That was so simple yet so perfectly executed. Inter ripped apart with ease. View image in fullscreen A leaping Ferran Torres shoots … Photograph: Emilio Morenatti/AP View image in fullscreen And puts the home side back on level terms. Photograph: Joan Monfort/AP View image in fullscreen Then celebrates. Photograph: Carl Recine/Getty Images Share Updated at 21.56 CEST\n\n30 Apr 2025 21.39 CEST 37 min: … from which nothing comes. But this is gloriously relentless. Barca have responded so well to the toxic shock of going two goals down at home, in short order, in a European semi-final. Against an Italian team. Share\n\n30 Apr 2025 21.38 CEST 36 min: Yamal wins the ball in the middle of the park with a crunching tackle on Bastoni. This lad can do it all. Barca break and Olmo aims for the bottom right. Sonner turns around the post for a corner … Share\n\n30 Apr 2025 21.37 CEST 34 min: Yamal again down the right. Another cross. Dimarco sent to the shops for the Mundo Deportivo this time. Sonner slaps away, just in time, with Raphinha lurking. This is getting old. Share",
    "clean_body": "30 apr 2025 2339 cest frenkie de jong gives the barca view to tnt “it was a nice game to play … both teams really want to go to the final … both teams played their heart out … it’s half time it’s still a draw so let’s see next week … we knew it was going to be hard and difficult … it was a bad start from us … we knew we could make the comeback … we like to play attacking football to dominate the game score goals … of course we take some risks but we also get a lot of reward from it so i think we will keep playing like this … hopefully it will get us to the final … we feel we have the team that can do something special … we will go for it” share 30 apr 2025 2326 cest inter’s denzel dumfries who has been named man of the match by uefa talks to tnt “crazy game in the end … both teams fought for the win … 33 is a deserved result … we are now looking forward to the next match … they are a very good team but we also have a lot of quality” he’s also told that he’s the first dutch player to score and assist in a champions league semifinal since wesley sneijder for eventual champions inter in 2010 “that is a nice statistic … i’m very proud of the performance” view image in fullscreen denzel dumfries of inter takes a selfie with the player of the match award photograph álex caparrósuefagetty images share updated at 2330 cest 30 apr 2025 2315 cest inter midfielder henrikh mkhitaryan talks to tnt sports “it was a crazy game … a great game to watch but not to play … it was very hard … we did our best … we could have done even better … we were leading 20 with 20 minutes gone but it was not that we thought we’d won the game already … barca put loads of pressure on us … unfortunately we couldn’t keep the 32 … but this is football … i feel very gutted that his secondhalf goal was disallowed … maybe it was two or three centimetres … but this is football … my will was too much that i wanted to score … maybe i rushed … maybe i have to score in the second leg let’s see … barcelona are very young and talented … we are going to do our best … it is not going to be easy because we have lost our captain and leader lautaro martínez … we will do our best to replace him and play without him” share 30 apr 2025 2303 cest at the end of a game that’s put the 2010 semifinal meeting between these clubs into perspective lamine yamal is awarded a shirt with the number 100 on it he may only be 17 years old but that’s already his century of appearances for barcelona and how he marked the occasion twisting in from the right to score a solo stunner in the style of archie gemmill in powerup mode that changed the momentum of a match which saw inter fly out of the blocks marcus thuram scoring the fastest semifinal goal in champions league history and denzil dumfries making it 02 with an overhead kick after yamal’s art piece ferran torres and dumfries went on to trade further goals before raphinha made it 33 with a lashing drive off both crossbar and the back of the unfortunate yann sommer it could have finished 73 37 or anything in between and it’s all got to happen again in milan in six days time can’t wait view image in fullscreen wonder how many more of those shirts that lamine yamal get over his career photograph michael reganuefagetty images share updated at 2309 cest 30 apr 2025 2252 cest full time barcelona 33 inter counting down the days until san siro next tuesday already share 30 apr 2025 2252 cest 90 min 2 … a brief game of head tennis breaks out but inter are never in danger lopez eventually hoicks a poor cross from the left out for a goal kick share 30 apr 2025 2251 cest 90 min 1 raphinha advances down the inside left and sends a speculative riser towards the top right sommer tips over spectacularly no unlucky rebound off the bar and his back this time but here comes a corner from which … share 30 apr 2025 2250 cest 90 min there will be three additional minutes can’t we have 33 a third half share 30 apr 2025 2249 cest 89 min it’s attack versus defence again yamal nearly finds lopez with a clever chip down the middle but darmian’s telescopic leg hooks clear share 30 apr 2025 2247 cest 87 min torres advances on the inter box and feeds yamal to his right the pass isn’t the best and gets between yamal’s feet but the young genius somehow manages to dig it out and wedges an effort over sommer and off the crossbar he’d been quiet for a while too quiet share 30 apr 2025 2245 cest 85 min barca probe inter sit tight raphinha curls in from the left hoping to find the head of garcia but garcia clanks into augusto who goes down and wins a free kick he doesn’t rush to get back up eventually he does share 30 apr 2025 2242 cest 83 min barcelona respond with a double swap of their own gavi and christensen come on for cubarsí and pedri share 30 apr 2025 2242 cest 81 min inter make a double change with a view to taking the heat out of this wonderfully preposterous match thuram and the magnificent dumfries make way for zieliński and darmian share 30 apr 2025 2240 cest 79 min yamal stands on the ball and spins away from thuram with absurd ease he nearly manages to release raphinha down the left with an outsideofboot diagonal pass but it’s intercepted then inter try to send dumfries clear down the right but szczęsny races out of his box to blooter clear share 30 apr 2025 2238 cest 78 min yamal jigs in from the right and draws a foul from mkhitaryan who was only offside back there by the length of an uncut toenail from the resulting free kick raphinha whistles a low curler towards the bottom left but sommer is behind it all the way this game is gloriously nuts share 30 apr 2025 2237 cest 76 min … and now dumfries onetwos with frattesi down the right and into the barca box he has the opportunity to shoot from ten yards but opts for the cutback wrong choice share 30 apr 2025 2236 cest 75 min inter have the ball in the net again dumfries is sent bombing down the right by bisseck he crosses low and long for mkhitaryan who races in from the left and slams home with his first touch but he’s an inch offside view image in fullscreen inters henrikh mkhitaryan thwacks the ball past barcelonas keeper wojciech szczesny and in to the net but he’s thwarted by the offside flag photograph albert geareuters share updated at 2247 cest 30 apr 2025 2234 cest 74 min until inter scored their third this match was attack versus defence now it’s an endtoend basketballinfused affair now it’s barca’s turn to attack lopez with the chance of releasing raphinha into the box down the left only to overcook the pass both teams fancy this share 30 apr 2025 2232 cest 72 min anything could happen here thuram blazes down the middle and for a second looks to have burst clear of cubarsi but the barca defender does well to make up some ground and block the eventual shot with an extended leg share 30 apr 2025 2231 cest 71 min sixty seconds of hot administrative action as cubarsi is booked for a tug on taremi then çalhanoğlu makes way for frattesi share 30 apr 2025 2230 cest 70 min thuram carelessly gifts the ball to lopez on the edge of the inter box lopez dribbles a shot straight at sommer and thuram breathes again that was a decent chance share 30 apr 2025 2228 cest 68 min olmo is replaced by fermín lópez share 30 apr 2025 2227 cest 67 min one minute and 53 seconds passed between those two goals this is one of the great semis and there’s still a quarter of it left share 30 apr 2025 2226 cest goal barcelona 33 inter sommer og 65 the corner’s pulled back yamal leaves it for raphinha who creams a firsttime riser towards the top right the ball caroms off the underside of the bar then off the back of the keeper and in what terrible luck for the keeper who touched that onto the bar but that was all raphinha’s work what a strike view image in fullscreen barcelona’s raphinha lets fly from distance photograph joan monfortap view image in fullscreen the ball comes back off the woodwork and hits inter’s keeper yann sommer on the bonce and goes into the net for barcelona’s equaliser photograph lluís genéafpgetty images view image in fullscreen inter’s francesco acerbi looks dejected photograph albert geareuters view image in fullscreen whilst raphinha and his barca teammates celebrate photograph nacho docereuters share updated at 2329 cest 30 apr 2025 2225 cest 64 min can barca respond again well raphinha wins a corner down the left and from that … share 30 apr 2025 2224 cest goal barcelona 23 inter dumfries 63 the corner’s hit long from the right dumfries rises above olmo at the far stick and plants a header into the top left easy as that view image in fullscreen denzel dumfries centre scores his second and inter’s third photograph carl recinegetty images share updated at 2231 cest 30 apr 2025 2223 cest 62 min this is better from inter as thuram sends dumfries into space down the right dumfries looks to hook into the middle but his low cross is deflected out by araújo inter claim a penalty preposterously as it hit the defender’s leg but it doesn’t matter because … share 30 apr 2025 2222 cest 61 min inter are reduced to repeatedly hacking the ball upfield to nobody in particular cubarsi stupidly gives them an out by jumping all over the back of thuram from the resulting free kick a long pass down the middle appears to be handled by martínez barella claims a free kick but there’s nothing doing share 30 apr 2025 2219 cest 59 min çalhanoğlu receives the first caution of the evening clattering through the back of pedri who had diddled him with a drop of the shoulder and was off into space share 30 apr 2025 2217 cest 58 min yamal exchanges cute passes with olmo down the insideright channel then attempts to surprise sommer with a cheeky toepoke towards the bottom right from distance sommer reads his opponent well and gathers share 30 apr 2025 2215 cest 56 min … so inter make a change swapping dimarco for augusto who now has the responsibility of keeping yamal quiet good luck and godspeed sir share 30 apr 2025 2214 cest 55 min yamal dribbles down the right his cross is half cleared pedri sends a low pearler wide right it’s all barca share 30 apr 2025 2214 cest 54 min barca stay patient inter aren’t seeing much of the ball and they can’t get out of their final third view image in fullscreen inter coach simone inzaghi right urges on his team photograph nacho docereuters share updated at 2220 cest 30 apr 2025 2212 cest 52 min barca pin inter back yamal probes down the right martinez crosses low from the left the visitors hack clear barca start again this could be the pattern of the second half right here share 30 apr 2025 2211 cest 50 min bisseck pulls a low cross back from the right dimarco romping in from the left sends a rising shot over the bar it might have grazed the top of the frame but the ball was going so fast it’s hard to say for sure view image in fullscreen inters federico dimarco fires off a shot before barcelonas eric garcia can block photograph albert geareuters share updated at 2218 cest 30 apr 2025 2209 cest 49 min yamal has the opportunity to release raphinha down the left but overcooks the pass nobody’s perfect meanwhile scott blair writes “i make no claim to be a wellinformed observer of the fitba’ but i’m 61 and largely enjoy it as an entertaining diversion rather than following a particular team i like to see scotland do well if that provides perspective accordingly i’ve seen a lot of goals over the years i genuinely don’t think i’ve seen anyone do that before” scott’s teasing us about archie gemmill isn’t he readers share 30 apr 2025 2206 cest 47 min a free kick for inter just left of centre 40 yards out barella scoops a diagonal ball towards thuram who is easily beaten to it by szczęsny on the righthand edge of the sixyard box no superfast start to the half for inter this time share 30 apr 2025 2204 cest barcelona get the second half started as expected inter have been forced into a change their injured captain lautaro martínez making way for mehdi taremi barca meanwhile have swapped out gerard martín for ronald araújo share 30 apr 2025 2150 cest half time barcelona 22 inter the fastestever goal in a champions league semi a spectacular overhead kick an exquisitely cushioned assist lamine yamal lamine yamal lamine yamal that … that was football share updated at 2156 cest 30 apr 2025 2147 cest 45 min there will be two additional firsthalf minutes can we not have 22 please share 30 apr 2025 2147 cest 44 min martínez suddenly pulls up he wants to come off but simone inzaghi screams at his captain to continue martinez hobbles around but stays on for now share 30 apr 2025 2145 cest 43 min raphinha tries to score with a sidefoot into the bottom left from 25 yards it’s blocked out for a corner and from the set piece lamal nearly successfully onetwos his way down the right channel and into a shooting position he’s crowded out just in time share 30 apr 2025 2143 cest 42 min kounde can’t continue and eric garcía comes on in his stead share 30 apr 2025 2142 cest 40 min kounde goes down holding his left leg on comes the trainer the only way the ferocious pace of this game could be halted share 30 apr 2025 2140 cest goal barcelona 22 inter torres 38 yeah they’ve responded well all right pedri in space down the insideright channel crosses long towards raphinha who cushions a header back across goal and into the path of torres who gets in ahead of acerbi and can’t miss from six yards barca are level that was so simple yet so perfectly executed inter ripped apart with ease view image in fullscreen a leaping ferran torres shoots … photograph emilio morenattiap view image in fullscreen and puts the home side back on level terms photograph joan monfortap view image in fullscreen then celebrates photograph carl recinegetty images share updated at 2156 cest 30 apr 2025 2139 cest 37 min … from which nothing comes but this is gloriously relentless barca have responded so well to the toxic shock of going two goals down at home in short order in a european semifinal against an italian team share 30 apr 2025 2138 cest 36 min yamal wins the ball in the middle of the park with a crunching tackle on bastoni this lad can do it all barca break and olmo aims for the bottom right sonner turns around the post for a corner … share 30 apr 2025 2137 cest 34 min yamal again down the right another cross dimarco sent to the shops for the mundo deportivo this time sonner slaps away just in time with raphinha lurking this is getting old share",
    "summary": "Photograph: Álex Caparrós/Uefa/Getty Images Share Updated at 23.30 CEST30 Apr 2025 23.15 CEST Inter midfielder Henrikh Mkhitaryan talks to TNT Sports.\nBut here comes a corner, from which … Share30 Apr 2025 22.50 CEST 90 min: There will be three additional minutes.\nShare30 Apr 2025 22.47 CEST 87 min: Torres advances on the Inter box and feeds Yamal to his right.\nShare30 Apr 2025 22.36 CEST 75 min: Inter have the ball in the net again!\nShare30 Apr 2025 21.50 CEST HALF TIME: Barcelona 2-2 Inter The fastest-ever goal in a Champions League semi.",
    "keywords": [
      "min",
      "left",
      "view",
      "league",
      "semifinal",
      "yamal",
      "leg",
      "right",
      "33",
      "cest",
      "apr",
      "share30",
      "inter",
      "2025",
      "barcelona",
      "champions",
      "happened"
    ],
    "image_url": "https://i.guim.co.uk/img/media/7317fc18e741e81e3d516a0f1496376b588cfb59/0_0_2229_1337/master/2229.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=55baf5018f89f68962c9e28fcfd6b65a"
  },
  "https://www.theguardian.com/p/x23c49": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x23c49",
    "date": "2025-04-16",
    "time": "04:44:34",
    "title": "Rugby Australia posts $36.8m deficit amid wait for financial windfall to arrive",
    "body": "Rugby Australia says it has “changed the trajectory” of the sport despite recording a deficit of $36.8m in 2024, as the organisation looks forward to the commercial windfall of this year’s British and Irish Lions tour and the coming men’s 2027 and women’s 2029 World Cups.\n\nThe governing body also took the opportunity at its results announcement to lash out at efforts to poach Australia’s best young talent, after the pursuit this year of multiple junior Wallabies by French recruiters.\n\nOperating expenses grew $26m to $156m due to costs of running the NSW Waratahs, ACT Brumbies and now-defunct Melbourne Rebels, and an increase in player payments and match day costs related to hosting more international matches.\n\nRA oversaw six home Wallabies fixtures in 2024 compared to two in 2023, but revenue grew only $1.9m to $126.3m. The annual report noted the commercial program experienced a “challenging year” due to a poor performance by the Wallabies at the 2023 World Cup and uncertainty in Super Rugby Pacific.\n\nPhil Waugh, chief executive of RA, said 2024’s financial losses had been anticipated and the game was still on track to pay off a $80m loan agreement with Pacific Equity Partners (PEP) this year.\n\n“RA is forecasting a record surplus in 2025 which should provide us the option of exiting the credit facility with PEP,” Waugh said. “Australian rugby then enters a new, substantially upweighted five-year broadcast cycle from 2026.\n\n“And in 2027 and 2029, Australia will welcome the world to our shores for the men’s and women’s editions of our sport’s grandest tournament, the Rugby World Cup. “\n\nThe code carried the financial burden of several challenges in 2024 that should now be in the past. These include the $10.3m integration of the Waratahs and Brumbies, $5.1m in outlays associated with the exit of the Rebels and almost $7m in interest charges.\n\nRA argues the game is in a healthy on-field state, reporting player participation across clubs, events and schools grew almost 15% and finally returned to pre-Covid levels.\n\nDaniel Herbert, RA chairperson, said it was a “year of transformation”. “The game in Australia has made significant progress over the last 12 months and, while that is no doubt pleasing, we are acutely aware that there is still plenty of work ahead of us for Australian rugby to realise its full potential,” he said.\n\n“Reform of the magnitude Rugby Australia completed in 2024 inevitably requires one-off strategic costs and investments, which are represented in the annual report. Those outlays have changed the trajectory of Australian rugby and placed the game on a strong footing for the future, reflected in the significantly improved five-year broadcast deal with Nine announced last week.”\n\nThe arrangement with Nine is reportedly worth up to $240m, or more than $40m per year. The previous deal was worth about $100m over three years.\n\nThe new deal includes a proportion of free advertising, as well as incentives for on-field performance.\n\nMore than 500,000 tickets are expected to be sold for the Lions tour this year, generating a one-in-12-year financial bonanza driving the administration’s optimism.\n\nskip past newsletter promotion Sign up to The Breakdown Free weekly newsletter The latest rugby union news and analysis, plus all the week's action reviewed Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nHerbert also revealed RA was concerned about offers to lure teenage representatives players such as Heinz Lemoto and Visesio Kite to France, and had raised the matter with World Rugby.\n\n“There’s more than what’s been reported as well that we’re aware of,” Herbert said. “Our view is that France has the ability to produce its own players, they don’t need to come and talk to our player agents to try and poach ours at a very young age.”\n\nWaugh confirmed a new Wallabies coach would be announced “imminently”.\n\nIn February, Joe Schmidt announced he would step down from the job in October in order to spend more time with his family in New Zealand.\n\n“We’re working as quickly as we can, but we need to get to the right outcome given the importance of this next cycle, and this next coach will take us through to a home Rugby World Cup,” Waugh said.\n\n“It’s been a very thorough process, and we think we’re landing in a good spot, and we’re just keen – as you are – to to give you an answer sooner rather than later.”",
    "clean_body": "rugby australia says it has “changed the trajectory” of the sport despite recording a deficit of 368m in 2024 as the organisation looks forward to the commercial windfall of this year’s british and irish lions tour and the coming men’s 2027 and women’s 2029 world cups the governing body also took the opportunity at its results announcement to lash out at efforts to poach australia’s best young talent after the pursuit this year of multiple junior wallabies by french recruiters operating expenses grew 26m to 156m due to costs of running the nsw waratahs act brumbies and nowdefunct melbourne rebels and an increase in player payments and match day costs related to hosting more international matches ra oversaw six home wallabies fixtures in 2024 compared to two in 2023 but revenue grew only 19m to 1263m the annual report noted the commercial program experienced a “challenging year” due to a poor performance by the wallabies at the 2023 world cup and uncertainty in super rugby pacific phil waugh chief executive of ra said 2024’s financial losses had been anticipated and the game was still on track to pay off a 80m loan agreement with pacific equity partners pep this year “ra is forecasting a record surplus in 2025 which should provide us the option of exiting the credit facility with pep” waugh said “australian rugby then enters a new substantially upweighted fiveyear broadcast cycle from 2026 “and in 2027 and 2029 australia will welcome the world to our shores for the men’s and women’s editions of our sport’s grandest tournament the rugby world cup “ the code carried the financial burden of several challenges in 2024 that should now be in the past these include the 103m integration of the waratahs and brumbies 51m in outlays associated with the exit of the rebels and almost 7m in interest charges ra argues the game is in a healthy onfield state reporting player participation across clubs events and schools grew almost 15 and finally returned to precovid levels daniel herbert ra chairperson said it was a “year of transformation” “the game in australia has made significant progress over the last 12 months and while that is no doubt pleasing we are acutely aware that there is still plenty of work ahead of us for australian rugby to realise its full potential” he said “reform of the magnitude rugby australia completed in 2024 inevitably requires oneoff strategic costs and investments which are represented in the annual report those outlays have changed the trajectory of australian rugby and placed the game on a strong footing for the future reflected in the significantly improved fiveyear broadcast deal with nine announced last week” the arrangement with nine is reportedly worth up to 240m or more than 40m per year the previous deal was worth about 100m over three years the new deal includes a proportion of free advertising as well as incentives for onfield performance more than 500000 tickets are expected to be sold for the lions tour this year generating a onein12year financial bonanza driving the administration’s optimism skip past newsletter promotion sign up to the breakdown free weekly newsletter the latest rugby union news and analysis plus all the weeks action reviewed enter your email address sign up privacy notice newsletters may contain info about charities online ads and content funded by outside parties for more information see our newsletters may contain info about charities online ads and content funded by outside parties for more information see our privacy policy we use google recaptcha to protect our website and the google privacy policy and terms of service apply after newsletter promotion herbert also revealed ra was concerned about offers to lure teenage representatives players such as heinz lemoto and visesio kite to france and had raised the matter with world rugby “there’s more than what’s been reported as well that we’re aware of” herbert said “our view is that france has the ability to produce its own players they don’t need to come and talk to our player agents to try and poach ours at a very young age” waugh confirmed a new wallabies coach would be announced “imminently” in february joe schmidt announced he would step down from the job in october in order to spend more time with his family in new zealand “we’re working as quickly as we can but we need to get to the right outcome given the importance of this next cycle and this next coach will take us through to a home rugby world cup” waugh said “it’s been a very thorough process and we think we’re landing in a good spot and we’re just keen – as you are – to to give you an answer sooner rather than later”",
    "summary": "RA oversaw six home Wallabies fixtures in 2024 compared to two in 2023, but revenue grew only $1.9m to $126.3m.\n“And in 2027 and 2029, Australia will welcome the world to our shores for the men’s and women’s editions of our sport’s grandest tournament, the Rugby World Cup.\n“The code carried the financial burden of several challenges in 2024 that should now be in the past.\n“Reform of the magnitude Rugby Australia completed in 2024 inevitably requires one-off strategic costs and investments, which are represented in the annual report.\nafter newsletter promotionHerbert also revealed RA was concerned about offers to lure teenage representatives players such as Heinz Lemoto and Visesio Kite to France, and had raised the matter with World Rugby.",
    "keywords": [
      "australia",
      "ra",
      "posts",
      "amid",
      "financial",
      "arrive",
      "2024",
      "deficit",
      "windfall",
      "world",
      "waugh",
      "privacy",
      "player",
      "wait",
      "rugby",
      "game",
      "wallabies",
      "368m"
    ],
    "image_url": "https://i.guim.co.uk/img/media/5bea98ea2776b2cf9dea4a8b7d5d072ef7e0257d/0_360_5400_3240/master/5400.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=13f5e78c58fe4284dc6bd0bf1dba4dd9"
  },
  "https://www.theguardian.com/p/x25aje": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x25aje",
    "date": "2025-04-25",
    "time": "14:14:13",
    "title": "Jimmy Kimmel on Hegseth bringing his wife to meetings: ‘Maybe she’s his designated driver’",
    "body": "With several hosts still on holiday, Jimmy Kimmel reacts to reports of a screaming match at the White House and Pete Hegseth bringing his wife to meetings.\n\nJimmy Kimmel\n\nThursday was Bring Your Child To Work Day, and indeed, “there’s been a lot of childish behavior at the White House as of late,” said Kimmel. For example, Axios reported that Elon Musk had an expletive-filled, chest-to-chest shouting match outside the Oval Office with treasury secretary Scott Bessent over who would run the Internal Revenue Service (IRS).\n\nBessent reportedly confronted Musk in a hallway, and “the F-bombs started to fly – or at least, that’s what Pete Hegseth texted his wife and brother,” Kimmel quipped.\n\nThe White House press secretary, Karoline Leavitt, “put her own spin on it”, Kimmel noted. In a statement, Leavitt said: “It’s no secret President Trump has put together a team of people who are incredibly passionate about the issues impacting our country.”\n\n“Really? Because this is Scott Bessent,” Kimmel said next to a photo of a very corporate looking, grey-haired white man. “This is a guy who is incredibly passionate? Looks like the only F-word he’s used before this is fiber. Scott Bessent looks like Will Ferrell playing George Bush playing Janet Reno.”\n\nThe argument was allegedly so loud that it interrupted a meeting between Trump and the prime minister of Italy. “They say no one has screamed that loud in the White House since the time Eric got his penis caught in the resolute desk,” Kimmel joked.\n\nThe host then turned to another beleaguered Trump official: Hegseth, the defense secretary, under fire this week for sending more sensitive information in a second Signal group chat that included his wife and other family members.\n\nAdditionally, numerous officials were reportedly annoyed when Hegseth brought his wife to meetings they assumed were one-on-one. The Pentagon denied the reports; according to Sean Parnell, the chief spokesperson for the Pentagon, Jennifer Hegseth “never attended a meeting where sensitive information or classified information was discussed”.\n\n“Of course she hasn’t – she doesn’t need to. If there’s anything exciting, he catches her up on a text,” Kimmel retorted.\n\n“Maybe there’s a good reason for her to be at the meetings. Maybe she’s his designated driver,” he added.\n\nKimmel also mocked reports that Hegseth had a makeup booth installed at the Pentagon for on-camera interviews, which the defense secretary denied; instead, according to a spokesperson, Hegseth does his own makeup.\n\n“The good news is, when he gets booted from the Pentagon, he’ll be able to get a job at Sephora,” Kimmel joked. “The defense secretary has a makeup room, the vice-president wears eyeliner, and yet somehow this administration spends all day every day complaining about trans women ruining sports.”",
    "clean_body": "with several hosts still on holiday jimmy kimmel reacts to reports of a screaming match at the white house and pete hegseth bringing his wife to meetings jimmy kimmel thursday was bring your child to work day and indeed “there’s been a lot of childish behavior at the white house as of late” said kimmel for example axios reported that elon musk had an expletivefilled chesttochest shouting match outside the oval office with treasury secretary scott bessent over who would run the internal revenue service irs bessent reportedly confronted musk in a hallway and “the fbombs started to fly – or at least that’s what pete hegseth texted his wife and brother” kimmel quipped the white house press secretary karoline leavitt “put her own spin on it” kimmel noted in a statement leavitt said “it’s no secret president trump has put together a team of people who are incredibly passionate about the issues impacting our country” “really because this is scott bessent” kimmel said next to a photo of a very corporate looking greyhaired white man “this is a guy who is incredibly passionate looks like the only fword he’s used before this is fiber scott bessent looks like will ferrell playing george bush playing janet reno” the argument was allegedly so loud that it interrupted a meeting between trump and the prime minister of italy “they say no one has screamed that loud in the white house since the time eric got his penis caught in the resolute desk” kimmel joked the host then turned to another beleaguered trump official hegseth the defense secretary under fire this week for sending more sensitive information in a second signal group chat that included his wife and other family members additionally numerous officials were reportedly annoyed when hegseth brought his wife to meetings they assumed were oneonone the pentagon denied the reports according to sean parnell the chief spokesperson for the pentagon jennifer hegseth “never attended a meeting where sensitive information or classified information was discussed” “of course she hasn’t – she doesn’t need to if there’s anything exciting he catches her up on a text” kimmel retorted “maybe there’s a good reason for her to be at the meetings maybe she’s his designated driver” he added kimmel also mocked reports that hegseth had a makeup booth installed at the pentagon for oncamera interviews which the defense secretary denied instead according to a spokesperson hegseth does his own makeup “the good news is when he gets booted from the pentagon he’ll be able to get a job at sephora” kimmel joked “the defense secretary has a makeup room the vicepresident wears eyeliner and yet somehow this administration spends all day every day complaining about trans women ruining sports”",
    "summary": "With several hosts still on holiday, Jimmy Kimmel reacts to reports of a screaming match at the White House and Pete Hegseth bringing his wife to meetings.\nJimmy KimmelThursday was Bring Your Child To Work Day, and indeed, “there’s been a lot of childish behavior at the White House as of late,” said Kimmel.\nFor example, Axios reported that Elon Musk had an expletive-filled, chest-to-chest shouting match outside the Oval Office with treasury secretary Scott Bessent over who would run the Internal Revenue Service (IRS).\nThe White House press secretary, Karoline Leavitt, “put her own spin on it”, Kimmel noted.\nAdditionally, numerous officials were reportedly annoyed when Hegseth brought his wife to meetings they assumed were one-on-one.",
    "keywords": [
      "maybe",
      "driver",
      "hegseth",
      "wife",
      "kimmel",
      "designated",
      "trump",
      "pentagon",
      "theres",
      "meetings",
      "shes",
      "house",
      "secretary",
      "bringing",
      "scott",
      "white",
      "jimmy"
    ],
    "image_url": "https://i.guim.co.uk/img/media/7be4109f6d3700770b3038710e58870fd42c2887/132_135_2599_1560/master/2599.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=150098fe40718a58eb198d1b68c851ce"
  },
  "https://www.theguardian.com/p/x25aqm": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x25aqm",
    "date": "2025-04-29",
    "time": "09:45:27",
    "title": "Share your reaction to the 2025 Canada election result",
    "body": "In Canada, the Liberal party has won a fourth term in office marking a landmark victory for the former central banker and political novice Mark Carney.\n\nBut Carney’s election victory is seen as being shaped by a series of chance events that hinged more on luck and circumstance than meticulous forethought. Before Justin Trudeau stepped down, the Liberals trailed the Conservatives by more than 20 points and the country’s two polling aggregators had the odds of a Conservative victory at greater than 99%.\n\nWe’d like to hear from Canadians about their views on the election results and find out the mood across the country. What are the most important issues you want addressed and what do you want to see from the next term?",
    "clean_body": "in canada the liberal party has won a fourth term in office marking a landmark victory for the former central banker and political novice mark carney but carney’s election victory is seen as being shaped by a series of chance events that hinged more on luck and circumstance than meticulous forethought before justin trudeau stepped down the liberals trailed the conservatives by more than 20 points and the country’s two polling aggregators had the odds of a conservative victory at greater than 99 we’d like to hear from canadians about their views on the election results and find out the mood across the country what are the most important issues you want addressed and what do you want to see from the next term",
    "summary": "In Canada, the Liberal party has won a fourth term in office marking a landmark victory for the former central banker and political novice Mark Carney.\nBut Carney’s election victory is seen as being shaped by a series of chance events that hinged more on luck and circumstance than meticulous forethought.\nBefore Justin Trudeau stepped down, the Liberals trailed the Conservatives by more than 20 points and the country’s two polling aggregators had the odds of a Conservative victory at greater than 99%.\nWe’d like to hear from Canadians about their views on the election results and find out the mood across the country.\nWhat are the most important issues you want addressed and what do you want to see from the next term?",
    "keywords": [
      "trudeau",
      "canada",
      "trailed",
      "won",
      "result",
      "series",
      "victory",
      "election",
      "shaped",
      "2025",
      "stepped",
      "share",
      "views",
      "term",
      "reaction"
    ],
    "image_url": "https://i.guim.co.uk/img/media/963840647d52dc2100278ca386284a26da0e5407/2_0_2856_1714/master/2856.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=95804440e10a0b393c0907f370b53959"
  },
  "https://www.theguardian.com/p/x24kht": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x24kht",
    "date": "2025-04-24",
    "time": "04:00:56",
    "title": "Will rising child poverty be Labour’s legacy? – Politics Weekly UK",
    "body": "The government began to roll out its free breakfast club scheme this week as part of plans to help struggling families. But with predictions that child poverty could increase by the end of this parliament, how serious is Labour about tackling the problem? John Harris hears from a headteacher, and speaks to our political editor, Pippa Crerar",
    "clean_body": "the government began to roll out its free breakfast club scheme this week as part of plans to help struggling families but with predictions that child poverty could increase by the end of this parliament how serious is labour about tackling the problem john harris hears from a headteacher and speaks to our political editor pippa crerar",
    "summary": "The government began to roll out its free breakfast club scheme this week as part of plans to help struggling families.\nBut with predictions that child poverty could increase by the end of this parliament, how serious is Labour about tackling the problem?\nJohn Harris hears from a headteacher, and speaks to our political editor, Pippa Crerar",
    "keywords": [
      "tackling",
      "problem",
      "weekly",
      "legacy",
      "serious",
      "struggling",
      "scheme",
      "uk",
      "rising",
      "week",
      "predictions",
      "roll",
      "poverty",
      "speaks",
      "politics",
      "child",
      "labours"
    ],
    "image_url": "https://i.guim.co.uk/img/media/8fc8d39879cd4c8f74e9223b849d46a395f17fd6/0_0_5216_3129/master/5216.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=db906b0d106e4792a1ac9313692b74ec"
  },
  "https://www.theguardian.com/p/x259bv": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x259bv",
    "date": "2025-04-25",
    "time": "11:57:44",
    "title": "Digested week: Memories of Wizbit, high hopes for Bill and Ted",
    "body": "Monday\n\nI did what a lot of people did on hearing news of the death of Pope Francis on Monday: I watched Conclave. The Oscar-nominated movie, adapted from the Robert Harris novel, unpacks the process of electing a new pope and between Sunday and Monday, it enjoyed a 283% surge in streaming figures. I’d like to say it deepened my understanding of life in the Vatican, but the truth is it just made me wish we could have Ralph Fiennes for pope, while reminding me – I’m not alone in this – that we’ve seen quite enough of Stanley Tucci for the time being.\n\nThe pope’s demise was foreshadowed by an event that, like a plague of locusts, should trigger anticipatory dread in any context, which is the appearance of JD Vance. Vance, a Catholic convert, was granted a brief audience with the pope on Easter Sunday, after what People magazine described as his “brushing off” by the pontiff the day before. After Vance’s departure, the pope delivered his Easter address via an aide, which included the line: “How much contempt is stirred up at times towards the vulnerable, the marginalised, and migrants!” – surely a one-star Yelp review directed at the US vice-president.\n\nNow we must wait; for the funeral on Saturday, followed by the puff of white smoke to indicate the election of a new pope, a reminder that the Catholic church never shortchanges on theatrics. Among the handful of lead contenders we are, of course, feverishly hoping for success for the candidate with the name that’s a small but perfect gift from God: the Italian cardinal and top Vatican official to the Middle East, Pierbattista Pizzaballa.\n\nTuesday\n\nSometimes life rewards us with just the thing we need at exactly the point when we need it and this week it’s the announcement that Alex Winter and Keanu Reeves will revive their turn as Bill and Ted, only this time in a Broadway production of Samuel Beckett’s Waiting for Godot.\n\nThe double act, more than 30 years on from the original Bill and Ted movie, are surely perfectly suited to play Beckett’s absurdist characters Vladimir (Alex) and Estragon (Reeves), a whimsical piece of casting for a play that will open at the Hudson theatre in New York in September for a limited run through to January. I last saw the play more than 10 years ago on Broadway in a production starring Ian McKellen and Patrick Stewart. It was mainly very good, while also suffering from a phenomenon that occasionally strikes when very famous actors take to the stage: the delight the actors took in the delight of the audience occasionally poked a hole in the drama. Let’s hope John Wick-does-Beckett – a premise I couldn’t love more – avoids too much smirking self-reference.\n\nView image in fullscreen ‘It certainly is hilarious, Gary, that people find your thoughts about Israel as pertinent as mine.’ Photograph: Stefan Rousseau/PA Media\n\nWednesday\n\nWhere do the words “the Magic Circle” take you? If you’re under 40, probably nowhere. But for anyone older, news this week of a long overdue resolution to a 34-year-old injustice among this country’s professional magicians, summoned an avalanche of images.\n\nIn 1991, a woman called Sophie Lloyd disguised herself as a man to trick Magic Circle examiners into admitting her into the male-only society. Later that year, when the Magic Circle changed its rules and admitted its first woman member – Debbie McGee! Wife of Paul Daniels! – Lloyd unveiled her deception, and the Circle elders were so furious they ejected her. Until this week, that is, when the Circle tracked Lloyd down, apologised, and presented her with membership.\n\nLloyd was delightful on the Today programme and the entire episode has been borne along on winds of eccentricity Samuel Beckett himself couldn’t have improved upon. And while there’s no explaining to the uninitiated what it all means, I urge the young and curious to find the nearest person with bags under their eyes, say the word “Wizbit” and watch them go. (“Ha ha this away, ha ha that away” – sad to imagine what had to be displaced in my psyche in order for this to hang on for four decades like knotweed.)\n\nThursday\n\nKristi Noem, famous for killing her dog and also being Trump’s head of homeland security, had her bag stolen this week from under her chair in a restaurant in Washington DC and the startling detail is that it contained $3,000 in cash. (The bag also contained her driving licence and a bunch of blank cheques.) Brilliantly, none of the Secret Service agents present in the room noticed the theft.\n\nVia a spokesperson, Noem, who recently visited a prison facility wearing a $50,000 gold Rolex, explained why she had such a large amount of cash on her person. “Her entire family was in town including her children and grandchildren. She was using the withdrawal to treat her family to dinner, activities and Easter gifts.” This is all very well but, as we know, were Noem a random Salvadoran man with tattoos living in Maryland with this kind of cash on her, she’d currently be sitting in a notorious prison in El Salvador.\n\nFriday\n\nDo you remember in 2016 when Priscilla Chan, Mark Zuckerberg’s wife, opened a tuition-free private school in Palo Alto dedicated to serving low income kids from communities of colour? It was called the Primary school and was, per reporting in the New York Times, committed to “identity development, diverse cultures and ideas”, as well as social justice and a DEI task force.\n\nAnyway it’s closing. Flabbergasted parents were summoned to a meeting this week and told the school would not operate beyond the summer of 2026. They were given no reason. “Mommy, the guy who’s been giving money to our school doesn’t want to give it to us any more,” one kindergartner was reported as saying, a reminder that in this current vibe shift there is no target too little.",
    "clean_body": "monday i did what a lot of people did on hearing news of the death of pope francis on monday i watched conclave the oscarnominated movie adapted from the robert harris novel unpacks the process of electing a new pope and between sunday and monday it enjoyed a 283 surge in streaming figures i’d like to say it deepened my understanding of life in the vatican but the truth is it just made me wish we could have ralph fiennes for pope while reminding me – i’m not alone in this – that we’ve seen quite enough of stanley tucci for the time being the pope’s demise was foreshadowed by an event that like a plague of locusts should trigger anticipatory dread in any context which is the appearance of jd vance vance a catholic convert was granted a brief audience with the pope on easter sunday after what people magazine described as his “brushing off” by the pontiff the day before after vance’s departure the pope delivered his easter address via an aide which included the line “how much contempt is stirred up at times towards the vulnerable the marginalised and migrants” – surely a onestar yelp review directed at the us vicepresident now we must wait for the funeral on saturday followed by the puff of white smoke to indicate the election of a new pope a reminder that the catholic church never shortchanges on theatrics among the handful of lead contenders we are of course feverishly hoping for success for the candidate with the name that’s a small but perfect gift from god the italian cardinal and top vatican official to the middle east pierbattista pizzaballa tuesday sometimes life rewards us with just the thing we need at exactly the point when we need it and this week it’s the announcement that alex winter and keanu reeves will revive their turn as bill and ted only this time in a broadway production of samuel beckett’s waiting for godot the double act more than 30 years on from the original bill and ted movie are surely perfectly suited to play beckett’s absurdist characters vladimir alex and estragon reeves a whimsical piece of casting for a play that will open at the hudson theatre in new york in september for a limited run through to january i last saw the play more than 10 years ago on broadway in a production starring ian mckellen and patrick stewart it was mainly very good while also suffering from a phenomenon that occasionally strikes when very famous actors take to the stage the delight the actors took in the delight of the audience occasionally poked a hole in the drama let’s hope john wickdoesbeckett – a premise i couldn’t love more – avoids too much smirking selfreference view image in fullscreen ‘it certainly is hilarious gary that people find your thoughts about israel as pertinent as mine’ photograph stefan rousseaupa media wednesday where do the words “the magic circle” take you if you’re under 40 probably nowhere but for anyone older news this week of a long overdue resolution to a 34yearold injustice among this country’s professional magicians summoned an avalanche of images in 1991 a woman called sophie lloyd disguised herself as a man to trick magic circle examiners into admitting her into the maleonly society later that year when the magic circle changed its rules and admitted its first woman member – debbie mcgee wife of paul daniels – lloyd unveiled her deception and the circle elders were so furious they ejected her until this week that is when the circle tracked lloyd down apologised and presented her with membership lloyd was delightful on the today programme and the entire episode has been borne along on winds of eccentricity samuel beckett himself couldn’t have improved upon and while there’s no explaining to the uninitiated what it all means i urge the young and curious to find the nearest person with bags under their eyes say the word “wizbit” and watch them go “ha ha this away ha ha that away” – sad to imagine what had to be displaced in my psyche in order for this to hang on for four decades like knotweed thursday kristi noem famous for killing her dog and also being trump’s head of homeland security had her bag stolen this week from under her chair in a restaurant in washington dc and the startling detail is that it contained 3000 in cash the bag also contained her driving licence and a bunch of blank cheques brilliantly none of the secret service agents present in the room noticed the theft via a spokesperson noem who recently visited a prison facility wearing a 50000 gold rolex explained why she had such a large amount of cash on her person “her entire family was in town including her children and grandchildren she was using the withdrawal to treat her family to dinner activities and easter gifts” this is all very well but as we know were noem a random salvadoran man with tattoos living in maryland with this kind of cash on her she’d currently be sitting in a notorious prison in el salvador friday do you remember in 2016 when priscilla chan mark zuckerberg’s wife opened a tuitionfree private school in palo alto dedicated to serving low income kids from communities of colour it was called the primary school and was per reporting in the new york times committed to “identity development diverse cultures and ideas” as well as social justice and a dei task force anyway it’s closing flabbergasted parents were summoned to a meeting this week and told the school would not operate beyond the summer of 2026 they were given no reason “mommy the guy who’s been giving money to our school doesn’t want to give it to us any more” one kindergartner was reported as saying a reminder that in this current vibe shift there is no target too little",
    "summary": "In 1991, a woman called Sophie Lloyd disguised herself as a man to trick Magic Circle examiners into admitting her into the male-only society.\nLater that year, when the Magic Circle changed its rules and admitted its first woman member – Debbie McGee!\nUntil this week, that is, when the Circle tracked Lloyd down, apologised, and presented her with membership.\n(“Ha ha this away, ha ha that away” – sad to imagine what had to be displaced in my psyche in order for this to hang on for four decades like knotweed.)\nFlabbergasted parents were summoned to a meeting this week and told the school would not operate beyond the summer of 2026.",
    "keywords": [
      "pope",
      "noem",
      "wizbit",
      "circle",
      "week",
      "ted",
      "school",
      "magic",
      "lloyd",
      "ha",
      "easter",
      "digested",
      "play",
      "bill",
      "memories",
      "hopes",
      "high"
    ],
    "image_url": "https://i.guim.co.uk/img/media/8ca78185fb60498f2da2a69e4a0d05f699db5c1e/0_107_3616_2169/master/3616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=6637217f12ec3f1b234d3a5265fad0a7"
  },
  "https://www.theguardian.com/p/x25q4t": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x25q4t",
    "date": "2025-04-28",
    "time": "19:23:02",
    "title": "Andreeva and Gauff advance before Spain power outage halts play",
    "body": "Mirra Andreeva has spent the past two years of her life establishing herself as one of the most successful teenagers of her era, yet on a chaotic, surreal day in Madrid, the 17 year-old had to briefly work through playing conditions more familiar to her contemporaries on the junior circuit. During the final change of ends of her fourth-round match against the Ukrainian qualifier Yulia Starodubtseva, as she served for a comfortable victory, she learned of the power outage that had ravaged Spain, Portugal and many nearby countries, ultimately forcing play to be postponed in Madrid.\n\nAs matches across the tournament grounds had already come to a halt, the two players were told that they could play out the subsequent game, but there was a catch: the live electronic line‑calling system was no longer functioning and there were no line umpires to call upon. They would have to play as if they were juniors again, calling their own lines with only the umpire there to intervene. Naturally, Andreeva began to feel the pressure.\n\n“It was 15-40 on my serve and I was like: ‘Oh, Mirra. Just please, please do everything in your power to just take this game and finish this match,’” she said, laughing. “I knew that if it would go to 5-5, probably we would have to wait. Probably I would not be here yet and I would just be waiting and we would just see what we would do.”\n\nFrom double break point down, Andreeva pulled herself together and closed out the match. A few metres away on the neighbouring stadium court, her next opponent was also one of the fortunate players: Coco Gauff had been in the middle of her post‑match interview after a dominant win when the power shut down. Gauff noted she had actually requested to be scheduled as the second match on‑court; for once, she was thankful to the WTA supervisers for not honouring that request.\n\n“So far, the toughest thing has been not been able to shower after my match. There’s no running water so I just had to take baby wipes and wipe myself, spray some perfume and call it a day,” Gauff said an hour after her match. “I don’t even think we’ll be able to go back to the hotel as the traffic lights are out. So it’s just crazy how much we depend on electricity. It’s really insane. It puts that in perspective and also makes me think about the humans that lived before electricity and how impressive that is.”\n\n1:24 Major power outage causes chaos in Spain and Portugal – video report\n\nOther players were not quite as fortunate. Grigor Dimitrov, the 15th seed, held a match point against Britain’s Jacob Fearnley at 6-4, 5-2 before serving for the match a game later. By 5-4, the second set back on serve, both players were walking off the court. An hour later, Dimitrov could be found sitting down alone in the sun in a quiet outdoor spot players use to warm up, smiling to himself at such an surreal turn of events.\n\n“At this point this is only a situation that you can just laugh at if I was on-court because it’s probably not going to happen ever again,” Gauff said. “You can always remember the day the power went out at the Madrid Open.”\n\nAs much of Madrid came to a standstill, that chaos was reflected inside the Caja Mágica. Unlike many other tournament sites, the Madrid Open grounds are mostly indoors, below ground level and there is minimal natural light off the court. It meant that much of the grounds were plunged in total darkness. In the communal fan areas, spectators stood shoulder to shoulder, packed like sardines, relying solely on the lights from their phones.\n\nView image in fullscreen Bulgaria’s Grigor Dimitrov had his match with Britain’s Jacob Fearnley interrupted. Photograph: Thomas Coex/AFP/Getty Images\n\nThe players themselves had things slightly better. Shortly after the outage, workers swept in with candles, with the players’ restaurant and lounge eventually illuminated by dozens of candles. Every hour, the player warm-up area seemed to take on a completely different function. Shortly after the power cut, a number of players due on-court had been warming up in total darkness. An hour later, the room was filled with players simply lying on the floor, on the phone and talking with others. Eventually, as they admitted defeat, numerous massage tables appeared and the players ended their days with physiotherapy.\n\n“I was in the gym and it’s super dark, everyone is using the phones with flashlights, but it’s also kind of fun because everyone is talking to each other and the atmosphere is a little more friendly,” Andreeva said.\n\nIt soon became clear that there would be no more play on this unforgettable day. As players scrambled to secure a lift home, the line at the transport desk extended almost as long as the Wimbledon queue. Their requests were recorded with pen and paper. With traffic lights ceasing to function in the city, a three-hour journey awaited for those who secured a car. Many opted for the one‑ to two‑hour walk. Once they reached home, this time they would not be able to distract themselves by playing video games, watching TV series or doomscrolling on social media. Not everyone seemed to mind.\n\n“If you take my phone away, I’m completely fine spending time without it,” said Andreeva, who turns 18 on Tuesday. “The only thing I need in my phone right now is a flashlight.”",
    "clean_body": "mirra andreeva has spent the past two years of her life establishing herself as one of the most successful teenagers of her era yet on a chaotic surreal day in madrid the 17 yearold had to briefly work through playing conditions more familiar to her contemporaries on the junior circuit during the final change of ends of her fourthround match against the ukrainian qualifier yulia starodubtseva as she served for a comfortable victory she learned of the power outage that had ravaged spain portugal and many nearby countries ultimately forcing play to be postponed in madrid as matches across the tournament grounds had already come to a halt the two players were told that they could play out the subsequent game but there was a catch the live electronic line‑calling system was no longer functioning and there were no line umpires to call upon they would have to play as if they were juniors again calling their own lines with only the umpire there to intervene naturally andreeva began to feel the pressure “it was 1540 on my serve and i was like ‘oh mirra just please please do everything in your power to just take this game and finish this match’” she said laughing “i knew that if it would go to 55 probably we would have to wait probably i would not be here yet and i would just be waiting and we would just see what we would do” from double break point down andreeva pulled herself together and closed out the match a few metres away on the neighbouring stadium court her next opponent was also one of the fortunate players coco gauff had been in the middle of her post‑match interview after a dominant win when the power shut down gauff noted she had actually requested to be scheduled as the second match on‑court for once she was thankful to the wta supervisers for not honouring that request “so far the toughest thing has been not been able to shower after my match there’s no running water so i just had to take baby wipes and wipe myself spray some perfume and call it a day” gauff said an hour after her match “i don’t even think we’ll be able to go back to the hotel as the traffic lights are out so it’s just crazy how much we depend on electricity it’s really insane it puts that in perspective and also makes me think about the humans that lived before electricity and how impressive that is” 124 major power outage causes chaos in spain and portugal – video report other players were not quite as fortunate grigor dimitrov the 15th seed held a match point against britain’s jacob fearnley at 64 52 before serving for the match a game later by 54 the second set back on serve both players were walking off the court an hour later dimitrov could be found sitting down alone in the sun in a quiet outdoor spot players use to warm up smiling to himself at such an surreal turn of events “at this point this is only a situation that you can just laugh at if i was oncourt because it’s probably not going to happen ever again” gauff said “you can always remember the day the power went out at the madrid open” as much of madrid came to a standstill that chaos was reflected inside the caja mágica unlike many other tournament sites the madrid open grounds are mostly indoors below ground level and there is minimal natural light off the court it meant that much of the grounds were plunged in total darkness in the communal fan areas spectators stood shoulder to shoulder packed like sardines relying solely on the lights from their phones view image in fullscreen bulgaria’s grigor dimitrov had his match with britain’s jacob fearnley interrupted photograph thomas coexafpgetty images the players themselves had things slightly better shortly after the outage workers swept in with candles with the players’ restaurant and lounge eventually illuminated by dozens of candles every hour the player warmup area seemed to take on a completely different function shortly after the power cut a number of players due oncourt had been warming up in total darkness an hour later the room was filled with players simply lying on the floor on the phone and talking with others eventually as they admitted defeat numerous massage tables appeared and the players ended their days with physiotherapy “i was in the gym and it’s super dark everyone is using the phones with flashlights but it’s also kind of fun because everyone is talking to each other and the atmosphere is a little more friendly” andreeva said it soon became clear that there would be no more play on this unforgettable day as players scrambled to secure a lift home the line at the transport desk extended almost as long as the wimbledon queue their requests were recorded with pen and paper with traffic lights ceasing to function in the city a threehour journey awaited for those who secured a car many opted for the one‑ to two‑hour walk once they reached home this time they would not be able to distract themselves by playing video games watching tv series or doomscrolling on social media not everyone seemed to mind “if you take my phone away i’m completely fine spending time without it” said andreeva who turns 18 on tuesday “the only thing i need in my phone right now is a flashlight”",
    "summary": "They would have to play as if they were juniors again, calling their own lines with only the umpire there to intervene.\nJust please, please do everything in your power to just take this game and finish this match,’” she said, laughing.\nThere’s no running water so I just had to take baby wipes and wipe myself, spray some perfume and call it a day,” Gauff said an hour after her match.\nShortly after the power cut, a number of players due on-court had been warming up in total darkness.\n“If you take my phone away, I’m completely fine spending time without it,” said Andreeva, who turns 18 on Tuesday.",
    "keywords": [
      "probably",
      "advance",
      "spain",
      "match",
      "andreeva",
      "gauff",
      "day",
      "play",
      "hour",
      "outage",
      "power",
      "players",
      "halts",
      "madrid"
    ],
    "image_url": "https://i.guim.co.uk/img/media/413ca0cd45d3448b100b4513c49b7296d11efd6d/1081_386_4453_2673/master/4453.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1b49b3bc12a135780499d7d03dadd0ec"
  },
  "https://www.theguardian.com/p/x23xqd": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x23xqd",
    "date": "2025-04-15",
    "time": "10:32:24",
    "title": "‘His delivery cut through class barriers’: Moby, Mala and other musicians on working with Benjamin Zephaniah",
    "body": "Tuesday marks the 67th birthday of the late Benjamin Zephaniah – revolutionary poet, playwright, musician and fearless voice for social justice – following the inaugural Benjamin Zephaniah Day held over the weekend at Brunel University. But while he is widely celebrated for his work in literature and activism, Zephaniah’s influence on music remains relatively overlooked.\n\nEmerging from the dub poetry scene, Zephaniah channelled personal experiences of systemic racism and state violence into intelligent spoken word. Albums such as Rasta combined politically charged poetry with dub rhythms and studio effects, laying the cultural groundwork for UK genres such as trip-hop, jungle and dubstep. We revisit his unique collaborations in electronic music, hearing from the artists who had the honour of working with him.\n\nNatty x Mala x Benjamin Zephaniah – Word & Sound (2019)\n\nZephaniah’s Rastafari-inspired wisdom, Natty’s roots-infused minimalism and Mala’s DMZ-era dubstep combine to raise the consciousness vibration in Word & Sound – an uplifting, intergenerational union years in the making. “Benjamin was like an older brother to me, we were sometimes on the phone for hours,” Natty says. “So when I asked him to be part of a project I was doing, he wrote his verse immediately.” They recorded at Akala’s Ladbroke Grove studio in London then spent hours listening to Zephaniah’s stories – including his rightous refusal of an MBE.\n\nNatty says the vocals were meant for the track Badman (Rastafari mix), but when Mala reached out, the dubstep producer was sent them instead. “Working with such powerful voices was something else,” says Mala. “Their words guided my creative process. Benjamin’s verse is a reminder to stay true to self and keep growing in heart and spirit. Rest in peace, sir, we salute you.”\n\nNatty continues to include the track in his live sets in memory of his friend. “Whenever we met, we’d sometimes spar, as we both studied martial arts. I remember how strong he was, which made his passing even harder to accept. He was just a down-to-earth, brilliant human being. I’m so grateful to have known and learned from him.”\n\nKofi Stone – May Sound Crazy (ft Benjamin Zepheniah) (2024)\n\nBorn-and-bred Brummies Kofi Stone and Zephaniah are a force to be reckoned with in this collaboration – one of Zephaniah’s last, recorded in summer 2023. He steps into the resilient role of mentor in this ambient electronic-infused hip-hop track, as Stone reflects on growing up in Birmingham and navigating poverty and racism. “It was truly an experience I’ll never forget,” Stone says.\n\nAhead of the recording, Stone met Zephaniah outside the Birmingham Hippodrome, where he was narrating the Peaky Blinders ballet. “Before the show, we spoke at length about family, music and the state of the world,” recalls Stone. “He later drove us to the studio and recorded his verse in just a few takes. The whole process was surreal and beautiful.”\n\nThe video to the track was produced months later. “Benjamin was actually quite unwell at the time,” says Stone, “but he was determined to make the shoot. We filmed his scene on a rooftop car park in Birmingham’s Chinatown.” That was [another] day I’ll never forget.”\n\nBomb the Bass – Empire (with Sinéad O’Connor & Benjamin Zephaniah) (1995)\n\nZephaniah joined Bomb the Bass and Sinéad O’Connor to deliver a critique of colonialism in this trip-hop-influenced production, imagining a life-sucking vampire as a metaphor for empire. Tim Simenon, AKA Bomb the Bass, says: “I remember smoking a lot of weed with Sinéad while recording Empire. She sang the lead vocal in one take, then added harmonies and backing vocals.”\n\nSimenon instinctively knew that Zephaniah’s voice would contrast powerfully. “He was such a warm, open guy. We spent a long day in the studio, bouncing ideas around until we landed on the spacious delivery we recorded. He gave the final mix an approving head nod – he was super pleased with the result. We mostly spoke about music, especially dub. We shared a love for Big Youth, Lee ‘Scratch’ Perry and On-U Sound.”\n\nLB Dub Corp: I Have a Dream (ft Benjamin Zephaniah) (2013)\n\nI Have a Dream pairs Zephaniah’s cheeky twist on Martin Luther King’s iconic speech with atmospheric dub techno. It’s one of two tracks featuring him on Luke Slater’s LB Dub Corp album Unknown Origin, the other being Take a Ride. “When I reached out about combining a track with his poem I Have a Scheme, he was up for it straight away,” Slater says. “We somehow ended up debating vegan food in China.”\n\nReflecting on their final exchange, Slater said: “Benjamin had just received the album copies I sent and told me he played the track for his students. I was humbled. I miss him in this dimension, but his words live on.” He had intended to ask him to collaborate a second time. “Then a week later he was gone. He left too soon. His words always carried a message – not always comfortable, never bland. His delivery cut through class barriers and reached people from all walks of life.”\n\nSwayzak – Illegal (ft Benjamin Zephaniah) (2000)\n\nThe duo Swayzak captured Zephaniah’s rebellious spirit in this unapologetically anarchic track. “Working with Benjamin was an unexpected delight,” says James S Taylor. “There was no ego, no pressure, just good vibes.” The collaboration quickly grew into a friendship. “We talked deeply about politics and the British empire,” David Brown says. “The Brummie West Indian poet – quite a person to have in one’s life.”\n\nA 2024 “redraft” of Zephaniah’s 1999 poem Illegal was released under the title Do Something Illegal as a tribute to Zephaniah under Brown’s ambient alias, the Eightsome Reel. The track ends with the sound of heavy rain, recorded the day Brown learned of Zephaniah’s death. “It hit me hard – I was in East Kilbride when I heard, a place where he once lived.”\n\nMoby – Where is Your Pride (ft Benjamin Zephaniah) (2024)\n\nReleased in June 2024 as part of his album, Always Centered at Night, Moby’s Where Is Your Pride? is a tribute to Zephaniah. He says: “As a vegan activist and as a wise and compassionate man, Benjamin inspired me for many years. I hope Where Is Your Pride? honours his legacy and also draws people’s attention to his life, work and principles.”",
    "clean_body": "tuesday marks the 67th birthday of the late benjamin zephaniah – revolutionary poet playwright musician and fearless voice for social justice – following the inaugural benjamin zephaniah day held over the weekend at brunel university but while he is widely celebrated for his work in literature and activism zephaniah’s influence on music remains relatively overlooked emerging from the dub poetry scene zephaniah channelled personal experiences of systemic racism and state violence into intelligent spoken word albums such as rasta combined politically charged poetry with dub rhythms and studio effects laying the cultural groundwork for uk genres such as triphop jungle and dubstep we revisit his unique collaborations in electronic music hearing from the artists who had the honour of working with him natty x mala x benjamin zephaniah – word sound 2019 zephaniah’s rastafariinspired wisdom natty’s rootsinfused minimalism and mala’s dmzera dubstep combine to raise the consciousness vibration in word sound – an uplifting intergenerational union years in the making “benjamin was like an older brother to me we were sometimes on the phone for hours” natty says “so when i asked him to be part of a project i was doing he wrote his verse immediately” they recorded at akala’s ladbroke grove studio in london then spent hours listening to zephaniah’s stories – including his rightous refusal of an mbe natty says the vocals were meant for the track badman rastafari mix but when mala reached out the dubstep producer was sent them instead “working with such powerful voices was something else” says mala “their words guided my creative process benjamin’s verse is a reminder to stay true to self and keep growing in heart and spirit rest in peace sir we salute you” natty continues to include the track in his live sets in memory of his friend “whenever we met we’d sometimes spar as we both studied martial arts i remember how strong he was which made his passing even harder to accept he was just a downtoearth brilliant human being i’m so grateful to have known and learned from him” kofi stone – may sound crazy ft benjamin zepheniah 2024 bornandbred brummies kofi stone and zephaniah are a force to be reckoned with in this collaboration – one of zephaniah’s last recorded in summer 2023 he steps into the resilient role of mentor in this ambient electronicinfused hiphop track as stone reflects on growing up in birmingham and navigating poverty and racism “it was truly an experience i’ll never forget” stone says ahead of the recording stone met zephaniah outside the birmingham hippodrome where he was narrating the peaky blinders ballet “before the show we spoke at length about family music and the state of the world” recalls stone “he later drove us to the studio and recorded his verse in just a few takes the whole process was surreal and beautiful” the video to the track was produced months later “benjamin was actually quite unwell at the time” says stone “but he was determined to make the shoot we filmed his scene on a rooftop car park in birmingham’s chinatown” that was another day i’ll never forget” bomb the bass – empire with sinéad o’connor benjamin zephaniah 1995 zephaniah joined bomb the bass and sinéad o’connor to deliver a critique of colonialism in this triphopinfluenced production imagining a lifesucking vampire as a metaphor for empire tim simenon aka bomb the bass says “i remember smoking a lot of weed with sinéad while recording empire she sang the lead vocal in one take then added harmonies and backing vocals” simenon instinctively knew that zephaniah’s voice would contrast powerfully “he was such a warm open guy we spent a long day in the studio bouncing ideas around until we landed on the spacious delivery we recorded he gave the final mix an approving head nod – he was super pleased with the result we mostly spoke about music especially dub we shared a love for big youth lee ‘scratch’ perry and onu sound” lb dub corp i have a dream ft benjamin zephaniah 2013 i have a dream pairs zephaniah’s cheeky twist on martin luther king’s iconic speech with atmospheric dub techno it’s one of two tracks featuring him on luke slater’s lb dub corp album unknown origin the other being take a ride “when i reached out about combining a track with his poem i have a scheme he was up for it straight away” slater says “we somehow ended up debating vegan food in china” reflecting on their final exchange slater said “benjamin had just received the album copies i sent and told me he played the track for his students i was humbled i miss him in this dimension but his words live on” he had intended to ask him to collaborate a second time “then a week later he was gone he left too soon his words always carried a message – not always comfortable never bland his delivery cut through class barriers and reached people from all walks of life” swayzak – illegal ft benjamin zephaniah 2000 the duo swayzak captured zephaniah’s rebellious spirit in this unapologetically anarchic track “working with benjamin was an unexpected delight” says james s taylor “there was no ego no pressure just good vibes” the collaboration quickly grew into a friendship “we talked deeply about politics and the british empire” david brown says “the brummie west indian poet – quite a person to have in one’s life” a 2024 “redraft” of zephaniah’s 1999 poem illegal was released under the title do something illegal as a tribute to zephaniah under brown’s ambient alias the eightsome reel the track ends with the sound of heavy rain recorded the day brown learned of zephaniah’s death “it hit me hard – i was in east kilbride when i heard a place where he once lived” moby – where is your pride ft benjamin zephaniah 2024 released in june 2024 as part of his album always centered at night moby’s where is your pride is a tribute to zephaniah he says “as a vegan activist and as a wise and compassionate man benjamin inspired me for many years i hope where is your pride honours his legacy and also draws people’s attention to his life work and principles”",
    "summary": "Tuesday marks the 67th birthday of the late Benjamin Zephaniah – revolutionary poet, playwright, musician and fearless voice for social justice – following the inaugural Benjamin Zephaniah Day held over the weekend at Brunel University.\nEmerging from the dub poetry scene, Zephaniah channelled personal experiences of systemic racism and state violence into intelligent spoken word.\nNatty x Mala x Benjamin Zephaniah – Word & Sound (2019)Zephaniah’s Rastafari-inspired wisdom, Natty’s roots-infused minimalism and Mala’s DMZ-era dubstep combine to raise the consciousness vibration in Word & Sound – an uplifting, intergenerational union years in the making.\nAhead of the recording, Stone met Zephaniah outside the Birmingham Hippodrome, where he was narrating the Peaky Blinders ballet.\nHis delivery cut through class barriers and reached people from all walks of life.”Swayzak – Illegal (ft Benjamin Zephaniah) (2000)The duo Swayzak captured Zephaniah’s rebellious spirit in this unapologetically anarchic track.",
    "keywords": [
      "zephaniah",
      "mala",
      "delivery",
      "track",
      "barriers",
      "recorded",
      "musicians",
      "class",
      "studio",
      "music",
      "zephaniahs",
      "stone",
      "dub",
      "sound",
      "working",
      "moby",
      "benjamin",
      "cut"
    ],
    "image_url": "https://i.guim.co.uk/img/media/9e4ea3b0052114d6d510257f07010852c5426031/0_124_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ac9896b42c43cfdeb3d4a76da061b276"
  },
  "https://www.theguardian.com/p/x23djc": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x23djc",
    "date": "2025-04-19",
    "time": "16:00:43",
    "title": "Bog standard? Tokyo’s spectacular public toilets – in pictures",
    "body": "Public toilets are rarely thought of fondly – that is unless you’re talking about those in Tokyo’s Shibuya district. Commissioned in 2019, creatives including renowned architects Shigeru Ban and the late Fumihiko Maki designed 17 beautiful, functional, meticulously clean public toilets, some of which featured in Wim Wenders’s 2023 film Perfect Days. Hong Kong-based photographer Ulana Switucha came across the toilets, each unique, while working on a project about Japanese architecture in 2023, and went back to photograph them the following year. “These structures are works of art,” she says. “They shine as beacons in their urban setting and demonstrate that public design can go beyond functionality to represent cultural and artistic value.”",
    "clean_body": "public toilets are rarely thought of fondly – that is unless you’re talking about those in tokyo’s shibuya district commissioned in 2019 creatives including renowned architects shigeru ban and the late fumihiko maki designed 17 beautiful functional meticulously clean public toilets some of which featured in wim wenders’s 2023 film perfect days hong kongbased photographer ulana switucha came across the toilets each unique while working on a project about japanese architecture in 2023 and went back to photograph them the following year “these structures are works of art” she says “they shine as beacons in their urban setting and demonstrate that public design can go beyond functionality to represent cultural and artistic value”",
    "summary": "Public toilets are rarely thought of fondly – that is unless you’re talking about those in Tokyo’s Shibuya district.\nCommissioned in 2019, creatives including renowned architects Shigeru Ban and the late Fumihiko Maki designed 17 beautiful, functional, meticulously clean public toilets, some of which featured in Wim Wenders’s 2023 film Perfect Days.\nHong Kong-based photographer Ulana Switucha came across the toilets, each unique, while working on a project about Japanese architecture in 2023, and went back to photograph them the following year.\n“These structures are works of art,” she says.\n“They shine as beacons in their urban setting and demonstrate that public design can go beyond functionality to represent cultural and artistic value.”",
    "keywords": [
      "standard",
      "wim",
      "pictures",
      "toilets",
      "public",
      "wenderss",
      "spectacular",
      "tokyos",
      "2023",
      "bog",
      "youre",
      "working",
      "went",
      "value",
      "works"
    ],
    "image_url": "https://i.guim.co.uk/img/media/7acea829f96168877e0694e1bba0406eed345a5d/83_66_1917_1150/master/1917.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=3fc1533b3cc430b336e90fc090de6236"
  },
  "https://www.theguardian.com/p/x254cn": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/p/x254cn",
    "date": "2025-04-25",
    "time": "10:02:15",
    "title": "Six-way title tilts and angry Bulls: non-league stories you may have missed",
    "body": "Bury break a record\n\nSix years after Bury were expelled from the Football League, last weekend they smashed a North West Counties League record by attracting a crowd of 8,719 to Gigg Lane as they sealed the first promotion since they were reborn by thrashing Burscough 4-0, a 15th successive victory. A measure of this achievement: the previous record crowd, the 6,023 who watched FC United of Manchester lose 1-0 to Great Harwood Town, was set in April 2006 (the 5,834 that saw Bury draw 2-2 with Ramsbottom United on Boxing Day sits at No 3 on the list); only one team in non‑league football, Southend in the division above the division above the division above the division above them, have had more people at a game this season; Bury’s average attendance in the ninth tier of English football, 3,315, is bigger than that of five teams in League Two and one in League One, as well as seven in the Portuguese top flight; that record attendance was 2.7 times larger than the total attendance at the other 11 games played in their division on the final day.\n\nA couple of other familiar names with big fanbases also hope to end the season with a celebration: Scunthorpe United, with the fourth-biggest average attendance in non-league football, are two points behind Kidderminster Harriers and Brackley Town in the hunt for a single automatic promotion spot in National League North (though Brackley are at home to rock-bottom Farsley Celtic, who are on a run even sillier than Bury’s, having lost their past 17 league games), and Torquay, fifth in the attendance table, are in National League South’s wild shake-up.\n\nSix-way title tussle\n\nThe final day dawns for National League South with fully 25% of its teams capable of winning it. Truro City go into it above Torquay at the top because their goal difference is better by two (they have scored one more goal), Eastbourne Borough and Worthing are a further point back, and Boreham Wood and Dorking Wanderers are two behind them (with the division’s best and second-best goal difference respectively). Disappointingly none of the teams play any of the others on the last day, with the pick of the fixtures Truro’s against St Albans City, who need to do better than Salisbury (the two are level on points but Salisbury’s goal difference is better by one) to stay up. A few weeks ago it looked as if the title was Worthing’s to win: on 15 March they had won their past five, led the league by four and had a game in hand on every other side in the top 10. “We’re very hard to play against at the moment and I think we’re improving, we’re getting better,” their manager, Chris Agutter, said after they beat Hemel Hempstead Town that day. “We’re becoming more ruthless as well. We just need to keep working hard, and the results touch wood should keep going in the right direction.” Since then: two wins, two draws, three defeats. They end their season at Enfield, who could go down if Salisbury and St Albans win.\n\nView image in fullscreen Dorking’s Alfie Rutherford, Dan Quick of Eastbourne Borough, Matt Rush of Boreham Wood, Temi Babalola of Worthing, Jordan Dyer of Torquay, Tyler Harvey of Truro City. Composite: Guardian pictures\n\nFinest margin call\n\nAlso quite exciting: the Isthmian Premier, where the top three sides have the same number of points (wafer-thin margins here: Billericay Town lead Horsham by a single goal of goal difference, and have scored two more, with Dartford needing both to slip up; if Billericay and Horsham were to end up level on points, goal difference and goals scored, Horsham would go up on games won). While in fifth and sixth Dover Athletic and unexpected promotion contenders Chichester City, also level on points, have a playoff playoff at Oaklands.\n\nBulls vent anger\n\nThe race for the Combined Counties Premier Division South title could hardly have been more exciting going into the final round of fixtures last weekend: Jersey Bulls led Redhill on goal difference, with Whyteleafe one point behind. The Bulls, the only one of those three playing at home, had sold out Springfield Stadium for the visit of Sandhurst. But on the Friday night they were informed that they were being deducted three points and fined £120 for fielding an ineligible player in last month’s 4-0 win over Tooting & Mitcham.\n\n“We understand the frustration, the anger, and the disbelief from supporters. We feel it too,” the club said in a statement. “When we started this club, we had nothing but the dream of giving our island a football team it deserves, one that we hoped our wonderful island community would take to its hearts, and one that we knew could be successful in the English leagues. That dream is not over. We have achieved so much in such a short space of time that we must not let an error, a technicality, and a decision that is out of our hands divide us.” For most of the final afternoon Whyteleafe, who led Fleet Town from the 12th minute, were going up, only for Redhill to score a 93rd-minute winner and pip them, but still the identity of the champions is unknown. The Bulls, who also won on the final day, have submitted an appeal, saying there is “significant mitigation” concerning a “lack of clarity on the number of yellow cards” (the situation does, to be fair, sound a bit confusing: after the player picked up his 10th booking of the season he was left out for two games before returning to the team. But it turned out that one of those 10 bookings didn’t count because it came in the FA Vase, which meant he was not officially suspended until after his next one, his first after the club thought he had been suspended). The league is investigating and the playoffs – due to get under way on Saturday – have been postponed.\n\nskip past newsletter promotion Sign up to Football Daily Free daily newsletter Kick off your evenings with the Guardian's take on the world of football Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nKeeping it Real\n\nReal Bedford’s march towards inevitable Premier League glory continues, the club having long since wrapped up the Southern League Division One Central. It is the club’s third league title in the three years since they were bought by the Bedfordian, podcaster and crypto enthusiast Peter McCormack, who declared at the time that the purchase was “part of a childhood dream to own a local Bedford club” and: “I’ve always wanted to bring league football to the town … I am a Bitcoiner, we aim big.” A £3.5m investment from the Olympic rowers and crypto traders Tyler and Cameron Winklevoss, announced last year, was finalised in February, and in the first match the now co-owners attended the team beat Kings Langley 1-0 to seal promotion (on the same day Real Bedford Women beat London Seaward 11-1 to win their own second successive league title). The empire is still growing: last month McCormack gave the club a sibling town-centre cafe, Real Coffee.\n\nView image in fullscreen Real Bedford have won their third league title in as many years. Photograph: Tom Jenkins/The Guardian\n\nA goal difference of -152\n\nSpare a thought for Welton Rovers of the Western League Premier Division (but not for long), who ended with four points from 38 matches, one win and a goal difference of -152. That win was a rip-roaring 7-4 victory over St Blazey in February which ended their worst period of the season, four games which they lost by an aggregate score of 32-1. If you think you could do better, they advertised for a new first-team manager on Monday. Also spare a thought for Sittingbourne, who became only the second Isthmian South East team since 2018 (when there were two more of them, so four extra games) to reach 100 points but still won’t be rewarded with automatic promotion. That’s because the first, Ramsgate, also did it this year, and are on 108. They play each other on Saturday.",
    "clean_body": "bury break a record six years after bury were expelled from the football league last weekend they smashed a north west counties league record by attracting a crowd of 8719 to gigg lane as they sealed the first promotion since they were reborn by thrashing burscough 40 a 15th successive victory a measure of this achievement the previous record crowd the 6023 who watched fc united of manchester lose 10 to great harwood town was set in april 2006 the 5834 that saw bury draw 22 with ramsbottom united on boxing day sits at no 3 on the list only one team in non‑league football southend in the division above the division above the division above the division above them have had more people at a game this season bury’s average attendance in the ninth tier of english football 3315 is bigger than that of five teams in league two and one in league one as well as seven in the portuguese top flight that record attendance was 27 times larger than the total attendance at the other 11 games played in their division on the final day a couple of other familiar names with big fanbases also hope to end the season with a celebration scunthorpe united with the fourthbiggest average attendance in nonleague football are two points behind kidderminster harriers and brackley town in the hunt for a single automatic promotion spot in national league north though brackley are at home to rockbottom farsley celtic who are on a run even sillier than bury’s having lost their past 17 league games and torquay fifth in the attendance table are in national league south’s wild shakeup sixway title tussle the final day dawns for national league south with fully 25 of its teams capable of winning it truro city go into it above torquay at the top because their goal difference is better by two they have scored one more goal eastbourne borough and worthing are a further point back and boreham wood and dorking wanderers are two behind them with the division’s best and secondbest goal difference respectively disappointingly none of the teams play any of the others on the last day with the pick of the fixtures truro’s against st albans city who need to do better than salisbury the two are level on points but salisbury’s goal difference is better by one to stay up a few weeks ago it looked as if the title was worthing’s to win on 15 march they had won their past five led the league by four and had a game in hand on every other side in the top 10 “we’re very hard to play against at the moment and i think we’re improving we’re getting better” their manager chris agutter said after they beat hemel hempstead town that day “we’re becoming more ruthless as well we just need to keep working hard and the results touch wood should keep going in the right direction” since then two wins two draws three defeats they end their season at enfield who could go down if salisbury and st albans win view image in fullscreen dorking’s alfie rutherford dan quick of eastbourne borough matt rush of boreham wood temi babalola of worthing jordan dyer of torquay tyler harvey of truro city composite guardian pictures finest margin call also quite exciting the isthmian premier where the top three sides have the same number of points waferthin margins here billericay town lead horsham by a single goal of goal difference and have scored two more with dartford needing both to slip up if billericay and horsham were to end up level on points goal difference and goals scored horsham would go up on games won while in fifth and sixth dover athletic and unexpected promotion contenders chichester city also level on points have a playoff playoff at oaklands bulls vent anger the race for the combined counties premier division south title could hardly have been more exciting going into the final round of fixtures last weekend jersey bulls led redhill on goal difference with whyteleafe one point behind the bulls the only one of those three playing at home had sold out springfield stadium for the visit of sandhurst but on the friday night they were informed that they were being deducted three points and fined £120 for fielding an ineligible player in last month’s 40 win over tooting mitcham “we understand the frustration the anger and the disbelief from supporters we feel it too” the club said in a statement “when we started this club we had nothing but the dream of giving our island a football team it deserves one that we hoped our wonderful island community would take to its hearts and one that we knew could be successful in the english leagues that dream is not over we have achieved so much in such a short space of time that we must not let an error a technicality and a decision that is out of our hands divide us” for most of the final afternoon whyteleafe who led fleet town from the 12th minute were going up only for redhill to score a 93rdminute winner and pip them but still the identity of the champions is unknown the bulls who also won on the final day have submitted an appeal saying there is “significant mitigation” concerning a “lack of clarity on the number of yellow cards” the situation does to be fair sound a bit confusing after the player picked up his 10th booking of the season he was left out for two games before returning to the team but it turned out that one of those 10 bookings didn’t count because it came in the fa vase which meant he was not officially suspended until after his next one his first after the club thought he had been suspended the league is investigating and the playoffs – due to get under way on saturday – have been postponed skip past newsletter promotion sign up to football daily free daily newsletter kick off your evenings with the guardians take on the world of football enter your email address sign up privacy notice newsletters may contain info about charities online ads and content funded by outside parties for more information see our newsletters may contain info about charities online ads and content funded by outside parties for more information see our privacy policy we use google recaptcha to protect our website and the google privacy policy and terms of service apply after newsletter promotion keeping it real real bedford’s march towards inevitable premier league glory continues the club having long since wrapped up the southern league division one central it is the club’s third league title in the three years since they were bought by the bedfordian podcaster and crypto enthusiast peter mccormack who declared at the time that the purchase was “part of a childhood dream to own a local bedford club” and “i’ve always wanted to bring league football to the town … i am a bitcoiner we aim big” a £35m investment from the olympic rowers and crypto traders tyler and cameron winklevoss announced last year was finalised in february and in the first match the now coowners attended the team beat kings langley 10 to seal promotion on the same day real bedford women beat london seaward 111 to win their own second successive league title the empire is still growing last month mccormack gave the club a sibling towncentre cafe real coffee view image in fullscreen real bedford have won their third league title in as many years photograph tom jenkinsthe guardian a goal difference of 152 spare a thought for welton rovers of the western league premier division but not for long who ended with four points from 38 matches one win and a goal difference of 152 that win was a riproaring 74 victory over st blazey in february which ended their worst period of the season four games which they lost by an aggregate score of 321 if you think you could do better they advertised for a new firstteam manager on monday also spare a thought for sittingbourne who became only the second isthmian south east team since 2018 when there were two more of them so four extra games to reach 100 points but still won’t be rewarded with automatic promotion that’s because the first ramsgate also did it this year and are on 108 they play each other on saturday",
    "summary": "Six-way title tussleThe final day dawns for National League South with fully 25% of its teams capable of winning it.\nTruro City go into it above Torquay at the top because their goal difference is better by two (they have scored one more goal), Eastbourne Borough and Worthing are a further point back, and Boreham Wood and Dorking Wanderers are two behind them (with the division’s best and second-best goal difference respectively).\nBulls vent angerThe race for the Combined Counties Premier Division South title could hardly have been more exciting going into the final round of fixtures last weekend: Jersey Bulls led Redhill on goal difference, with Whyteleafe one point behind.\nafter newsletter promotionKeeping it RealReal Bedford’s march towards inevitable Premier League glory continues, the club having long since wrapped up the Southern League Division One Central.\nView image in fullscreen Real Bedford have won their third league title in as many years.",
    "keywords": [
      "sixway",
      "goal",
      "difference",
      "promotion",
      "league",
      "angry",
      "title",
      "nonleague",
      "points",
      "tilts",
      "missed",
      "football",
      "town",
      "division",
      "bulls",
      "games"
    ],
    "image_url": "https://i.guim.co.uk/img/media/779b3b3c80b783ca5f3b14fee45b1977fa3871c3/0_136_2048_1229/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6a0e083046cace1d89df2a0ffc478743"
  },
  "https://www.theguardian.com/theobserverarchive": {
    "source": "The Guardian",
    "url": "https://www.theguardian.com/theobserverarchive",
    "date": "2025-04-21",
    "time": "00:00:00",
    "title": "The Observer archive",
    "body": "One day, life as a finance consultant stopped making sense for Peter Hahn, so he took to organic winegrowing in the Loire instead. He talks to Genevieve Fox",
    "clean_body": "one day life as a finance consultant stopped making sense for peter hahn so he took to organic winegrowing in the loire instead he talks to genevieve fox",
    "summary": "One day, life as a finance consultant stopped making sense for Peter Hahn, so he took to organic winegrowing in the Loire instead.\nHe talks to Genevieve Fox",
    "keywords": [
      "talks",
      "stopped",
      "organic",
      "life",
      "winegrowing",
      "sense",
      "loire",
      "making",
      "observer",
      "took",
      "archive",
      "peter"
    ],
    "image_url": "https://assets.guim.co.uk/static/frontend/icons/homescreen/apple-touch-icon.svg"
  }
}