{
  "https://www.nytimes.com/wirecutter/reviews/best-concealers/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/reviews/best-concealers/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "The Best Concealers",
    "body": "Under $15\n\nCovergirl Clean Invisible Concealer had decent coverup, but only offered 12 shades.\n\nWhile E.L.F. 16HR Camo Concealer came in 24 hues at the time of testing, its oversized wand was unwieldy, and it had a powdery, dull finish.\n\nMakeup Revolution IRL Filter Finish Concealer had weak coverage, a streaky finish, and a narrow shade range.\n\nWe were let down by a drugstore-favorite, Maybelline Instant Age Rewind Eraser Multi-Use Concealer, which provided so-so coverage, dried cakey, and settled into fine lines. Its twisting sponge applicator was also a pain to use. And its shade range had big jumps, particularly frustrating our panelists with deeper skin tones.\n\n$16 to $34\n\nThe dry, very matte Benefit Boi-ing Cakeless Concealer was hard to move around and looked patchy on the skin.\n\nCharlotte Tilbury Beautiful Skin Radiant Concealer had a glimmering, light-reflecting finish, but also deposited teeny, glitter-like particulates across the skin.\n\nKnown for its inclusive shade range, Fenty Beauty We’re Even Hydrating Longwear Concealer looked simultaneously dry and patchy under the eyes and shiny in the T-zone. Its white plastic top and tippy, angled bottom also looked cheap, given the price.\n\nSlick Glossier Stretch Balm Concealer seemed to highlight tiny under-eye bumps.\n\nThe too-big wand for Haus Labs Triclone Skin Tech Hydrating + De-puffing Concealer had to be tugged out and jammed back in the tube, and the formula caked.\n\nEven though Ilia True Skin Serum Concealer slid on easily, it dried with creasing.\n\nIronically, It Cosmetics Bye Bye Under Eye Concealer did a much better job at covering redness than under-eye circles. Distinctively thick and tacky, it was more challenging to blend, and its finish tended to be a bit shiny. While its shade range included 24 hues, it didn’t increase gradually for deeper skin tones, and neither of our panelists on that end of the spectrum could find shades that matched them.\n\nBeloved for lighter skin tones, Laura Mercier Real Flawless Weightless Perfecting Concealer has smooth matte coverage, but its price per weight was high compared with similarly performing products.\n\nMany testers found that the lightweight Lancôme Teint Idole Concealer required multiple layers for effective coverage, its applicator head was the “bulkiest,” and it didn’t have much staying power.\n\nNatural-looking Make Up For Ever HD Concealer had solid, buildable coverage, but it was not exceptional enough to justify its high price versus other concealers that we advanced to panel testing.\n\nMilk Makeup Future Fluid Concealer had a tacky, difficult-to-spread consistency and a powdery, drying finish.\n\nThe thick consistency of Nars Soft Matte Complete Concealer required more-expert makeup application, and most panelists found the mattifying effects emphasized creases. But it was the favorite of a 20-something with combo skin who loved the texture and found that it “toned down oiliness.\"\n\nPat McGrath Labs Skin Fetsh: Sublime Perfection Full Coverage Concealer had a thick formula that covered redness quite well, but it was also slightly drying and quite pricey for its weight.\n\nEven though Tarte Shape Tape Full-Coverage Concealer was the most full coverage in its line, which also includes medium-coverage and creamy variants, panelists found it didn’t cover under-eye circles particularly well. And its sticky consistency tended to cake for most testers. It did, however, effectively cover a birthmark in one layer.\n\nCreamy Tower 28 Swipe Serum Concealer provided solid under-eye coverage, and most testers appreciated the doe-foot applicator’s flexibility and tiny head, but it didn’t perform well in obscuring redness.\n\n$35 and up\n\nThe glamorous Armani Beauty Luminous Silk Hydrating & Brightening Concealer had a glimmering finish that just looked expensive, but its longevity was “mediocre.” And one of our testers was very frustrated that Armani didn’t offer deeper shades in more undertone options.\n\nA cult-favorite and go-to for supervising beauty editor Hannah Morrill, Clé de Peau Concealer SPF 27 provides excellent matte coverage in a single swipe. But its sky-high price and limited shade range kept it from advancing to panel testing.\n\nThough Givenchy Prisme Libre Skin-Caring Concealer and pricier-by-weight Estée Lauder Futurist Soft Touch Brightening Skincealer both blended smoothly and provided good coverage, they also creased or settled into fine lines for half of our panelists as the day progressed. Many also found the Givenchy concealer’s larger applicator head to be clunky.\n\nEncased in a “sexy” frosted, tapered bottle, Hourglass Vanish Airbrush Concealer knocked it out of the park in longevity and coverage for all targeted areas. But panelists balked when asked if they’d buy it themselves.\n\nFor no-makeup makeup girlies, dewy RMS Beauty UnCoverup Concealer did indeed leave a glowy finish, but the price per weight was quite high.\n\nToo Faced Born This Way Super Coverage Multi-Use Concealer had a tacky, difficult-to-spread consistency and also slightly emphasized skin texture.\n\nMore of a highlighter, exorbitantly priced Yves St Laurent Touche Éclat Awakening Concealer Click Pen doesn’t offer much coverage, and its click-pen applicator took a lot of clicking to get going and then released too much product all at once.\n\nThis article was edited by Hannah Morrill and Jennifer Hunter.",
    "clean_body": "under 15 covergirl clean invisible concealer had decent coverup but only offered 12 shades while elf 16hr camo concealer came in 24 hues at the time of testing its oversized wand was unwieldy and it had a powdery dull finish makeup revolution irl filter finish concealer had weak coverage a streaky finish and a narrow shade range we were let down by a drugstorefavorite maybelline instant age rewind eraser multiuse concealer which provided soso coverage dried cakey and settled into fine lines its twisting sponge applicator was also a pain to use and its shade range had big jumps particularly frustrating our panelists with deeper skin tones 16 to 34 the dry very matte benefit boiing cakeless concealer was hard to move around and looked patchy on the skin charlotte tilbury beautiful skin radiant concealer had a glimmering lightreflecting finish but also deposited teeny glitterlike particulates across the skin known for its inclusive shade range fenty beauty we’re even hydrating longwear concealer looked simultaneously dry and patchy under the eyes and shiny in the tzone its white plastic top and tippy angled bottom also looked cheap given the price slick glossier stretch balm concealer seemed to highlight tiny undereye bumps the toobig wand for haus labs triclone skin tech hydrating depuffing concealer had to be tugged out and jammed back in the tube and the formula caked even though ilia true skin serum concealer slid on easily it dried with creasing ironically it cosmetics bye bye under eye concealer did a much better job at covering redness than undereye circles distinctively thick and tacky it was more challenging to blend and its finish tended to be a bit shiny while its shade range included 24 hues it didn’t increase gradually for deeper skin tones and neither of our panelists on that end of the spectrum could find shades that matched them beloved for lighter skin tones laura mercier real flawless weightless perfecting concealer has smooth matte coverage but its price per weight was high compared with similarly performing products many testers found that the lightweight lancôme teint idole concealer required multiple layers for effective coverage its applicator head was the “bulkiest” and it didn’t have much staying power naturallooking make up for ever hd concealer had solid buildable coverage but it was not exceptional enough to justify its high price versus other concealers that we advanced to panel testing milk makeup future fluid concealer had a tacky difficulttospread consistency and a powdery drying finish the thick consistency of nars soft matte complete concealer required moreexpert makeup application and most panelists found the mattifying effects emphasized creases but it was the favorite of a 20something with combo skin who loved the texture and found that it “toned down oiliness pat mcgrath labs skin fetsh sublime perfection full coverage concealer had a thick formula that covered redness quite well but it was also slightly drying and quite pricey for its weight even though tarte shape tape fullcoverage concealer was the most full coverage in its line which also includes mediumcoverage and creamy variants panelists found it didn’t cover undereye circles particularly well and its sticky consistency tended to cake for most testers it did however effectively cover a birthmark in one layer creamy tower 28 swipe serum concealer provided solid undereye coverage and most testers appreciated the doefoot applicator’s flexibility and tiny head but it didn’t perform well in obscuring redness 35 and up the glamorous armani beauty luminous silk hydrating brightening concealer had a glimmering finish that just looked expensive but its longevity was “mediocre” and one of our testers was very frustrated that armani didn’t offer deeper shades in more undertone options a cultfavorite and goto for supervising beauty editor hannah morrill clé de peau concealer spf 27 provides excellent matte coverage in a single swipe but its skyhigh price and limited shade range kept it from advancing to panel testing though givenchy prisme libre skincaring concealer and pricierbyweight estée lauder futurist soft touch brightening skincealer both blended smoothly and provided good coverage they also creased or settled into fine lines for half of our panelists as the day progressed many also found the givenchy concealer’s larger applicator head to be clunky encased in a “sexy” frosted tapered bottle hourglass vanish airbrush concealer knocked it out of the park in longevity and coverage for all targeted areas but panelists balked when asked if they’d buy it themselves for nomakeup makeup girlies dewy rms beauty uncoverup concealer did indeed leave a glowy finish but the price per weight was quite high too faced born this way super coverage multiuse concealer had a tacky difficulttospread consistency and also slightly emphasized skin texture more of a highlighter exorbitantly priced yves st laurent touche éclat awakening concealer click pen doesn’t offer much coverage and its clickpen applicator took a lot of clicking to get going and then released too much product all at once this article was edited by hannah morrill and jennifer hunter",
    "summary": "Makeup Revolution IRL Filter Finish Concealer had weak coverage, a streaky finish, and a narrow shade range.\nAnd its shade range had big jumps, particularly frustrating our panelists with deeper skin tones.\nCharlotte Tilbury Beautiful Skin Radiant Concealer had a glimmering, light-reflecting finish, but also deposited teeny, glitter-like particulates across the skin.\nKnown for its inclusive shade range, Fenty Beauty We’re Even Hydrating Longwear Concealer looked simultaneously dry and patchy under the eyes and shiny in the T-zone.\nBut its sky-high price and limited shade range kept it from advancing to panel testing.",
    "keywords": [
      "testers",
      "finish",
      "concealer",
      "shade",
      "didnt",
      "range",
      "undereye",
      "coverage",
      "concealers",
      "best",
      "panelists",
      "skin"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2025/01/BEST-CONCEALERS-2048px-9269-2x1-1.jpg?auto=webp&quality=75&crop=1.91:1&width=1200"
  },
  "https://www.nytimes.com/wirecutter/reviews/best-tablecloths/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/reviews/best-tablecloths/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "The Best Tablecloths",
    "body": "We focused only on tablecloths made from natural fibers. The most common and affordable natural-fiber table linens are made from cotton. Prices vary depending on the quality of the fiber, the construction, and sometimes the name brand. Cotton linens generally have the smooth, polished look of tablecloths you’d see in a fine-dining restaurant.\n\nLinen is also a great material for tablecloths. Made from the fibers of the flax plant, linen is absorbent and has a more-relaxed drape than cotton. Threads spun from flax fibers are thicker than cotton, and the result is the distinct, visible woven texture that linen goods are known for.\n\nQuality craftsmanship and thoughtful details separate good tablecloths from great ones. Hems with clean, straight stitching and minimal puckering are a sign of a well-made product. Deep hems measuring at least 1 inch and mitered corners on square or rectangular shapes add weight to the drape and give tablecloths a polished drop. But round and oval tablecloths should be finished with a narrower hem, about ¼ inch or ⅜ inch, to avoid puckering.\n\n“Puckering” describes the little ripples that appear along the hemline of a tablecloth after it’s laundered. This can happen if the fabric and thread shrink at different rates, the stitch tension is too tight, or the fabric wasn’t laundered before sewing. All of the tablecloths we’ve tested have puckered at various rates, but the worst offenders came out of the wash with rippled and fluttered hems that were impossible to iron flat.\n\nWe looked for tablecloths that are available in multiple sizes and shapes. Dining tables come in many sizes and shapes (square, rectangle, oval, and square). We set out to find the most attractive, high-quality tablecloths that come in a variety of cuts and dimensions.\n\nMeasure your dining table, and then add 20 to 24 inches to the length to account for an appropriate drop. Or you can use this Williams Sonoma chart. Keep in mind that all table linens made from natural fibers will shrink after laundering, about 5% in length and 3% in width. So if you’re worried about a tablecloth’s drop becoming too short after laundering, be safe and go up a size.\n\nTo test durability, we washed, dried, and pressed the tablecloths with a steam iron. We examined the fabric for pilling and the hems for puckering and fraying. We also measured each piece to gauge shrinkage after laundering. Any natural-fiber tablecloth will shrink some after the first wash.\n\nWe also looked at how attractive they were while in use. We draped the tablecloths over countertops, desks, and tables to examine the drape and drop of each one.",
    "clean_body": "we focused only on tablecloths made from natural fibers the most common and affordable naturalfiber table linens are made from cotton prices vary depending on the quality of the fiber the construction and sometimes the name brand cotton linens generally have the smooth polished look of tablecloths you’d see in a finedining restaurant linen is also a great material for tablecloths made from the fibers of the flax plant linen is absorbent and has a morerelaxed drape than cotton threads spun from flax fibers are thicker than cotton and the result is the distinct visible woven texture that linen goods are known for quality craftsmanship and thoughtful details separate good tablecloths from great ones hems with clean straight stitching and minimal puckering are a sign of a wellmade product deep hems measuring at least 1 inch and mitered corners on square or rectangular shapes add weight to the drape and give tablecloths a polished drop but round and oval tablecloths should be finished with a narrower hem about ¼ inch or ⅜ inch to avoid puckering “puckering” describes the little ripples that appear along the hemline of a tablecloth after it’s laundered this can happen if the fabric and thread shrink at different rates the stitch tension is too tight or the fabric wasn’t laundered before sewing all of the tablecloths we’ve tested have puckered at various rates but the worst offenders came out of the wash with rippled and fluttered hems that were impossible to iron flat we looked for tablecloths that are available in multiple sizes and shapes dining tables come in many sizes and shapes square rectangle oval and square we set out to find the most attractive highquality tablecloths that come in a variety of cuts and dimensions measure your dining table and then add 20 to 24 inches to the length to account for an appropriate drop or you can use this williams sonoma chart keep in mind that all table linens made from natural fibers will shrink after laundering about 5 in length and 3 in width so if you’re worried about a tablecloth’s drop becoming too short after laundering be safe and go up a size to test durability we washed dried and pressed the tablecloths with a steam iron we examined the fabric for pilling and the hems for puckering and fraying we also measured each piece to gauge shrinkage after laundering any naturalfiber tablecloth will shrink some after the first wash we also looked at how attractive they were while in use we draped the tablecloths over countertops desks and tables to examine the drape and drop of each one",
    "summary": "Cotton linens generally have the smooth, polished look of tablecloths you’d see in a fine-dining restaurant.\nDining tables come in many sizes and shapes (square, rectangle, oval, and square).\nWe set out to find the most attractive, high-quality tablecloths that come in a variety of cuts and dimensions.\nSo if you’re worried about a tablecloth’s drop becoming too short after laundering, be safe and go up a size.\nWe draped the tablecloths over countertops, desks, and tables to examine the drape and drop of each one.",
    "keywords": [
      "table",
      "hems",
      "shapes",
      "cotton",
      "linens",
      "fibers",
      "shrink",
      "best",
      "tablecloths",
      "drop",
      "square"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2025/02/BEST-TABLECLOTH-2048px-6966-2x1-1.jpg?auto=webp&quality=75&crop=1.91:1&width=1200"
  },
  "https://www.nytimes.com/wirecutter/reviews/best-moisturizers/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/reviews/best-moisturizers/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "The Best Moisturizers",
    "body": "Michael Murtaugh/NYT Wirecutter Michael Murtaugh/NYT Wirecutter; prop styling by Andrea Bonin Michael Murtaugh/NYT Wirecutter\n\nVanicream Daily Facial Moisturizer is a go-to for dermatologists and sensitive skin types alike, thanks to its blend of humectants, such as hyaluronic acid and glycerin, and emollients, like ceramides and squalane. It absorbs readily, leaves skin plumped, and even softens the appearance of fine lines, however temporarily. The packaging isn’t charming, but none of our testers could deny its efficacy.\n\nIt boasts no-nonsense ingredients. While many of the moisturizers we considered had more than 50 ingredients, Vanicream moisturizer’s lean and mean 19 includes the derm-anointed all-stars we looked for: squalane, glycerin, glycol, hyaluronic acid, and five different ceramides. Also, it notably lacks common chemical irritants like fragrances, dyes, lanolin, parabens, and formaldehyde releasers. The fine-tuned ingredient panel leaves little room for irritation, and none of our eight testers—even those with sensitive skin—reported any issues.\n\nThe packaging is dismal, but the texture is sublime. Inside the meh plastic tube is an absolutely breathtaking formula. “The silky texture could easily pass for Chanel,” noted one panelist, who even considered decanting it into a more vanity-worthy jar. Medium-weight and highly emollient, the cream glides on effortlessly, absorbs beautifully, and works well under makeup (several options we tested, like one from EltaMD, either pilled or repelled cosmetics). Most compellingly, it leaves our skin softer than moisturizers costing 10 times as much.\n\nIt’s easy to work this cream into a skin-care routine. Even panelists who didn’t have sensitive skin appreciated Vanicream moisturizer for another reason: its layerability. A tester working a prescription tretinoin back into her routine after pregnancy found it was an ideal base layer to prevent the initial skin flare-up she was expecting. Some of the creams we tested had nearly a hundred ingredients, like Clé de Peau (84). More ingredients means more chances for reactivity, especially when paired with compounds like vitamin C, retinol, and alpha hydroxy acids (AHA). Vanicream moisturizer keeps it basic, in the best way.\n\nFlaws but not dealbreakers",
    "clean_body": "michael murtaughnyt wirecutter michael murtaughnyt wirecutter prop styling by andrea bonin michael murtaughnyt wirecutter vanicream daily facial moisturizer is a goto for dermatologists and sensitive skin types alike thanks to its blend of humectants such as hyaluronic acid and glycerin and emollients like ceramides and squalane it absorbs readily leaves skin plumped and even softens the appearance of fine lines however temporarily the packaging isn’t charming but none of our testers could deny its efficacy it boasts nononsense ingredients while many of the moisturizers we considered had more than 50 ingredients vanicream moisturizer’s lean and mean 19 includes the dermanointed allstars we looked for squalane glycerin glycol hyaluronic acid and five different ceramides also it notably lacks common chemical irritants like fragrances dyes lanolin parabens and formaldehyde releasers the finetuned ingredient panel leaves little room for irritation and none of our eight testers—even those with sensitive skin—reported any issues the packaging is dismal but the texture is sublime inside the meh plastic tube is an absolutely breathtaking formula “the silky texture could easily pass for chanel” noted one panelist who even considered decanting it into a more vanityworthy jar mediumweight and highly emollient the cream glides on effortlessly absorbs beautifully and works well under makeup several options we tested like one from eltamd either pilled or repelled cosmetics most compellingly it leaves our skin softer than moisturizers costing 10 times as much it’s easy to work this cream into a skincare routine even panelists who didn’t have sensitive skin appreciated vanicream moisturizer for another reason its layerability a tester working a prescription tretinoin back into her routine after pregnancy found it was an ideal base layer to prevent the initial skin flareup she was expecting some of the creams we tested had nearly a hundred ingredients like clé de peau 84 more ingredients means more chances for reactivity especially when paired with compounds like vitamin c retinol and alpha hydroxy acids aha vanicream moisturizer keeps it basic in the best way flaws but not dealbreakers",
    "summary": "It absorbs readily, leaves skin plumped, and even softens the appearance of fine lines, however temporarily.\nWhile many of the moisturizers we considered had more than 50 ingredients, Vanicream moisturizer’s lean and mean 19 includes the derm-anointed all-stars we looked for: squalane, glycerin, glycol, hyaluronic acid, and five different ceramides.\nMost compellingly, it leaves our skin softer than moisturizers costing 10 times as much.\nEven panelists who didn’t have sensitive skin appreciated Vanicream moisturizer for another reason: its layerability.\nVanicream moisturizer keeps it basic, in the best way.",
    "keywords": [
      "wirecutter",
      "moisturizer",
      "moisturizers",
      "michael",
      "vanicream",
      "murtaughnyt",
      "leaves",
      "best",
      "ingredients",
      "skin",
      "sensitive"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2025/03/BEST-FACIAL-MOISTURIZERS-SUB-2048px-1190-2x1-1.jpg?auto=webp&quality=75&crop=1.91:1&width=1200"
  },
  "https://www.nytimes.com/column/sidebar": {
    "source": "NYT",
    "url": "https://www.nytimes.com/column/sidebar",
    "date": "unknown",
    "time": "00:00:00",
    "title": "",
    "body": "",
    "clean_body": "",
    "summary": "",
    "keywords": [],
    "image_url": ""
  },
  "https://www.nytimes.com/column/playlist": {
    "source": "NYT",
    "url": "https://www.nytimes.com/column/playlist",
    "date": "unknown",
    "time": "00:00:00",
    "title": "",
    "body": "",
    "clean_body": "",
    "summary": "",
    "keywords": [],
    "image_url": ""
  },
  "https://www.nytimes.com/wirecutter/sleep/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/sleep/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "Sleep",
    "body": "Sleep\n\nGreat sleep shouldn’t be elusive. Our team of sleep and bedding experts spends hundreds of hours each year researching and testing everything from mattresses to sheets to sleep-tracking apps designed to help you get more shut-eye. Here you’ll find our best recommendations, including advice on ways to optimize your habits for better sleep.",
    "clean_body": "sleep great sleep shouldn’t be elusive our team of sleep and bedding experts spends hundreds of hours each year researching and testing everything from mattresses to sheets to sleeptracking apps designed to help you get more shuteye here you’ll find our best recommendations including advice on ways to optimize your habits for better sleep",
    "summary": "SleepGreat sleep shouldn’t be elusive.\nOur team of sleep and bedding experts spends hundreds of hours each year researching and testing everything from mattresses to sheets to sleep-tracking apps designed to help you get more shut-eye.\nHere you’ll find our best recommendations, including advice on ways to optimize your habits for better sleep.",
    "keywords": [
      "youll",
      "team",
      "shuteye",
      "spends",
      "sleeptracking",
      "sleepgreat",
      "shouldnt",
      "testing",
      "ways",
      "sleep"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2020/12/wc_og_general.png?auto=webp&quality=75&crop=1.91:1&width=1200"
  },
  "https://www.nytimes.com/reviews/dining": {
    "source": "NYT",
    "url": "https://www.nytimes.com/reviews/dining",
    "date": "unknown",
    "time": "00:00:00",
    "title": "New York Restaurant Reviews",
    "body": "Le Veau d’Or\n\nNYT Critic’s Pick\n\n2 star\n\nFrench\n\n$$$$\n\nUpper East Side\n\nThis second coming of the famed French bistro Le Veau d’Or from the dynamic restaurateurs Riad Nasr and Lee Hanson excels in many ways: The food is well executed, the wines are fun and the dining room exudes warmth and charm. At times, though, the restaurant is caught between the desire to restore the old Veau d’Or just as it was and the realities of this dining era\n\nBy Priya Krishna",
    "clean_body": "le veau d’or nyt critic’s pick 2 star french upper east side this second coming of the famed french bistro le veau d’or from the dynamic restaurateurs riad nasr and lee hanson excels in many ways the food is well executed the wines are fun and the dining room exudes warmth and charm at times though the restaurant is caught between the desire to restore the old veau d’or just as it was and the realities of this dining era by priya krishna",
    "summary": "Le Veau d’OrNYT Critic’s Pick2 starFrench$$$$Upper East SideThis second coming of the famed French bistro Le Veau d’Or from the dynamic restaurateurs Riad Nasr and Lee Hanson excels in many ways: The food is well executed, the wines are fun and the dining room exudes warmth and charm.\nAt times, though, the restaurant is caught between the desire to restore the old Veau d’Or just as it was and the realities of this dining eraBy Priya Krishna",
    "keywords": [
      "york",
      "warmth",
      "reviews",
      "sidethis",
      "times",
      "starfrenchupper",
      "veau",
      "le",
      "dining",
      "restaurant",
      "dor",
      "ways",
      "wines"
    ],
    "image_url": "https://www.nytimes.com/reviews/restaurant review, New York restaurants, NY restaurants, Brooklyn restaurants, Manhattan dining search, queens neighborhood joints, Bronx places to eat"
  },
  "https://www.nytimes.com/wirecutter/reviews/23andme-data-bankrupt/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/reviews/23andme-data-bankrupt/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "23andMe Just Filed for Bankruptcy. You Should Delete Your Data Now.",
    "body": "“Genetic data is immutable and can reveal very personal details about you and your family members,” the Electronic Frontier Foundation cautioned in a blog post about 23andMe’s potential sale last year. If your relatives have used 23andMe in the past, your data is also at risk.\n\nBecause some DNA is passed on from parent to child, there’s a strong correlation between the genetic material of people within the same family. If anyone in your family has provided a genetic sample to 23andMe (or another DNA test kit maker), the company already knows something about you—even if you’ve never personally given them your data. If you know that a relative has used 23andMe, consider reaching out to ask them to delete their data.\n\nThe privacy concerns of giving a company your genetic information are not theoretical and are not exclusive to 23andMe. Law enforcement officers have used genetic profiles from home DNA kit companies in the past. In a 2018 case, law enforcement used a combination of genetic profiles from GEDmatch along with carefully constructed family trees to identify a murderer after 40 years.\n\nBoth Wirecutter and the EFF noted that 23andMe does not voluntarily share data with law enforcement and requires a warrant before providing any data on its customers.\n\nMany of 23andMe’s customers have used the service to discover long-lost relatives or piece together family history that might have otherwise remained unknown. It’s unfortunate that the company’s data-security practices and now-uncertain future may undermine those discoveries.\n\nThis article was edited by Caitlin McGarry and Erica Ogg.",
    "clean_body": "“genetic data is immutable and can reveal very personal details about you and your family members” the electronic frontier foundation cautioned in a blog post about 23andme’s potential sale last year if your relatives have used 23andme in the past your data is also at risk because some dna is passed on from parent to child there’s a strong correlation between the genetic material of people within the same family if anyone in your family has provided a genetic sample to 23andme or another dna test kit maker the company already knows something about you—even if you’ve never personally given them your data if you know that a relative has used 23andme consider reaching out to ask them to delete their data the privacy concerns of giving a company your genetic information are not theoretical and are not exclusive to 23andme law enforcement officers have used genetic profiles from home dna kit companies in the past in a 2018 case law enforcement used a combination of genetic profiles from gedmatch along with carefully constructed family trees to identify a murderer after 40 years both wirecutter and the eff noted that 23andme does not voluntarily share data with law enforcement and requires a warrant before providing any data on its customers many of 23andme’s customers have used the service to discover longlost relatives or piece together family history that might have otherwise remained unknown it’s unfortunate that the company’s datasecurity practices and nowuncertain future may undermine those discoveries this article was edited by caitlin mcgarry and erica ogg",
    "summary": "“Genetic data is immutable and can reveal very personal details about you and your family members,” the Electronic Frontier Foundation cautioned in a blog post about 23andMe’s potential sale last year.\nIf your relatives have used 23andMe in the past, your data is also at risk.\nIf you know that a relative has used 23andMe, consider reaching out to ask them to delete their data.\nLaw enforcement officers have used genetic profiles from home DNA kit companies in the past.\nBoth Wirecutter and the EFF noted that 23andMe does not voluntarily share data with law enforcement and requires a warrant before providing any data on its customers.",
    "keywords": [
      "profiles",
      "used",
      "relatives",
      "23andme",
      "data",
      "genetic",
      "dna",
      "delete",
      "family",
      "enforcement",
      "law",
      "filed",
      "bankruptcy"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2025/03/ADVICE-DELETE-23ANDME-2048px-2x1-1.jpg?auto=webp&quality=75&crop=1.91:1&width=1200"
  },
  "https://www.nytimes.com/wirecutter/reviews/best-potato-chips/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/reviews/best-potato-chips/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "The Best Potato Chips",
    "body": "Michael Murtaugh/NYT Wirecutter; food styling by Maggie Ruggiero\n\nPlain potato chips\n\nMost of our panel liked Herr’s Crisp ’N Tasty Potato Chips for their golden color and good potato flavor but found them to be blander and less light and crispy than some of our picks.\n\n365 by Whole Foods Organic Sea Salt Potato Chips had an earthy potato flavor most tasters liked, but not as much as our picks. They looked earthy, too: large, flat, pale chips with a wisp of potato skin at the edges.\n\nSal de Ibiza Chips from Spain were one of the only imported chips our panel liked. These large, sunny chips had a great flavor and were very crispy, but most felt they were just a little too greasy.\n\nMost tasters liked these smaller, thin and crunchy Market Pantry Classic Potato Chips made for Target but didn’t consider them a favorite, noting that they had a slightly darker flavor and color than many of our picks and a slightly more oily flavor.\n\nMost tasters really liked Lay’s Classic Potato Chips, noting a big crunch and balanced salt-and-potato flavor, but several noted the taste felt subdued compared with that of our picks.\n\nWalker’s Legendary Ready Salted Potato Chips, imported from the United Kingdom, garnered a very similar reaction. (Both brands are owned by PepsiCo.)\n\nWe liked the potato flavor of Wise Snacks Golden Original Potato Chips—darker-brown chips that are on the smaller side and salty—but they were a little oilier than most.\n\nHerr’s Crisp ’N Tasty Potato Chips had a nice, toasted, oven-fried potato flavor, but the salt was unevenly applied.\n\nSome tasters thought Trader Joe’s Ode to the Classic Potato Chip were pale and tasted slightly stale, though they had a nutty, balanced flavor and snappy texture.\n\nOur panel found that Old Dutch Original Potato Chips had a dense, too-dry texture and some vegetal off-flavors, and they needed more salt.\n\nMartin’s Sea Salted Potato Chips are made with shortening instead of vegetable oil, and our panel did not like their starchy, powdery texture. A few tasters also noticed bitter off-flavors.\n\nTasters did not like Whole Foods Organic potato chips, which had some green spots in addition to thicker pieces of potato peel, and stale, rancid flavors.\n\nBoth Gibble’s Original Potato Chips and Kay & Ray’s Premium Potato Chips, also made by Gibble’s, are fried in lard, and even tasters that like our old-fashioned picks found the aftertaste of the animal fat unpleasant.\n\nMiddleswarth Potato Chips are also made with lard. Several tasters liked these chips but said that the flavor, reminiscent of fast-food french fries, wasn’t suited to a plain potato chip.\n\nWe dismissed Better Made Special Original Potato Chips, which had an unpleasantly strong oil flavor that was almost porky, even though they are not made with lard.\n\nSterzing’s Potato Chips, a regional brand from Iowa, tasted like older, musty oil.\n\nSnyder of Berlin Original Potato Chips were light and crisp, though some tasters found the oil a little rancid.\n\nThe batch of Spain’s Bonilla a La Vista chips we tried had rancid oil flavors, which surprised us—multiple tasters on the panel had tried these beautiful, sunny chips in the past and loved them. We recommend them in several gift guides for that reason and for the fun factor of receiving a big tin of chips as a gift. But because of the potential for stale chips, we couldn’t make them a pick in this guide.\n\nTorres Extra Virgin Olive Oil potato chips had rancid, off-flavors. We also sampled Torres Selecta Mediterranean Sea Salt chips, which tasted bland and stale. But our tasters thought both looked beautiful.\n\nSuperbon Chips de Madrid from Spain and San Carlo Classic Potato Chips from Italy were also bland and stale, with starchy aftertastes.\n\nWe had wanted to try Clover Valley Classic Potato Chips, sold at Dollar General, and Snack Day Original Potato Chips, sold at Aldi, but both were out of stock during our tasting. And chips from Charles Chips arrived too late for us to include them in our test.\n\nKettle-style potato chips\n\nWe liked the toasty, deep-fried flavor and light texture of Clancy’s Original Kettle Chips, which had savory, almost meaty overtones, but we didn’t find them to be as appealing as our top picks.\n\nMost tasters found Zapp’s New Orleans Kettle Style Regular Flavor chips to be nicely crunchy and balanced in flavor, if somewhat average.\n\nGreat Value Kettle Cooked Original Potato Chips were a nice golden brown and very crunchy, with a fried potato flavor similar to that of fast-food french fries. But some found that flavor lingered too long.\n\nA few tasters liked the heavy crunch and savory, oily flavor of Tim’s Cascade Snacks Cascade Style Potato Chips with Sea Salt, but several thought these dark-tan chips had lingering flavors that were borderline unpleasant.\n\nUtz Kettle Classics Original were a little on the oily side but fresh-tasting and light, with good potato flavor. But some thought they were too soft.\n\nMy Dad’s Chips Homestyle Potato Chips were polarizing. Some tasters absolutely loved this chip’s dark russet color, extra saltiness, deep crunch, oily sheen, and toasty, long-fried flavor, especially with dip. Others felt they were a little too salty.\n\nThe darkly fried, oily Good & Gather Kettle Cooked Sea Salt Potato Chips reminded tasters of latkes, but several thought they tasted overcooked, or even slightly bitter.\n\nMiss Vickie’s Sea Salt Chips were also among the darkest chips we tasted. Though they had good flavor and texture, we found them to be too greasy, and some chips tasted stale.\n\nWe did not enjoy Kettle Brand Sea Salt Potato Chips, which tasted stale and even scorched, with a strong aftertaste and unpleasant mouthfeel.\n\nWe appreciated the mission of Uglies Sea Salt Kettle Potato Chips—to use potatoes rejected for use by other chip makers—but did not love the end results. Some chips had unpleasant earthy, stale, or moldy flavors and a strong aftertaste of green potato.\n\nCape Cod Kettle Cooked Potato Chips Original had a sweet-potato flavor and greasy crunch that many liked, but some tasted scorched oil.\n\nMartin’s Kettle Cook’d Hand Cooked Potato Chips are fried in shortening instead of vegetable oil, and our panel did not like their bitter off-flavors and softer texture.\n\nWe mostly liked Dirty Kettle Style Potato Chips, which are golden brown and taste and feel a little oily. The flavor wasn’t hugely potatoey, but the chips were satisfying. Although, a few found they had a slightly unpleasant aftertaste.\n\nKettle-style Pipers Angelsley Sea Salt Crisps were oily yet bland, and undersalted.\n\nWise Snacks New York Deli Kettle Cooked Potato Chips were noticeably harder than other chips, which many tasters didn’t like, and on the oily side. The potato flavor was earthy and toasty, though some tasters detected a stale or even fishy aftertaste.\n\nWe did not like 365 by Whole Foods Market Sea Salt Kettle Chips, which were stale, lacking in flavor, and strangely hard.\n\nWe also did not like Siete Kettle Cooked Potato Chips, which are fried in avocado oil. Tasters noted they tasted like dirt, plastic, or scorched oil, were too soft, and had a bad aftertaste.\n\nTrader Joe’s Kettle Cooked Olive Oil Potato Chips also tasted of scorched oil and had an unpleasant buttery aftertaste.\n\nGreat Lakes Potato Chip Co. Kettle Cooked Original Potato Chips had a good flavor and were super crunchy, but some found they had starchy notes that were unpleasant.\n\nHal’s New York Kettle Chips Original Sea Salt were pale and stale, and several chips also had flecks of green potato, which tend to taste bad.\n\nNorth Fork Potato Chips were also small, pale, and stale.\n\nWe did not like Rusty’s Chips Sea Salt Potato Chips. Dark orange, and extremely oily, they tasted stale and were thick and dry.\n\nWe had wanted to taste Clover Valley Original Kettle Potato Chips, sold at Dollar General, but they were out of stock during our tasting.\n\nWavy and rippled chips\n\nTasters thought Ruffles Original had great flavor, a good crunch, and stood up to dipping, but they were not as well-liked as our picks. They’re also very salty.\n\nUtz Ripples Original Potato Chips and Utz Wavy Original Potato Chips were well balanced, with a good salt level, sturdiness, and potato flavor, but some said they were subtler than our picks.\n\nHerr’s Ripples Potato Chips (which have a wider wave) and Herr’s Ridged Potato Chips were also very good, but with a flatter flavor than our pick. Herr’s Kettle Cooked Classic Lattice Cut with Sea Salt potato chips, on the other hand, were too oily and thick.\n\nClancy’s Wavy Potato Chip, made for Aldi supermarkets, had a great texture but were starchy and tasted undercooked.\n\nWe did not like Kirkland Signature Kettle Brand Pink Salt Potato Chips, made for Costco. They were greasy, hard, and bland, and they tasted slightly underdone.\n\nWe did not like Boulder Canyon Classic Sea Salt Kettle Style Potato Chips, which are fried in avocado oil. The oil tasted stale and bitter.\n\nWe had wanted to taste Clover Valley Ripple Cut Potato Chips, sold at Dollar General, and Amazon Fresh Wavy Potato Chips, but both were out of stock during our tasting.",
    "clean_body": "michael murtaughnyt wirecutter food styling by maggie ruggiero plain potato chips most of our panel liked herr’s crisp ’n tasty potato chips for their golden color and good potato flavor but found them to be blander and less light and crispy than some of our picks 365 by whole foods organic sea salt potato chips had an earthy potato flavor most tasters liked but not as much as our picks they looked earthy too large flat pale chips with a wisp of potato skin at the edges sal de ibiza chips from spain were one of the only imported chips our panel liked these large sunny chips had a great flavor and were very crispy but most felt they were just a little too greasy most tasters liked these smaller thin and crunchy market pantry classic potato chips made for target but didn’t consider them a favorite noting that they had a slightly darker flavor and color than many of our picks and a slightly more oily flavor most tasters really liked lay’s classic potato chips noting a big crunch and balanced saltandpotato flavor but several noted the taste felt subdued compared with that of our picks walker’s legendary ready salted potato chips imported from the united kingdom garnered a very similar reaction both brands are owned by pepsico we liked the potato flavor of wise snacks golden original potato chips—darkerbrown chips that are on the smaller side and salty—but they were a little oilier than most herr’s crisp ’n tasty potato chips had a nice toasted ovenfried potato flavor but the salt was unevenly applied some tasters thought trader joe’s ode to the classic potato chip were pale and tasted slightly stale though they had a nutty balanced flavor and snappy texture our panel found that old dutch original potato chips had a dense toodry texture and some vegetal offflavors and they needed more salt martin’s sea salted potato chips are made with shortening instead of vegetable oil and our panel did not like their starchy powdery texture a few tasters also noticed bitter offflavors tasters did not like whole foods organic potato chips which had some green spots in addition to thicker pieces of potato peel and stale rancid flavors both gibble’s original potato chips and kay ray’s premium potato chips also made by gibble’s are fried in lard and even tasters that like our oldfashioned picks found the aftertaste of the animal fat unpleasant middleswarth potato chips are also made with lard several tasters liked these chips but said that the flavor reminiscent of fastfood french fries wasn’t suited to a plain potato chip we dismissed better made special original potato chips which had an unpleasantly strong oil flavor that was almost porky even though they are not made with lard sterzing’s potato chips a regional brand from iowa tasted like older musty oil snyder of berlin original potato chips were light and crisp though some tasters found the oil a little rancid the batch of spain’s bonilla a la vista chips we tried had rancid oil flavors which surprised us—multiple tasters on the panel had tried these beautiful sunny chips in the past and loved them we recommend them in several gift guides for that reason and for the fun factor of receiving a big tin of chips as a gift but because of the potential for stale chips we couldn’t make them a pick in this guide torres extra virgin olive oil potato chips had rancid offflavors we also sampled torres selecta mediterranean sea salt chips which tasted bland and stale but our tasters thought both looked beautiful superbon chips de madrid from spain and san carlo classic potato chips from italy were also bland and stale with starchy aftertastes we had wanted to try clover valley classic potato chips sold at dollar general and snack day original potato chips sold at aldi but both were out of stock during our tasting and chips from charles chips arrived too late for us to include them in our test kettlestyle potato chips we liked the toasty deepfried flavor and light texture of clancy’s original kettle chips which had savory almost meaty overtones but we didn’t find them to be as appealing as our top picks most tasters found zapp’s new orleans kettle style regular flavor chips to be nicely crunchy and balanced in flavor if somewhat average great value kettle cooked original potato chips were a nice golden brown and very crunchy with a fried potato flavor similar to that of fastfood french fries but some found that flavor lingered too long a few tasters liked the heavy crunch and savory oily flavor of tim’s cascade snacks cascade style potato chips with sea salt but several thought these darktan chips had lingering flavors that were borderline unpleasant utz kettle classics original were a little on the oily side but freshtasting and light with good potato flavor but some thought they were too soft my dad’s chips homestyle potato chips were polarizing some tasters absolutely loved this chip’s dark russet color extra saltiness deep crunch oily sheen and toasty longfried flavor especially with dip others felt they were a little too salty the darkly fried oily good gather kettle cooked sea salt potato chips reminded tasters of latkes but several thought they tasted overcooked or even slightly bitter miss vickie’s sea salt chips were also among the darkest chips we tasted though they had good flavor and texture we found them to be too greasy and some chips tasted stale we did not enjoy kettle brand sea salt potato chips which tasted stale and even scorched with a strong aftertaste and unpleasant mouthfeel we appreciated the mission of uglies sea salt kettle potato chips—to use potatoes rejected for use by other chip makers—but did not love the end results some chips had unpleasant earthy stale or moldy flavors and a strong aftertaste of green potato cape cod kettle cooked potato chips original had a sweetpotato flavor and greasy crunch that many liked but some tasted scorched oil martin’s kettle cook’d hand cooked potato chips are fried in shortening instead of vegetable oil and our panel did not like their bitter offflavors and softer texture we mostly liked dirty kettle style potato chips which are golden brown and taste and feel a little oily the flavor wasn’t hugely potatoey but the chips were satisfying although a few found they had a slightly unpleasant aftertaste kettlestyle pipers angelsley sea salt crisps were oily yet bland and undersalted wise snacks new york deli kettle cooked potato chips were noticeably harder than other chips which many tasters didn’t like and on the oily side the potato flavor was earthy and toasty though some tasters detected a stale or even fishy aftertaste we did not like 365 by whole foods market sea salt kettle chips which were stale lacking in flavor and strangely hard we also did not like siete kettle cooked potato chips which are fried in avocado oil tasters noted they tasted like dirt plastic or scorched oil were too soft and had a bad aftertaste trader joe’s kettle cooked olive oil potato chips also tasted of scorched oil and had an unpleasant buttery aftertaste great lakes potato chip co kettle cooked original potato chips had a good flavor and were super crunchy but some found they had starchy notes that were unpleasant hal’s new york kettle chips original sea salt were pale and stale and several chips also had flecks of green potato which tend to taste bad north fork potato chips were also small pale and stale we did not like rusty’s chips sea salt potato chips dark orange and extremely oily they tasted stale and were thick and dry we had wanted to taste clover valley original kettle potato chips sold at dollar general but they were out of stock during our tasting wavy and rippled chips tasters thought ruffles original had great flavor a good crunch and stood up to dipping but they were not as wellliked as our picks they’re also very salty utz ripples original potato chips and utz wavy original potato chips were well balanced with a good salt level sturdiness and potato flavor but some said they were subtler than our picks herr’s ripples potato chips which have a wider wave and herr’s ridged potato chips were also very good but with a flatter flavor than our pick herr’s kettle cooked classic lattice cut with sea salt potato chips on the other hand were too oily and thick clancy’s wavy potato chip made for aldi supermarkets had a great texture but were starchy and tasted undercooked we did not like kirkland signature kettle brand pink salt potato chips made for costco they were greasy hard and bland and they tasted slightly underdone we did not like boulder canyon classic sea salt kettle style potato chips which are fried in avocado oil the oil tasted stale and bitter we had wanted to taste clover valley ripple cut potato chips sold at dollar general and amazon fresh wavy potato chips but both were out of stock during our tasting",
    "summary": "We had wanted to try Clover Valley Classic Potato Chips, sold at Dollar General, and Snack Day Original Potato Chips, sold at Aldi, but both were out of stock during our tasting.\nWe did not like Rusty’s Chips Sea Salt Potato Chips.\nUtz Ripples Original Potato Chips and Utz Wavy Original Potato Chips were well balanced, with a good salt level, sturdiness, and potato flavor, but some said they were subtler than our picks.\nHerr’s Ripples Potato Chips (which have a wider wave) and Herr’s Ridged Potato Chips were also very good, but with a flatter flavor than our pick.\nWe had wanted to taste Clover Valley Ripple Cut Potato Chips, sold at Dollar General, and Amazon Fresh Wavy Potato Chips, but both were out of stock during our tasting.",
    "keywords": [
      "tasted",
      "sea",
      "original",
      "salt",
      "flavor",
      "potato",
      "chips",
      "kettle",
      "stale",
      "best",
      "tasters"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2025/02/TT-POTATO-CHIPS-2048px-1084-2x1-1.jpg?auto=webp&quality=75&crop=1.91:1&width=1200"
  },
  "https://www.nytimes.com/wirecutter/reviews/scandi-sleeping-method/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/reviews/scandi-sleeping-method/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "One Bed, Two Blankets: How My Husband and I Stopped Fighting Over the Covers at Night",
    "body": "My husband’s side of the bed (left) and mine (right). He sleeps with a lightweight blanket, while I prefer a heavy comforter. Elissa Sanci/NYT Wirecutter\n\nI admit that I’ve been a cover hog my entire life, but it’s not (totally) my fault. I move a lot in my sleep—which I can’t control—so I’d often swaddle myself in our shared blanket throughout the night, leaving my husband out in the cold. Getting the covers back was never easy for him, and on the nights I went to bed earlier than he did, he’d have to wrestle them free, sometimes waking me in the process.\n\nThe morning I woke up wrapped in our shared comforter, warm and cozy, only to see him shivering under a too-small throw blanket usually reserved for the couch, I felt like an absolute jerk and decided it was time to find a solution. That’s when I finally suggested to my husband that we sleep with separate blankets.\n\nMy husband happily welcomed this new arrangement. We agreed that if we didn’t like the separation and wanted to be under the same blanket again, we’d simply switch back. But after just one night of sleeping the Scandinavian way, we knew we were on to something.\n\n“The Scandinavian sleeping method allows you to create a sleep environment that works for you,” explains James Wilson, a sleep practitioner and educator based in the UK. This is especially helpful if you and your partner have different body temperatures, as my husband and I do. “As sleepers, we’re all different, so if we’re trying to buy a comforter that suits everyone in the bed, we often end up with one person being too hot or too cold.”\n\nSleeping Scandi-style solved our temperature differences literally overnight. With the freedom to personalize our respective sides of the bed with bedding that complemented our individual temperatures, we both immediately slept more comfortably. My husband, who runs hot, prefers to sleep in as little as possible, under a paper-thin blanket, while I’d rather wear a full sweatsuit with socks to bed and wrap myself, burrito-style, in a fluffy feather-down comforter. Before adopting the Scandi method, we’d always bicker over the bedding, eventually compromising with a blanket somewhere in the middle that neither of us actually liked. Now, we each sleep exactly how we want with the bedding we prefer.\n\nCreating a sleeping environment that’s right for you in terms of comfort, support, and temperature is likely to improve the quality of your sleep, explains Wilson. It has certainly helped my husband and me sleep more soundly throughout the night, especially now that one of us isn’t left out in the cold night after night.",
    "clean_body": "my husband’s side of the bed left and mine right he sleeps with a lightweight blanket while i prefer a heavy comforter elissa sancinyt wirecutter i admit that i’ve been a cover hog my entire life but it’s not totally my fault i move a lot in my sleep—which i can’t control—so i’d often swaddle myself in our shared blanket throughout the night leaving my husband out in the cold getting the covers back was never easy for him and on the nights i went to bed earlier than he did he’d have to wrestle them free sometimes waking me in the process the morning i woke up wrapped in our shared comforter warm and cozy only to see him shivering under a toosmall throw blanket usually reserved for the couch i felt like an absolute jerk and decided it was time to find a solution that’s when i finally suggested to my husband that we sleep with separate blankets my husband happily welcomed this new arrangement we agreed that if we didn’t like the separation and wanted to be under the same blanket again we’d simply switch back but after just one night of sleeping the scandinavian way we knew we were on to something “the scandinavian sleeping method allows you to create a sleep environment that works for you” explains james wilson a sleep practitioner and educator based in the uk this is especially helpful if you and your partner have different body temperatures as my husband and i do “as sleepers we’re all different so if we’re trying to buy a comforter that suits everyone in the bed we often end up with one person being too hot or too cold” sleeping scandistyle solved our temperature differences literally overnight with the freedom to personalize our respective sides of the bed with bedding that complemented our individual temperatures we both immediately slept more comfortably my husband who runs hot prefers to sleep in as little as possible under a paperthin blanket while i’d rather wear a full sweatsuit with socks to bed and wrap myself burritostyle in a fluffy featherdown comforter before adopting the scandi method we’d always bicker over the bedding eventually compromising with a blanket somewhere in the middle that neither of us actually liked now we each sleep exactly how we want with the bedding we prefer creating a sleeping environment that’s right for you in terms of comfort support and temperature is likely to improve the quality of your sleep explains wilson it has certainly helped my husband and me sleep more soundly throughout the night especially now that one of us isn’t left out in the cold night after night",
    "summary": "I move a lot in my sleep—which I can’t control—so I’d often swaddle myself in our shared blanket throughout the night, leaving my husband out in the cold.\nThat’s when I finally suggested to my husband that we sleep with separate blankets.\nBut after just one night of sleeping the Scandinavian way, we knew we were on to something.\nWith the freedom to personalize our respective sides of the bed with bedding that complemented our individual temperatures, we both immediately slept more comfortably.\nIt has certainly helped my husband and me sleep more soundly throughout the night, especially now that one of us isn’t left out in the cold night after night.",
    "keywords": [
      "fighting",
      "comforter",
      "thats",
      "night",
      "blanket",
      "stopped",
      "bed",
      "sleeping",
      "wilson",
      "covers",
      "husband",
      "blankets",
      "sleep",
      "bedding"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2025/03/WILI-SCANDI-SLEEPING-METHOD-2048px-2048px-2x1-1.jpg?auto=webp&quality=75&crop=1.91:1&width=1200"
  },
  "https://www.nytimes.com/wirecutter/reviews/best-body-lotions/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/reviews/best-body-lotions/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "The Best Body Lotions",
    "body": "Some panelists have had positive previous experiences using AmLactin Daily Nourish 12%, one of the few body moisturizers to appear on multiple best-of lists, to help clear their or their children’s keratosis pilaris. But the slippery formula didn’t wow us for everyday use, and some testers experienced a stinging sensation when using it.\n\nAlthough Aveeno Daily Moisturizing Body Lotion was a top pick in the previous version of this guide, the current crop of panelists said the formula was lighter and less effective than other contenders; most found the hydrating benefits much too short-lived.\n\nWe found Eucerin Intensive Repair, which counts mineral oil as its first ingredient, to be too greasy and unpleasant to use. (We also disliked the smell, which one tester described as reminiscent of old milk.) The same was true for Nivea Essentially Enriched, which had the consistency, look, and feel of an especially greasy sunscreen.\n\nWe’ve used Palmer’s Daily Skin Therapy many times in the past for extra-dry skin needs, but our testers found the consistency too greasy to recommend for everyday use. In addition, the formula tended to sit on, not sink into, flaky skin.\n\nWe were extremely frustrated by the pump dispenser for La Roche-Posay Lipikar AP+ Triple Repair Moisturizing Cream—the thick formula seemed almost impossible to get out of the bottle.\n\nWe liked the richness and texture of Kiehl’s Creme de Corps but were slightly put off by its smell, color, and oiliness.\n\nWe tested Brazilian Bum Bum Cream based on its rave reviews but found the formula’s hydration to be much too fleeting—and its tub way too small—for any sort of effective daily habit. Similarly, Eos Shea Better 24H Moisture Body Lotion had all the hype (and a great price), but we weren’t wowed by its slightly greasy, less hydrating formula.\n\nAs a luxe option, Fenty Beauty’s Butta Drop Whipped Oil Body Cream was just okay texture-wise, and the scent was too subtle to register after a short while. We found that the similarly priced Josie Maran Whipped Argan Oil Body Butter (which comes in both scented and unscented options) offered a much better experience for the money.\n\nSome testers loved the scent of Weleda Skin Food Body Butter, and some found it overwhelming. Ultimately, it was the butter’s oily top layer and waxy, congealed texture that kept it off our list of picks.\n\nInexpensive mainstays Gold Bond Healing Hydrating Lotion and Jergens Ultra Healing Dry Skin Moisturizer both had formulas that we found too clumpy, and for one tester the Gold Bond pump broke after one use.\n\nBoth CeraVe Daily Moisturizing Lotion (a former runner-up pick) and Cetaphil Moisturizing Lotion had formulas that we found too light for remedying dry skin; we preferred the CeraVe Daily Moisturizing Cream formula instead.\n\nFor all of its fancy holographic packaging, we found the thin formula of Olay Collagen Peptide Firming Body Lotion to be extremely underwhelming.\n\nAlthough Tree Hut Vanilla Whipped Shea Body Butter is an inexpensive body butter, we thought its cold, jelly-like texture was unappealing.\n\nThis article was edited by Hannah Morrill and Jennifer Hunter. Hannah Waters wrote an earlier version of this article.",
    "clean_body": "some panelists have had positive previous experiences using amlactin daily nourish 12 one of the few body moisturizers to appear on multiple bestof lists to help clear their or their children’s keratosis pilaris but the slippery formula didn’t wow us for everyday use and some testers experienced a stinging sensation when using it although aveeno daily moisturizing body lotion was a top pick in the previous version of this guide the current crop of panelists said the formula was lighter and less effective than other contenders most found the hydrating benefits much too shortlived we found eucerin intensive repair which counts mineral oil as its first ingredient to be too greasy and unpleasant to use we also disliked the smell which one tester described as reminiscent of old milk the same was true for nivea essentially enriched which had the consistency look and feel of an especially greasy sunscreen we’ve used palmer’s daily skin therapy many times in the past for extradry skin needs but our testers found the consistency too greasy to recommend for everyday use in addition the formula tended to sit on not sink into flaky skin we were extremely frustrated by the pump dispenser for la rocheposay lipikar ap triple repair moisturizing cream—the thick formula seemed almost impossible to get out of the bottle we liked the richness and texture of kiehl’s creme de corps but were slightly put off by its smell color and oiliness we tested brazilian bum bum cream based on its rave reviews but found the formula’s hydration to be much too fleeting—and its tub way too small—for any sort of effective daily habit similarly eos shea better 24h moisture body lotion had all the hype and a great price but we weren’t wowed by its slightly greasy less hydrating formula as a luxe option fenty beauty’s butta drop whipped oil body cream was just okay texturewise and the scent was too subtle to register after a short while we found that the similarly priced josie maran whipped argan oil body butter which comes in both scented and unscented options offered a much better experience for the money some testers loved the scent of weleda skin food body butter and some found it overwhelming ultimately it was the butter’s oily top layer and waxy congealed texture that kept it off our list of picks inexpensive mainstays gold bond healing hydrating lotion and jergens ultra healing dry skin moisturizer both had formulas that we found too clumpy and for one tester the gold bond pump broke after one use both cerave daily moisturizing lotion a former runnerup pick and cetaphil moisturizing lotion had formulas that we found too light for remedying dry skin we preferred the cerave daily moisturizing cream formula instead for all of its fancy holographic packaging we found the thin formula of olay collagen peptide firming body lotion to be extremely underwhelming although tree hut vanilla whipped shea body butter is an inexpensive body butter we thought its cold jellylike texture was unappealing this article was edited by hannah morrill and jennifer hunter hannah waters wrote an earlier version of this article",
    "summary": "We found that the similarly priced Josie Maran Whipped Argan Oil Body Butter (which comes in both scented and unscented options) offered a much better experience for the money.\nSome testers loved the scent of Weleda Skin Food Body Butter, and some found it overwhelming.\nBoth CeraVe Daily Moisturizing Lotion (a former runner-up pick) and Cetaphil Moisturizing Lotion had formulas that we found too light for remedying dry skin; we preferred the CeraVe Daily Moisturizing Cream formula instead.\nFor all of its fancy holographic packaging, we found the thin formula of Olay Collagen Peptide Firming Body Lotion to be extremely underwhelming.\nAlthough Tree Hut Vanilla Whipped Shea Body Butter is an inexpensive body butter, we thought its cold, jelly-like texture was unappealing.",
    "keywords": [
      "greasy",
      "butter",
      "body",
      "whipped",
      "lotion",
      "moisturizing",
      "formula",
      "skin",
      "daily",
      "best",
      "lotions",
      "texture"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2025/03/BEST-BODY-LOTION-SUB-2048px-1427-2x1-1.jpg?auto=webp&quality=75&crop=1.91:1&width=1200"
  },
  "https://www.nytimes.com/wirecutter/reviews/humidifier-health-effects/": {
    "source": "NYT",
    "url": "https://www.nytimes.com/wirecutter/reviews/humidifier-health-effects/",
    "date": "unknown",
    "time": "00:00:00",
    "title": "Do You Use a Humidifier or Diffuser Before Bedtime? You Might Want to Stop.",
    "body": "A humidifier can be a useful tool to support health, said Juanita Mora, a physician and spokesperson for the American Lung Association. “But we also have to make sure that it’s cleaned at least once a week [and] the water’s changed daily so that we avoid adding more indoor pollutants to our environment by turning on this humidifier,” explained Mora.\n\nWash humidifiers with soap weekly\n\nStaff writer Thom Dunn, who wrote Wirecutter’s guide to the best humidifiers, recommends cleaning the device weekly or any time you notice white scale or film, as well as after pulling it from storage. (That’s why cleaning was a big part of testing humidifiers for our guide.)\n\nSeriously: Do it once a week. This is no laughing matter; the Consumer Product Safety Commission issued an alert about dirty humidifiers and possible health hazards, which can range from “flu-like symptoms to serious infection.”\n\nWe have a whole article about cleaning humidifiers, but soap and water is the safest option, said Maryum Merchant, a pulmonologist at UCLA Health who co-leads the Adult Asthma Program, in a phone interview. She said diluted white vinegar can also be used safely, but she discouraged the use of bleach, even when diluted.\n\nThe CDC states that soap and water are typically sufficient to clean surfaces. If you do use bleach to clean a particularly nasty humidifier, Thom recommends bringing the humidifier outside and running a full tank of water through it after you’ve finished cleaning, to make sure none of the dangerous chemicals stick around.\n\n“Do not use chemical cleaning agents or disinfectants, as they can remain in the humidifier and be volatilized next time the humidifier is used,” said Andrea Dietrich, a professor of civil and environmental engineering at Virginia Tech who co-authored a paper on humidifier use and indoor air quality.\n\nUse distilled water and change it daily\n\nThe CPSC recommends changing the water in your humidifier once a day. On top of that, as Merchant, Mora, and other experts recommend, you should use distilled water—that is, water without any minerals—in an ultrasonic humidifier. Distilled water excludes tap water, even when it’s been filtered or purified.\n\nThat’s because studies show that when filled with mineral water or tap water, even when it’s been filtered, ultrasonic humidifiers in particular can send small particles of dried minerals, like calcium and magnesium, into the air. Those minerals aren’t inherently harmful (in fact, they’re important nutrients), but they’re not healthy when inhaled into the lungs.\n\n“When dried mineral particles containing calcium and magnesium are inhaled into the lungs, this is not good for health, as particles can clog the lung passages, making breathing difficult,” said Dietrich, who co-authored one such study, by email. There is also a risk that the mineral dust could contain metals like arsenic, cadmium, lead, and manganese, she said.\n\n“Inhaling particles has worse consequences for children than adults because children inhale a greater volume of air per body weight than adults,” Dietrich said.\n\nIn contrast to ultrasonic humidifiers, steam or evaporative humidifiers circumvent the possibility of aerosolizing minerals—but steam types can pose burn hazards and may not be a good idea if you have young children or pets. And they too need to be cleaned routinely.\n\nMonitor moisture\n\n“Depending on your home, raising the humidity in a room can also lead to growth of microbes,” said Hayley Goldbach, a dermatologist and dermatologic surgeon at Brown University, in an email. “For someone with asthma, this can be a serious trigger.”\n\nGenerally speaking, optimal humidity levels for your home are between 30% and 50%, said Mora.\n\nThe EPA recommends keeping humidity levels indoors within 50%. If you do use a humidifier regularly, it’s a good idea to monitor your indoor humidity, said Mora; devices that measure this, called hygrometers, are available at hardware stores (we suggest an inexpensive option in our dehumidifier guide).\n\nYou should also take care to keep the area around the humidifier dry, including walls and other vertical surfaces, to prevent mold and mildew growth within building materials, said Jeffrey Siegel, a professor of civil and mineral engineering at the University of Toronto, in a phone interview.\n\nBe cautious with scents\n\nIf you’re in the habit of running your humidifier with essential oils (which some models let you do) or using an essential oil diffuser that relies on mist, here are some things you may want to consider.\n\nResearch on the possible benefits of essential oils is ongoing. But when it comes to scent diffusers, you should proceed with extra caution: Aromatherapy essential oils aren’t regulated by the Food and Drug Administration or the CPSC. Essential oils may emit potentially hazardous VOCs into the air. Experts say you should never use essential oil diffusers around infants under 6 months old; for ages above that, discuss with your doctor what essential oils may be okay to use.\n\nHow much you put into your diffuser, and how much you dilute it, will vary and is hard to measure. And if your space is poorly ventilated (a small bedroom with the windows closed in winter, say), the concentration of oils in the air you breathe can climb quite high, said Merchant.\n\nPeople are still studying the safety of inhaling essential oils long-term. However, one study suggests that heavy exposure, as in several hours a day over many years, could potentially have health effects. More immediately, essential oils might trigger an asthma attack in some individuals, according to the American Lung Association. If you have asthma, it’s a good idea to proceed with caution, as we suggest in our guide to the best essential oil diffusers.\n\nRemember, if you use an essential oil diffuser, clean it regularly, fill it with distilled water, and don’t keep it running on your bedside table as you fall asleep. Let it run for as short a time as possible, and far from your head.\n\nEssential oils can also be hazardous to pets or otherwise impact their health, said Amy Nichelason, a veterinarian and professor of veterinary medicine at the University of Wisconsin-Madison, in an email. “Overall, I don’t recommend essential oil diffusers, especially in environments where my patients”—that is, dogs and cats—“have any form of respiratory disease like asthma,” she explained. She recommends using them only in areas that your pet can’t access.",
    "clean_body": "a humidifier can be a useful tool to support health said juanita mora a physician and spokesperson for the american lung association “but we also have to make sure that it’s cleaned at least once a week and the water’s changed daily so that we avoid adding more indoor pollutants to our environment by turning on this humidifier” explained mora wash humidifiers with soap weekly staff writer thom dunn who wrote wirecutter’s guide to the best humidifiers recommends cleaning the device weekly or any time you notice white scale or film as well as after pulling it from storage that’s why cleaning was a big part of testing humidifiers for our guide seriously do it once a week this is no laughing matter the consumer product safety commission issued an alert about dirty humidifiers and possible health hazards which can range from “flulike symptoms to serious infection” we have a whole article about cleaning humidifiers but soap and water is the safest option said maryum merchant a pulmonologist at ucla health who coleads the adult asthma program in a phone interview she said diluted white vinegar can also be used safely but she discouraged the use of bleach even when diluted the cdc states that soap and water are typically sufficient to clean surfaces if you do use bleach to clean a particularly nasty humidifier thom recommends bringing the humidifier outside and running a full tank of water through it after you’ve finished cleaning to make sure none of the dangerous chemicals stick around “do not use chemical cleaning agents or disinfectants as they can remain in the humidifier and be volatilized next time the humidifier is used” said andrea dietrich a professor of civil and environmental engineering at virginia tech who coauthored a paper on humidifier use and indoor air quality use distilled water and change it daily the cpsc recommends changing the water in your humidifier once a day on top of that as merchant mora and other experts recommend you should use distilled water—that is water without any minerals—in an ultrasonic humidifier distilled water excludes tap water even when it’s been filtered or purified that’s because studies show that when filled with mineral water or tap water even when it’s been filtered ultrasonic humidifiers in particular can send small particles of dried minerals like calcium and magnesium into the air those minerals aren’t inherently harmful in fact they’re important nutrients but they’re not healthy when inhaled into the lungs “when dried mineral particles containing calcium and magnesium are inhaled into the lungs this is not good for health as particles can clog the lung passages making breathing difficult” said dietrich who coauthored one such study by email there is also a risk that the mineral dust could contain metals like arsenic cadmium lead and manganese she said “inhaling particles has worse consequences for children than adults because children inhale a greater volume of air per body weight than adults” dietrich said in contrast to ultrasonic humidifiers steam or evaporative humidifiers circumvent the possibility of aerosolizing minerals—but steam types can pose burn hazards and may not be a good idea if you have young children or pets and they too need to be cleaned routinely monitor moisture “depending on your home raising the humidity in a room can also lead to growth of microbes” said hayley goldbach a dermatologist and dermatologic surgeon at brown university in an email “for someone with asthma this can be a serious trigger” generally speaking optimal humidity levels for your home are between 30 and 50 said mora the epa recommends keeping humidity levels indoors within 50 if you do use a humidifier regularly it’s a good idea to monitor your indoor humidity said mora devices that measure this called hygrometers are available at hardware stores we suggest an inexpensive option in our dehumidifier guide you should also take care to keep the area around the humidifier dry including walls and other vertical surfaces to prevent mold and mildew growth within building materials said jeffrey siegel a professor of civil and mineral engineering at the university of toronto in a phone interview be cautious with scents if you’re in the habit of running your humidifier with essential oils which some models let you do or using an essential oil diffuser that relies on mist here are some things you may want to consider research on the possible benefits of essential oils is ongoing but when it comes to scent diffusers you should proceed with extra caution aromatherapy essential oils aren’t regulated by the food and drug administration or the cpsc essential oils may emit potentially hazardous vocs into the air experts say you should never use essential oil diffusers around infants under 6 months old for ages above that discuss with your doctor what essential oils may be okay to use how much you put into your diffuser and how much you dilute it will vary and is hard to measure and if your space is poorly ventilated a small bedroom with the windows closed in winter say the concentration of oils in the air you breathe can climb quite high said merchant people are still studying the safety of inhaling essential oils longterm however one study suggests that heavy exposure as in several hours a day over many years could potentially have health effects more immediately essential oils might trigger an asthma attack in some individuals according to the american lung association if you have asthma it’s a good idea to proceed with caution as we suggest in our guide to the best essential oil diffusers remember if you use an essential oil diffuser clean it regularly fill it with distilled water and don’t keep it running on your bedside table as you fall asleep let it run for as short a time as possible and far from your head essential oils can also be hazardous to pets or otherwise impact their health said amy nichelason a veterinarian and professor of veterinary medicine at the university of wisconsinmadison in an email “overall i don’t recommend essential oil diffusers especially in environments where my patients”—that is dogs and cats—“have any form of respiratory disease like asthma” she explained she recommends using them only in areas that your pet can’t access",
    "summary": "Use distilled water and change it dailyThe CPSC recommends changing the water in your humidifier once a day.\nBe cautious with scentsIf you’re in the habit of running your humidifier with essential oils (which some models let you do) or using an essential oil diffuser that relies on mist, here are some things you may want to consider.\nExperts say you should never use essential oil diffusers around infants under 6 months old; for ages above that, discuss with your doctor what essential oils may be okay to use.\nMore immediately, essential oils might trigger an asthma attack in some individuals, according to the American Lung Association.\nRemember, if you use an essential oil diffuser, clean it regularly, fill it with distilled water, and don’t keep it running on your bedside table as you fall asleep.",
    "keywords": [
      "bedtime",
      "oils",
      "recommends",
      "essential",
      "humidifier",
      "stop",
      "health",
      "oil",
      "water",
      "humidifiers",
      "diffuser",
      "asthma",
      "cleaning"
    ],
    "image_url": "https://cdn.thewirecutter.com/wp-content/media/2025/02/NYK-HUMIDIFIER-HEALTH-EFFECTS-2048px-6302-2x1-1.jpg?auto=webp&quality=75&crop=1.91:1&width=1200"
  }
}