{
  "https://www.bbc.com/news/articles/c238gmp298po": {
    "source": "BBC",
    "url": "https://www.bbc.com/news/articles/c238gmp298po",
    "date": "unknown",
    "time": "00:00:00",
    "title": "General Taoreed Lagbaja: Nigeria's army chief age 56 dies after long illness",
    "body": "Nigeria's army chief dies aged 56\n\nTaoreed Lagbaja was appointed Nigeria's chief of army staff in June 2023\n\n\"President Tinubu wishes Lt General Lagbaja eternal peace and honors his significant contributions to the nation,\" the statement read.\n\nIn a statement shared on X by presidential spokesperson Bayo Onanuga, President Tinubu expressed his \"heartfelt condolences\" to Gen Lagbaja’s family.\n\nHe died on Tuesday night in Lagos. The exact details of his illness were not made public.\n\nNigeria's army chief Lt Gen Taoreed Lagbaja has died after a \"period of illness\" aged 56, President Bola Tinubu has announced.\n\nHis passing marked a significant loss for the Nigerian Armed Forces, where he \"played pivotal roles in numerous internal security operations\", it said.\n\nChief of army staff is the highest-ranking military officer in the Nigerian army.\n\nGen Lagbaja was appointed to the position in June 2023, not long after President Tinubu took office.\n\nHe was often away from duty - sometimes out of the country receiving treatment for an undisclosed illness - and had not been seen in public for some time, raising concerns.\n\nDuring his short tenure, Nigeria saw an increase in attacks by fighters from the Islamist Boko Haram group and incidents of kidnapping, especially in the north and central parts of the country.\n\nThis includes the mass abduction of more than 280 children in Kuriga earlier this year.\n\nUnder former President Muhammadu Buhari's onslaught on the jihadist insurgency, he led a task force near Maiduguri, the north-eastern city worst hit by the Boko Haram insurgency.\n\nIn the face of overwhelming security concerns, Gen Lagbja made it a point to ensure the army would not intervene in the country's democracy, especially after several neighbouring countries experienced military coups.\n\n\"We are agents of democracy and have no desire to truncate it,\" he said.\n\nHe also participated in a United Nation peacekeeping mission in the Democratic Republic of Congo in 2003.\n\nBefore joining the army, Gen Lagbaja attended a teachers' college in Osogbo. He went onto join the Nigerian Defence Academy in 1987, starting his military career.\n\nHe later obtained an Msc in Strategic Studies from the US Army War College in Pennsylvania.\n\nGen Lagbaja is survived by his wife, Mariya, and their two children.",
    "clean_body": "nigerias army chief dies aged 56 taoreed lagbaja was appointed nigerias chief of army staff in june 2023 president tinubu wishes lt general lagbaja eternal peace and honors his significant contributions to the nation the statement read in a statement shared on x by presidential spokesperson bayo onanuga president tinubu expressed his heartfelt condolences to gen lagbaja’s family he died on tuesday night in lagos the exact details of his illness were not made public nigerias army chief lt gen taoreed lagbaja has died after a period of illness aged 56 president bola tinubu has announced his passing marked a significant loss for the nigerian armed forces where he played pivotal roles in numerous internal security operations it said chief of army staff is the highestranking military officer in the nigerian army gen lagbaja was appointed to the position in june 2023 not long after president tinubu took office he was often away from duty sometimes out of the country receiving treatment for an undisclosed illness and had not been seen in public for some time raising concerns during his short tenure nigeria saw an increase in attacks by fighters from the islamist boko haram group and incidents of kidnapping especially in the north and central parts of the country this includes the mass abduction of more than 280 children in kuriga earlier this year under former president muhammadu buharis onslaught on the jihadist insurgency he led a task force near maiduguri the northeastern city worst hit by the boko haram insurgency in the face of overwhelming security concerns gen lagbja made it a point to ensure the army would not intervene in the countrys democracy especially after several neighbouring countries experienced military coups we are agents of democracy and have no desire to truncate it he said he also participated in a united nation peacekeeping mission in the democratic republic of congo in 2003 before joining the army gen lagbaja attended a teachers college in osogbo he went onto join the nigerian defence academy in 1987 starting his military career he later obtained an msc in strategic studies from the us army war college in pennsylvania gen lagbaja is survived by his wife mariya and their two children",
    "summary": "Nigeria's army chief dies aged 56Taoreed Lagbaja was appointed Nigeria's chief of army staff in June 2023\"President Tinubu wishes Lt General Lagbaja eternal peace and honors his significant contributions to the nation,\" the statement read.\nNigeria's army chief Lt Gen Taoreed Lagbaja has died after a \"period of illness\" aged 56, President Bola Tinubu has announced.\nChief of army staff is the highest-ranking military officer in the Nigerian army.\nGen Lagbaja was appointed to the position in June 2023, not long after President Tinubu took office.\nBefore joining the army, Gen Lagbaja attended a teachers' college in Osogbo.",
    "keywords": [
      "long",
      "lagbaja",
      "nigerian",
      "military",
      "president",
      "general",
      "gen",
      "statement",
      "nigerias",
      "age",
      "army",
      "tinubu",
      "illness",
      "taoreed",
      "chief",
      "dies"
    ],
    "image_url": "https://ichef.bbci.co.uk/news/1024/branded_news/cded/live/ccdf0dd0-9c33-11ef-82c3-45a801b7330b.jpg"
  }
}